source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.file_name = type { i8*, i64, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !210, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !209, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 112, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23}
!23 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0, isUnsigned: true)
!24 = !{!25, !35, !96, !86, !100, !104, !108, !111, !112, !118, !29, !133, !137, !141, !144, !148, !151, !155, !170, !173, !179, !183, !186, !190, !191, !88, !192, !193}
!25 = !DISubprogram(name: "dcgettext", scope: !26, file: !26, line: 51, type: !27, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!26 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !31, !31, !33}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !{}
!35 = !DISubprogram(name: "fputs_unlocked", scope: !36, file: !36, line: 662, type: !37, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!36 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!37 = !DISubroutineType(types: !38)
!38 = !{!33, !31, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !42)
!41 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !58, !59, !60, !61, !65, !67, !69, !73, !76, !78, !81, !84, !85, !87, !91, !92}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !40, file: !41, line: 51, baseType: !33, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !40, file: !41, line: 54, baseType: !29, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !40, file: !41, line: 55, baseType: !29, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !40, file: !41, line: 56, baseType: !29, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !40, file: !41, line: 57, baseType: !29, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !40, file: !41, line: 58, baseType: !29, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !40, file: !41, line: 59, baseType: !29, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !40, file: !41, line: 60, baseType: !29, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !40, file: !41, line: 61, baseType: !29, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !40, file: !41, line: 64, baseType: !29, size: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !40, file: !41, line: 65, baseType: !29, size: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !40, file: !41, line: 66, baseType: !29, size: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !40, file: !41, line: 68, baseType: !56, size: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !41, line: 36, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !40, file: !41, line: 70, baseType: !39, size: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !40, file: !41, line: 72, baseType: !33, size: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !40, file: !41, line: 73, baseType: !33, size: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !40, file: !41, line: 74, baseType: !62, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 152, baseType: !64)
!63 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!64 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !40, file: !41, line: 77, baseType: !66, size: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !40, file: !41, line: 78, baseType: !68, size: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !40, file: !41, line: 79, baseType: !70, size: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !40, file: !41, line: 81, baseType: !74, size: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !41, line: 43, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !40, file: !41, line: 89, baseType: !77, size: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 153, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !40, file: !41, line: 91, baseType: !79, size: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !41, line: 37, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !40, file: !41, line: 92, baseType: !82, size: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !41, line: 38, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !40, file: !41, line: 93, baseType: !39, size: 64, offset: 1344)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !40, file: !41, line: 94, baseType: !86, size: 64, offset: 1408)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !40, file: !41, line: 95, baseType: !88, size: 64, offset: 1472)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 46, baseType: !90)
!89 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!90 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !40, file: !41, line: 96, baseType: !33, size: 32, offset: 1536)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !40, file: !41, line: 98, baseType: !93, size: 160, offset: 1568)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 20)
!96 = !DISubprogram(name: "getenv", scope: !97, file: !97, line: 634, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!97 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{!29, !31}
!100 = !DISubprogram(name: "set_program_name", scope: !101, file: !101, line: 37, type: !102, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!101 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!102 = !DISubroutineType(types: !103)
!103 = !{null, !31}
!104 = !DISubprogram(name: "setlocale", scope: !105, file: !105, line: 122, type: !106, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!105 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!106 = !DISubroutineType(types: !107)
!107 = !{!29, !33, !31}
!108 = !DISubprogram(name: "bindtextdomain", scope: !26, file: !26, line: 86, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!109 = !DISubroutineType(types: !110)
!110 = !{!29, !31, !31}
!111 = !DISubprogram(name: "textdomain", scope: !26, file: !26, line: 82, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!112 = !DISubprogram(name: "atexit", scope: !97, file: !97, line: 595, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!113 = !DISubroutineType(types: !114)
!114 = !{!33, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null}
!118 = !DISubprogram(name: "getopt_long", scope: !119, file: !119, line: 66, type: !120, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!119 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!120 = !DISubroutineType(types: !121)
!121 = !{!33, !33, !122, !31, !124, !131}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !119, line: 50, size: 256, elements: !127)
!127 = !{!128, !129, !130, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !119, line: 52, baseType: !31, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !126, file: !119, line: 55, baseType: !33, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !119, line: 56, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !119, line: 57, baseType: !33, size: 32, offset: 192)
!133 = !DISubprogram(name: "version_etc", scope: !134, file: !134, line: 69, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!134 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!135 = !DISubroutineType(types: !136)
!136 = !{null, !39, !31, !31, !31, null}
!137 = !DISubprogram(name: "error", scope: !138, file: !138, line: 52, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!138 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{null, !33, !33, !31, null}
!141 = !DISubprogram(name: "puts", scope: !36, file: !36, line: 632, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!142 = !DISubroutineType(types: !143)
!143 = !{!33, !31}
!144 = !DISubprogram(name: "xgetcwd", scope: !145, file: !145, line: 17, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!145 = !DIFile(filename: "./lib/xgetcwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{!29}
!148 = !DISubprogram(name: "free", scope: !97, file: !97, line: 565, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !86}
!151 = !DISubprogram(name: "xmalloc", scope: !152, file: !152, line: 53, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!152 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{!86, !90}
!155 = !DISubprogram(name: "get_root_dev_ino", scope: !156, file: !156, line: 25, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!156 = !DIFile(filename: "./lib/root-dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !161, line: 7, size: 128, elements: !162)
!161 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !{!163, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !160, file: !161, line: 9, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !165, line: 47, baseType: !166)
!165 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !63, line: 148, baseType: !90)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !160, file: !161, line: 10, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !165, line: 59, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !63, line: 145, baseType: !90)
!170 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!171 = !DISubroutineType(types: !172)
!172 = !{!29, !5, !31}
!173 = !DISubprogram(name: "opendir", scope: !174, file: !174, line: 134, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!174 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !31}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !174, line: 127, flags: DIFlagFwdDecl)
!179 = !DISubprogram(name: "quote", scope: !180, file: !180, line: 44, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!180 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !DISubroutineType(types: !182)
!182 = !{!31, !31}
!183 = !DISubprogram(name: "dirfd", scope: !174, file: !174, line: 224, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!184 = !DISubroutineType(types: !185)
!185 = !{!33, !177}
!186 = !DISubprogram(name: "fchdir", scope: !187, file: !187, line: 501, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!187 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!188 = !DISubroutineType(types: !189)
!189 = !{!33, !33}
!190 = !DISubprogram(name: "chdir", scope: !187, file: !187, line: 497, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!191 = !DISubprogram(name: "closedir", scope: !174, file: !174, line: 149, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!192 = !DISubprogram(name: "xalloc_die", scope: !152, file: !152, line: 51, type: !116, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !34)
!193 = !DISubprogram(name: "readdir", scope: !174, file: !174, line: 162, type: !194, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !177}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !198, line: 22, size: 2240, elements: !199)
!198 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!199 = !{!200, !201, !202, !203, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !197, file: !198, line: 25, baseType: !166, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !197, file: !198, line: 26, baseType: !62, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !197, file: !198, line: 31, baseType: !66, size: 16, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !197, file: !198, line: 32, baseType: !204, size: 8, offset: 144)
!204 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !197, file: !198, line: 33, baseType: !206, size: 2048, offset: 152)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2048, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 256)
!209 = !{!0}
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 1280, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 5)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "Version", scope: !215, file: !216, line: 2, type: !31, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, globals: !217, nameTableKind: None)
!216 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!217 = !{!213}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "file_name", scope: !220, file: !221, line: 46, type: !31, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !222, globals: !260, nameTableKind: None)
!221 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!222 = !{!223, !25, !259, !137}
!223 = !DISubprogram(name: "close_stream", scope: !224, file: !224, line: 2, type: !225, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!224 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !DISubroutineType(types: !226)
!226 = !{!33, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !228, file: !41, line: 51, baseType: !33, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !228, file: !41, line: 54, baseType: !29, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !228, file: !41, line: 55, baseType: !29, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !228, file: !41, line: 56, baseType: !29, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !228, file: !41, line: 57, baseType: !29, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !228, file: !41, line: 58, baseType: !29, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !228, file: !41, line: 59, baseType: !29, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !228, file: !41, line: 60, baseType: !29, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !228, file: !41, line: 61, baseType: !29, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !228, file: !41, line: 64, baseType: !29, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !228, file: !41, line: 65, baseType: !29, size: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !228, file: !41, line: 66, baseType: !29, size: 64, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !228, file: !41, line: 68, baseType: !56, size: 64, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !228, file: !41, line: 70, baseType: !227, size: 64, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !228, file: !41, line: 72, baseType: !33, size: 32, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !228, file: !41, line: 73, baseType: !33, size: 32, offset: 928)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !228, file: !41, line: 74, baseType: !62, size: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !228, file: !41, line: 77, baseType: !66, size: 16, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !228, file: !41, line: 78, baseType: !68, size: 8, offset: 1040)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !228, file: !41, line: 79, baseType: !70, size: 8, offset: 1048)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !228, file: !41, line: 81, baseType: !74, size: 64, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !228, file: !41, line: 89, baseType: !77, size: 64, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !228, file: !41, line: 91, baseType: !79, size: 64, offset: 1216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !228, file: !41, line: 92, baseType: !82, size: 64, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !228, file: !41, line: 93, baseType: !227, size: 64, offset: 1344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !228, file: !41, line: 94, baseType: !86, size: 64, offset: 1408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !228, file: !41, line: 95, baseType: !88, size: 64, offset: 1472)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !228, file: !41, line: 96, baseType: !33, size: 32, offset: 1536)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !228, file: !41, line: 98, baseType: !93, size: 160, offset: 1568)
!259 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!260 = !{!218, !261}
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !220, file: !221, line: 56, type: !263, isLocal: true, isDefinition: true)
!263 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "exit_failure", scope: !266, file: !267, line: 24, type: !269, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, globals: !268, nameTableKind: None)
!267 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = !{!264}
!269 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "program_name", scope: !272, file: !273, line: 33, type: !31, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !274, globals: !310, nameTableKind: None)
!273 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = !{!86, !275, !29}
!275 = !DISubprogram(name: "fputs", scope: !36, file: !36, line: 626, type: !276, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!276 = !DISubroutineType(types: !277)
!277 = !{!33, !31, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !279, file: !41, line: 51, baseType: !33, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !279, file: !41, line: 54, baseType: !29, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !279, file: !41, line: 55, baseType: !29, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !279, file: !41, line: 56, baseType: !29, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !279, file: !41, line: 57, baseType: !29, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !279, file: !41, line: 58, baseType: !29, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !279, file: !41, line: 59, baseType: !29, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !279, file: !41, line: 60, baseType: !29, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !279, file: !41, line: 61, baseType: !29, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !279, file: !41, line: 64, baseType: !29, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !279, file: !41, line: 65, baseType: !29, size: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !279, file: !41, line: 66, baseType: !29, size: 64, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !279, file: !41, line: 68, baseType: !56, size: 64, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !279, file: !41, line: 70, baseType: !278, size: 64, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !279, file: !41, line: 72, baseType: !33, size: 32, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !279, file: !41, line: 73, baseType: !33, size: 32, offset: 928)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !279, file: !41, line: 74, baseType: !62, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !279, file: !41, line: 77, baseType: !66, size: 16, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !279, file: !41, line: 78, baseType: !68, size: 8, offset: 1040)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !279, file: !41, line: 79, baseType: !70, size: 8, offset: 1048)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !279, file: !41, line: 81, baseType: !74, size: 64, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !279, file: !41, line: 89, baseType: !77, size: 64, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !279, file: !41, line: 91, baseType: !79, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !279, file: !41, line: 92, baseType: !82, size: 64, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !279, file: !41, line: 93, baseType: !278, size: 64, offset: 1344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !279, file: !41, line: 94, baseType: !86, size: 64, offset: 1408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !279, file: !41, line: 95, baseType: !88, size: 64, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !279, file: !41, line: 96, baseType: !33, size: 32, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !279, file: !41, line: 98, baseType: !93, size: 160, offset: 1568)
!310 = !{!270}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !313, file: !314, line: 85, type: !423, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !315, retainedTypes: !336, globals: !399, nameTableKind: None)
!314 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!315 = !{!5, !316, !321}
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !317)
!317 = !{!318, !319, !320}
!318 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!320 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !322, line: 46, baseType: !7, size: 32, elements: !323)
!322 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!324 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!325 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!326 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!327 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!328 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!329 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!330 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!331 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!332 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!335 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!336 = !{!337, !342, !148, !358, !33, !66, !361, !88, !378, !382, !25, !388, !392, !29, !151, !192, !396}
!337 = !DISubprogram(name: "xmemdup", scope: !152, file: !152, line: 62, type: !338, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!338 = !DISubroutineType(types: !339)
!339 = !{!86, !340, !90}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!342 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !343, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!343 = !DISubroutineType(types: !344)
!344 = !{!29, !31, !90, !345, !346}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !314, line: 65, size: 448, elements: !349)
!349 = !{!350, !351, !352, !356, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !348, file: !314, line: 68, baseType: !5, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !348, file: !314, line: 71, baseType: !33, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !348, file: !314, line: 75, baseType: !353, size: 256, offset: 64)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 8)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !348, file: !314, line: 78, baseType: !31, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !348, file: !314, line: 81, baseType: !31, size: 64, offset: 384)
!358 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !359, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!359 = !DISubroutineType(types: !360)
!360 = !{!29, !33, !31, !31, !31, !90}
!361 = !DISubprogram(name: "rpl_mbrtowc", scope: !362, file: !362, line: 717, type: !363, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!362 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!363 = !DISubroutineType(types: !364)
!364 = !{!90, !131, !31, !90, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 13, size: 64, elements: !368)
!367 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !366, file: !367, line: 15, baseType: !33, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !366, file: !367, line: 20, baseType: !371, size: 32, offset: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !367, line: 16, size: 32, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !371, file: !367, line: 18, baseType: !7, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !371, file: !367, line: 19, baseType: !375, size: 32)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 4)
!378 = !DISubprogram(name: "iswprint", scope: !379, file: !379, line: 120, type: !380, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!379 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!380 = !DISubroutineType(types: !381)
!381 = !{!33, !7}
!382 = !DISubprogram(name: "mbsinit", scope: !383, file: !383, line: 292, type: !384, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!383 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!384 = !DISubroutineType(types: !385)
!385 = !{!33, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!388 = !DISubprogram(name: "locale_charset", scope: !389, file: !389, line: 35, type: !390, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!389 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!390 = !DISubroutineType(types: !391)
!391 = !{!31}
!392 = !DISubprogram(name: "c_strcasecmp", scope: !393, file: !393, line: 42, type: !394, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!393 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!394 = !DISubroutineType(types: !395)
!395 = !{!33, !31, !31}
!396 = !DISubprogram(name: "xrealloc", scope: !152, file: !152, line: 59, type: !397, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!397 = !DISubroutineType(types: !398)
!398 = !{!86, !86, !90}
!399 = !{!311, !400, !406, !408, !410, !412, !419, !421}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !313, file: !314, line: 101, type: !402, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 320, elements: !404)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!404 = !{!405}
!405 = !DISubrange(count: 10)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !313, file: !314, line: 1052, type: !348, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !313, file: !314, line: 116, type: !348, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "slot0", scope: !313, file: !314, line: 842, type: !206, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "slotvec", scope: !313, file: !314, line: 845, type: !414, isLocal: true, isDefinition: true)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !314, line: 834, size: 128, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !415, file: !314, line: 836, baseType: !88, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !415, file: !314, line: 837, baseType: !29, size: 64, offset: 64)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "nslots", scope: !313, file: !314, line: 843, type: !33, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "slotvec0", scope: !313, file: !314, line: 844, type: !415, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 704, elements: !425)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!425 = !{!426}
!426 = !DISubrange(count: 11)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !429, file: !430, line: 26, type: !432, isDefinition: true)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, globals: !431, nameTableKind: None)
!430 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!431 = !{!427}
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 376, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 47)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, nameTableKind: None)
!436 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !439, retainedTypes: !443, nameTableKind: None)
!438 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!439 = !{!440}
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 40, baseType: !7, size: 32, elements: !441)
!441 = !{!442}
!442 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!443 = !{!25, !444, !86}
!444 = !DISubprogram(name: "fputs_unlocked", scope: !36, file: !36, line: 662, type: !445, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!445 = !DISubroutineType(types: !446)
!446 = !{!33, !31, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !448, file: !41, line: 51, baseType: !33, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !448, file: !41, line: 54, baseType: !29, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !448, file: !41, line: 55, baseType: !29, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !448, file: !41, line: 56, baseType: !29, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !448, file: !41, line: 57, baseType: !29, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !448, file: !41, line: 58, baseType: !29, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !448, file: !41, line: 59, baseType: !29, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !448, file: !41, line: 60, baseType: !29, size: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !448, file: !41, line: 61, baseType: !29, size: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !448, file: !41, line: 64, baseType: !29, size: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !448, file: !41, line: 65, baseType: !29, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !448, file: !41, line: 66, baseType: !29, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !448, file: !41, line: 68, baseType: !56, size: 64, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !448, file: !41, line: 70, baseType: !447, size: 64, offset: 832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !448, file: !41, line: 72, baseType: !33, size: 32, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !448, file: !41, line: 73, baseType: !33, size: 32, offset: 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !448, file: !41, line: 74, baseType: !62, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !448, file: !41, line: 77, baseType: !66, size: 16, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !448, file: !41, line: 78, baseType: !68, size: 8, offset: 1040)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !448, file: !41, line: 79, baseType: !70, size: 8, offset: 1048)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !448, file: !41, line: 81, baseType: !74, size: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !448, file: !41, line: 89, baseType: !77, size: 64, offset: 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !448, file: !41, line: 91, baseType: !79, size: 64, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !448, file: !41, line: 92, baseType: !82, size: 64, offset: 1280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !448, file: !41, line: 93, baseType: !447, size: 64, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !448, file: !41, line: 94, baseType: !86, size: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !448, file: !41, line: 95, baseType: !88, size: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !448, file: !41, line: 96, baseType: !33, size: 32, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !448, file: !41, line: 98, baseType: !93, size: 160, offset: 1568)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !481, retainedTypes: !494, nameTableKind: None)
!480 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !{!482}
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !483, file: !152, line: 186, baseType: !7, size: 32, elements: !492)
!483 = distinct !DISubprogram(name: "x2nrealloc", scope: !152, file: !152, line: 174, type: !484, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !487)
!484 = !DISubroutineType(types: !485)
!485 = !{!86, !86, !486, !88}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!487 = !{!488, !489, !490, !491}
!488 = !DILocalVariable(name: "p", arg: 1, scope: !483, file: !152, line: 174, type: !86)
!489 = !DILocalVariable(name: "pn", arg: 2, scope: !483, file: !152, line: 174, type: !486)
!490 = !DILocalVariable(name: "s", arg: 3, scope: !483, file: !152, line: 174, type: !88)
!491 = !DILocalVariable(name: "n", scope: !483, file: !152, line: 176, type: !88)
!492 = !{!493}
!493 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!494 = !{!88, !192, !151, !396, !29, !148, !86, !495, !498}
!495 = !DISubprogram(name: "xcalloc", scope: !152, file: !152, line: 57, type: !496, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!496 = !DISubroutineType(types: !497)
!497 = !{!86, !90, !90}
!498 = !DISubprogram(name: "rpl_calloc", scope: !499, file: !499, line: 688, type: !496, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!499 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !502, nameTableKind: None)
!501 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = !{!25, !137}
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !505, nameTableKind: None)
!504 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = !{!192}
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !508, nameTableKind: None)
!507 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !{!86}
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !511, nameTableKind: None)
!510 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !{!512, !88, !524}
!512 = !DISubprogram(name: "mbrtowc", scope: !383, file: !383, line: 296, type: !513, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!513 = !DISubroutineType(types: !514)
!514 = !{!90, !131, !31, !90, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 13, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !516, file: !367, line: 15, baseType: !33, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !516, file: !367, line: 20, baseType: !520, size: 32, offset: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !516, file: !367, line: 16, size: 32, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !520, file: !367, line: 18, baseType: !7, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !520, file: !367, line: 19, baseType: !375, size: 32)
!524 = !DISubprogram(name: "hard_locale", scope: !525, file: !525, line: 26, type: !526, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!525 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!526 = !DISubroutineType(types: !527)
!527 = !{!263, !33}
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !530, nameTableKind: None)
!529 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !{!531}
!531 = !DISubprogram(name: "rpl_fclose", scope: !532, file: !532, line: 672, type: !533, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!532 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = !DISubroutineType(types: !534)
!534 = !{!33, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !536, file: !41, line: 51, baseType: !33, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !536, file: !41, line: 54, baseType: !29, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !536, file: !41, line: 55, baseType: !29, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !536, file: !41, line: 56, baseType: !29, size: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !536, file: !41, line: 57, baseType: !29, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !536, file: !41, line: 58, baseType: !29, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !536, file: !41, line: 59, baseType: !29, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !536, file: !41, line: 60, baseType: !29, size: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !536, file: !41, line: 61, baseType: !29, size: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !536, file: !41, line: 64, baseType: !29, size: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !536, file: !41, line: 65, baseType: !29, size: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !536, file: !41, line: 66, baseType: !29, size: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !536, file: !41, line: 68, baseType: !56, size: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !536, file: !41, line: 70, baseType: !535, size: 64, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !536, file: !41, line: 72, baseType: !33, size: 32, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !536, file: !41, line: 73, baseType: !33, size: 32, offset: 928)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !536, file: !41, line: 74, baseType: !62, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !536, file: !41, line: 77, baseType: !66, size: 16, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !536, file: !41, line: 78, baseType: !68, size: 8, offset: 1040)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !536, file: !41, line: 79, baseType: !70, size: 8, offset: 1048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !536, file: !41, line: 81, baseType: !74, size: 64, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !536, file: !41, line: 89, baseType: !77, size: 64, offset: 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !536, file: !41, line: 91, baseType: !79, size: 64, offset: 1216)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !536, file: !41, line: 92, baseType: !82, size: 64, offset: 1280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !536, file: !41, line: 93, baseType: !535, size: 64, offset: 1344)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !536, file: !41, line: 94, baseType: !86, size: 64, offset: 1408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !536, file: !41, line: 95, baseType: !88, size: 64, offset: 1472)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !536, file: !41, line: 96, baseType: !33, size: 32, offset: 1536)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !536, file: !41, line: 98, baseType: !93, size: 160, offset: 1568)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !569, nameTableKind: None)
!568 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !{!570}
!570 = !DISubprogram(name: "setlocale_null_r", scope: !571, file: !571, line: 64, type: !572, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!571 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !DISubroutineType(types: !573)
!573 = !{!33, !33, !29, !90}
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !576, retainedTypes: !963, nameTableKind: None)
!575 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !{!577}
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !578, line: 41, baseType: !7, size: 32, elements: !579)
!578 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!580 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!581 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!582 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!583 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!584 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!585 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!586 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!587 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!588 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!589 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!590 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!591 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!592 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!593 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!594 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!595 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!596 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!597 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!598 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!599 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!600 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!601 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!602 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!603 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!604 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!605 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!606 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!607 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!608 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!609 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!610 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!611 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!612 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!613 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!614 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!615 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!616 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!617 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!618 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!619 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!620 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!621 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!622 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!623 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!624 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!625 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!626 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!627 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!628 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!629 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!688 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!691 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!692 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!693 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!694 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!695 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!696 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!697 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!698 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!699 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!700 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!701 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!702 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!775 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!848 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!849 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!850 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!851 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!852 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!853 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!854 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!855 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!856 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!857 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!858 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!859 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!860 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!861 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!862 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!864 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!865 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!866 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!867 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!868 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!869 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!895 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!896 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!897 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!898 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!899 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!904 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!905 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!906 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!907 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!963 = !{!964, !86}
!964 = !DISubprogram(name: "nl_langinfo", scope: !578, file: !578, line: 661, type: !965, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!965 = !DISubroutineType(types: !966)
!966 = !{!29, !33}
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !969, nameTableKind: None)
!968 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!969 = !{!86, !104}
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !972, nameTableKind: None)
!971 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!972 = !{!973, !1008, !1009, !1012}
!973 = !DISubprogram(name: "fileno", scope: !36, file: !36, line: 786, type: !974, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!974 = !DISubroutineType(types: !975)
!975 = !{!33, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !977, file: !41, line: 51, baseType: !33, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !977, file: !41, line: 54, baseType: !29, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !977, file: !41, line: 55, baseType: !29, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !977, file: !41, line: 56, baseType: !29, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !977, file: !41, line: 57, baseType: !29, size: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !977, file: !41, line: 58, baseType: !29, size: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !977, file: !41, line: 59, baseType: !29, size: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !977, file: !41, line: 60, baseType: !29, size: 64, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !977, file: !41, line: 61, baseType: !29, size: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !977, file: !41, line: 64, baseType: !29, size: 64, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !977, file: !41, line: 65, baseType: !29, size: 64, offset: 640)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !977, file: !41, line: 66, baseType: !29, size: 64, offset: 704)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !977, file: !41, line: 68, baseType: !56, size: 64, offset: 768)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !977, file: !41, line: 70, baseType: !976, size: 64, offset: 832)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !977, file: !41, line: 72, baseType: !33, size: 32, offset: 896)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !977, file: !41, line: 73, baseType: !33, size: 32, offset: 928)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !977, file: !41, line: 74, baseType: !62, size: 64, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !977, file: !41, line: 77, baseType: !66, size: 16, offset: 1024)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !977, file: !41, line: 78, baseType: !68, size: 8, offset: 1040)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !977, file: !41, line: 79, baseType: !70, size: 8, offset: 1048)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !977, file: !41, line: 81, baseType: !74, size: 64, offset: 1088)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !977, file: !41, line: 89, baseType: !77, size: 64, offset: 1152)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !977, file: !41, line: 91, baseType: !79, size: 64, offset: 1216)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !977, file: !41, line: 92, baseType: !82, size: 64, offset: 1280)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !977, file: !41, line: 93, baseType: !976, size: 64, offset: 1344)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !977, file: !41, line: 94, baseType: !86, size: 64, offset: 1408)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !977, file: !41, line: 95, baseType: !88, size: 64, offset: 1472)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !977, file: !41, line: 96, baseType: !33, size: 32, offset: 1536)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !977, file: !41, line: 98, baseType: !93, size: 160, offset: 1568)
!1008 = !DISubprogram(name: "fclose", scope: !36, file: !36, line: 213, type: !974, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!1009 = !DISubprogram(name: "lseek", scope: !187, file: !187, line: 334, type: !1010, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!64, !33, !64, !33}
!1012 = !DISubprogram(name: "rpl_fflush", scope: !532, file: !532, line: 718, type: !974, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !34, retainedTypes: !1015, nameTableKind: None)
!1014 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1015 = !{!86, !1016, !1051}
!1016 = !DISubprogram(name: "fflush", scope: !36, file: !36, line: 218, type: !1017, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !34)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!33, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !1021)
