; ModuleID = 'coreutils-8.32/src/readlink.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.F_triple = type { i8*, i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 40, type: !38, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !32, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/readlink.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !14, line: 32, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!27 = !{!28, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33, !36, !0}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "no_newline", scope: !2, file: !3, line: 35, type: !35, isLocal: true, isDefinition: true)
!35 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 38, type: !35, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 2816, elements: !51)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !41, line: 50, size: 256, elements: !42)
!41 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!42 = !{!43, !46, !48, !50}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 52, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !40, file: !41, line: 55, baseType: !47, size: 32, offset: 64)
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !41, line: 56, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !40, file: !41, line: 57, baseType: !47, size: 32, offset: 192)
!51 = !{!52}
!52 = !DISubrange(count: 11)
!53 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!54 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "Version", scope: !57, file: !58, line: 2, type: !44, isLocal: false, isDefinition: true)
!57 = distinct !DICompileUnit(language: DW_LANG_C99, file: !58, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, globals: !60, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!59 = !{}
!60 = !{!55}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "file_name", scope: !63, file: !64, line: 46, type: !44, isLocal: true, isDefinition: true)
!63 = distinct !DICompileUnit(language: DW_LANG_C99, file: !64, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, globals: !65, splitDebugInlining: false, nameTableKind: None)
!64 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!65 = !{!61, !66}
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !63, file: !64, line: 56, type: !35, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "exit_failure", scope: !70, file: !71, line: 24, type: !73, isLocal: false, isDefinition: true)
!70 = distinct !DICompileUnit(language: DW_LANG_C99, file: !71, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, globals: !72, splitDebugInlining: false, nameTableKind: None)
!71 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!72 = !{!68}
!73 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "default_tuning", scope: !76, file: !77, line: 130, type: !83, isLocal: true, isDefinition: true)
!76 = distinct !DICompileUnit(language: DW_LANG_C99, file: !77, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !78, globals: !82, splitDebugInlining: false, nameTableKind: None)
!77 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !{!79, !30, !80}
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 46, baseType: !79)
!81 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!82 = !{!74}
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !85, line: 65, baseType: !86)
!85 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !85, line: 53, size: 160, elements: !87)
!87 = !{!88, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !86, file: !85, line: 58, baseType: !89, size: 32)
!89 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !86, file: !85, line: 59, baseType: !89, size: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !86, file: !85, line: 60, baseType: !89, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !86, file: !85, line: 61, baseType: !89, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !86, file: !85, line: 62, baseType: !35, size: 8, offset: 128)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "program_name", scope: !96, file: !97, line: 33, type: !44, isLocal: false, isDefinition: true)
!96 = distinct !DICompileUnit(language: DW_LANG_C99, file: !97, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !98, globals: !99, splitDebugInlining: false, nameTableKind: None)
!97 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!98 = !{!30, !28}
!99 = !{!94}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !102, file: !103, line: 85, type: !164, isLocal: false, isDefinition: true)
!102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !103, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !125, globals: !127, splitDebugInlining: false, nameTableKind: None)
!103 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!104 = !{!13, !105, !110}
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 242, baseType: !7, size: 32, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 46, baseType: !7, size: 32, elements: !112)
!111 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!113 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!116 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!117 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!119 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!120 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!121 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!124 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!125 = !{!47, !126, !80, !28}
!126 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!127 = !{!100, !128, !134, !146, !148, !153, !160, !162}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !102, file: !103, line: 101, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 320, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!132 = !{!133}
!133 = !DISubrange(count: 10)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !102, file: !103, line: 1052, type: !136, isLocal: false, isDefinition: true)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !103, line: 65, size: 448, elements: !137)
!137 = !{!138, !139, !140, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !136, file: !103, line: 68, baseType: !13, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !103, line: 71, baseType: !47, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !136, file: !103, line: 75, baseType: !141, size: 256, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !136, file: !103, line: 78, baseType: !44, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !136, file: !103, line: 81, baseType: !44, size: 64, offset: 384)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !102, file: !103, line: 116, type: !136, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "slot0", scope: !102, file: !103, line: 842, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 256)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "slotvec", scope: !102, file: !103, line: 845, type: !155, isLocal: true, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !103, line: 834, size: 128, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !103, line: 836, baseType: !80, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !156, file: !103, line: 837, baseType: !28, size: 64, offset: 64)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "nslots", scope: !102, file: !103, line: 843, type: !47, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "slotvec0", scope: !102, file: !103, line: 844, type: !156, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 704, elements: !51)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !168, file: !169, line: 26, type: !171, isLocal: false, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !{!166}
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 376, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 47)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !{!177}
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !178, file: !175, line: 64, baseType: !7, size: 32, elements: !211)
!178 = distinct !DISubprogram(name: "areadlink_with_size", scope: !175, file: !175, line: 53, type: !179, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !181)
!179 = !DISubroutineType(types: !180)
!180 = !{!28, !44, !80}
!181 = !{!182, !183, !184, !185, !186, !187, !188, !195, !196, !200, !201, !202, !205}
!182 = !DILocalVariable(name: "file", arg: 1, scope: !178, file: !175, line: 53, type: !44)
!183 = !DILocalVariable(name: "size", arg: 2, scope: !178, file: !175, line: 53, type: !80)
!184 = !DILocalVariable(name: "symlink_max", scope: !178, file: !175, line: 58, type: !80)
!185 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !178, file: !175, line: 59, type: !80)
!186 = !DILocalVariable(name: "initial_limit", scope: !178, file: !175, line: 60, type: !80)
!187 = !DILocalVariable(name: "buf_size", scope: !178, file: !175, line: 67, type: !80)
!188 = !DILocalVariable(name: "r", scope: !189, file: !175, line: 72, type: !190)
!189 = distinct !DILexicalBlock(scope: !178, file: !175, line: 71, column: 5)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !191, line: 108, baseType: !192)
!191 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !193, line: 194, baseType: !194)
!193 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!194 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!195 = !DILocalVariable(name: "link_length", scope: !189, file: !175, line: 73, type: !80)
!196 = !DILocalVariable(name: "stackbuf", scope: !189, file: !175, line: 74, type: !197)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 128)
!200 = !DILocalVariable(name: "buf", scope: !189, file: !175, line: 75, type: !28)
!201 = !DILocalVariable(name: "buffer", scope: !189, file: !175, line: 76, type: !28)
!202 = !DILocalVariable(name: "saved_errno", scope: !203, file: !175, line: 92, type: !47)
!203 = distinct !DILexicalBlock(scope: !204, file: !175, line: 91, column: 9)
!204 = distinct !DILexicalBlock(scope: !189, file: !175, line: 90, column: 11)
!205 = !DILocalVariable(name: "shrinked_buffer", scope: !206, file: !175, line: 110, type: !28)
!206 = distinct !DILexicalBlock(scope: !207, file: !175, line: 108, column: 13)
!207 = distinct !DILexicalBlock(scope: !208, file: !175, line: 107, column: 20)
!208 = distinct !DILexicalBlock(scope: !209, file: !175, line: 101, column: 15)
!209 = distinct !DILexicalBlock(scope: !210, file: !175, line: 99, column: 9)
!210 = distinct !DILexicalBlock(scope: !189, file: !175, line: 98, column: 11)
!211 = !{!212}
!212 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!213 = !{!30}
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!215 = !DIFile(filename: "lib/canonicalize.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!216 = !{!5}
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !98, splitDebugInlining: false, nameTableKind: None)
!218 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!222 = !DIFile(filename: "lib/same.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!224 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !{!226}
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !224, line: 40, baseType: !7, size: 32, elements: !227)
!227 = !{!228}
!228 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !231, retainedTypes: !245, splitDebugInlining: false, nameTableKind: None)
!230 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!231 = !{!232}
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !234, file: !233, line: 186, baseType: !7, size: 32, elements: !243)
!233 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = distinct !DISubprogram(name: "x2nrealloc", scope: !233, file: !233, line: 174, type: !235, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !229, retainedNodes: !238)
!235 = !DISubroutineType(types: !236)
!236 = !{!30, !30, !237, !80}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!238 = !{!239, !240, !241, !242}
!239 = !DILocalVariable(name: "p", arg: 1, scope: !234, file: !233, line: 174, type: !30)
!240 = !DILocalVariable(name: "pn", arg: 2, scope: !234, file: !233, line: 174, type: !237)
!241 = !DILocalVariable(name: "s", arg: 3, scope: !234, file: !233, line: 174, type: !80)
!242 = !DILocalVariable(name: "n", scope: !234, file: !233, line: 176, type: !80)
!243 = !{!244}
!244 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!245 = !{!80, !28, !30}
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!247 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!249 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!251 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !254, splitDebugInlining: false, nameTableKind: None)
!253 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!254 = !{!80}
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !263, splitDebugInlining: false, nameTableKind: None)
!262 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!263 = !{!28}
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/hash-pjw.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !270, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = !{!271}
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 41, baseType: !7, size: 32, elements: !273)
!272 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!274 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!275 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!276 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!277 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!278 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!279 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!280 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!281 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!282 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!283 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!284 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!285 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!286 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!287 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!288 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!289 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!290 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!291 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!292 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!293 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!294 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!295 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!296 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!300 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!301 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!302 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!303 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!304 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!305 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!306 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!307 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!308 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!312 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!313 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!314 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!315 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!316 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!317 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!318 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!319 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!320 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!321 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!322 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!323 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!382 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!385 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!386 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!387 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!388 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!389 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!390 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!391 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!392 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!393 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!469 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!542 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!543 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!544 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!545 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!546 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!547 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!548 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!549 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!550 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!551 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!552 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!553 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!554 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!555 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!556 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!558 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!559 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!560 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!561 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!562 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!563 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!589 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!590 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!591 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!592 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!593 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!598 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!599 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!600 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!601 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !660, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, splitDebugInlining: false, nameTableKind: None)
!660 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!662 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !213, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!665 = !{!"clang version 12.0.1"}
!666 = !{i32 7, !"Dwarf Version", i32 4}
!667 = !{i32 2, !"Debug Info Version", i32 3}
!668 = !{i32 1, !"wchar_size", i32 4}
!669 = !{i32 7, !"PIC Level", i32 2}
!670 = !{i32 7, !"PIE Level", i32 2}
!671 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 56, type: !672, scopeLine: 57, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !47}
!674 = !{!675}
!675 = !DILocalVariable(name: "status", arg: 1, scope: !671, file: !3, line: 56, type: !47)
!676 = !DILocation(line: 0, scope: !671)
!677 = !DILocation(line: 58, column: 14, scope: !678)
!678 = distinct !DILexicalBlock(scope: !671, file: !3, line: 58, column: 7)
!679 = !DILocation(line: 58, column: 7, scope: !671)
!680 = !DILocation(line: 59, column: 5, scope: !681)
!681 = distinct !DILexicalBlock(scope: !678, file: !3, line: 59, column: 5)
!682 = !{!683, !683, i64 0}
!683 = !{!"any pointer", !684, i64 0}
!684 = !{!"omnipotent char", !685, i64 0}
!685 = !{!"Simple C/C++ TBAA"}
!686 = !DILocation(line: 62, column: 7, scope: !687)
!687 = distinct !DILexicalBlock(scope: !678, file: !3, line: 61, column: 5)
!688 = !DILocation(line: 63, column: 7, scope: !687)
!689 = !DILocation(line: 65, column: 7, scope: !687)
!690 = !DILocation(line: 75, column: 7, scope: !687)
!691 = !DILocation(line: 86, column: 7, scope: !687)
!692 = !DILocation(line: 87, column: 7, scope: !687)
!693 = !DILocalVariable(name: "program", arg: 1, scope: !694, file: !695, line: 634, type: !44)
!694 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !695, file: !695, line: 634, type: !696, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !698)
!695 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!696 = !DISubroutineType(types: !697)
!697 = !{null, !44}
!698 = !{!693, !699, !708, !709, !711}
!699 = !DILocalVariable(name: "infomap", scope: !694, file: !695, line: 636, type: !700)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 896, elements: !706)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !694, file: !695, line: 636, size: 128, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !702, file: !695, line: 636, baseType: !44, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !702, file: !695, line: 636, baseType: !44, size: 64, offset: 64)
!706 = !{!707}
!707 = !DISubrange(count: 7)
!708 = !DILocalVariable(name: "node", scope: !694, file: !695, line: 646, type: !44)
!709 = !DILocalVariable(name: "map_prog", scope: !694, file: !695, line: 647, type: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!711 = !DILocalVariable(name: "lc_messages", scope: !694, file: !695, line: 659, type: !44)
!712 = !DILocation(line: 0, scope: !694, inlinedAt: !713)
!713 = distinct !DILocation(line: 88, column: 7, scope: !687)
!714 = !DILocation(line: 636, column: 3, scope: !694, inlinedAt: !713)
!715 = !DILocation(line: 636, column: 67, scope: !694, inlinedAt: !713)
!716 = !DILocation(line: 647, column: 36, scope: !694, inlinedAt: !713)
!717 = !DILocation(line: 649, column: 3, scope: !694, inlinedAt: !713)
!718 = !DILocation(line: 649, column: 33, scope: !694, inlinedAt: !713)
!719 = !DILocation(line: 650, column: 13, scope: !694, inlinedAt: !713)
!720 = !DILocation(line: 649, column: 20, scope: !694, inlinedAt: !713)
!721 = !{!722, !683, i64 0}
!722 = !{!"infomap", !683, i64 0, !683, i64 8}
!723 = !DILocation(line: 649, column: 10, scope: !694, inlinedAt: !713)
!724 = !DILocation(line: 649, column: 28, scope: !694, inlinedAt: !713)
!725 = distinct !{!725, !717, !719, !726}
!726 = !{!"llvm.loop.mustprogress"}
!727 = !DILocation(line: 652, column: 17, scope: !728, inlinedAt: !713)
!728 = distinct !DILexicalBlock(scope: !694, file: !695, line: 652, column: 7)
!729 = !{!722, !683, i64 8}
!730 = !DILocation(line: 652, column: 7, scope: !728, inlinedAt: !713)
!731 = !DILocation(line: 652, column: 7, scope: !694, inlinedAt: !713)
!732 = !DILocation(line: 655, column: 3, scope: !694, inlinedAt: !713)
!733 = !DILocation(line: 659, column: 29, scope: !694, inlinedAt: !713)
!734 = !DILocation(line: 660, column: 7, scope: !735, inlinedAt: !713)
!735 = distinct !DILexicalBlock(scope: !694, file: !695, line: 660, column: 7)
!736 = !DILocation(line: 660, column: 19, scope: !735, inlinedAt: !713)
!737 = !DILocation(line: 660, column: 22, scope: !735, inlinedAt: !713)
!738 = !DILocation(line: 660, column: 7, scope: !694, inlinedAt: !713)
!739 = !DILocation(line: 666, column: 7, scope: !740, inlinedAt: !713)
!740 = distinct !DILexicalBlock(scope: !735, file: !695, line: 661, column: 5)
!741 = !DILocation(line: 668, column: 5, scope: !740, inlinedAt: !713)
!742 = !DILocation(line: 669, column: 3, scope: !694, inlinedAt: !713)
!743 = !DILocation(line: 671, column: 3, scope: !694, inlinedAt: !713)
!744 = !DILocation(line: 673, column: 1, scope: !694, inlinedAt: !713)
!745 = !DILocation(line: 90, column: 3, scope: !671)
!746 = !DISubprogram(name: "dcgettext", scope: !747, file: !747, line: 51, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!747 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!748 = !DISubroutineType(types: !749)
!749 = !{!28, !44, !44, !47}
!750 = !DISubprogram(name: "fputs_unlocked", scope: !751, file: !751, line: 667, type: !752, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!751 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!752 = !DISubroutineType(types: !753)
!753 = !{!47, !44, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !756, line: 49, size: 1728, elements: !757)
!756 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !773, !774, !775, !776, !778, !779, !781, !785, !788, !790, !793, !796, !797, !798, !799, !800}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !755, file: !756, line: 51, baseType: !47, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !755, file: !756, line: 54, baseType: !28, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !755, file: !756, line: 55, baseType: !28, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !755, file: !756, line: 56, baseType: !28, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !755, file: !756, line: 57, baseType: !28, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !755, file: !756, line: 58, baseType: !28, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !755, file: !756, line: 59, baseType: !28, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !755, file: !756, line: 60, baseType: !28, size: 64, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !755, file: !756, line: 61, baseType: !28, size: 64, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !755, file: !756, line: 64, baseType: !28, size: 64, offset: 576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !755, file: !756, line: 65, baseType: !28, size: 64, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !755, file: !756, line: 66, baseType: !28, size: 64, offset: 704)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !755, file: !756, line: 68, baseType: !771, size: 64, offset: 768)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !756, line: 36, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !755, file: !756, line: 70, baseType: !754, size: 64, offset: 832)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !755, file: !756, line: 72, baseType: !47, size: 32, offset: 896)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !755, file: !756, line: 73, baseType: !47, size: 32, offset: 928)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !755, file: !756, line: 74, baseType: !777, size: 64, offset: 960)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !193, line: 152, baseType: !194)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !755, file: !756, line: 77, baseType: !126, size: 16, offset: 1024)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !755, file: !756, line: 78, baseType: !780, size: 8, offset: 1040)
!780 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !755, file: !756, line: 79, baseType: !782, size: 8, offset: 1048)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 1)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !755, file: !756, line: 81, baseType: !786, size: 64, offset: 1088)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !756, line: 43, baseType: null)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !755, file: !756, line: 89, baseType: !789, size: 64, offset: 1152)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !193, line: 153, baseType: !194)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !755, file: !756, line: 91, baseType: !791, size: 64, offset: 1216)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !756, line: 37, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !755, file: !756, line: 92, baseType: !794, size: 64, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !756, line: 38, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !755, file: !756, line: 93, baseType: !754, size: 64, offset: 1344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !755, file: !756, line: 94, baseType: !30, size: 64, offset: 1408)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !755, file: !756, line: 95, baseType: !80, size: 64, offset: 1472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !755, file: !756, line: 96, baseType: !47, size: 32, offset: 1536)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !755, file: !756, line: 98, baseType: !801, size: 160, offset: 1568)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 20)
!804 = !DISubprogram(name: "setlocale", scope: !805, file: !805, line: 122, type: !806, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!805 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!806 = !DISubroutineType(types: !807)
!807 = !{!28, !47, !44}
!808 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 94, type: !809, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !812)
!809 = !DISubroutineType(types: !810)
!810 = !{!47, !47, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !823}
!813 = !DILocalVariable(name: "argc", arg: 1, scope: !808, file: !3, line: 94, type: !47)
!814 = !DILocalVariable(name: "argv", arg: 2, scope: !808, file: !3, line: 94, type: !811)
!815 = !DILocalVariable(name: "can_mode", scope: !808, file: !3, line: 97, type: !47)
!816 = !DILocalVariable(name: "status", scope: !808, file: !3, line: 98, type: !47)
!817 = !DILocalVariable(name: "optc", scope: !808, file: !3, line: 99, type: !47)
!818 = !DILocalVariable(name: "use_nuls", scope: !808, file: !3, line: 100, type: !35)
!819 = !DILocalVariable(name: "fname", scope: !820, file: !3, line: 158, type: !44)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 157, column: 5)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 156, column: 3)
!822 = distinct !DILexicalBlock(scope: !808, file: !3, line: 156, column: 3)
!823 = !DILocalVariable(name: "value", scope: !820, file: !3, line: 159, type: !28)
!824 = !DILocation(line: 0, scope: !808)
!825 = !DILocation(line: 103, column: 21, scope: !808)
!826 = !DILocation(line: 103, column: 3, scope: !808)
!827 = !DILocation(line: 104, column: 3, scope: !808)
!828 = !DILocation(line: 105, column: 3, scope: !808)
!829 = !DILocation(line: 106, column: 3, scope: !808)
!830 = !DILocation(line: 108, column: 3, scope: !808)
!831 = !DILocation(line: 110, column: 3, scope: !808)
!832 = !DILocation(line: 110, column: 18, scope: !808)
!833 = distinct !{!833, !831, !834, !726}
!834 = !DILocation(line: 141, column: 5, scope: !808)
!835 = !DILocation(line: 119, column: 11, scope: !836)
!836 = distinct !DILexicalBlock(scope: !837, file: !3, line: 113, column: 9)
!837 = distinct !DILexicalBlock(scope: !808, file: !3, line: 111, column: 5)
!838 = !DILocation(line: 122, column: 11, scope: !836)
!839 = !DILocation(line: 124, column: 22, scope: !836)
!840 = !DILocation(line: 125, column: 11, scope: !836)
!841 = !DILocation(line: 128, column: 19, scope: !836)
!842 = !DILocation(line: 129, column: 11, scope: !836)
!843 = !DILocation(line: 131, column: 19, scope: !836)
!844 = !DILocation(line: 132, column: 11, scope: !836)
!845 = !DILocation(line: 136, column: 9, scope: !836)
!846 = !DILocation(line: 137, column: 9, scope: !836)
!847 = !DILocation(line: 139, column: 11, scope: !836)
!848 = !DILocation(line: 143, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !808, file: !3, line: 143, column: 7)
!850 = !{!851, !851, i64 0}
!851 = !{!"int", !684, i64 0}
!852 = !DILocation(line: 143, column: 14, scope: !849)
!853 = !DILocation(line: 143, column: 7, scope: !808)
!854 = !DILocation(line: 145, column: 20, scope: !855)
!855 = distinct !DILexicalBlock(scope: !849, file: !3, line: 144, column: 5)
!856 = !DILocation(line: 145, column: 7, scope: !855)
!857 = !DILocation(line: 146, column: 7, scope: !855)
!858 = !DILocation(line: 149, column: 12, scope: !859)
!859 = distinct !DILexicalBlock(scope: !808, file: !3, line: 149, column: 7)
!860 = !DILocation(line: 149, column: 21, scope: !859)
!861 = !DILocation(line: 149, column: 7, scope: !808)
!862 = !DILocation(line: 151, column: 11, scope: !863)
!863 = distinct !DILexicalBlock(scope: !864, file: !3, line: 151, column: 11)
!864 = distinct !DILexicalBlock(scope: !859, file: !3, line: 150, column: 5)
!865 = !DILocation(line: 151, column: 11, scope: !864)
!866 = !DILocation(line: 152, column: 22, scope: !863)
!867 = !DILocation(line: 152, column: 9, scope: !863)
!868 = !DILocation(line: 156, column: 10, scope: !821)
!869 = !DILocation(line: 153, column: 18, scope: !864)
!870 = !DILocation(line: 154, column: 5, scope: !864)
!871 = !DILocation(line: 156, column: 17, scope: !821)
!872 = !DILocation(line: 156, column: 3, scope: !822)
!873 = !DILocation(line: 158, column: 27, scope: !820)
!874 = !DILocation(line: 0, scope: !820)
!875 = !DILocation(line: 159, column: 22, scope: !820)
!876 = !DILocation(line: 160, column: 24, scope: !820)
!877 = !DILocation(line: 161, column: 24, scope: !820)
!878 = !DILocation(line: 162, column: 11, scope: !879)
!879 = distinct !DILexicalBlock(scope: !820, file: !3, line: 162, column: 11)
!880 = !DILocation(line: 162, column: 11, scope: !820)
!881 = !DILocation(line: 164, column: 11, scope: !882)
!882 = distinct !DILexicalBlock(scope: !879, file: !3, line: 163, column: 9)
!883 = !DILocation(line: 165, column: 17, scope: !884)
!884 = distinct !DILexicalBlock(scope: !882, file: !3, line: 165, column: 15)
!885 = !DILocation(line: 165, column: 15, scope: !882)
!886 = !DILocalVariable(name: "__c", arg: 1, scope: !887, file: !888, line: 108, type: !47)
!887 = distinct !DISubprogram(name: "putchar_unlocked", scope: !888, file: !888, line: 108, type: !889, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !891)
!888 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!889 = !DISubroutineType(types: !890)
!890 = !{!47, !47}
!891 = !{!886}
!892 = !DILocation(line: 0, scope: !887, inlinedAt: !893)
!893 = distinct !DILocation(line: 166, column: 13, scope: !884)
!894 = !DILocation(line: 110, column: 10, scope: !887, inlinedAt: !893)
!895 = !{!896, !683, i64 40}
!896 = !{!"_IO_FILE", !851, i64 0, !683, i64 8, !683, i64 16, !683, i64 24, !683, i64 32, !683, i64 40, !683, i64 48, !683, i64 56, !683, i64 64, !683, i64 72, !683, i64 80, !683, i64 88, !683, i64 96, !683, i64 104, !851, i64 112, !851, i64 116, !897, i64 120, !898, i64 128, !684, i64 130, !684, i64 131, !683, i64 136, !897, i64 144, !683, i64 152, !683, i64 160, !683, i64 168, !683, i64 176, !897, i64 184, !851, i64 192, !684, i64 196}
!897 = !{!"long", !684, i64 0}
!898 = !{!"short", !684, i64 0}
!899 = !{!896, !683, i64 48}
!900 = !{!"branch_weights", i32 2000, i32 1}
!901 = !{!684, !684, i64 0}
!902 = !DILocation(line: 167, column: 11, scope: !882)
!903 = !DILocation(line: 168, column: 9, scope: !882)
!904 = !DILocation(line: 172, column: 15, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 172, column: 15)
!906 = distinct !DILexicalBlock(scope: !879, file: !3, line: 170, column: 9)
!907 = !DILocation(line: 172, column: 15, scope: !906)
!908 = !DILocation(line: 173, column: 23, scope: !905)
!909 = !DILocation(line: 173, column: 36, scope: !905)
!910 = !DILocation(line: 173, column: 13, scope: !905)
!911 = !DILocation(line: 156, column: 25, scope: !821)
!912 = distinct !{!912, !872, !913, !726}
!913 = !DILocation(line: 175, column: 5, scope: !822)
!914 = !DILocation(line: 98, column: 7, scope: !808)
!915 = !DILocation(line: 177, column: 3, scope: !808)
!916 = !DISubprogram(name: "bindtextdomain", scope: !747, file: !747, line: 86, type: !917, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!917 = !DISubroutineType(types: !918)
!918 = !{!28, !44, !44}
!919 = !DISubprogram(name: "textdomain", scope: !747, file: !747, line: 82, type: !920, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!920 = !DISubroutineType(types: !921)
!921 = !{!28, !44}
!922 = !DISubprogram(name: "atexit", scope: !923, file: !923, line: 595, type: !924, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!923 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!924 = !DISubroutineType(types: !925)
!925 = !{!47, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null}
!929 = !DISubprogram(name: "getopt_long", scope: !41, file: !41, line: 66, type: !930, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!930 = !DISubroutineType(types: !931)
!931 = !{!47, !47, !932, !44, !934, !49}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!935 = !DISubprogram(name: "error", scope: !936, file: !936, line: 52, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !59)
!936 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!937 = !DISubroutineType(types: !938)
!938 = !{null, !47, !47, !44, null}
!939 = !DILocation(line: 0, scope: !178)
!940 = !DILocation(line: 67, column: 27, scope: !178)
!941 = !DILocation(line: 67, column: 22, scope: !178)
!942 = !DILocation(line: 70, column: 3, scope: !178)
!943 = !DILocation(line: 67, column: 10, scope: !178)
!944 = !DILocation(line: 74, column: 7, scope: !189)
!945 = !DILocation(line: 74, column: 12, scope: !189)
!946 = !DILocation(line: 0, scope: !189)
!947 = !DILocation(line: 78, column: 24, scope: !948)
!948 = distinct !DILexicalBlock(scope: !189, file: !175, line: 78, column: 11)
!949 = !DILocation(line: 80, column: 26, scope: !950)
!950 = distinct !DILexicalBlock(scope: !948, file: !175, line: 79, column: 9)
!951 = !DILocation(line: 81, column: 16, scope: !952)
!952 = distinct !DILexicalBlock(scope: !950, file: !175, line: 81, column: 15)
!953 = !DILocation(line: 81, column: 15, scope: !950)
!954 = !DILocation(line: 85, column: 11, scope: !189)
!955 = !DILocation(line: 90, column: 13, scope: !204)
!956 = !DILocation(line: 90, column: 17, scope: !204)
!957 = !DILocation(line: 90, column: 20, scope: !204)
!958 = !DILocation(line: 90, column: 26, scope: !204)
!959 = !DILocation(line: 90, column: 11, scope: !189)
!960 = !DILocation(line: 0, scope: !203)
!961 = !DILocation(line: 93, column: 11, scope: !203)
!962 = !DILocation(line: 94, column: 17, scope: !203)
!963 = !DILocation(line: 98, column: 23, scope: !210)
!964 = !DILocation(line: 98, column: 11, scope: !189)
!965 = !DILocation(line: 100, column: 11, scope: !209)
!966 = !DILocation(line: 100, column: 28, scope: !209)
!967 = !DILocation(line: 101, column: 16, scope: !208)
!968 = !DILocation(line: 0, scope: !208)
!969 = !DILocation(line: 101, column: 15, scope: !209)
!970 = !DILocation(line: 103, column: 24, scope: !971)
!971 = distinct !DILexicalBlock(scope: !208, file: !175, line: 102, column: 13)
!972 = !DILocation(line: 104, column: 19, scope: !973)
!973 = distinct !DILexicalBlock(scope: !971, file: !175, line: 104, column: 19)
!974 = !DILocation(line: 104, column: 19, scope: !971)
!975 = !DILocalVariable(name: "__dest", arg: 1, scope: !976, file: !977, line: 26, type: !980)
!976 = distinct !DISubprogram(name: "memcpy", scope: !977, file: !977, line: 26, type: !978, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !984)
!977 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "")
!978 = !DISubroutineType(types: !979)
!979 = !{!30, !980, !981, !80}
!980 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !30)
!981 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!984 = !{!975, !985, !986}
!985 = !DILocalVariable(name: "__src", arg: 2, scope: !976, file: !977, line: 26, type: !981)
!986 = !DILocalVariable(name: "__len", arg: 3, scope: !976, file: !977, line: 26, type: !80)
!987 = !DILocation(line: 0, scope: !976, inlinedAt: !988)
!988 = distinct !DILocation(line: 105, column: 24, scope: !973)
!989 = !DILocation(line: 29, column: 10, scope: !976, inlinedAt: !988)
!990 = !DILocation(line: 105, column: 17, scope: !973)
!991 = !DILocation(line: 107, column: 36, scope: !207)
!992 = !DILocation(line: 107, column: 20, scope: !208)
!993 = !DILocation(line: 110, column: 39, scope: !206)
!994 = !DILocation(line: 0, scope: !206)
!995 = !DILocation(line: 111, column: 35, scope: !996)
!996 = distinct !DILexicalBlock(scope: !206, file: !175, line: 111, column: 19)
!997 = !DILocation(line: 111, column: 19, scope: !206)
!998 = !DILocation(line: 113, column: 13, scope: !206)
!999 = !DILocation(line: 117, column: 7, scope: !189)
!1000 = !DILocation(line: 118, column: 20, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !189, file: !175, line: 118, column: 11)
!1002 = !DILocation(line: 118, column: 11, scope: !189)
!1003 = !DILocation(line: 119, column: 18, scope: !1001)
!1004 = !DILocation(line: 119, column: 9, scope: !1001)
!1005 = !DILocation(line: 120, column: 25, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !175, line: 120, column: 16)
!1007 = !DILocation(line: 120, column: 16, scope: !1001)
!1008 = !DILocation(line: 124, column: 11, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1006, file: !175, line: 123, column: 9)
!1010 = !DILocation(line: 124, column: 17, scope: !1009)
!1011 = !DILocation(line: 125, column: 11, scope: !1009)
!1012 = !DILocation(line: 127, column: 5, scope: !178)
!1013 = !DILocation(line: 128, column: 1, scope: !178)
!1014 = distinct !DISubprogram(name: "canonicalize_filename_mode", scope: !215, file: !215, line: 99, type: !1015, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !214, retainedNodes: !1018)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!28, !44, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "canonicalize_mode_t", file: !6, line: 42, baseType: !5)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1032, !1033, !1034, !1035, !1036, !1041, !1085, !1089, !1090, !1093, !1094, !1095, !1098}
!1019 = !DILocalVariable(name: "name", arg: 1, scope: !1014, file: !215, line: 99, type: !44)
!1020 = !DILocalVariable(name: "can_mode", arg: 2, scope: !1014, file: !215, line: 99, type: !1017)
!1021 = !DILocalVariable(name: "rname", scope: !1014, file: !215, line: 101, type: !28)
!1022 = !DILocalVariable(name: "dest", scope: !1014, file: !215, line: 101, type: !28)
!1023 = !DILocalVariable(name: "extra_buf", scope: !1014, file: !215, line: 101, type: !28)
!1024 = !DILocalVariable(name: "start", scope: !1014, file: !215, line: 102, type: !44)
!1025 = !DILocalVariable(name: "end", scope: !1014, file: !215, line: 103, type: !44)
!1026 = !DILocalVariable(name: "rname_limit", scope: !1014, file: !215, line: 104, type: !44)
!1027 = !DILocalVariable(name: "extra_len", scope: !1014, file: !215, line: 105, type: !80)
!1028 = !DILocalVariable(name: "ht", scope: !1014, file: !215, line: 106, type: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !85, line: 69, baseType: !1031)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !85, line: 67, flags: DIFlagFwdDecl)
!1032 = !DILocalVariable(name: "saved_errno", scope: !1014, file: !215, line: 107, type: !47)
!1033 = !DILocalVariable(name: "can_flags", scope: !1014, file: !215, line: 108, type: !47)
!1034 = !DILocalVariable(name: "logical", scope: !1014, file: !215, line: 109, type: !35)
!1035 = !DILocalVariable(name: "prefix_len", scope: !1014, file: !215, line: 110, type: !80)
!1036 = !DILocalVariable(name: "p", scope: !1037, file: !215, line: 144, type: !28)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !215, line: 143, column: 9)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !215, line: 142, column: 11)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !215, line: 137, column: 5)
!1040 = distinct !DILexicalBlock(scope: !1014, file: !215, line: 136, column: 7)
!1041 = !DILocalVariable(name: "st", scope: !1042, file: !215, line: 202, type: !1049)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !215, line: 201, column: 9)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !215, line: 190, column: 16)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !215, line: 188, column: 16)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !215, line: 186, column: 11)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !215, line: 177, column: 5)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !215, line: 176, column: 3)
!1048 = distinct !DILexicalBlock(scope: !1014, file: !215, line: 176, column: 3)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1050, line: 26, size: 1152, elements: !1051)
!1050 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!1051 = !{!1052, !1054, !1056, !1058, !1060, !1062, !1064, !1065, !1066, !1067, !1069, !1071, !1079, !1080, !1081}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1049, file: !1050, line: 28, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !193, line: 145, baseType: !79)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1049, file: !1050, line: 33, baseType: !1055, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !193, line: 148, baseType: !79)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1049, file: !1050, line: 41, baseType: !1057, size: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !193, line: 151, baseType: !79)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1049, file: !1050, line: 42, baseType: !1059, size: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !193, line: 150, baseType: !7)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1049, file: !1050, line: 44, baseType: !1061, size: 32, offset: 224)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !193, line: 146, baseType: !7)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1049, file: !1050, line: 45, baseType: !1063, size: 32, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !193, line: 147, baseType: !7)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1049, file: !1050, line: 47, baseType: !47, size: 32, offset: 288)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1049, file: !1050, line: 49, baseType: !1053, size: 64, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1049, file: !1050, line: 54, baseType: !777, size: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1049, file: !1050, line: 58, baseType: !1068, size: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !193, line: 175, baseType: !194)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1049, file: !1050, line: 60, baseType: !1070, size: 64, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !193, line: 180, baseType: !194)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1049, file: !1050, line: 71, baseType: !1072, size: 128, offset: 576)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1073, line: 10, size: 128, elements: !1074)
!1073 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!1074 = !{!1075, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1072, file: !1073, line: 12, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !193, line: 160, baseType: !194)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1072, file: !1073, line: 16, baseType: !1078, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !193, line: 197, baseType: !194)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1049, file: !1050, line: 72, baseType: !1072, size: 128, offset: 704)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1049, file: !1050, line: 73, baseType: !1072, size: 128, offset: 832)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1049, file: !1050, line: 86, baseType: !1082, size: 192, offset: 960)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 192, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 3)
!1085 = !DILocalVariable(name: "dest_offset", scope: !1086, file: !215, line: 209, type: !1088)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !215, line: 208, column: 13)
!1087 = distinct !DILexicalBlock(scope: !1042, file: !215, line: 207, column: 15)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !81, line: 35, baseType: !194)
!1089 = !DILocalVariable(name: "new_size", scope: !1086, file: !215, line: 210, type: !80)
!1090 = !DILocalVariable(name: "buf", scope: !1091, file: !215, line: 250, type: !28)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !215, line: 249, column: 13)
!1092 = distinct !DILexicalBlock(scope: !1042, file: !215, line: 248, column: 15)
!1093 = !DILocalVariable(name: "n", scope: !1091, file: !215, line: 251, type: !80)
!1094 = !DILocalVariable(name: "len", scope: !1091, file: !215, line: 251, type: !80)
!1095 = !DILocalVariable(name: "pfxlen", scope: !1096, file: !215, line: 295, type: !80)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !215, line: 294, column: 17)
!1097 = distinct !DILexicalBlock(scope: !1091, file: !215, line: 293, column: 19)
!1098 = !DILabel(scope: !1014, name: "error", file: !215, line: 348)
!1099 = !DILocation(line: 0, scope: !1014)
!1100 = !DILocation(line: 109, column: 28, scope: !1014)
!1101 = !DILocation(line: 109, column: 18, scope: !1014)
!1102 = !DILocation(line: 112, column: 12, scope: !1014)
!1103 = !DILocation(line: 114, column: 7, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1014, file: !215, line: 114, column: 7)
!1105 = !{i32 0, i32 3}
!1106 = !DILocation(line: 114, column: 7, scope: !1014)
!1107 = !DILocation(line: 116, column: 7, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1104, file: !215, line: 115, column: 5)
!1109 = !DILocation(line: 116, column: 13, scope: !1108)
!1110 = !DILocation(line: 117, column: 7, scope: !1108)
!1111 = !DILocation(line: 120, column: 12, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1014, file: !215, line: 120, column: 7)
!1113 = !DILocation(line: 120, column: 7, scope: !1014)
!1114 = !DILocation(line: 122, column: 7, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1112, file: !215, line: 121, column: 5)
!1116 = !DILocation(line: 122, column: 13, scope: !1115)
!1117 = !DILocation(line: 123, column: 7, scope: !1115)
!1118 = !DILocation(line: 126, column: 7, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1014, file: !215, line: 126, column: 7)
!1120 = !DILocation(line: 126, column: 7, scope: !1014)
!1121 = !DILocation(line: 128, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1119, file: !215, line: 127, column: 5)
!1123 = !DILocation(line: 128, column: 13, scope: !1122)
!1124 = !DILocation(line: 129, column: 7, scope: !1122)
!1125 = !DILocation(line: 138, column: 15, scope: !1039)
!1126 = !DILocation(line: 139, column: 12, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1039, file: !215, line: 139, column: 11)
!1128 = !DILocation(line: 139, column: 11, scope: !1039)
!1129 = !DILocation(line: 141, column: 14, scope: !1039)
!1130 = !DILocation(line: 142, column: 24, scope: !1038)
!1131 = !DILocation(line: 142, column: 11, scope: !1039)
!1132 = !DILocation(line: 144, column: 21, scope: !1037)
!1133 = !DILocation(line: 0, scope: !1037)
!1134 = !DILocation(line: 145, column: 20, scope: !1037)
!1135 = !DILocation(line: 147, column: 31, scope: !1037)
!1136 = !DILocation(line: 148, column: 9, scope: !1037)
!1137 = !DILocation(line: 158, column: 15, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1040, file: !215, line: 157, column: 5)
!1139 = !DILocation(line: 159, column: 27, scope: !1138)
!1140 = !DILocation(line: 166, column: 12, scope: !1138)
!1141 = !DILocation(line: 166, column: 15, scope: !1138)
!1142 = !DILocation(line: 0, scope: !1040)
!1143 = !DILocation(line: 176, column: 11, scope: !1047)
!1144 = !DILocation(line: 176, column: 3, scope: !1048)
!1145 = !DILocation(line: 179, column: 14, scope: !1046)
!1146 = !DILocation(line: 179, column: 7, scope: !1046)
!1147 = !DILocation(line: 183, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1046, file: !215, line: 183, column: 7)
!1149 = !DILocation(line: 180, column: 9, scope: !1046)
!1150 = distinct !{!1150, !1146, !1151, !726}
!1151 = !DILocation(line: 180, column: 11, scope: !1046)
!1152 = !DILocation(line: 183, column: 25, scope: !1153)
