source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 40, type: !163, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !157, nameTableKind: None)
!3 = !DIFile(filename: "src/readlink.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !14, line: 32, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!27 = !{!28, !38, !99, !103, !107, !110, !113, !120, !32, !89, !135, !139, !143, !146, !150, !153, !156}
!28 = !DISubprogram(name: "dcgettext", scope: !29, file: !29, line: 51, type: !30, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!29 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !34, !34, !36}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{}
!38 = !DISubprogram(name: "fputs_unlocked", scope: !39, file: !39, line: 662, type: !40, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!36, !34, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !45)
!44 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !61, !62, !63, !64, !68, !70, !72, !76, !79, !81, !84, !87, !88, !90, !94, !95}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !43, file: !44, line: 51, baseType: !36, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !43, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !43, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !43, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !43, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !43, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !43, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !43, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !43, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !43, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !43, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !43, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !43, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !44, line: 36, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !43, file: !44, line: 70, baseType: !42, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !43, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !43, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !43, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 152, baseType: !67)
!66 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!67 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !43, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!69 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !43, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!71 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !43, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !43, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !44, line: 43, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !43, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !66, line: 153, baseType: !67)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !43, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !44, line: 37, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !43, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !44, line: 38, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !43, file: !44, line: 93, baseType: !42, size: 64, offset: 1344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !43, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !43, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !92, line: 46, baseType: !93)
!92 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!93 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !43, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !43, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 20)
!99 = !DISubprogram(name: "set_program_name", scope: !100, file: !100, line: 37, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!100 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !34}
!103 = !DISubprogram(name: "setlocale", scope: !104, file: !104, line: 122, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!104 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!105 = !DISubroutineType(types: !106)
!106 = !{!32, !36, !34}
!107 = !DISubprogram(name: "bindtextdomain", scope: !29, file: !29, line: 86, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!108 = !DISubroutineType(types: !109)
!109 = !{!32, !34, !34}
!110 = !DISubprogram(name: "textdomain", scope: !29, file: !29, line: 82, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!111 = !DISubroutineType(types: !112)
!112 = !{!32, !34}
!113 = !DISubprogram(name: "atexit", scope: !114, file: !114, line: 595, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!114 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!36, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null}
!120 = !DISubprogram(name: "getopt_long", scope: !121, file: !121, line: 66, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!121 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!122 = !DISubroutineType(types: !123)
!123 = !{!36, !36, !124, !34, !126, !133}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !121, line: 50, size: 256, elements: !129)
!129 = !{!130, !131, !132, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !121, line: 52, baseType: !34, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !128, file: !121, line: 55, baseType: !36, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !128, file: !121, line: 56, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !128, file: !121, line: 57, baseType: !36, size: 32, offset: 192)
!135 = !DISubprogram(name: "version_etc", scope: !136, file: !136, line: 69, type: !137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!136 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!137 = !DISubroutineType(types: !138)
!138 = !{null, !42, !34, !34, !34, null}
!139 = !DISubprogram(name: "error", scope: !140, file: !140, line: 52, type: !141, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!140 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !DISubroutineType(types: !142)
!142 = !{null, !36, !36, !34, null}
!143 = !DISubprogram(name: "canonicalize_filename_mode", scope: !6, file: !6, line: 50, type: !144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!144 = !DISubroutineType(types: !145)
!145 = !{!32, !34, !5}
!146 = !DISubprogram(name: "areadlink_with_size", scope: !147, file: !147, line: 24, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!147 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!148 = !DISubroutineType(types: !149)
!149 = !{!32, !34, !93}
!150 = !DISubprogram(name: "free", scope: !114, file: !114, line: 565, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !89}
!153 = !DISubprogram(name: "quotearg_n_style_colon", scope: !14, file: !14, line: 397, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!154 = !DISubroutineType(types: !155)
!155 = !{!32, !36, !13, !34}
!156 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !{!158, !161, !0}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "no_newline", scope: !2, file: !3, line: 35, type: !160, isLocal: true, isDefinition: true)
!160 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 38, type: !160, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 2816, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 11)
!166 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!167 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "Version", scope: !170, file: !171, line: 2, type: !34, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, globals: !172, nameTableKind: None)
!171 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !{!168}
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "file_name", scope: !175, file: !176, line: 46, type: !34, isLocal: true, isDefinition: true)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !177, globals: !215, nameTableKind: None)
!176 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!178, !28, !214, !139}
!178 = !DISubprogram(name: "close_stream", scope: !179, file: !179, line: 2, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!179 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !DISubroutineType(types: !181)
!181 = !{!36, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !183, file: !44, line: 51, baseType: !36, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !183, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !183, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !183, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !183, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !183, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !183, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !183, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !183, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !183, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !183, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !183, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !183, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !183, file: !44, line: 70, baseType: !182, size: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !183, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !183, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !183, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !183, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !183, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !183, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !183, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !183, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !183, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !183, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !183, file: !44, line: 93, baseType: !182, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !183, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !183, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !183, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !183, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!214 = !DISubprogram(name: "quotearg_colon", scope: !14, file: !14, line: 391, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!215 = !{!173, !216}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !175, file: !176, line: 56, type: !160, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "exit_failure", scope: !220, file: !221, line: 24, type: !223, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, globals: !222, nameTableKind: None)
!221 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!222 = !{!218}
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "default_tuning", scope: !226, file: !227, line: 130, type: !234, isLocal: true, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !228, globals: !233, nameTableKind: None)
!227 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !{!93, !89, !229, !150, !91}
!229 = !DISubprogram(name: "rpl_calloc", scope: !230, file: !230, line: 688, type: !231, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!230 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!231 = !DISubroutineType(types: !232)
!232 = !{!89, !93, !93}
!233 = !{!224}
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !236, line: 65, baseType: !237)
!236 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !236, line: 53, size: 160, elements: !238)
!238 = !{!239, !241, !242, !243, !244}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !237, file: !236, line: 58, baseType: !240, size: 32)
!240 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !237, file: !236, line: 59, baseType: !240, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !237, file: !236, line: 60, baseType: !240, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !237, file: !236, line: 61, baseType: !240, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !237, file: !236, line: 62, baseType: !160, size: 8, offset: 128)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "program_name", scope: !247, file: !248, line: 33, type: !34, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !249, globals: !285, nameTableKind: None)
!248 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !{!89, !250, !32}
!250 = !DISubprogram(name: "fputs", scope: !39, file: !39, line: 626, type: !251, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!251 = !DISubroutineType(types: !252)
!252 = !{!36, !34, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !254, file: !44, line: 51, baseType: !36, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !254, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !254, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !254, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !254, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !254, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !254, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !254, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !254, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !254, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !254, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !254, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !254, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !254, file: !44, line: 70, baseType: !253, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !254, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !254, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !254, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !254, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !254, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !254, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !254, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !254, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !254, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !254, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !254, file: !44, line: 93, baseType: !253, size: 64, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !254, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !254, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !254, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !254, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!285 = !{!245}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !288, file: !289, line: 85, type: !406, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !290, retainedTypes: !311, globals: !379, nameTableKind: None)
!289 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!290 = !{!13, !291, !296}
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 242, baseType: !7, size: 32, elements: !292)
!292 = !{!293, !294, !295}
!293 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!294 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!295 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 46, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!299 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!300 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!301 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!302 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!303 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!304 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!305 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!306 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!307 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!310 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!311 = !{!312, !318, !150, !334, !36, !69, !337, !91, !354, !358, !28, !364, !368, !32, !372, !375, !376}
!312 = !DISubprogram(name: "xmemdup", scope: !313, file: !313, line: 62, type: !314, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!313 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!314 = !DISubroutineType(types: !315)
!315 = !{!89, !316, !93}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!318 = !DISubprogram(name: "quotearg_alloc_mem", scope: !14, file: !14, line: 342, type: !319, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!319 = !DISubroutineType(types: !320)
!320 = !{!32, !34, !93, !321, !322}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !289, line: 65, size: 448, elements: !325)
!325 = !{!326, !327, !328, !332, !333}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !324, file: !289, line: 68, baseType: !13, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !324, file: !289, line: 71, baseType: !36, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !324, file: !289, line: 75, baseType: !329, size: 256, offset: 64)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !324, file: !289, line: 78, baseType: !34, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !324, file: !289, line: 81, baseType: !34, size: 64, offset: 384)
!334 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !14, file: !14, line: 408, type: !335, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!335 = !DISubroutineType(types: !336)
!336 = !{!32, !36, !34, !34, !34, !93}
!337 = !DISubprogram(name: "rpl_mbrtowc", scope: !338, file: !338, line: 717, type: !339, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!338 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!339 = !DISubroutineType(types: !340)
!340 = !{!93, !133, !34, !93, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 13, size: 64, elements: !344)
!343 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !342, file: !343, line: 15, baseType: !36, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !342, file: !343, line: 20, baseType: !347, size: 32, offset: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !343, line: 16, size: 32, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !347, file: !343, line: 18, baseType: !7, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !347, file: !343, line: 19, baseType: !351, size: 32)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 4)
!354 = !DISubprogram(name: "iswprint", scope: !355, file: !355, line: 120, type: !356, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!355 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!356 = !DISubroutineType(types: !357)
!357 = !{!36, !7}
!358 = !DISubprogram(name: "mbsinit", scope: !359, file: !359, line: 292, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!359 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!360 = !DISubroutineType(types: !361)
!361 = !{!36, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!364 = !DISubprogram(name: "locale_charset", scope: !365, file: !365, line: 35, type: !366, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!365 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!366 = !DISubroutineType(types: !367)
!367 = !{!34}
!368 = !DISubprogram(name: "c_strcasecmp", scope: !369, file: !369, line: 42, type: !370, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!369 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !DISubroutineType(types: !371)
!371 = !{!36, !34, !34}
!372 = !DISubprogram(name: "xmalloc", scope: !313, file: !313, line: 53, type: !373, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!373 = !DISubroutineType(types: !374)
!374 = !{!89, !93}
!375 = !DISubprogram(name: "xalloc_die", scope: !313, file: !313, line: 51, type: !118, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !37)
!376 = !DISubprogram(name: "xrealloc", scope: !313, file: !313, line: 59, type: !377, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!377 = !DISubroutineType(types: !378)
!378 = !{!89, !89, !93}
!379 = !{!286, !380, !386, !388, !390, !395, !402, !404}
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !288, file: !289, line: 101, type: !382, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 320, elements: !384)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!384 = !{!385}
!385 = !DISubrange(count: 10)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !288, file: !289, line: 1052, type: !324, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !288, file: !289, line: 116, type: !324, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "slot0", scope: !288, file: !289, line: 842, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 256)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "slotvec", scope: !288, file: !289, line: 845, type: !397, isLocal: true, isDefinition: true)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !289, line: 834, size: 128, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !398, file: !289, line: 836, baseType: !91, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !398, file: !289, line: 837, baseType: !32, size: 64, offset: 64)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "nslots", scope: !288, file: !289, line: 843, type: !36, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "slotvec0", scope: !288, file: !289, line: 844, type: !398, isLocal: true, isDefinition: true)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 704, elements: !164)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !410, file: !411, line: 26, type: !413, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, globals: !412, nameTableKind: None)
!411 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!412 = !{!408}
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 376, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 47)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !418, retainedTypes: !453, nameTableKind: None)
!417 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!419}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !420, file: !417, line: 64, baseType: !7, size: 32, elements: !451)
!420 = distinct !DISubprogram(name: "areadlink_with_size", scope: !417, file: !417, line: 53, type: !421, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!32, !34, !91}
!423 = !{!424, !425, !426, !427, !428, !429, !430, !435, !436, !440, !441, !442, !445}
!424 = !DILocalVariable(name: "file", arg: 1, scope: !420, file: !417, line: 53, type: !34)
!425 = !DILocalVariable(name: "size", arg: 2, scope: !420, file: !417, line: 53, type: !91)
!426 = !DILocalVariable(name: "symlink_max", scope: !420, file: !417, line: 58, type: !91)
!427 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !420, file: !417, line: 59, type: !91)
!428 = !DILocalVariable(name: "initial_limit", scope: !420, file: !417, line: 60, type: !91)
!429 = !DILocalVariable(name: "buf_size", scope: !420, file: !417, line: 67, type: !91)
!430 = !DILocalVariable(name: "r", scope: !431, file: !417, line: 72, type: !432)
!431 = distinct !DILexicalBlock(scope: !420, file: !417, line: 71, column: 5)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !433, line: 108, baseType: !434)
!433 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !66, line: 193, baseType: !67)
!435 = !DILocalVariable(name: "link_length", scope: !431, file: !417, line: 73, type: !91)
!436 = !DILocalVariable(name: "stackbuf", scope: !431, file: !417, line: 74, type: !437)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1024, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 128)
!440 = !DILocalVariable(name: "buf", scope: !431, file: !417, line: 75, type: !32)
!441 = !DILocalVariable(name: "buffer", scope: !431, file: !417, line: 76, type: !32)
!442 = !DILocalVariable(name: "saved_errno", scope: !443, file: !417, line: 92, type: !36)
!443 = distinct !DILexicalBlock(scope: !444, file: !417, line: 91, column: 9)
!444 = distinct !DILexicalBlock(scope: !431, file: !417, line: 90, column: 11)
!445 = !DILocalVariable(name: "shrinked_buffer", scope: !446, file: !417, line: 110, type: !32)
!446 = distinct !DILexicalBlock(scope: !447, file: !417, line: 108, column: 13)
!447 = distinct !DILexicalBlock(scope: !448, file: !417, line: 107, column: 20)
!448 = distinct !DILexicalBlock(scope: !449, file: !417, line: 101, column: 15)
!449 = distinct !DILexicalBlock(scope: !450, file: !417, line: 99, column: 9)
!450 = distinct !DILexicalBlock(scope: !431, file: !417, line: 98, column: 11)
!451 = !{!452}
!452 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!453 = !{!150, !89}
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !456, retainedTypes: !457, nameTableKind: None)
!455 = !DIFile(filename: "lib/canonicalize.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!456 = !{!5}
!457 = !{!89, !458, !376, !372, !146, !150, !462, !467, !375, !486, !530}
!458 = !DISubprogram(name: "xgetcwd", scope: !459, file: !459, line: 17, type: !460, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!459 = !DIFile(filename: "./lib/xgetcwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !DISubroutineType(types: !461)
!461 = !{!32}
!462 = !DISubprogram(name: "hash_free", scope: !236, file: !236, line: 96, type: !463, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !236, line: 67, flags: DIFlagFwdDecl)
!467 = !DISubprogram(name: "hash_initialize", scope: !236, file: !236, line: 89, type: !468, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!468 = !DISubroutineType(types: !469)
!469 = !{!465, !93, !470, !479, !482, !485}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !236, line: 53, size: 160, elements: !473)
!473 = !{!474, !475, !476, !477, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !472, file: !236, line: 58, baseType: !240, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !472, file: !236, line: 59, baseType: !240, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !472, file: !236, line: 60, baseType: !240, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !472, file: !236, line: 61, baseType: !240, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !472, file: !236, line: 62, baseType: !160, size: 8, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!93, !316, !93}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!160, !316, !316}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!486 = !DISubprogram(name: "seen_file", scope: !487, file: !487, line: 14, type: !488, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!487 = !DIFile(filename: "./lib/file-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !DISubroutineType(types: !489)
!489 = !{!160, !490, !34, !492}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !495, line: 46, size: 1152, elements: !496)
!495 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!496 = !{!497, !499, !501, !503, !505, !507, !509, !510, !511, !512, !514, !516, !524, !525, !526}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !494, file: !495, line: 48, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !66, line: 145, baseType: !93)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !494, file: !495, line: 53, baseType: !500, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !66, line: 148, baseType: !93)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !494, file: !495, line: 61, baseType: !502, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !66, line: 151, baseType: !93)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !494, file: !495, line: 62, baseType: !504, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !66, line: 150, baseType: !7)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !494, file: !495, line: 64, baseType: !506, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !66, line: 146, baseType: !7)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !494, file: !495, line: 65, baseType: !508, size: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !66, line: 147, baseType: !7)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !494, file: !495, line: 67, baseType: !36, size: 32, offset: 288)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !494, file: !495, line: 69, baseType: !498, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !494, file: !495, line: 74, baseType: !65, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !494, file: !495, line: 78, baseType: !513, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !66, line: 174, baseType: !67)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !494, file: !495, line: 80, baseType: !515, size: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !66, line: 179, baseType: !67)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !494, file: !495, line: 91, baseType: !517, size: 128, offset: 576)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !518, line: 10, size: 128, elements: !519)
!518 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!519 = !{!520, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !517, file: !518, line: 12, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !66, line: 160, baseType: !67)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !517, file: !518, line: 16, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !66, line: 196, baseType: !67)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !494, file: !495, line: 92, baseType: !517, size: 128, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !494, file: !495, line: 93, baseType: !517, size: 128, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !494, file: !495, line: 106, baseType: !527, size: 192, offset: 960)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 192, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 3)
!530 = !DISubprogram(name: "record_file", scope: !487, file: !487, line: 7, type: !531, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !465, !34, !492}
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !535, nameTableKind: None)
!534 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!535 = !{!89, !372, !536, !537, !375, !540, !32, !542}
!536 = !DISubprogram(name: "xstrdup", scope: !313, file: !313, line: 64, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!537 = !DISubprogram(name: "hash_insert", scope: !236, file: !236, line: 100, type: !538, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!538 = !DISubroutineType(types: !539)
!539 = !{!89, !465, !316}
!540 = !DISubprogram(name: "triple_free", scope: !541, file: !541, line: 22, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!541 = !DIFile(filename: "./lib/hash-triple.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!542 = !DISubprogram(name: "hash_lookup", scope: !236, file: !236, line: 78, type: !543, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!543 = !DISubroutineType(types: !544)
!544 = !{!89, !490, !316}
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !547, nameTableKind: None)
!546 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = !{!548, !550, !150}
!548 = !DISubprogram(name: "hash_pjw", scope: !549, file: !549, line: 23, type: !480, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!549 = !DIFile(filename: "./lib/hash-pjw.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!550 = !DISubprogram(name: "same_name", scope: !551, file: !551, line: 23, type: !552, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!551 = !DIFile(filename: "./lib/same.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = !DISubroutineType(types: !553)
!553 = !{!160, !34, !34}
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !556, nameTableKind: None)
!555 = !DIFile(filename: "lib/same.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!556 = !{!557, !560, !562, !565, !139, !150}
!557 = !DISubprogram(name: "same_nameat", scope: !551, file: !551, line: 24, type: !558, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!558 = !DISubroutineType(types: !559)
!559 = !{!160, !36, !34, !36, !34}
!560 = !DISubprogram(name: "last_component", scope: !561, file: !561, line: 46, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!561 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!562 = !DISubprogram(name: "base_len", scope: !561, file: !561, line: 44, type: !563, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!563 = !DISubroutineType(types: !564)
!564 = !{!93, !34}
!565 = !DISubprogram(name: "dir_name", scope: !561, file: !561, line: 40, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !568, retainedTypes: !572, nameTableKind: None)
!567 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!568 = !{!569}
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !567, line: 40, baseType: !7, size: 32, elements: !570)
!570 = !{!571}
!571 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!572 = !{!28, !573, !89}
!573 = !DISubprogram(name: "fputs_unlocked", scope: !39, file: !39, line: 662, type: !574, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!574 = !DISubroutineType(types: !575)
!575 = !{!36, !34, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !577, file: !44, line: 51, baseType: !36, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !577, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !577, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !577, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !577, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !577, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !577, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !577, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !577, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !577, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !577, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !577, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !577, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !577, file: !44, line: 70, baseType: !576, size: 64, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !577, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !577, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !577, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !577, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !577, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !577, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !577, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !577, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !577, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !577, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !577, file: !44, line: 93, baseType: !576, size: 64, offset: 1344)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !577, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !577, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !577, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !577, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !610, retainedTypes: !623, nameTableKind: None)
!609 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!610 = !{!611}
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !612, file: !313, line: 186, baseType: !7, size: 32, elements: !621)
!612 = distinct !DISubprogram(name: "x2nrealloc", scope: !313, file: !313, line: 174, type: !613, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !608, retainedNodes: !616)
!613 = !DISubroutineType(types: !614)
!614 = !{!89, !89, !615, !91}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!616 = !{!617, !618, !619, !620}
!617 = !DILocalVariable(name: "p", arg: 1, scope: !612, file: !313, line: 174, type: !89)
!618 = !DILocalVariable(name: "pn", arg: 2, scope: !612, file: !313, line: 174, type: !615)
!619 = !DILocalVariable(name: "s", arg: 3, scope: !612, file: !313, line: 174, type: !91)
!620 = !DILocalVariable(name: "n", scope: !612, file: !313, line: 176, type: !91)
!621 = !{!622}
!622 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!623 = !{!91, !375, !372, !376, !32, !150, !89, !624, !229}
!624 = !DISubprogram(name: "xcalloc", scope: !313, file: !313, line: 57, type: !231, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!625 = distinct !DICompileUnit(language: DW_LANG_C99, file: !626, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !627, nameTableKind: None)
!626 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!627 = !{!28, !139}
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !630, nameTableKind: None)
!629 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!630 = !{!375}
!631 = distinct !DICompileUnit(language: DW_LANG_C99, file: !632, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !633, nameTableKind: None)
!632 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!633 = !{!89}
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !636, nameTableKind: None)
!635 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!636 = !{!637, !91, !649}
!637 = !DISubprogram(name: "mbrtowc", scope: !359, file: !359, line: 296, type: !638, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!638 = !DISubroutineType(types: !639)
!639 = !{!93, !133, !34, !93, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 13, size: 64, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !641, file: !343, line: 15, baseType: !36, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !641, file: !343, line: 20, baseType: !645, size: 32, offset: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !343, line: 16, size: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !645, file: !343, line: 18, baseType: !7, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !645, file: !343, line: 19, baseType: !351, size: 32)
!649 = !DISubprogram(name: "hard_locale", scope: !650, file: !650, line: 26, type: !651, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!650 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!651 = !DISubroutineType(types: !652)
!652 = !{!160, !36}
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !655, nameTableKind: None)
!654 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!655 = !{!656}
!656 = !DISubprogram(name: "rpl_fclose", scope: !657, file: !657, line: 672, type: !658, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!657 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!658 = !DISubroutineType(types: !659)
!659 = !{!36, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !661, file: !44, line: 51, baseType: !36, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !661, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !661, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !661, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !661, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !661, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !661, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !661, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !661, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !661, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !661, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !661, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !661, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !661, file: !44, line: 70, baseType: !660, size: 64, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !661, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !661, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !661, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !661, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !661, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !661, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !661, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !661, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !661, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !661, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !661, file: !44, line: 93, baseType: !660, size: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !661, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !661, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !661, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !661, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !694, nameTableKind: None)
!693 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!694 = !{!695, !375}
!695 = !DISubprogram(name: "mdir_name", scope: !561, file: !561, line: 43, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !698, nameTableKind: None)
!697 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!560}
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !461, nameTableKind: None)
!700 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, retainedTypes: !703, nameTableKind: None)
!702 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!703 = !{!704}
!704 = !DISubprogram(name: "setlocale_null_r", scope: !705, file: !705, line: 64, type: !706, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!705 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!706 = !DISubroutineType(types: !707)
!707 = !{!36, !36, !32, !93}
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !37, nameTableKind: None)
!709 = !DIFile(filename: "lib/hash-pjw.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !712, retainedTypes: !1099, nameTableKind: None)
!711 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!712 = !{!713}
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 41, baseType: !7, size: 32, elements: !715)
!714 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098}
!716 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!717 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!718 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!719 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!720 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!721 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!722 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!723 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!724 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!725 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!726 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!727 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!728 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!729 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!730 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!731 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!732 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!733 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!734 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!735 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!736 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!737 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!738 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!739 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!740 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!741 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!742 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!743 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!744 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!745 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!746 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!747 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!748 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!749 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!750 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!751 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!752 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!753 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!754 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!755 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!756 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!757 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!758 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!759 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!760 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!761 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!762 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!763 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!764 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!765 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!824 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!827 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!828 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!829 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!830 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!831 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!832 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!833 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!834 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!835 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!836 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!837 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!838 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!911 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!984 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!985 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!986 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!987 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!988 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!989 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!990 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!991 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!992 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!993 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!994 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!995 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!996 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!997 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!998 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!1000 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!1001 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!1002 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!1003 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!1004 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!1005 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
