source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 47, type: !46, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !32, nameTableKind: None)
!3 = !DIFile(filename: "src/realpath.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !14, line: 32, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!27 = !{!28, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33, !36, !38, !42, !0, !44}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "logical", scope: !2, file: !3, line: 42, type: !35, isLocal: true, isDefinition: true)
!35 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "use_nuls", scope: !2, file: !3, line: 43, type: !35, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "can_relative_to", scope: !2, file: !3, line: 44, type: !40, isLocal: true, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "can_relative_base", scope: !2, file: !3, line: 45, type: !40, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 41, type: !35, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 3328, elements: !57)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !49, line: 50, size: 256, elements: !50)
!49 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!50 = !{!51, !52, !54, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !49, line: 52, baseType: !40, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !48, file: !49, line: 55, baseType: !53, size: 32, offset: 64)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !48, file: !49, line: 56, baseType: !55, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !48, file: !49, line: 57, baseType: !53, size: 32, offset: 192)
!57 = !{!58}
!58 = !DISubrange(count: 13)
!59 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!60 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!61 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "Version", scope: !64, file: !65, line: 2, type: !40, isDefinition: true)
!64 = distinct !DICompileUnit(language: DW_LANG_C99, file: !65, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, globals: !67, nameTableKind: None)
!65 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!66 = !{}
!67 = !{!62}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "file_name", scope: !70, file: !71, line: 46, type: !40, isLocal: true, isDefinition: true)
!70 = distinct !DICompileUnit(language: DW_LANG_C99, file: !71, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, globals: !72, nameTableKind: None)
!71 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!72 = !{!68, !73}
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !70, file: !71, line: 56, type: !35, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "exit_failure", scope: !77, file: !78, line: 24, type: !80, isDefinition: true)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, globals: !79, nameTableKind: None)
!78 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!79 = !{!75}
!80 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "default_tuning", scope: !83, file: !84, line: 130, type: !90, isLocal: true, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !85, globals: !89, nameTableKind: None)
!84 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!85 = !{!86, !30, !87}
!86 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 46, baseType: !86)
!88 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!89 = !{!81}
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !92, line: 65, baseType: !93)
!92 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !92, line: 53, size: 160, elements: !94)
!94 = !{!95, !97, !98, !99, !100}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !93, file: !92, line: 58, baseType: !96, size: 32)
!96 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !93, file: !92, line: 59, baseType: !96, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !93, file: !92, line: 60, baseType: !96, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !93, file: !92, line: 61, baseType: !96, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !93, file: !92, line: 62, baseType: !35, size: 8, offset: 128)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "program_name", scope: !103, file: !104, line: 33, type: !40, isDefinition: true)
!103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !104, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !105, globals: !106, nameTableKind: None)
!104 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!105 = !{!30, !28}
!106 = !{!101}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !109, file: !110, line: 85, type: !171, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !111, retainedTypes: !132, globals: !134, nameTableKind: None)
!110 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!111 = !{!13, !112, !117}
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 242, baseType: !7, size: 32, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 46, baseType: !7, size: 32, elements: !119)
!118 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!120 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!121 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!122 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!123 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!124 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!125 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!126 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!127 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!128 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!131 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!132 = !{!53, !133, !87, !28}
!133 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!134 = !{!107, !135, !141, !153, !155, !160, !167, !169}
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !109, file: !110, line: 101, type: !137, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 320, elements: !139)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!139 = !{!140}
!140 = !DISubrange(count: 10)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !109, file: !110, line: 1052, type: !143, isDefinition: true)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !110, line: 65, size: 448, elements: !144)
!144 = !{!145, !146, !147, !151, !152}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !143, file: !110, line: 68, baseType: !13, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !143, file: !110, line: 71, baseType: !53, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !143, file: !110, line: 75, baseType: !148, size: 256, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !143, file: !110, line: 78, baseType: !40, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !143, file: !110, line: 81, baseType: !40, size: 64, offset: 384)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !109, file: !110, line: 116, type: !143, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "slot0", scope: !109, file: !110, line: 842, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 256)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "slotvec", scope: !109, file: !110, line: 845, type: !162, isLocal: true, isDefinition: true)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !110, line: 834, size: 128, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !110, line: 836, baseType: !87, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !163, file: !110, line: 837, baseType: !28, size: 64, offset: 64)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "nslots", scope: !109, file: !110, line: 843, type: !53, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "slotvec0", scope: !109, file: !110, line: 844, type: !163, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 704, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!173 = !{!174}
!174 = !DISubrange(count: 11)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !177, file: !178, line: 26, type: !180, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, globals: !179, nameTableKind: None)
!178 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!179 = !{!175}
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 376, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 47)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!184 = !DIFile(filename: "src/relpath.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !187, retainedTypes: !188, nameTableKind: None)
!186 = !DIFile(filename: "lib/canonicalize.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !{!5}
!188 = !{!30}
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !105, nameTableKind: None)
!190 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!192 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!194 = !DIFile(filename: "lib/same.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !188, nameTableKind: None)
!196 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !{!198}
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !196, line: 40, baseType: !7, size: 32, elements: !199)
!199 = !{!200}
!200 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !203, retainedTypes: !217, nameTableKind: None)
!202 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = !{!204}
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !206, file: !205, line: 186, baseType: !7, size: 32, elements: !215)
!205 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!206 = distinct !DISubprogram(name: "x2nrealloc", scope: !205, file: !205, line: 174, type: !207, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !210)
!207 = !DISubroutineType(types: !208)
!208 = !{!30, !30, !209, !87}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!210 = !{!211, !212, !213, !214}
!211 = !DILocalVariable(name: "p", arg: 1, scope: !206, file: !205, line: 174, type: !30)
!212 = !DILocalVariable(name: "pn", arg: 2, scope: !206, file: !205, line: 174, type: !209)
!213 = !DILocalVariable(name: "s", arg: 3, scope: !206, file: !205, line: 174, type: !87)
!214 = !DILocalVariable(name: "n", scope: !206, file: !205, line: 176, type: !87)
!215 = !{!216}
!216 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!217 = !{!87, !28, !30}
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!219 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!221 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !188, nameTableKind: None)
!223 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !226, nameTableKind: None)
!225 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!226 = !{!87}
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !229, retainedTypes: !188, nameTableKind: None)
!228 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!229 = !{!230}
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !231, file: !228, line: 64, baseType: !7, size: 32, elements: !264)
!231 = distinct !DISubprogram(name: "areadlink_with_size", scope: !228, file: !228, line: 53, type: !232, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !234)
!232 = !DISubroutineType(types: !233)
!233 = !{!28, !40, !87}
!234 = !{!235, !236, !237, !238, !239, !240, !241, !248, !249, !253, !254, !255, !258}
!235 = !DILocalVariable(name: "file", arg: 1, scope: !231, file: !228, line: 53, type: !40)
!236 = !DILocalVariable(name: "size", arg: 2, scope: !231, file: !228, line: 53, type: !87)
!237 = !DILocalVariable(name: "symlink_max", scope: !231, file: !228, line: 58, type: !87)
!238 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !231, file: !228, line: 59, type: !87)
!239 = !DILocalVariable(name: "initial_limit", scope: !231, file: !228, line: 60, type: !87)
!240 = !DILocalVariable(name: "buf_size", scope: !231, file: !228, line: 67, type: !87)
!241 = !DILocalVariable(name: "r", scope: !242, file: !228, line: 72, type: !243)
!242 = distinct !DILexicalBlock(scope: !231, file: !228, line: 71, column: 5)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !244, line: 108, baseType: !245)
!244 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !246, line: 194, baseType: !247)
!246 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!247 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!248 = !DILocalVariable(name: "link_length", scope: !242, file: !228, line: 73, type: !87)
!249 = !DILocalVariable(name: "stackbuf", scope: !242, file: !228, line: 74, type: !250)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 128)
!253 = !DILocalVariable(name: "buf", scope: !242, file: !228, line: 75, type: !28)
!254 = !DILocalVariable(name: "buffer", scope: !242, file: !228, line: 76, type: !28)
!255 = !DILocalVariable(name: "saved_errno", scope: !256, file: !228, line: 92, type: !53)
!256 = distinct !DILexicalBlock(scope: !257, file: !228, line: 91, column: 9)
!257 = distinct !DILexicalBlock(scope: !242, file: !228, line: 90, column: 11)
!258 = !DILocalVariable(name: "shrinked_buffer", scope: !259, file: !228, line: 110, type: !28)
!259 = distinct !DILexicalBlock(scope: !260, file: !228, line: 108, column: 13)
!260 = distinct !DILexicalBlock(scope: !261, file: !228, line: 107, column: 20)
!261 = distinct !DILexicalBlock(scope: !262, file: !228, line: 101, column: 15)
!262 = distinct !DILexicalBlock(scope: !263, file: !228, line: 99, column: 9)
!263 = distinct !DILexicalBlock(scope: !242, file: !228, line: 98, column: 11)
!264 = !{!265}
!265 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!267 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!269 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!271 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !274, nameTableKind: None)
!273 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = !{!28}
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!276 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!278 = !DIFile(filename: "lib/hash-pjw.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !281, retainedTypes: !188, nameTableKind: None)
!280 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!281 = !{!282}
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !283, line: 41, baseType: !7, size: 32, elements: !284)
!283 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!285 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!286 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!287 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!288 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!289 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!290 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!291 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!292 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!293 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!294 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!295 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!296 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!297 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!298 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!304 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!305 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!306 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!307 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!308 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!309 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!310 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!316 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!317 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!318 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!319 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!320 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!321 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!322 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!323 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!324 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!325 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!326 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!327 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!328 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!329 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!330 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!331 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!332 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!333 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!334 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!393 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!401 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!402 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!403 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!404 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!405 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!406 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!407 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!480 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!553 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!554 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!555 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!556 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!557 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!558 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!559 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!560 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!561 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!562 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!563 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!564 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!565 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!566 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!567 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!569 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!570 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!571 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!572 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!573 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!574 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!600 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!601 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!602 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!603 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!604 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!609 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!610 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!611 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!612 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !188, nameTableKind: None)
!669 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, nameTableKind: None)
!671 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !188, nameTableKind: None)
!673 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !66, retainedTypes: !188, nameTableKind: None)
!675 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!676 = !{!"clang version 12.0.1"}
!677 = !{i32 7, !"Dwarf Version", i32 4}
!678 = !{i32 2, !"Debug Info Version", i32 3}
!679 = !{i32 1, !"wchar_size", i32 4}
!680 = !{i32 7, !"PIC Level", i32 2}
!681 = !{i32 7, !"PIE Level", i32 2}
!682 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 65, type: !683, scopeLine: 66, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !53}
!685 = !{!686}
!686 = !DILocalVariable(name: "status", arg: 1, scope: !682, file: !3, line: 65, type: !53)
!687 = !DILocation(scope: !682)
!688 = !DILocation(line: 67, column: 14, scope: !689)
!689 = distinct !DILexicalBlock(scope: !682, file: !3, line: 67, column: 7)
!690 = !DILocation(line: 67, column: 7, scope: !682)
!691 = !DILocation(line: 68, column: 5, scope: !692)
!692 = distinct !DILexicalBlock(scope: !689, file: !3, line: 68, column: 5)
!693 = !{!694, !694, i64 0}
!694 = !{!"any pointer", !695, i64 0}
!695 = !{!"omnipotent char", !696, i64 0}
!696 = !{!"Simple C/C++ TBAA"}
!697 = !DILocation(line: 71, column: 7, scope: !698)
!698 = distinct !DILexicalBlock(scope: !689, file: !3, line: 70, column: 5)
!699 = !DILocation(line: 72, column: 7, scope: !698)
!700 = !DILocation(line: 77, column: 7, scope: !698)
!701 = !DILocation(line: 90, column: 7, scope: !698)
!702 = !DILocation(line: 91, column: 7, scope: !698)
!703 = !DILocalVariable(name: "program", arg: 1, scope: !704, file: !705, line: 634, type: !40)
!704 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !705, file: !705, line: 634, type: !706, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !708)
!705 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!706 = !DISubroutineType(types: !707)
!707 = !{null, !40}
!708 = !{!703, !709, !718, !719, !721}
!709 = !DILocalVariable(name: "infomap", scope: !704, file: !705, line: 636, type: !710)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 896, elements: !716)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !704, file: !705, line: 636, size: 128, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !712, file: !705, line: 636, baseType: !40, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !712, file: !705, line: 636, baseType: !40, size: 64, offset: 64)
!716 = !{!717}
!717 = !DISubrange(count: 7)
!718 = !DILocalVariable(name: "node", scope: !704, file: !705, line: 646, type: !40)
!719 = !DILocalVariable(name: "map_prog", scope: !704, file: !705, line: 647, type: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!721 = !DILocalVariable(name: "lc_messages", scope: !704, file: !705, line: 659, type: !40)
!722 = !DILocation(scope: !704, inlinedAt: !723)
!723 = distinct !DILocation(line: 92, column: 7, scope: !698)
!724 = !DILocation(line: 636, column: 3, scope: !704, inlinedAt: !723)
!725 = !DILocation(line: 636, column: 67, scope: !704, inlinedAt: !723)
!726 = !DILocation(line: 647, column: 36, scope: !704, inlinedAt: !723)
!727 = !DILocation(line: 649, column: 3, scope: !704, inlinedAt: !723)
!728 = !DILocation(line: 649, column: 33, scope: !704, inlinedAt: !723)
!729 = !DILocation(line: 650, column: 13, scope: !704, inlinedAt: !723)
!730 = !DILocation(line: 649, column: 20, scope: !704, inlinedAt: !723)
!731 = !{!732, !694, i64 0}
!732 = !{!"infomap", !694, i64 0, !694, i64 8}
!733 = !DILocation(line: 649, column: 10, scope: !704, inlinedAt: !723)
!734 = !DILocation(line: 649, column: 28, scope: !704, inlinedAt: !723)
!735 = distinct !{!735, !727, !729, !736}
!736 = !{!"llvm.loop.mustprogress"}
!737 = !DILocation(line: 652, column: 17, scope: !738, inlinedAt: !723)
!738 = distinct !DILexicalBlock(scope: !704, file: !705, line: 652, column: 7)
!739 = !{!732, !694, i64 8}
!740 = !DILocation(line: 652, column: 7, scope: !738, inlinedAt: !723)
!741 = !DILocation(line: 652, column: 7, scope: !704, inlinedAt: !723)
!742 = !DILocation(line: 655, column: 3, scope: !704, inlinedAt: !723)
!743 = !DILocation(line: 659, column: 29, scope: !704, inlinedAt: !723)
!744 = !DILocation(line: 660, column: 7, scope: !745, inlinedAt: !723)
!745 = distinct !DILexicalBlock(scope: !704, file: !705, line: 660, column: 7)
!746 = !DILocation(line: 660, column: 19, scope: !745, inlinedAt: !723)
!747 = !DILocation(line: 660, column: 22, scope: !745, inlinedAt: !723)
!748 = !DILocation(line: 660, column: 7, scope: !704, inlinedAt: !723)
!749 = !DILocation(line: 666, column: 7, scope: !750, inlinedAt: !723)
!750 = distinct !DILexicalBlock(scope: !745, file: !705, line: 661, column: 5)
!751 = !DILocation(line: 668, column: 5, scope: !750, inlinedAt: !723)
!752 = !DILocation(line: 669, column: 3, scope: !704, inlinedAt: !723)
!753 = !DILocation(line: 671, column: 3, scope: !704, inlinedAt: !723)
!754 = !DILocation(line: 673, column: 1, scope: !704, inlinedAt: !723)
!755 = !DILocation(line: 94, column: 3, scope: !682)
!756 = !DISubprogram(name: "dcgettext", scope: !757, file: !757, line: 51, type: !758, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !66)
!757 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!758 = !DISubroutineType(types: !759)
!759 = !{!28, !40, !40, !53}
!760 = !DISubprogram(name: "fputs_unlocked", scope: !761, file: !761, line: 667, type: !762, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !66)
!761 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!762 = !DISubroutineType(types: !763)
!763 = !{!53, !40, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !766, line: 49, size: 1728, elements: !767)
!766 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !783, !784, !785, !786, !788, !789, !791, !795, !798, !800, !803, !806, !807, !808, !809, !810}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !765, file: !766, line: 51, baseType: !53, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !765, file: !766, line: 54, baseType: !28, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !765, file: !766, line: 55, baseType: !28, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !765, file: !766, line: 56, baseType: !28, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !765, file: !766, line: 57, baseType: !28, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !765, file: !766, line: 58, baseType: !28, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !765, file: !766, line: 59, baseType: !28, size: 64, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !765, file: !766, line: 60, baseType: !28, size: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !765, file: !766, line: 61, baseType: !28, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !765, file: !766, line: 64, baseType: !28, size: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !765, file: !766, line: 65, baseType: !28, size: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !765, file: !766, line: 66, baseType: !28, size: 64, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !765, file: !766, line: 68, baseType: !781, size: 64, offset: 768)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !766, line: 36, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !765, file: !766, line: 70, baseType: !764, size: 64, offset: 832)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !765, file: !766, line: 72, baseType: !53, size: 32, offset: 896)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !765, file: !766, line: 73, baseType: !53, size: 32, offset: 928)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !765, file: !766, line: 74, baseType: !787, size: 64, offset: 960)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !246, line: 152, baseType: !247)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !765, file: !766, line: 77, baseType: !133, size: 16, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !765, file: !766, line: 78, baseType: !790, size: 8, offset: 1040)
!790 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !765, file: !766, line: 79, baseType: !792, size: 8, offset: 1048)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 1)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !765, file: !766, line: 81, baseType: !796, size: 64, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !766, line: 43, baseType: null)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !765, file: !766, line: 89, baseType: !799, size: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !246, line: 153, baseType: !247)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !765, file: !766, line: 91, baseType: !801, size: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !766, line: 37, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !765, file: !766, line: 92, baseType: !804, size: 64, offset: 1280)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !766, line: 38, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !765, file: !766, line: 93, baseType: !764, size: 64, offset: 1344)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !765, file: !766, line: 94, baseType: !30, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !765, file: !766, line: 95, baseType: !87, size: 64, offset: 1472)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !765, file: !766, line: 96, baseType: !53, size: 32, offset: 1536)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !765, file: !766, line: 98, baseType: !811, size: 160, offset: 1568)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 20)
!814 = !DISubprogram(name: "setlocale", scope: !815, file: !815, line: 122, type: !816, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !66)
!815 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!816 = !DISubroutineType(types: !817)
!817 = !{!28, !53, !40}
!818 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 174, type: !819, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !822)
!819 = !DISubroutineType(types: !820)
!820 = !{!53, !53, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !831, !832}
!823 = !DILocalVariable(name: "argc", arg: 1, scope: !818, file: !3, line: 174, type: !53)
!824 = !DILocalVariable(name: "argv", arg: 2, scope: !818, file: !3, line: 174, type: !821)
!825 = !DILocalVariable(name: "ok", scope: !818, file: !3, line: 176, type: !35)
!826 = !DILocalVariable(name: "can_mode", scope: !818, file: !3, line: 177, type: !53)
!827 = !DILocalVariable(name: "relative_to", scope: !818, file: !3, line: 178, type: !40)
!828 = !DILocalVariable(name: "relative_base", scope: !818, file: !3, line: 179, type: !40)
!829 = !DILocalVariable(name: "c", scope: !830, file: !3, line: 191, type: !53)
!830 = distinct !DILexicalBlock(scope: !818, file: !3, line: 190, column: 5)
!831 = !DILocalVariable(name: "need_dir", scope: !818, file: !3, line: 244, type: !35)
!832 = !DILocalVariable(name: "base", scope: !833, file: !3, line: 257, type: !28)
!833 = distinct !DILexicalBlock(scope: !834, file: !3, line: 256, column: 5)
!834 = distinct !DILexicalBlock(scope: !835, file: !3, line: 255, column: 12)
!835 = distinct !DILexicalBlock(scope: !818, file: !3, line: 253, column: 7)
!836 = !DILocation(scope: !818)
!837 = !DILocation(line: 182, column: 21, scope: !818)
!838 = !DILocation(line: 182, column: 3, scope: !818)
!839 = !DILocation(line: 183, column: 3, scope: !818)
!840 = !DILocation(line: 184, column: 3, scope: !818)
!841 = !DILocation(line: 185, column: 3, scope: !818)
!842 = !DILocation(line: 187, column: 3, scope: !818)
!843 = !DILocation(line: 189, column: 3, scope: !818)
!844 = !DILocation(line: 178, column: 15, scope: !818)
!845 = !DILocation(line: 179, column: 15, scope: !818)
!846 = !DILocation(line: 177, column: 7, scope: !818)
!847 = !DILocation(line: 191, column: 15, scope: !830)
!848 = !DILocation(scope: !830)
!849 = !DILocation(line: 192, column: 11, scope: !830)
!850 = !DILocation(line: 197, column: 20, scope: !851)
!851 = distinct !DILexicalBlock(scope: !830, file: !3, line: 195, column: 9)
!852 = !DILocation(line: 199, column: 11, scope: !851)
!853 = !DILocation(line: 201, column: 20, scope: !851)
!854 = !DILocation(line: 202, column: 20, scope: !851)
!855 = !DILocation(line: 203, column: 11, scope: !851)
!856 = !DILocation(line: 205, column: 20, scope: !851)
!857 = !DILocation(line: 206, column: 19, scope: !851)
!858 = !DILocation(line: 207, column: 11, scope: !851)
!859 = !DILocation(line: 209, column: 20, scope: !851)
!860 = !DILocation(line: 210, column: 19, scope: !851)
!861 = !DILocation(line: 211, column: 11, scope: !851)
!862 = !DILocation(line: 213, column: 20, scope: !851)
!863 = !DILocation(line: 214, column: 19, scope: !851)
!864 = !DILocation(line: 215, column: 11, scope: !851)
!865 = !DILocation(line: 217, column: 19, scope: !851)
!866 = !DILocation(line: 218, column: 11, scope: !851)
!867 = !DILocation(line: 220, column: 20, scope: !851)
!868 = !DILocation(line: 221, column: 11, scope: !851)
!869 = !DILocation(line: 223, column: 25, scope: !851)
!870 = !DILocation(line: 224, column: 11, scope: !851)
!871 = !DILocation(line: 226, column: 27, scope: !851)
!872 = !DILocation(line: 227, column: 11, scope: !851)
!873 = !DILocation(line: 228, column: 9, scope: !851)
!874 = !DILocation(line: 229, column: 9, scope: !851)
!875 = !DILocation(line: 231, column: 11, scope: !851)
!876 = !DILocation(line: 235, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !818, file: !3, line: 235, column: 7)
!878 = !{!879, !879, i64 0}
!879 = !{!"int", !695, i64 0}
!880 = !DILocation(line: 235, column: 14, scope: !877)
!881 = !DILocation(line: 235, column: 7, scope: !818)
!882 = !DILocation(line: 237, column: 20, scope: !883)
!883 = distinct !DILexicalBlock(scope: !877, file: !3, line: 236, column: 5)
!884 = !DILocation(line: 237, column: 7, scope: !883)
!885 = !DILocation(line: 238, column: 7, scope: !883)
!886 = !DILocation(line: 241, column: 7, scope: !887)
!887 = distinct !DILexicalBlock(scope: !818, file: !3, line: 241, column: 7)
!888 = !DILocation(line: 241, column: 21, scope: !887)
!889 = !DILocation(line: 244, column: 29, scope: !818)
!890 = !DILocation(line: 244, column: 46, scope: !818)
!891 = !DILocation(line: 245, column: 7, scope: !892)
!892 = distinct !DILexicalBlock(scope: !818, file: !3, line: 245, column: 7)
!893 = !DILocation(line: 245, column: 7, scope: !818)
!894 = !DILocalVariable(name: "fname", arg: 1, scope: !895, file: !3, line: 100, type: !40)
!895 = distinct !DISubprogram(name: "realpath_canon", scope: !3, file: !3, line: 100, type: !896, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !898)
!896 = !DISubroutineType(types: !897)
!897 = !{!28, !40, !53}
!898 = !{!894, !899, !900, !901}
!899 = !DILocalVariable(name: "can_mode", arg: 2, scope: !895, file: !3, line: 100, type: !53)
!900 = !DILocalVariable(name: "can_fname", scope: !895, file: !3, line: 102, type: !28)
!901 = !DILocalVariable(name: "can_fname2", scope: !902, file: !3, line: 106, type: !28)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 104, column: 5)
!903 = distinct !DILexicalBlock(scope: !895, file: !3, line: 103, column: 7)
!904 = !DILocation(scope: !895, inlinedAt: !905)
!905 = distinct !DILocation(line: 247, column: 25, scope: !906)
!906 = distinct !DILexicalBlock(scope: !892, file: !3, line: 246, column: 5)
!907 = !DILocation(line: 102, column: 21, scope: !895, inlinedAt: !905)
!908 = !DILocation(line: 103, column: 7, scope: !903, inlinedAt: !905)
!909 = !DILocation(line: 103, column: 15, scope: !903, inlinedAt: !905)
!910 = !DILocation(line: 105, column: 16, scope: !902, inlinedAt: !905)
!911 = !DILocation(line: 106, column: 26, scope: !902, inlinedAt: !905)
!912 = !DILocation(scope: !902, inlinedAt: !905)
!913 = !DILocation(line: 107, column: 7, scope: !902, inlinedAt: !905)
!914 = !DILocation(line: 247, column: 23, scope: !906)
!915 = !DILocation(line: 248, column: 12, scope: !916)
!916 = distinct !DILexicalBlock(scope: !906, file: !3, line: 248, column: 11)
!917 = !DILocation(line: 248, column: 11, scope: !906)
!918 = !DILocation(line: 249, column: 9, scope: !916)
!919 = !DILocation(line: 250, column: 20, scope: !920)
!920 = distinct !DILexicalBlock(scope: !906, file: !3, line: 250, column: 11)
!921 = !DILocalVariable(name: "path", arg: 1, scope: !922, file: !3, line: 142, type: !40)
!922 = distinct !DISubprogram(name: "isdir", scope: !3, file: !3, line: 142, type: !923, scopeLine: 143, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{!35, !40}
!925 = !{!921, !926}
!926 = !DILocalVariable(name: "sb", scope: !922, file: !3, line: 144, type: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !928, line: 26, size: 1152, elements: !929)
!928 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!929 = !{!930, !932, !934, !936, !938, !940, !942, !943, !944, !945, !947, !949, !957, !958, !959}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !927, file: !928, line: 28, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !246, line: 145, baseType: !86)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !927, file: !928, line: 33, baseType: !933, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !246, line: 148, baseType: !86)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !927, file: !928, line: 41, baseType: !935, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !246, line: 151, baseType: !86)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !927, file: !928, line: 42, baseType: !937, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !246, line: 150, baseType: !7)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !927, file: !928, line: 44, baseType: !939, size: 32, offset: 224)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !246, line: 146, baseType: !7)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !927, file: !928, line: 45, baseType: !941, size: 32, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !246, line: 147, baseType: !7)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !927, file: !928, line: 47, baseType: !53, size: 32, offset: 288)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !927, file: !928, line: 49, baseType: !931, size: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !927, file: !928, line: 54, baseType: !787, size: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !927, file: !928, line: 58, baseType: !946, size: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !246, line: 175, baseType: !247)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !927, file: !928, line: 60, baseType: !948, size: 64, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !246, line: 180, baseType: !247)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !927, file: !928, line: 71, baseType: !950, size: 128, offset: 576)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !951, line: 10, size: 128, elements: !952)
!951 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!952 = !{!953, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !950, file: !951, line: 12, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !246, line: 160, baseType: !247)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !950, file: !951, line: 16, baseType: !956, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !246, line: 197, baseType: !247)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !927, file: !928, line: 72, baseType: !950, size: 128, offset: 704)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !927, file: !928, line: 73, baseType: !950, size: 128, offset: 832)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !927, file: !928, line: 86, baseType: !960, size: 192, offset: 960)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 192, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 3)
!963 = !DILocation(scope: !922, inlinedAt: !964)
!964 = distinct !DILocation(line: 250, column: 24, scope: !920)
!965 = !DILocation(line: 144, column: 3, scope: !922, inlinedAt: !964)
!966 = !DILocation(line: 144, column: 15, scope: !922, inlinedAt: !964)
!967 = !DILocation(line: 145, column: 7, scope: !968, inlinedAt: !964)
!968 = distinct !DILexicalBlock(scope: !922, file: !3, line: 145, column: 7)
!969 = !DILocation(line: 145, column: 24, scope: !968, inlinedAt: !964)
!970 = !DILocation(line: 145, column: 7, scope: !922, inlinedAt: !964)
!971 = !DILocation(line: 146, column: 5, scope: !968, inlinedAt: !964)
!972 = !DILocation(line: 147, column: 10, scope: !922, inlinedAt: !964)
!973 = !{!974, !879, i64 24}
!974 = !{!"stat", !975, i64 0, !975, i64 8, !975, i64 16, !879, i64 24, !879, i64 28, !879, i64 32, !879, i64 36, !975, i64 40, !975, i64 48, !975, i64 56, !975, i64 64, !976, i64 72, !976, i64 88, !976, i64 104, !695, i64 120}
!975 = !{!"long", !695, i64 0}
!976 = !{!"timespec", !975, i64 0, !975, i64 8}
!977 = !DILocation(line: 148, column: 1, scope: !922, inlinedAt: !964)
!978 = !DILocation(line: 250, column: 11, scope: !906)
!979 = !DILocation(line: 251, column: 9, scope: !920)
!980 = !DILocation(line: 253, column: 21, scope: !835)
!981 = !DILocation(line: 253, column: 7, scope: !818)
!982 = !DILocation(line: 254, column: 25, scope: !835)
!983 = !DILocation(line: 254, column: 23, scope: !835)
!984 = !DILocation(line: 254, column: 5, scope: !835)
!985 = !DILocation(line: 255, column: 12, scope: !835)
!986 = !DILocation(scope: !895, inlinedAt: !987)
!987 = distinct !DILocation(line: 257, column: 20, scope: !833)
!988 = !DILocation(line: 102, column: 21, scope: !895, inlinedAt: !987)
!989 = !DILocation(line: 103, column: 7, scope: !903, inlinedAt: !987)
!990 = !DILocation(line: 103, column: 15, scope: !903, inlinedAt: !987)
!991 = !DILocation(line: 105, column: 16, scope: !902, inlinedAt: !987)
!992 = !DILocation(line: 106, column: 26, scope: !902, inlinedAt: !987)
!993 = !DILocation(scope: !902, inlinedAt: !987)
!994 = !DILocation(line: 107, column: 7, scope: !902, inlinedAt: !987)
!995 = !DILocation(scope: !833)
!996 = !DILocation(line: 258, column: 12, scope: !997)
!997 = distinct !DILexicalBlock(scope: !833, file: !3, line: 258, column: 11)
!998 = !DILocation(line: 258, column: 11, scope: !833)
!999 = !DILocation(line: 259, column: 9, scope: !997)
!1000 = !DILocation(line: 260, column: 20, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !833, file: !3, line: 260, column: 11)
!1002 = !DILocation(scope: !922, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 260, column: 24, scope: !1001)
!1004 = !DILocation(line: 144, column: 3, scope: !922, inlinedAt: !1003)
!1005 = !DILocation(line: 144, column: 15, scope: !922, inlinedAt: !1003)
!1006 = !DILocation(line: 145, column: 7, scope: !968, inlinedAt: !1003)
!1007 = !DILocation(line: 145, column: 24, scope: !968, inlinedAt: !1003)
!1008 = !DILocation(line: 145, column: 7, scope: !922, inlinedAt: !1003)
!1009 = !DILocation(line: 146, column: 5, scope: !968, inlinedAt: !1003)
!1010 = !DILocation(line: 147, column: 10, scope: !922, inlinedAt: !1003)
!1011 = !DILocation(line: 148, column: 1, scope: !922, inlinedAt: !1003)
!1012 = !DILocation(line: 260, column: 11, scope: !833)
!1013 = !DILocation(line: 261, column: 9, scope: !1001)
!1014 = !DILocation(line: 264, column: 30, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !833, file: !3, line: 264, column: 11)
!1016 = !DILocalVariable(name: "prefix", arg: 1, scope: !1017, file: !3, line: 115, type: !40)
!1017 = distinct !DISubprogram(name: "path_prefix", scope: !3, file: !3, line: 115, type: !1018, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!35, !40, !40}
!1020 = !{!1016, !1021}
!1021 = !DILocalVariable(name: "path", arg: 2, scope: !1017, file: !3, line: 115, type: !40)
!1022 = !DILocation(scope: !1017, inlinedAt: !1023)
!1023 = distinct !DILocation(line: 264, column: 11, scope: !1015)
!1024 = !DILocation(line: 118, column: 9, scope: !1017, inlinedAt: !1023)
!1025 = !DILocation(line: 119, column: 7, scope: !1017, inlinedAt: !1023)
!1026 = !DILocation(line: 123, column: 8, scope: !1027, inlinedAt: !1023)
!1027 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 123, column: 7)
!1028 = !{!695, !695, i64 0}
!1029 = !DILocation(line: 123, column: 7, scope: !1017, inlinedAt: !1023)
!1030 = !DILocation(line: 131, column: 3, scope: !1017, inlinedAt: !1023)
!1031 = !DILocation(line: 127, column: 26, scope: !1032, inlinedAt: !1023)
!1032 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 127, column: 7)
!1033 = !DILocation(line: 127, column: 7, scope: !1017, inlinedAt: !1023)
!1034 = !DILocation(line: 128, column: 12, scope: !1032, inlinedAt: !1023)
!1035 = !DILocation(line: 128, column: 18, scope: !1032, inlinedAt: !1023)
!1036 = !DILocation(line: 264, column: 11, scope: !833)
!1037 = !DILocation(line: 131, column: 21, scope: !1017, inlinedAt: !1023)
!1038 = !DILocation(line: 131, column: 18, scope: !1017, inlinedAt: !1023)
!1039 = !DILocation(line: 135, column: 13, scope: !1040, inlinedAt: !1023)
!1040 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 132, column: 5)
!1041 = !DILocation(line: 136, column: 11, scope: !1040, inlinedAt: !1023)
!1042 = !DILocation(line: 131, column: 10, scope: !1017, inlinedAt: !1023)
!1043 = distinct !{!1043, !1030, !1044, !736}
!1044 = !DILocation(line: 137, column: 5, scope: !1017, inlinedAt: !1023)
!1045 = !DILocation(line: 138, column: 24, scope: !1017, inlinedAt: !1023)
!1046 = !DILocation(line: 124, column: 12, scope: !1027, inlinedAt: !1023)
!1047 = !DILocation(line: 124, column: 18, scope: !1027, inlinedAt: !1023)
!1048 = !DILocation(line: 265, column: 27, scope: !1015)
!1049 = !DILocation(line: 265, column: 9, scope: !1015)
!1050 = !DILocation(line: 268, column: 11, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 267, column: 9)
!1052 = !DILocation(line: 269, column: 29, scope: !1051)
!1053 = !DILocation(line: 270, column: 27, scope: !1051)
!1054 = !DILocation(line: 274, column: 10, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 274, column: 3)
!1056 = distinct !DILexicalBlock(scope: !818, file: !3, line: 274, column: 3)
!1057 = !DILocation(line: 274, column: 17, scope: !1055)
!1058 = !DILocation(line: 274, column: 3, scope: !1056)
!1059 = !DILocation(line: 275, column: 25, scope: !1055)
!1060 = !DILocalVariable(name: "fname", arg: 1, scope: !1061, file: !3, line: 151, type: !40)
!1061 = distinct !DISubprogram(name: "process_path", scope: !3, file: !3, line: 151, type: !1062, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1064)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!35, !40, !53}
!1064 = !{!1060, !1065, !1066}
!1065 = !DILocalVariable(name: "can_mode", arg: 2, scope: !1061, file: !3, line: 151, type: !53)
!1066 = !DILocalVariable(name: "can_fname", scope: !1061, file: !3, line: 153, type: !28)
!1067 = !DILocation(scope: !1061, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 275, column: 11, scope: !1055)
!1069 = !DILocation(scope: !895, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 153, column: 21, scope: !1061, inlinedAt: !1068)
!1071 = !DILocation(line: 102, column: 21, scope: !895, inlinedAt: !1070)
!1072 = !DILocation(line: 103, column: 7, scope: !903, inlinedAt: !1070)
!1073 = !DILocation(line: 103, column: 15, scope: !903, inlinedAt: !1070)
!1074 = !DILocation(line: 106, column: 26, scope: !902, inlinedAt: !1070)
!1075 = !DILocation(scope: !902, inlinedAt: !1070)
!1076 = !DILocation(line: 107, column: 7, scope: !902, inlinedAt: !1070)
!1077 = !DILocation(line: 154, column: 8, scope: !1078, inlinedAt: !1068)
!1078 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 154, column: 7)
!1079 = !DILocation(line: 154, column: 7, scope: !1061, inlinedAt: !1068)
!1080 = !DILocation(line: 156, column: 11, scope: !1081, inlinedAt: !1068)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 156, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 155, column: 5)
!1083 = !DILocation(line: 156, column: 11, scope: !1082, inlinedAt: !1068)
!1084 = !DILocation(line: 157, column: 19, scope: !1081, inlinedAt: !1068)
!1085 = !DILocation(line: 157, column: 32, scope: !1081, inlinedAt: !1068)
!1086 = !DILocation(line: 157, column: 9, scope: !1081, inlinedAt: !1068)
!1087 = !DILocation(line: 161, column: 8, scope: !1088, inlinedAt: !1068)
!1088 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 161, column: 7)
!1089 = !DILocation(line: 162, column: 7, scope: !1088, inlinedAt: !1068)
!1090 = !DILocation(line: 162, column: 11, scope: !1088, inlinedAt: !1068)
!1091 = !DILocation(line: 162, column: 29, scope: !1088, inlinedAt: !1068)
!1092 = !DILocation(scope: !1017, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 162, column: 33, scope: !1088, inlinedAt: !1068)
!1094 = !DILocation(line: 118, column: 9, scope: !1017, inlinedAt: !1093)
!1095 = !DILocation(line: 119, column: 7, scope: !1017, inlinedAt: !1093)
!1096 = !DILocation(line: 123, column: 8, scope: !1027, inlinedAt: !1093)
!1097 = !DILocation(line: 123, column: 7, scope: !1017, inlinedAt: !1093)
!1098 = !DILocation(line: 131, column: 3, scope: !1017, inlinedAt: !1093)
!1099 = !DILocation(line: 127, column: 26, scope: !1032, inlinedAt: !1093)
!1100 = !DILocation(line: 127, column: 7, scope: !1017, inlinedAt: !1093)
!1101 = !DILocation(line: 128, column: 12, scope: !1032, inlinedAt: !1093)
!1102 = !DILocation(line: 128, column: 18, scope: !1032, inlinedAt: !1093)
!1103 = !DILocation(line: 163, column: 7, scope: !1088, inlinedAt: !1068)
!1104 = !DILocation(line: 131, column: 21, scope: !1017, inlinedAt: !1093)
!1105 = !DILocation(line: 131, column: 18, scope: !1017, inlinedAt: !1093)
!1106 = !DILocation(line: 135, column: 13, scope: !1040, inlinedAt: !1093)
!1107 = !DILocation(line: 136, column: 11, scope: !1040, inlinedAt: !1093)
!1108 = !DILocation(line: 131, column: 10, scope: !1017, inlinedAt: !1093)
!1109 = distinct !{!1109, !1098, !1110, !736}
!1110 = !DILocation(line: 137, column: 5, scope: !1017, inlinedAt: !1093)
!1111 = !DILocation(line: 138, column: 24, scope: !1017, inlinedAt: !1093)
!1112 = !DILocation(line: 124, column: 12, scope: !1027, inlinedAt: !1093)
!1113 = !DILocation(line: 124, column: 18, scope: !1027, inlinedAt: !1093)
!1114 = !DILocation(line: 163, column: 31, scope: !1088, inlinedAt: !1068)
!1115 = !DILocation(line: 161, column: 7, scope: !1061, inlinedAt: !1068)
!1116 = !DILocation(line: 164, column: 5, scope: !1088, inlinedAt: !1068)
!1117 = !DILocation(line: 166, column: 3, scope: !1061, inlinedAt: !1068)
!1118 = !DILocalVariable(name: "__c", arg: 1, scope: !1119, file: !1120, line: 108, type: !53)
!1119 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1120, file: !1120, line: 108, type: !1121, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1123)
!1120 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!53, !53}
!1123 = !{!1118}
!1124 = !DILocation(scope: !1119, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 166, column: 3, scope: !1061, inlinedAt: !1068)
!1126 = !DILocation(line: 110, column: 10, scope: !1119, inlinedAt: !1125)
!1127 = !{!1128, !694, i64 40}
!1128 = !{!"_IO_FILE", !879, i64 0, !694, i64 8, !694, i64 16, !694, i64 24, !694, i64 32, !694, i64 40, !694, i64 48, !694, i64 56, !694, i64 64, !694, i64 72, !694, i64 80, !694, i64 88, !694, i64 96, !694, i64 104, !879, i64 112, !879, i64 116, !975, i64 120, !1129, i64 128, !695, i64 130, !695, i64 131, !694, i64 136, !975, i64 144, !694, i64 152, !694, i64 160, !694, i64 168, !694, i64 176, !975, i64 184, !879, i64 192, !695, i64 196}
!1129 = !{!"short", !695, i64 0}
!1130 = !{!1128, !694, i64 48}
!1131 = !{!"branch_weights", i32 2000, i32 1}
!1132 = !DILocation(line: 168, column: 3, scope: !1061, inlinedAt: !1068)
!1133 = !DILocation(line: 170, column: 3, scope: !1061, inlinedAt: !1068)
!1134 = !DILocation(line: 171, column: 1, scope: !1061, inlinedAt: !1068)
!1135 = !DILocation(line: 275, column: 8, scope: !1055)
!1136 = !DILocation(line: 274, column: 25, scope: !1055)
!1137 = distinct !{!1137, !1058, !1138, !736}
!1138 = !DILocation(line: 275, column: 47, scope: !1056)
!1139 = !DILocation(line: 277, column: 10, scope: !818)
!1140 = !DILocation(line: 278, column: 1, scope: !818)
!1141 = !DISubprogram(name: "bindtextdomain", scope: !757, file: !757, line: 86, type: !1142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !66)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!28, !40, !40}
!1144 = !DISubprogram(name: "textdomain", scope: !757, file: !757, line: 82, type: !1145, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !66)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!28, !40}
!1147 = !DISubprogram(name: "atexit", scope: !1148, file: !1148, line: 595, type: !1149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !66)
!1148 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!53, !1151}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null}
!1154 = !DISubprogram(name: "getopt_long", scope: !49, file: !49, line: 66, type: !1155, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !66)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!53, !53, !1157, !40, !1159, !55}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
