; ModuleID = 'coreutils-8.32/src/realpath.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.F_triple = type { i8*, i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 47, type: !172, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !161, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/realpath.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !14, line: 32, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!27 = !{!28, !38, !99, !103, !107, !110, !113, !120, !32, !89, !135, !139, !143, !146, !149, !152, !155, !160}
!28 = !DISubprogram(name: "dcgettext", scope: !29, file: !29, line: 51, type: !30, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!29 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !34, !34, !36}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{}
!38 = !DISubprogram(name: "fputs_unlocked", scope: !39, file: !39, line: 662, type: !40, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!36, !34, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !45)
!44 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !61, !62, !63, !64, !68, !70, !72, !76, !79, !81, !84, !87, !88, !90, !94, !95}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !43, file: !44, line: 51, baseType: !36, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !43, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !43, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !43, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !43, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !43, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !43, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !43, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !43, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !43, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !43, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !43, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !43, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !44, line: 36, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !43, file: !44, line: 70, baseType: !42, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !43, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !43, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !43, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 152, baseType: !67)
!66 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!67 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !43, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!69 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !43, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!71 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !43, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !43, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !44, line: 43, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !43, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !66, line: 153, baseType: !67)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !43, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !44, line: 37, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !43, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !44, line: 38, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !43, file: !44, line: 93, baseType: !42, size: 64, offset: 1344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !43, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !43, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !92, line: 46, baseType: !93)
!92 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!93 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !43, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !43, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 20)
!99 = !DISubprogram(name: "set_program_name", scope: !100, file: !100, line: 37, type: !101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!100 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !34}
!103 = !DISubprogram(name: "setlocale", scope: !104, file: !104, line: 122, type: !105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!104 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!105 = !DISubroutineType(types: !106)
!106 = !{!32, !36, !34}
!107 = !DISubprogram(name: "bindtextdomain", scope: !29, file: !29, line: 86, type: !108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!108 = !DISubroutineType(types: !109)
!109 = !{!32, !34, !34}
!110 = !DISubprogram(name: "textdomain", scope: !29, file: !29, line: 82, type: !111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!111 = !DISubroutineType(types: !112)
!112 = !{!32, !34}
!113 = !DISubprogram(name: "atexit", scope: !114, file: !114, line: 595, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!114 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!36, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null}
!120 = !DISubprogram(name: "getopt_long", scope: !121, file: !121, line: 66, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!121 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!122 = !DISubroutineType(types: !123)
!123 = !{!36, !36, !124, !34, !126, !133}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !121, line: 50, size: 256, elements: !129)
!129 = !{!130, !131, !132, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !121, line: 52, baseType: !34, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !128, file: !121, line: 55, baseType: !36, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !128, file: !121, line: 56, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !128, file: !121, line: 57, baseType: !36, size: 32, offset: 192)
!135 = !DISubprogram(name: "version_etc", scope: !136, file: !136, line: 69, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!136 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!137 = !DISubroutineType(types: !138)
!138 = !{null, !42, !34, !34, !34, null}
!139 = !DISubprogram(name: "error", scope: !140, file: !140, line: 52, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!140 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !DISubroutineType(types: !142)
!142 = !{null, !36, !36, !34, null}
!143 = !DISubprogram(name: "quotearg_n_style_colon", scope: !14, file: !14, line: 397, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!144 = !DISubroutineType(types: !145)
!145 = !{!32, !36, !13, !34}
!146 = !DISubprogram(name: "free", scope: !114, file: !114, line: 565, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !89}
!149 = !DISubprogram(name: "canonicalize_filename_mode", scope: !6, file: !6, line: 50, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!150 = !DISubroutineType(types: !151)
!151 = !{!32, !34, !5}
!152 = !DISubprogram(name: "quotearg_style", scope: !14, file: !14, line: 377, type: !153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!153 = !DISubroutineType(types: !154)
!154 = !{!32, !13, !34}
!155 = !DISubprogram(name: "relpath", scope: !156, file: !156, line: 23, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!156 = !DIFile(filename: "src/relpath.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !34, !34, !32, !93}
!159 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!160 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!161 = !{!162, !164, !166, !168, !0, !170}
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "logical", scope: !2, file: !3, line: 42, type: !159, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "use_nuls", scope: !2, file: !3, line: 43, type: !159, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "can_relative_to", scope: !2, file: !3, line: 44, type: !34, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "can_relative_base", scope: !2, file: !3, line: 45, type: !34, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 41, type: !159, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 3328, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 13)
!175 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!176 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!177 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "Version", scope: !180, file: !181, line: 2, type: !34, isLocal: false, isDefinition: true)
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, globals: !182, splitDebugInlining: false, nameTableKind: None)
!181 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!182 = !{!178}
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "file_name", scope: !185, file: !186, line: 46, type: !34, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !187, globals: !225, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !{!188, !28, !224, !139}
!188 = !DISubprogram(name: "close_stream", scope: !189, file: !189, line: 2, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!189 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!190 = !DISubroutineType(types: !191)
!191 = !{!36, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !193, file: !44, line: 51, baseType: !36, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !193, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !193, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !193, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !193, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !193, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !193, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !193, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !193, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !193, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !193, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !193, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !193, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !193, file: !44, line: 70, baseType: !192, size: 64, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !193, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !193, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !193, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !193, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !193, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !193, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !193, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !193, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !193, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !193, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !193, file: !44, line: 93, baseType: !192, size: 64, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !193, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !193, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !193, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !193, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!224 = !DISubprogram(name: "quotearg_colon", scope: !14, file: !14, line: 391, type: !111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!225 = !{!183, !226}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !185, file: !186, line: 56, type: !159, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "exit_failure", scope: !230, file: !231, line: 24, type: !233, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, globals: !232, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!232 = !{!228}
!233 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "default_tuning", scope: !236, file: !237, line: 130, type: !244, isLocal: true, isDefinition: true)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !238, globals: !243, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!238 = !{!93, !89, !239, !146, !91}
!239 = !DISubprogram(name: "rpl_calloc", scope: !240, file: !240, line: 688, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!240 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!241 = !DISubroutineType(types: !242)
!242 = !{!89, !93, !93}
!243 = !{!234}
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !246, line: 65, baseType: !247)
!246 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !246, line: 53, size: 160, elements: !248)
!248 = !{!249, !251, !252, !253, !254}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !247, file: !246, line: 58, baseType: !250, size: 32)
!250 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !247, file: !246, line: 59, baseType: !250, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !247, file: !246, line: 60, baseType: !250, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !247, file: !246, line: 61, baseType: !250, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !247, file: !246, line: 62, baseType: !159, size: 8, offset: 128)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "program_name", scope: !257, file: !258, line: 33, type: !34, isLocal: false, isDefinition: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !259, globals: !295, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = !{!89, !260, !32}
!260 = !DISubprogram(name: "fputs", scope: !39, file: !39, line: 626, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!261 = !DISubroutineType(types: !262)
!262 = !{!36, !34, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !264, file: !44, line: 51, baseType: !36, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !264, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !264, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !264, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !264, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !264, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !264, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !264, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !264, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !264, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !264, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !264, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !264, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !264, file: !44, line: 70, baseType: !263, size: 64, offset: 832)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !264, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !264, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !264, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !264, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !264, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !264, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !264, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !264, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !264, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !264, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !264, file: !44, line: 93, baseType: !263, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !264, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !264, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !264, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !264, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!295 = !{!255}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !298, file: !299, line: 85, type: !416, isLocal: false, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !300, retainedTypes: !321, globals: !389, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!300 = !{!13, !301, !306}
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 242, baseType: !7, size: 32, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !307, line: 46, baseType: !7, size: 32, elements: !308)
!307 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!309 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!310 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!311 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!312 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!313 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!314 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!315 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!316 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!317 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!319 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!320 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!321 = !{!322, !328, !146, !344, !36, !69, !347, !91, !364, !368, !28, !374, !378, !32, !382, !385, !386}
!322 = !DISubprogram(name: "xmemdup", scope: !323, file: !323, line: 62, type: !324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!323 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!324 = !DISubroutineType(types: !325)
!325 = !{!89, !326, !93}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!328 = !DISubprogram(name: "quotearg_alloc_mem", scope: !14, file: !14, line: 342, type: !329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!329 = !DISubroutineType(types: !330)
!330 = !{!32, !34, !93, !331, !332}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !299, line: 65, size: 448, elements: !335)
!335 = !{!336, !337, !338, !342, !343}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !334, file: !299, line: 68, baseType: !13, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !299, line: 71, baseType: !36, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !334, file: !299, line: 75, baseType: !339, size: 256, offset: 64)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !334, file: !299, line: 78, baseType: !34, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !334, file: !299, line: 81, baseType: !34, size: 64, offset: 384)
!344 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !14, file: !14, line: 408, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!345 = !DISubroutineType(types: !346)
!346 = !{!32, !36, !34, !34, !34, !93}
!347 = !DISubprogram(name: "rpl_mbrtowc", scope: !348, file: !348, line: 717, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!348 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !DISubroutineType(types: !350)
!350 = !{!93, !133, !34, !93, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 13, size: 64, elements: !354)
!353 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !352, file: !353, line: 15, baseType: !36, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !352, file: !353, line: 20, baseType: !357, size: 32, offset: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !353, line: 16, size: 32, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !357, file: !353, line: 18, baseType: !7, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !357, file: !353, line: 19, baseType: !361, size: 32)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 4)
!364 = !DISubprogram(name: "iswprint", scope: !365, file: !365, line: 120, type: !366, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!365 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!366 = !DISubroutineType(types: !367)
!367 = !{!36, !7}
!368 = !DISubprogram(name: "mbsinit", scope: !369, file: !369, line: 292, type: !370, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!369 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!370 = !DISubroutineType(types: !371)
!371 = !{!36, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!374 = !DISubprogram(name: "locale_charset", scope: !375, file: !375, line: 35, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!375 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!376 = !DISubroutineType(types: !377)
!377 = !{!34}
!378 = !DISubprogram(name: "c_strcasecmp", scope: !379, file: !379, line: 42, type: !380, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!379 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!380 = !DISubroutineType(types: !381)
!381 = !{!36, !34, !34}
!382 = !DISubprogram(name: "xmalloc", scope: !323, file: !323, line: 53, type: !383, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!383 = !DISubroutineType(types: !384)
!384 = !{!89, !93}
!385 = !DISubprogram(name: "xalloc_die", scope: !323, file: !323, line: 51, type: !118, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !37)
!386 = !DISubprogram(name: "xrealloc", scope: !323, file: !323, line: 59, type: !387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!387 = !DISubroutineType(types: !388)
!388 = !{!89, !89, !93}
!389 = !{!296, !390, !396, !398, !400, !405, !412, !414}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !298, file: !299, line: 101, type: !392, isLocal: false, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 320, elements: !394)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!394 = !{!395}
!395 = !DISubrange(count: 10)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !298, file: !299, line: 1052, type: !334, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !298, file: !299, line: 116, type: !334, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "slot0", scope: !298, file: !299, line: 842, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 256)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "slotvec", scope: !298, file: !299, line: 845, type: !407, isLocal: true, isDefinition: true)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !299, line: 834, size: 128, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !408, file: !299, line: 836, baseType: !91, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !408, file: !299, line: 837, baseType: !32, size: 64, offset: 64)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "nslots", scope: !298, file: !299, line: 843, type: !36, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "slotvec0", scope: !298, file: !299, line: 844, type: !408, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 704, elements: !418)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!418 = !{!419}
!419 = !DISubrange(count: 11)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !422, file: !423, line: 26, type: !425, isLocal: false, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, globals: !424, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!424 = !{!420}
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 376, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 47)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !430, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "src/relpath.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!430 = !{!28, !139, !431}
!431 = !DISubprogram(name: "fputs_unlocked", scope: !39, file: !39, line: 662, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!432 = !DISubroutineType(types: !433)
!433 = !{!36, !34, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !435, file: !44, line: 51, baseType: !36, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !435, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !435, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !435, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !435, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !435, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !435, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !435, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !435, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !435, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !435, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !435, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !435, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !435, file: !44, line: 70, baseType: !434, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !435, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !435, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !435, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !435, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !435, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !435, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !435, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !435, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !435, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !435, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !435, file: !44, line: 93, baseType: !434, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !435, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !435, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !435, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !435, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !468, retainedTypes: !469, splitDebugInlining: false, nameTableKind: None)
!467 = !DIFile(filename: "lib/canonicalize.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!468 = !{!5}
!469 = !{!89, !470, !386, !382, !474, !146, !478, !483, !385, !502, !546}
!470 = !DISubprogram(name: "xgetcwd", scope: !471, file: !471, line: 17, type: !472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!471 = !DIFile(filename: "./lib/xgetcwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!472 = !DISubroutineType(types: !473)
!473 = !{!32}
!474 = !DISubprogram(name: "areadlink_with_size", scope: !475, file: !475, line: 24, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!475 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!476 = !DISubroutineType(types: !477)
!477 = !{!32, !34, !93}
!478 = !DISubprogram(name: "hash_free", scope: !246, file: !246, line: 96, type: !479, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !246, line: 67, flags: DIFlagFwdDecl)
!483 = !DISubprogram(name: "hash_initialize", scope: !246, file: !246, line: 89, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!484 = !DISubroutineType(types: !485)
!485 = !{!481, !93, !486, !495, !498, !501}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !246, line: 53, size: 160, elements: !489)
!489 = !{!490, !491, !492, !493, !494}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !488, file: !246, line: 58, baseType: !250, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !488, file: !246, line: 59, baseType: !250, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !488, file: !246, line: 60, baseType: !250, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !488, file: !246, line: 61, baseType: !250, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !488, file: !246, line: 62, baseType: !159, size: 8, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!93, !326, !93}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!159, !326, !326}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!502 = !DISubprogram(name: "seen_file", scope: !503, file: !503, line: 14, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!503 = !DIFile(filename: "./lib/file-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !DISubroutineType(types: !505)
!505 = !{!159, !506, !34, !508}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !511, line: 46, size: 1152, elements: !512)
!511 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!512 = !{!513, !515, !517, !519, !521, !523, !525, !526, !527, !528, !530, !532, !540, !541, !542}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !510, file: !511, line: 48, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !66, line: 145, baseType: !93)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !510, file: !511, line: 53, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !66, line: 148, baseType: !93)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !510, file: !511, line: 61, baseType: !518, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !66, line: 151, baseType: !93)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !510, file: !511, line: 62, baseType: !520, size: 32, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !66, line: 150, baseType: !7)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !510, file: !511, line: 64, baseType: !522, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !66, line: 146, baseType: !7)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !510, file: !511, line: 65, baseType: !524, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !66, line: 147, baseType: !7)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !510, file: !511, line: 67, baseType: !36, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !510, file: !511, line: 69, baseType: !514, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !510, file: !511, line: 74, baseType: !65, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !510, file: !511, line: 78, baseType: !529, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !66, line: 174, baseType: !67)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !510, file: !511, line: 80, baseType: !531, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !66, line: 179, baseType: !67)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !510, file: !511, line: 91, baseType: !533, size: 128, offset: 576)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !534, line: 10, size: 128, elements: !535)
!534 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!535 = !{!536, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !533, file: !534, line: 12, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !66, line: 160, baseType: !67)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !533, file: !534, line: 16, baseType: !539, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !66, line: 196, baseType: !67)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !510, file: !511, line: 92, baseType: !533, size: 128, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !510, file: !511, line: 93, baseType: !533, size: 128, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !510, file: !511, line: 106, baseType: !543, size: 192, offset: 960)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 192, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 3)
!546 = !DISubprogram(name: "record_file", scope: !503, file: !503, line: 7, type: !547, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !481, !34, !508}
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !551, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!89, !382, !552, !553, !385, !556, !32, !558}
!552 = !DISubprogram(name: "xstrdup", scope: !323, file: !323, line: 64, type: !111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!553 = !DISubprogram(name: "hash_insert", scope: !246, file: !246, line: 100, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!554 = !DISubroutineType(types: !555)
!555 = !{!89, !481, !326}
!556 = !DISubprogram(name: "triple_free", scope: !557, file: !557, line: 22, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!557 = !DIFile(filename: "./lib/hash-triple.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !DISubprogram(name: "hash_lookup", scope: !246, file: !246, line: 78, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!559 = !DISubroutineType(types: !560)
!560 = !{!89, !506, !326}
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !563, splitDebugInlining: false, nameTableKind: None)
!562 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !{!564, !566, !146}
!564 = !DISubprogram(name: "hash_pjw", scope: !565, file: !565, line: 23, type: !496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!565 = !DIFile(filename: "./lib/hash-pjw.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!566 = !DISubprogram(name: "same_name", scope: !567, file: !567, line: 23, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!567 = !DIFile(filename: "./lib/same.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!568 = !DISubroutineType(types: !569)
!569 = !{!159, !34, !34}
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !572, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "lib/same.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !{!573, !576, !578, !581, !139, !146}
!573 = !DISubprogram(name: "same_nameat", scope: !567, file: !567, line: 24, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!574 = !DISubroutineType(types: !575)
!575 = !{!159, !36, !34, !36, !34}
!576 = !DISubprogram(name: "last_component", scope: !577, file: !577, line: 46, type: !111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!577 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!578 = !DISubprogram(name: "base_len", scope: !577, file: !577, line: 44, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!579 = !DISubroutineType(types: !580)
!580 = !{!93, !34}
!581 = !DISubprogram(name: "dir_name", scope: !577, file: !577, line: 40, type: !111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !584, retainedTypes: !588, splitDebugInlining: false, nameTableKind: None)
!583 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!584 = !{!585}
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !583, line: 40, baseType: !7, size: 32, elements: !586)
!586 = !{!587}
!587 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!588 = !{!28, !589, !89}
!589 = !DISubprogram(name: "fputs_unlocked", scope: !39, file: !39, line: 662, type: !590, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!590 = !DISubroutineType(types: !591)
!591 = !{!36, !34, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !593, file: !44, line: 51, baseType: !36, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !593, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !593, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !593, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !593, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !593, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !593, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !593, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !593, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !593, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !593, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !593, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !593, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !593, file: !44, line: 70, baseType: !592, size: 64, offset: 832)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !593, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !593, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !593, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !593, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !593, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !593, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !593, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !593, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !593, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !593, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !593, file: !44, line: 93, baseType: !592, size: 64, offset: 1344)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !593, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !593, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !593, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !593, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !626, retainedTypes: !639, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!626 = !{!627}
!627 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !628, file: !323, line: 186, baseType: !7, size: 32, elements: !637)
!628 = distinct !DISubprogram(name: "x2nrealloc", scope: !323, file: !323, line: 174, type: !629, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !624, retainedNodes: !632)
!629 = !DISubroutineType(types: !630)
!630 = !{!89, !89, !631, !91}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!632 = !{!633, !634, !635, !636}
!633 = !DILocalVariable(name: "p", arg: 1, scope: !628, file: !323, line: 174, type: !89)
!634 = !DILocalVariable(name: "pn", arg: 2, scope: !628, file: !323, line: 174, type: !631)
!635 = !DILocalVariable(name: "s", arg: 3, scope: !628, file: !323, line: 174, type: !91)
!636 = !DILocalVariable(name: "n", scope: !628, file: !323, line: 176, type: !91)
!637 = !{!638}
!638 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!639 = !{!91, !385, !382, !386, !32, !146, !89, !640, !239}
!640 = !DISubprogram(name: "xcalloc", scope: !323, file: !323, line: 57, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !643, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!643 = !{!28, !139}
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !646, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!646 = !{!385}
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !649, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!649 = !{!89}
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !652, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!652 = !{!653, !91, !665}
!653 = !DISubprogram(name: "mbrtowc", scope: !369, file: !369, line: 296, type: !654, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!654 = !DISubroutineType(types: !655)
!655 = !{!93, !133, !34, !93, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 13, size: 64, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !657, file: !353, line: 15, baseType: !36, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !657, file: !353, line: 20, baseType: !661, size: 32, offset: 32)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !657, file: !353, line: 16, size: 32, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !661, file: !353, line: 18, baseType: !7, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !661, file: !353, line: 19, baseType: !361, size: 32)
!665 = !DISubprogram(name: "hard_locale", scope: !666, file: !666, line: 26, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!666 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!667 = !DISubroutineType(types: !668)
!668 = !{!159, !36}
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !671, retainedTypes: !706, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!671 = !{!672}
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !673, file: !670, line: 64, baseType: !7, size: 32, elements: !704)
!673 = distinct !DISubprogram(name: "areadlink_with_size", scope: !670, file: !670, line: 53, type: !674, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !669, retainedNodes: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{!32, !34, !91}
!676 = !{!677, !678, !679, !680, !681, !682, !683, !688, !689, !693, !694, !695, !698}
!677 = !DILocalVariable(name: "file", arg: 1, scope: !673, file: !670, line: 53, type: !34)
!678 = !DILocalVariable(name: "size", arg: 2, scope: !673, file: !670, line: 53, type: !91)
!679 = !DILocalVariable(name: "symlink_max", scope: !673, file: !670, line: 58, type: !91)
!680 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !673, file: !670, line: 59, type: !91)
!681 = !DILocalVariable(name: "initial_limit", scope: !673, file: !670, line: 60, type: !91)
!682 = !DILocalVariable(name: "buf_size", scope: !673, file: !670, line: 67, type: !91)
!683 = !DILocalVariable(name: "r", scope: !684, file: !670, line: 72, type: !685)
!684 = distinct !DILexicalBlock(scope: !673, file: !670, line: 71, column: 5)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !686, line: 108, baseType: !687)
!686 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !66, line: 193, baseType: !67)
!688 = !DILocalVariable(name: "link_length", scope: !684, file: !670, line: 73, type: !91)
!689 = !DILocalVariable(name: "stackbuf", scope: !684, file: !670, line: 74, type: !690)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1024, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 128)
!693 = !DILocalVariable(name: "buf", scope: !684, file: !670, line: 75, type: !32)
!694 = !DILocalVariable(name: "buffer", scope: !684, file: !670, line: 76, type: !32)
!695 = !DILocalVariable(name: "saved_errno", scope: !696, file: !670, line: 92, type: !36)
!696 = distinct !DILexicalBlock(scope: !697, file: !670, line: 91, column: 9)
!697 = distinct !DILexicalBlock(scope: !684, file: !670, line: 90, column: 11)
!698 = !DILocalVariable(name: "shrinked_buffer", scope: !699, file: !670, line: 110, type: !32)
!699 = distinct !DILexicalBlock(scope: !700, file: !670, line: 108, column: 13)
!700 = distinct !DILexicalBlock(scope: !701, file: !670, line: 107, column: 20)
!701 = distinct !DILexicalBlock(scope: !702, file: !670, line: 101, column: 15)
!702 = distinct !DILexicalBlock(scope: !703, file: !670, line: 99, column: 9)
!703 = distinct !DILexicalBlock(scope: !684, file: !670, line: 98, column: 11)
!704 = !{!705}
!705 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!706 = !{!146, !89}
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !709, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!709 = !{!710}
!710 = !DISubprogram(name: "rpl_fclose", scope: !711, file: !711, line: 672, type: !712, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!711 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!712 = !DISubroutineType(types: !713)
!713 = !{!36, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !715, file: !44, line: 51, baseType: !36, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !715, file: !44, line: 54, baseType: !32, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !715, file: !44, line: 55, baseType: !32, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !715, file: !44, line: 56, baseType: !32, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !715, file: !44, line: 57, baseType: !32, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !715, file: !44, line: 58, baseType: !32, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !715, file: !44, line: 59, baseType: !32, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !715, file: !44, line: 60, baseType: !32, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !715, file: !44, line: 61, baseType: !32, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !715, file: !44, line: 64, baseType: !32, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !715, file: !44, line: 65, baseType: !32, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !715, file: !44, line: 66, baseType: !32, size: 64, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !715, file: !44, line: 68, baseType: !59, size: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !715, file: !44, line: 70, baseType: !714, size: 64, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !715, file: !44, line: 72, baseType: !36, size: 32, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !715, file: !44, line: 73, baseType: !36, size: 32, offset: 928)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !715, file: !44, line: 74, baseType: !65, size: 64, offset: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !715, file: !44, line: 77, baseType: !69, size: 16, offset: 1024)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !715, file: !44, line: 78, baseType: !71, size: 8, offset: 1040)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !715, file: !44, line: 79, baseType: !73, size: 8, offset: 1048)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !715, file: !44, line: 81, baseType: !77, size: 64, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !715, file: !44, line: 89, baseType: !80, size: 64, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !715, file: !44, line: 91, baseType: !82, size: 64, offset: 1216)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !715, file: !44, line: 92, baseType: !85, size: 64, offset: 1280)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !715, file: !44, line: 93, baseType: !714, size: 64, offset: 1344)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !715, file: !44, line: 94, baseType: !89, size: 64, offset: 1408)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !715, file: !44, line: 95, baseType: !91, size: 64, offset: 1472)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !715, file: !44, line: 96, baseType: !36, size: 32, offset: 1536)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !715, file: !44, line: 98, baseType: !96, size: 160, offset: 1568)
!746 = distinct !DICompileUnit(language: DW_LANG_C99, file: !747, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!747 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!748 = !{!749, !385}
!749 = !DISubprogram(name: "mdir_name", scope: !577, file: !577, line: 43, type: !111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !752, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!752 = !{!576}
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !473, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, retainedTypes: !757, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!757 = !{!758}
!758 = !DISubprogram(name: "setlocale_null_r", scope: !759, file: !759, line: 64, type: !760, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !37)
!759 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!760 = !DISubroutineType(types: !761)
!761 = !{!36, !36, !32, !93}
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "lib/hash-pjw.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !765, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !766, retainedTypes: !1153, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!766 = !{!767}
!767 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !768, line: 41, baseType: !7, size: 32, elements: !769)
!768 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152}
!770 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!771 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!772 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!773 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!774 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!775 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!776 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!777 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!778 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!779 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!780 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!781 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!782 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!783 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!784 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!785 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!786 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!787 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!788 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!789 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!790 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!791 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!792 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!793 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!794 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!795 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!796 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!797 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!798 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!799 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!800 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!801 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!802 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!803 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!804 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!805 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!806 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!807 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!808 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!809 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!810 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!811 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!812 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!813 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!814 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!815 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!816 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!817 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!818 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!819 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!878 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!881 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!882 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!883 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!884 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!885 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!886 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!887 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!888 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!889 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!890 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!891 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!892 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!965 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
