source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.24 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 63, type: !250, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !217, nameTableKind: None)
!3 = !DIFile(filename: "src/rm.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !12, !17, !31, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !6, line: 23, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "interactive_type", file: !3, line: 56, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "interactive_never", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "interactive_once", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "interactive_always", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 32, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !6, line: 78, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !39, file: !38, line: 187, baseType: !7, size: 32, elements: !49)
!38 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = distinct !DISubprogram(name: "select_plural", scope: !38, file: !38, line: 183, type: !40, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !47)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43}
!42 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !44, line: 102, baseType: !45)
!44 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !46, line: 73, baseType: !42)
!46 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!47 = !{!48}
!48 = !DILocalVariable(name: "n", arg: 1, scope: !39, file: !38, line: 183, type: !43)
!49 = !{!50}
!50 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!51 = !{!52, !62, !121, !125, !129, !132, !135, !142, !157, !159, !163, !56, !112, !166, !170, !185, !188, !193, !210, !214}
!52 = !DISubprogram(name: "dcgettext", scope: !53, file: !53, line: 51, type: !54, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!53 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !58, !58, !60}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !{}
!62 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 662, type: !64, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!63 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!64 = !DISubroutineType(types: !65)
!65 = !{!60, !58, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !69)
!68 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !85, !86, !87, !88, !91, !93, !95, !99, !102, !104, !107, !110, !111, !113, !116, !117}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 51, baseType: !60, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 36, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 70, baseType: !66, size: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 152, baseType: !90)
!90 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 77, baseType: !92, size: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 78, baseType: !94, size: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 79, baseType: !96, size: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 81, baseType: !100, size: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 43, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 89, baseType: !103, size: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !46, line: 153, baseType: !90)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !67, file: !68, line: 91, baseType: !105, size: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !68, line: 37, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !67, file: !68, line: 92, baseType: !108, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !68, line: 38, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !67, file: !68, line: 93, baseType: !66, size: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !67, file: !68, line: 94, baseType: !112, size: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 95, baseType: !114, size: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 46, baseType: !42)
!115 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 98, baseType: !118, size: 160, offset: 1568)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 20)
!121 = !DISubprogram(name: "set_program_name", scope: !122, file: !122, line: 37, type: !123, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!122 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!123 = !DISubroutineType(types: !124)
!124 = !{null, !58}
!125 = !DISubprogram(name: "setlocale", scope: !126, file: !126, line: 122, type: !127, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!126 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!127 = !DISubroutineType(types: !128)
!128 = !{!56, !60, !58}
!129 = !DISubprogram(name: "bindtextdomain", scope: !53, file: !53, line: 86, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!130 = !DISubroutineType(types: !131)
!131 = !{!56, !58, !58}
!132 = !DISubprogram(name: "textdomain", scope: !53, file: !53, line: 82, type: !133, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!133 = !DISubroutineType(types: !134)
!134 = !{!56, !58}
!135 = !DISubprogram(name: "atexit", scope: !136, file: !136, line: 595, type: !137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!136 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!137 = !DISubroutineType(types: !138)
!138 = !{!60, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null}
!142 = !DISubprogram(name: "getopt_long", scope: !143, file: !143, line: 66, type: !144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!143 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!60, !60, !146, !58, !148, !155}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !143, line: 50, size: 256, elements: !151)
!151 = !{!152, !153, !154, !156}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !143, line: 52, baseType: !58, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !150, file: !143, line: 55, baseType: !60, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !143, line: 56, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !150, file: !143, line: 57, baseType: !60, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!159 = !DISubprogram(name: "error", scope: !160, file: !160, line: 52, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!160 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{null, !60, !60, !58, null}
!163 = !DISubprogram(name: "quotearg_style", scope: !18, file: !18, line: 377, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!164 = !DISubroutineType(types: !165)
!165 = !{!56, !17, !58}
!166 = !DISubprogram(name: "version_etc", scope: !167, file: !167, line: 69, type: !168, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!167 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!168 = !DISubroutineType(types: !169)
!169 = !{null, !66, !58, !58, !58, null}
!170 = !DISubprogram(name: "get_root_dev_ino", scope: !171, file: !171, line: 25, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!171 = !DIFile(filename: "./lib/root-dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !176, line: 7, size: 128, elements: !177)
!176 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!178, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !175, file: !176, line: 9, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !180, line: 47, baseType: !181)
!180 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !46, line: 148, baseType: !42)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !175, file: !176, line: 10, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !180, line: 59, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !46, line: 145, baseType: !42)
!185 = !DISubprogram(name: "dcngettext", scope: !53, file: !53, line: 73, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!186 = !DISubroutineType(types: !187)
!187 = !{!56, !58, !58, !58, !42, !60}
!188 = !DISubprogram(name: "yesno", scope: !189, file: !189, line: 22, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!189 = !DIFile(filename: "./lib/yesno.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!190 = !DISubroutineType(types: !191)
!191 = !{!192}
!192 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!193 = !DISubprogram(name: "rm", scope: !6, file: !6, line: 99, type: !194, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!194 = !DISubroutineType(types: !195)
!195 = !{!31, !146, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !6, line: 32, size: 256, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !198, file: !6, line: 35, baseType: !192, size: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !198, file: !6, line: 38, baseType: !5, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !198, file: !6, line: 47, baseType: !192, size: 8, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !198, file: !6, line: 50, baseType: !192, size: 8, offset: 72)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !198, file: !6, line: 53, baseType: !192, size: 8, offset: 80)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !198, file: !6, line: 57, baseType: !174, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !198, file: !6, line: 61, baseType: !192, size: 8, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !198, file: !6, line: 64, baseType: !192, size: 8, offset: 200)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !198, file: !6, line: 67, baseType: !192, size: 8, offset: 208)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !198, file: !6, line: 75, baseType: !192, size: 8, offset: 216)
!210 = !DISubprogram(name: "isatty", scope: !211, file: !211, line: 779, type: !212, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!211 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!212 = !DISubroutineType(types: !213)
!213 = !{!60, !60}
!214 = !DISubprogram(name: "quotearg_n_style", scope: !18, file: !18, line: 368, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!215 = !DISubroutineType(types: !216)
!216 = !{!56, !60, !17, !58}
!217 = !{!218, !0, !238, !244}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !220, file: !3, line: 345, type: !175, isLocal: true, isDefinition: true)
!220 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 209, type: !221, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !224)
!221 = !DISubroutineType(types: !222)
!222 = !{!60, !60, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !235, !236, !237}
!225 = !DILocalVariable(name: "argc", arg: 1, scope: !220, file: !3, line: 209, type: !60)
!226 = !DILocalVariable(name: "argv", arg: 2, scope: !220, file: !3, line: 209, type: !223)
!227 = !DILocalVariable(name: "preserve_root", scope: !220, file: !3, line: 211, type: !192)
!228 = !DILocalVariable(name: "x", scope: !220, file: !3, line: 212, type: !198)
!229 = !DILocalVariable(name: "prompt_once", scope: !220, file: !3, line: 213, type: !192)
!230 = !DILocalVariable(name: "c", scope: !220, file: !3, line: 214, type: !60)
!231 = !DILocalVariable(name: "i", scope: !232, file: !3, line: 262, type: !60)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 261, column: 11)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 232, column: 9)
!234 = distinct !DILexicalBlock(scope: !220, file: !3, line: 230, column: 5)
!235 = !DILocalVariable(name: "n_files", scope: !220, file: !3, line: 352, type: !43)
!236 = !DILocalVariable(name: "file", scope: !220, file: !3, line: 353, type: !223)
!237 = !DILocalVariable(name: "status", scope: !220, file: !3, line: 370, type: !31)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "interactive_types", scope: !2, file: !3, line: 92, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 192, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!242 = !{!243}
!243 = !DISubrange(count: 6)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "interactive_args", scope: !2, file: !3, line: 86, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 448, elements: !248)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!248 = !{!249}
!249 = !DISubrange(count: 7)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 3072, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 12)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "Version", scope: !255, file: !256, line: 2, type: !58, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, globals: !257, nameTableKind: None)
!256 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = !{!253}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !260, file: !261, line: 67, type: !311, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !262, retainedTypes: !263, globals: !310, nameTableKind: None)
!261 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = !{!17}
!263 = !{!112, !58, !52, !214, !264, !159, !268, !303, !306, !309}
!264 = !DISubprogram(name: "quote_n", scope: !265, file: !265, line: 40, type: !266, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!265 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = !DISubroutineType(types: !267)
!267 = !{!58, !60, !58}
!268 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 662, type: !269, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!269 = !DISubroutineType(types: !270)
!270 = !{!60, !58, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !272, file: !68, line: 51, baseType: !60, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !272, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !272, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !272, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !272, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !272, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !272, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !272, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !272, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !272, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !272, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !272, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !272, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !272, file: !68, line: 70, baseType: !271, size: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !272, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !272, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !272, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !272, file: !68, line: 77, baseType: !92, size: 16, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !272, file: !68, line: 78, baseType: !94, size: 8, offset: 1040)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !272, file: !68, line: 79, baseType: !96, size: 8, offset: 1048)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !272, file: !68, line: 81, baseType: !100, size: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !272, file: !68, line: 89, baseType: !103, size: 64, offset: 1152)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !272, file: !68, line: 91, baseType: !105, size: 64, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !272, file: !68, line: 92, baseType: !108, size: 64, offset: 1280)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !272, file: !68, line: 93, baseType: !271, size: 64, offset: 1344)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !272, file: !68, line: 94, baseType: !112, size: 64, offset: 1408)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !272, file: !68, line: 95, baseType: !114, size: 64, offset: 1472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !272, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !272, file: !68, line: 98, baseType: !118, size: 160, offset: 1568)
!303 = !DISubprogram(name: "quote", scope: !265, file: !265, line: 44, type: !304, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!304 = !DISubroutineType(types: !305)
!305 = !{!58, !58}
!306 = !DISubprogram(name: "usage", scope: !261, file: !261, line: 56, type: !307, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !60}
!309 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!310 = !{!258}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !312, line: 61, baseType: !139)
!312 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "file_name", scope: !315, file: !316, line: 37, type: !58, isLocal: true, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !317, globals: !366, nameTableKind: None)
!316 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!317 = !{!318, !354, !358, !361, !52, !363, !159, !364}
!318 = !DISubprogram(name: "freadahead", scope: !319, file: !319, line: 41, type: !320, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!319 = !DIFile(filename: "./lib/freadahead.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!320 = !DISubroutineType(types: !321)
!321 = !{!42, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !323, file: !68, line: 51, baseType: !60, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !323, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !323, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !323, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !323, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !323, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !323, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !323, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !323, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !323, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !323, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !323, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !323, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !323, file: !68, line: 70, baseType: !322, size: 64, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !323, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !323, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !323, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !323, file: !68, line: 77, baseType: !92, size: 16, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !323, file: !68, line: 78, baseType: !94, size: 8, offset: 1040)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !323, file: !68, line: 79, baseType: !96, size: 8, offset: 1048)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !323, file: !68, line: 81, baseType: !100, size: 64, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !323, file: !68, line: 89, baseType: !103, size: 64, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !323, file: !68, line: 91, baseType: !105, size: 64, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !323, file: !68, line: 92, baseType: !108, size: 64, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !323, file: !68, line: 93, baseType: !322, size: 64, offset: 1344)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !323, file: !68, line: 94, baseType: !112, size: 64, offset: 1408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !323, file: !68, line: 95, baseType: !114, size: 64, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !323, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !323, file: !68, line: 98, baseType: !118, size: 160, offset: 1568)
!354 = !DISubprogram(name: "rpl_fseeko", scope: !355, file: !355, line: 1034, type: !356, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!355 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!356 = !DISubroutineType(types: !357)
!357 = !{!60, !322, !90, !60}
!358 = !DISubprogram(name: "rpl_fflush", scope: !355, file: !355, line: 718, type: !359, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!359 = !DISubroutineType(types: !360)
!360 = !{!60, !322}
!361 = !DISubprogram(name: "close_stream", scope: !362, file: !362, line: 2, type: !359, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!362 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!363 = !DISubprogram(name: "quotearg_colon", scope: !18, file: !18, line: 391, type: !133, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!364 = !DISubprogram(name: "close_stdout", scope: !365, file: !365, line: 30, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!365 = !DIFile(filename: "./lib/closeout.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!366 = !{!313}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "file_name", scope: !369, file: !370, line: 46, type: !58, isLocal: true, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !371, globals: !407, nameTableKind: None)
!370 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!371 = !{!372, !52, !363, !159}
!372 = !DISubprogram(name: "close_stream", scope: !362, file: !362, line: 2, type: !373, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!373 = !DISubroutineType(types: !374)
!374 = !{!60, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !376, file: !68, line: 51, baseType: !60, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !376, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !376, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !376, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !376, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !376, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !376, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !376, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !376, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !376, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !376, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !376, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !376, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !376, file: !68, line: 70, baseType: !375, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !376, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !376, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !376, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !376, file: !68, line: 77, baseType: !92, size: 16, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !376, file: !68, line: 78, baseType: !94, size: 8, offset: 1040)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !376, file: !68, line: 79, baseType: !96, size: 8, offset: 1048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !376, file: !68, line: 81, baseType: !100, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !376, file: !68, line: 89, baseType: !103, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !376, file: !68, line: 91, baseType: !105, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !376, file: !68, line: 92, baseType: !108, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !376, file: !68, line: 93, baseType: !375, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !376, file: !68, line: 94, baseType: !112, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !376, file: !68, line: 95, baseType: !114, size: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !376, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !376, file: !68, line: 98, baseType: !118, size: 160, offset: 1568)
!407 = !{!367, !408}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !369, file: !370, line: 56, type: !192, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "exit_failure", scope: !412, file: !413, line: 24, type: !415, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, globals: !414, nameTableKind: None)
!413 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!414 = !{!410}
!415 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "program_name", scope: !418, file: !419, line: 33, type: !58, isDefinition: true)
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !420, globals: !456, nameTableKind: None)
!419 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!420 = !{!112, !421, !56}
!421 = !DISubprogram(name: "fputs", scope: !63, file: !63, line: 626, type: !422, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!422 = !DISubroutineType(types: !423)
!423 = !{!60, !58, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !425, file: !68, line: 51, baseType: !60, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !425, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !425, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !425, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !425, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !425, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !425, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !425, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !425, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !425, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !425, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !425, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !425, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !425, file: !68, line: 70, baseType: !424, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !425, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !425, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !425, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !425, file: !68, line: 77, baseType: !92, size: 16, offset: 1024)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !425, file: !68, line: 78, baseType: !94, size: 8, offset: 1040)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !425, file: !68, line: 79, baseType: !96, size: 8, offset: 1048)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !425, file: !68, line: 81, baseType: !100, size: 64, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !425, file: !68, line: 89, baseType: !103, size: 64, offset: 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !425, file: !68, line: 91, baseType: !105, size: 64, offset: 1216)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !425, file: !68, line: 92, baseType: !108, size: 64, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !425, file: !68, line: 93, baseType: !424, size: 64, offset: 1344)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !425, file: !68, line: 94, baseType: !112, size: 64, offset: 1408)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !425, file: !68, line: 95, baseType: !114, size: 64, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !425, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !425, file: !68, line: 98, baseType: !118, size: 160, offset: 1568)
!456 = !{!416}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !459, file: !460, line: 85, type: !578, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !461, retainedTypes: !482, globals: !551, nameTableKind: None)
!460 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!461 = !{!17, !462, !467}
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 242, baseType: !7, size: 32, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!465 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!466 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !468, line: 46, baseType: !7, size: 32, elements: !469)
!468 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!470 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!471 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!472 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!473 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!474 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!475 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!476 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!477 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!478 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!479 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!480 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!481 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!482 = !{!483, !487, !503, !506, !60, !92, !509, !114, !526, !530, !52, !536, !540, !56, !544, !547, !548}
!483 = !DISubprogram(name: "xmemdup", scope: !484, file: !484, line: 62, type: !485, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!484 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!485 = !DISubroutineType(types: !486)
!486 = !{!112, !157, !42}
!487 = !DISubprogram(name: "quotearg_alloc_mem", scope: !18, file: !18, line: 342, type: !488, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!488 = !DISubroutineType(types: !489)
!489 = !{!56, !58, !42, !490, !491}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !460, line: 65, size: 448, elements: !494)
!494 = !{!495, !496, !497, !501, !502}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !493, file: !460, line: 68, baseType: !17, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !493, file: !460, line: 71, baseType: !60, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !493, file: !460, line: 75, baseType: !498, size: 256, offset: 64)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 8)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !493, file: !460, line: 78, baseType: !58, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !493, file: !460, line: 81, baseType: !58, size: 64, offset: 384)
!503 = !DISubprogram(name: "free", scope: !136, file: !136, line: 565, type: !504, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !112}
!506 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !18, file: !18, line: 408, type: !507, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!507 = !DISubroutineType(types: !508)
!508 = !{!56, !60, !58, !58, !58, !42}
!509 = !DISubprogram(name: "rpl_mbrtowc", scope: !510, file: !510, line: 717, type: !511, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!510 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !DISubroutineType(types: !512)
!512 = !{!42, !155, !58, !42, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !515, line: 13, size: 64, elements: !516)
!515 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !514, file: !515, line: 15, baseType: !60, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !514, file: !515, line: 20, baseType: !519, size: 32, offset: 32)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !515, line: 16, size: 32, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !519, file: !515, line: 18, baseType: !7, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !519, file: !515, line: 19, baseType: !523, size: 32)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 4)
!526 = !DISubprogram(name: "iswprint", scope: !527, file: !527, line: 120, type: !528, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!527 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!528 = !DISubroutineType(types: !529)
!529 = !{!60, !7}
!530 = !DISubprogram(name: "mbsinit", scope: !531, file: !531, line: 292, type: !532, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!531 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!532 = !DISubroutineType(types: !533)
!533 = !{!60, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!536 = !DISubprogram(name: "locale_charset", scope: !537, file: !537, line: 35, type: !538, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!537 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = !DISubroutineType(types: !539)
!539 = !{!58}
!540 = !DISubprogram(name: "c_strcasecmp", scope: !541, file: !541, line: 42, type: !542, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!541 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!542 = !DISubroutineType(types: !543)
!543 = !{!60, !58, !58}
!544 = !DISubprogram(name: "xmalloc", scope: !484, file: !484, line: 53, type: !545, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!545 = !DISubroutineType(types: !546)
!546 = !{!112, !42}
!547 = !DISubprogram(name: "xalloc_die", scope: !484, file: !484, line: 51, type: !140, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !61)
!548 = !DISubprogram(name: "xrealloc", scope: !484, file: !484, line: 59, type: !549, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!549 = !DISubroutineType(types: !550)
!550 = !{!112, !112, !42}
!551 = !{!457, !552, !558, !560, !562, !567, !574, !576}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !459, file: !460, line: 101, type: !554, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 320, elements: !556)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!556 = !{!557}
!557 = !DISubrange(count: 10)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !459, file: !460, line: 1052, type: !493, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !459, file: !460, line: 116, type: !493, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "slot0", scope: !459, file: !460, line: 842, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 256)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "slotvec", scope: !459, file: !460, line: 845, type: !569, isLocal: true, isDefinition: true)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !460, line: 834, size: 128, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !570, file: !460, line: 836, baseType: !114, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !570, file: !460, line: 837, baseType: !56, size: 64, offset: 64)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "nslots", scope: !459, file: !460, line: 843, type: !60, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "slotvec0", scope: !459, file: !460, line: 844, type: !570, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 704, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 11)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !583, file: !584, line: 26, type: !586, isDefinition: true)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, globals: !585, nameTableKind: None)
!584 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!585 = !{!581}
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 47)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!590 = distinct !DIGlobalVariable(name: "initialized", scope: !591, file: !592, line: 34, type: !192, isLocal: true, isDefinition: true)
!591 = distinct !DISubprogram(name: "can_write_any_file", scope: !592, file: !592, line: 32, type: !190, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !593, retainedNodes: !602)
!592 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !594, globals: !598, nameTableKind: None)
!594 = !{!595}
!595 = !DISubprogram(name: "geteuid", scope: !211, file: !211, line: 678, type: !596, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!596 = !DISubroutineType(types: !597)
!597 = !{!7}
!598 = !{!599, !600}
!599 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "can_write", scope: !591, file: !592, line: 35, type: !192, isLocal: true, isDefinition: true)
!602 = !{!603}
!603 = !DILocalVariable(name: "can", scope: !604, file: !592, line: 39, type: !192)
!604 = distinct !DILexicalBlock(scope: !605, file: !592, line: 38, column: 5)
!605 = distinct !DILexicalBlock(scope: !591, file: !592, line: 37, column: 7)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "default_tuning", scope: !608, file: !609, line: 130, type: !616, isLocal: true, isDefinition: true)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !610, globals: !615, nameTableKind: None)
!609 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!610 = !{!42, !112, !611, !503, !114}
!611 = !DISubprogram(name: "rpl_calloc", scope: !612, file: !612, line: 688, type: !613, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!612 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!613 = !DISubroutineType(types: !614)
!614 = !{!112, !42, !42}
!615 = !{!606}
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !618, line: 65, baseType: !619)
!618 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !618, line: 53, size: 160, elements: !620)
!620 = !{!621, !623, !624, !625, !626}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !619, file: !618, line: 58, baseType: !622, size: 32)
!622 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !619, file: !618, line: 59, baseType: !622, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !619, file: !618, line: 60, baseType: !622, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !619, file: !618, line: 61, baseType: !622, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !619, file: !618, line: 62, baseType: !192, size: 8, offset: 128)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !629, file: !630, line: 507, type: !60, isLocal: true, isDefinition: true)
!629 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !630, file: !630, line: 488, type: !631, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !633, retainedNodes: !641)
!630 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!631 = !DISubroutineType(types: !632)
!632 = !{!60, !60, !60}
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !630, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !634, globals: !640, nameTableKind: None)
!634 = !{!635, !639}
!635 = !DISubprogram(name: "fcntl", scope: !636, file: !636, line: 176, type: !637, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!636 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!637 = !DISubroutineType(types: !638)
!638 = !{!60, !60, !60, null}
!639 = !DISubprogram(name: "close", scope: !211, file: !211, line: 353, type: !212, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!640 = !{!627}
!641 = !{!642, !643, !644, !645, !648}
!642 = !DILocalVariable(name: "fd", arg: 1, scope: !629, file: !630, line: 488, type: !60)
!643 = !DILocalVariable(name: "target", arg: 2, scope: !629, file: !630, line: 488, type: !60)
!644 = !DILocalVariable(name: "result", scope: !629, file: !630, line: 490, type: !60)
!645 = !DILocalVariable(name: "flags", scope: !646, file: !630, line: 531, type: !60)
!646 = distinct !DILexicalBlock(scope: !647, file: !630, line: 530, column: 5)
!647 = distinct !DILexicalBlock(scope: !629, file: !630, line: 529, column: 7)
!648 = !DILocalVariable(name: "saved_errno", scope: !649, file: !630, line: 534, type: !60)
!649 = distinct !DILexicalBlock(scope: !650, file: !630, line: 533, column: 9)
!650 = distinct !DILexicalBlock(scope: !646, file: !630, line: 532, column: 11)
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !653, retainedTypes: !675, nameTableKind: None)
!652 = !DIFile(filename: "src/remove.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!653 = !{!31, !5, !17, !654, !659, !663}
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !652, line: 35, baseType: !7, size: 32, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIEnumerator(name: "T_UNKNOWN", value: 2, isUnsigned: true)
!657 = !DIEnumerator(name: "T_NO", value: 3, isUnsigned: true)
!658 = !DIEnumerator(name: "T_YES", value: 4, isUnsigned: true)
!659 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !652, line: 46, baseType: !7, size: 32, elements: !660)
!660 = !{!661, !662}
!661 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2, isUnsigned: true)
!662 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3, isUnsigned: true)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !664, line: 97, baseType: !7, size: 32, elements: !665)
!664 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674}
!666 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!667 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!668 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!669 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!670 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!671 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!672 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!673 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!674 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!675 = !{!676, !791, !112, !52, !159, !794, !163, !797, !214, !799, !503, !803, !804, !807, !639, !811, !814, !826, !829, !188, !835, !837, !60, !840}
!676 = !DISubprogram(name: "xfts_open", scope: !677, file: !677, line: 5, type: !678, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!677 = !DIFile(filename: "./lib/xfts.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !146, !60, !763}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 80, size: 1024, elements: !683)
!682 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!683 = !{!684, !753, !754, !756, !757, !758, !759, !760, !761, !762, !769, !770, !773, !780}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !681, file: !682, line: 81, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !682, line: 199, size: 2112, elements: !687)
!687 = !{!688, !689, !690, !691, !695, !696, !697, !698, !699, !700, !701, !702, !705, !707, !708, !711, !712, !713, !714, !749}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !686, file: !682, line: 200, baseType: !685, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !686, file: !682, line: 201, baseType: !685, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !686, file: !682, line: 202, baseType: !685, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !686, file: !682, line: 203, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !664, line: 127, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !664, line: 127, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !686, file: !682, line: 206, baseType: !90, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !686, file: !682, line: 207, baseType: !112, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !686, file: !682, line: 208, baseType: !56, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !686, file: !682, line: 209, baseType: !56, size: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !686, file: !682, line: 210, baseType: !60, size: 32, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !686, file: !682, line: 211, baseType: !60, size: 32, offset: 544)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !686, file: !682, line: 212, baseType: !114, size: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !686, file: !682, line: 214, baseType: !703, size: 64, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !682, line: 197, baseType: !681)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !686, file: !682, line: 218, baseType: !706, size: 64, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !115, line: 35, baseType: !90)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !686, file: !682, line: 220, baseType: !114, size: 64, offset: 768)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !686, file: !682, line: 225, baseType: !709, size: 64, offset: 832)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !180, line: 74, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !46, line: 151, baseType: !42)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !686, file: !682, line: 241, baseType: !92, size: 16, offset: 896)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !686, file: !682, line: 245, baseType: !92, size: 16, offset: 912)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !686, file: !682, line: 251, baseType: !92, size: 16, offset: 928)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !686, file: !682, line: 253, baseType: !715, size: 1152, offset: 960)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 1152, elements: !97)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !717, line: 46, size: 1152, elements: !718)
!717 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!718 = !{!719, !720, !721, !722, !724, !726, !728, !729, !730, !731, !733, !735, !743, !744, !745}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !716, file: !717, line: 48, baseType: !184, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !716, file: !717, line: 53, baseType: !181, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !716, file: !717, line: 61, baseType: !710, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !716, file: !717, line: 62, baseType: !723, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !46, line: 150, baseType: !7)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !716, file: !717, line: 64, baseType: !725, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !46, line: 146, baseType: !7)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !716, file: !717, line: 65, baseType: !727, size: 32, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !46, line: 147, baseType: !7)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !716, file: !717, line: 67, baseType: !60, size: 32, offset: 288)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !716, file: !717, line: 69, baseType: !184, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !716, file: !717, line: 74, baseType: !89, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !716, file: !717, line: 78, baseType: !732, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !46, line: 174, baseType: !90)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !716, file: !717, line: 80, baseType: !734, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !46, line: 179, baseType: !90)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !716, file: !717, line: 91, baseType: !736, size: 128, offset: 576)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !737, line: 10, size: 128, elements: !738)
!737 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!738 = !{!739, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !736, file: !737, line: 12, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !46, line: 160, baseType: !90)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !736, file: !737, line: 16, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !46, line: 196, baseType: !90)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !716, file: !717, line: 92, baseType: !736, size: 128, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !716, file: !717, line: 93, baseType: !736, size: 128, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !716, file: !717, line: 106, baseType: !746, size: 192, offset: 960)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 192, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 3)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !686, file: !682, line: 254, baseType: !750, offset: 2112)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: -1)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !681, file: !682, line: 82, baseType: !685, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !681, file: !682, line: 83, baseType: !755, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !681, file: !682, line: 84, baseType: !183, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !681, file: !682, line: 85, baseType: !56, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !681, file: !682, line: 86, baseType: !60, size: 32, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !681, file: !682, line: 87, baseType: !60, size: 32, offset: 352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !681, file: !682, line: 89, baseType: !114, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !681, file: !682, line: 90, baseType: !114, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !681, file: !682, line: 91, baseType: !763, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!60, !766, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !681, file: !682, line: 160, baseType: !60, size: 32, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !681, file: !682, line: 169, baseType: !771, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !682, line: 169, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !681, file: !682, line: 191, baseType: !774, size: 64, offset: 704)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !681, file: !682, line: 171, size: 64, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !774, file: !682, line: 184, baseType: !771, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !774, file: !682, line: 190, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !682, line: 190, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !681, file: !682, line: 196, baseType: !781, size: 256, offset: 768)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !782, line: 39, baseType: !783)
!782 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !782, line: 31, size: 256, elements: !784)
!784 = !{!785, !787, !788, !789, !790}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !783, file: !782, line: 33, baseType: !786, size: 128)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !524)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !783, file: !782, line: 34, baseType: !60, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !783, file: !782, line: 35, baseType: !7, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !783, file: !782, line: 36, baseType: !7, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !783, file: !782, line: 37, baseType: !192, size: 8, offset: 224)
!791 = !DISubprogram(name: "rpl_fts_read", scope: !682, file: !682, line: 280, type: !792, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!792 = !DISubroutineType(types: !793)
!793 = !{!685, !680}
!794 = !DISubprogram(name: "rpl_fts_close", scope: !682, file: !682, line: 276, type: !795, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!795 = !DISubroutineType(types: !796)
!796 = !{!60, !680}
!797 = !DISubprogram(name: "last_component", scope: !798, file: !798, line: 46, type: !133, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!798 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!799 = !DISubprogram(name: "file_name_concat", scope: !800, file: !800, line: 22, type: !801, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!800 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!801 = !DISubroutineType(types: !802)
!802 = !{!56, !58, !58, !223}
!803 = !DISubprogram(name: "quotearg_n_style_colon", scope: !18, file: !18, line: 397, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!804 = !DISubprogram(name: "openat", scope: !636, file: !636, line: 220, type: !805, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!805 = !DISubroutineType(types: !806)
!806 = !{!60, !60, !58, !60, null}
!807 = !DISubprogram(name: "fdopendir", scope: !664, file: !664, line: 141, type: !808, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!808 = !DISubroutineType(types: !809)
!809 = !{!810, !60}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!811 = !DISubprogram(name: "closedir", scope: !664, file: !664, line: 149, type: !812, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!812 = !DISubroutineType(types: !813)
!813 = !{!60, !810}
!814 = !DISubprogram(name: "readdir", scope: !664, file: !664, line: 162, type: !815, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !810}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !819, line: 22, size: 2240, elements: !820)
!819 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!820 = !{!821, !822, !823, !824, !825}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !818, file: !819, line: 25, baseType: !181, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !818, file: !819, line: 26, baseType: !89, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !818, file: !819, line: 31, baseType: !92, size: 16, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !818, file: !819, line: 32, baseType: !309, size: 8, offset: 144)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !818, file: !819, line: 33, baseType: !564, size: 2048, offset: 152)
!826 = !DISubprogram(name: "rpl_fts_set", scope: !682, file: !682, line: 281, type: !827, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!827 = !DISubroutineType(types: !828)
!828 = !{!60, !680, !685, !60}
!829 = !DISubprogram(name: "file_type", scope: !830, file: !830, line: 27, type: !831, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!830 = !DIFile(filename: "./lib/file-type.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!831 = !DISubroutineType(types: !832)
!832 = !{!58, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!835 = !DISubprogram(name: "can_write_any_file", scope: !836, file: !836, line: 2, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!836 = !DIFile(filename: "./lib/write-any-file.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!837 = !DISubprogram(name: "faccessat", scope: !211, file: !211, line: 304, type: !838, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!838 = !DISubroutineType(types: !839)
!839 = !{!60, !60, !58, !60, !60}
!840 = !DISubprogram(name: "unlinkat", scope: !211, file: !211, line: 829, type: !841, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!841 = !DISubroutineType(types: !842)
!842 = !{!60, !60, !58, !60}
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !845, nameTableKind: None)
!844 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!845 = !{!56}
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !848, nameTableKind: None)
!847 = !DIFile(filename: "lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!848 = !{!52}
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !851, nameTableKind: None)
!850 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!851 = !{!852, !112, !547}
!852 = !DISubprogram(name: "mfile_name_concat", scope: !800, file: !800, line: 26, type: !801, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !855, nameTableKind: None)
!854 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!855 = !{!797, !856, !112}
!856 = !DISubprogram(name: "base_len", scope: !798, file: !798, line: 44, type: !857, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!857 = !DISubroutineType(types: !858)
!858 = !{!42, !58}
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, nameTableKind: None)
!860 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !862, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !863, retainedTypes: !867, nameTableKind: None)
!862 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!863 = !{!864}
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 40, baseType: !7, size: 32, elements: !865)
!865 = !{!866}
!866 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!867 = !{!52, !868, !112}
!868 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 662, type: !869, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!869 = !DISubroutineType(types: !870)
!870 = !{!60, !58, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !872, file: !68, line: 51, baseType: !60, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !872, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !872, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !872, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !872, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !872, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !872, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !872, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !872, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !872, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !872, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !872, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !872, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !872, file: !68, line: 70, baseType: !871, size: 64, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !872, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !872, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !872, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !872, file: !68, line: 77, baseType: !92, size: 16, offset: 1024)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !872, file: !68, line: 78, baseType: !94, size: 8, offset: 1040)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !872, file: !68, line: 79, baseType: !96, size: 8, offset: 1048)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !872, file: !68, line: 81, baseType: !100, size: 64, offset: 1088)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !872, file: !68, line: 89, baseType: !103, size: 64, offset: 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !872, file: !68, line: 91, baseType: !105, size: 64, offset: 1216)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !872, file: !68, line: 92, baseType: !108, size: 64, offset: 1280)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !872, file: !68, line: 93, baseType: !871, size: 64, offset: 1344)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !872, file: !68, line: 94, baseType: !112, size: 64, offset: 1408)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !872, file: !68, line: 95, baseType: !114, size: 64, offset: 1472)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !872, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !872, file: !68, line: 98, baseType: !118, size: 160, offset: 1568)
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !905, retainedTypes: !918, nameTableKind: None)
!904 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!905 = !{!906}
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !907, file: !484, line: 186, baseType: !7, size: 32, elements: !916)
!907 = distinct !DISubprogram(name: "x2nrealloc", scope: !484, file: !484, line: 174, type: !908, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !903, retainedNodes: !911)
!908 = !DISubroutineType(types: !909)
!909 = !{!112, !112, !910, !114}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!911 = !{!912, !913, !914, !915}
!912 = !DILocalVariable(name: "p", arg: 1, scope: !907, file: !484, line: 174, type: !112)
!913 = !DILocalVariable(name: "pn", arg: 2, scope: !907, file: !484, line: 174, type: !910)
!914 = !DILocalVariable(name: "s", arg: 3, scope: !907, file: !484, line: 174, type: !114)
!915 = !DILocalVariable(name: "n", scope: !907, file: !484, line: 176, type: !114)
!916 = !{!917}
!917 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!918 = !{!114, !547, !544, !548, !56, !503, !112, !919, !611}
!919 = !DISubprogram(name: "xcalloc", scope: !484, file: !484, line: 57, type: !613, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !922, nameTableKind: None)
!921 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!922 = !{!52, !159}
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !925, nameTableKind: None)
!924 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!925 = !{!926, !112, !547}
!926 = !DISubprogram(name: "rpl_fts_open", scope: !682, file: !682, line: 277, type: !927, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!927 = !DISubroutineType(types: !928)
!928 = !{!929, !146, !60, !990}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 80, size: 1024, elements: !931)
!931 = !{!932, !980, !981, !983, !984, !985, !986, !987, !988, !989, !996, !997, !998, !1003}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !930, file: !682, line: 81, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !682, line: 199, size: 2112, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !950, !951, !952, !953, !954, !955, !956, !979}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !934, file: !682, line: 200, baseType: !933, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !934, file: !682, line: 201, baseType: !933, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !934, file: !682, line: 202, baseType: !933, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !934, file: !682, line: 203, baseType: !692, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !934, file: !682, line: 206, baseType: !90, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !934, file: !682, line: 207, baseType: !112, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !934, file: !682, line: 208, baseType: !56, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !934, file: !682, line: 209, baseType: !56, size: 64, offset: 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !934, file: !682, line: 210, baseType: !60, size: 32, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !934, file: !682, line: 211, baseType: !60, size: 32, offset: 544)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !934, file: !682, line: 212, baseType: !114, size: 64, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !934, file: !682, line: 214, baseType: !948, size: 64, offset: 640)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !682, line: 197, baseType: !930)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !934, file: !682, line: 218, baseType: !706, size: 64, offset: 704)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !934, file: !682, line: 220, baseType: !114, size: 64, offset: 768)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !934, file: !682, line: 225, baseType: !709, size: 64, offset: 832)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !934, file: !682, line: 241, baseType: !92, size: 16, offset: 896)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !934, file: !682, line: 245, baseType: !92, size: 16, offset: 912)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !934, file: !682, line: 251, baseType: !92, size: 16, offset: 928)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !934, file: !682, line: 253, baseType: !957, size: 1152, offset: 960)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 1152, elements: !97)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !717, line: 46, size: 1152, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !976, !977, !978}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !958, file: !717, line: 48, baseType: !184, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !958, file: !717, line: 53, baseType: !181, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !958, file: !717, line: 61, baseType: !710, size: 64, offset: 128)
