source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.24 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !57)
!3 = !DIFile(filename: "src/rm.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !12, !17, !31, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !6, line: 23, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "interactive_type", file: !3, line: 56, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "interactive_never", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "interactive_once", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "interactive_always", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 32, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !6, line: 78, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !39, file: !38, line: 187, baseType: !7, size: 32, elements: !49)
!38 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!39 = distinct !DISubprogram(name: "select_plural", scope: !38, file: !38, line: 183, type: !40, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !47)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43}
!42 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !44, line: 102, baseType: !45)
!44 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !46, line: 72, baseType: !42)
!46 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!47 = !{!48}
!48 = !DILocalVariable(name: "n", arg: 1, scope: !39, file: !38, line: 183, type: !43)
!49 = !{!50}
!50 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!51 = !{!52, !55, !56}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !{!58, !0, !103, !109}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !60, file: !3, line: 345, type: !80, isLocal: true, isDefinition: true)
!60 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 209, type: !61, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !65)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !63, !64}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!65 = !{!66, !67, !68, !70, !94, !95, !96, !100, !101, !102}
!66 = !DILocalVariable(name: "argc", arg: 1, scope: !60, file: !3, line: 209, type: !63)
!67 = !DILocalVariable(name: "argv", arg: 2, scope: !60, file: !3, line: 209, type: !64)
!68 = !DILocalVariable(name: "preserve_root", scope: !60, file: !3, line: 211, type: !69)
!69 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DILocalVariable(name: "x", scope: !60, file: !3, line: 212, type: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !6, line: 32, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !90, !91, !92, !93}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !71, file: !6, line: 35, baseType: !69, size: 8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !71, file: !6, line: 38, baseType: !5, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !71, file: !6, line: 47, baseType: !69, size: 8, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !71, file: !6, line: 50, baseType: !69, size: 8, offset: 72)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !71, file: !6, line: 53, baseType: !69, size: 8, offset: 80)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !71, file: !6, line: 57, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !81, line: 7, size: 128, elements: !82)
!81 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!82 = !{!83, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !80, file: !81, line: 9, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !85, line: 47, baseType: !86)
!85 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !46, line: 146, baseType: !42)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !80, file: !81, line: 10, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !85, line: 59, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !46, line: 143, baseType: !42)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !71, file: !6, line: 61, baseType: !69, size: 8, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !71, file: !6, line: 64, baseType: !69, size: 8, offset: 200)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !71, file: !6, line: 67, baseType: !69, size: 8, offset: 208)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !71, file: !6, line: 75, baseType: !69, size: 8, offset: 216)
!94 = !DILocalVariable(name: "prompt_once", scope: !60, file: !3, line: 213, type: !69)
!95 = !DILocalVariable(name: "c", scope: !60, file: !3, line: 214, type: !63)
!96 = !DILocalVariable(name: "i", scope: !97, file: !3, line: 262, type: !63)
!97 = distinct !DILexicalBlock(scope: !98, file: !3, line: 261, column: 11)
!98 = distinct !DILexicalBlock(scope: !99, file: !3, line: 232, column: 9)
!99 = distinct !DILexicalBlock(scope: !60, file: !3, line: 230, column: 5)
!100 = !DILocalVariable(name: "n_files", scope: !60, file: !3, line: 352, type: !43)
!101 = !DILocalVariable(name: "file", scope: !60, file: !3, line: 353, type: !64)
!102 = !DILocalVariable(name: "status", scope: !60, file: !3, line: 370, type: !31)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "interactive_types", scope: !2, file: !3, line: 92, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 192, elements: !107)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!107 = !{!108}
!108 = !DISubrange(count: 6)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "interactive_args", scope: !2, file: !3, line: 86, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 448, elements: !113)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!113 = !{!114}
!114 = !DISubrange(count: 7)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 3072, elements: !125)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !118, line: 50, size: 256, elements: !119)
!118 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!119 = !{!120, !121, !122, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 52, baseType: !52, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !117, file: !118, line: 55, baseType: !63, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !117, file: !118, line: 56, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !117, file: !118, line: 57, baseType: !63, size: 32, offset: 192)
!125 = !{!126}
!126 = !DISubrange(count: 12)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "Version", scope: !129, file: !130, line: 2, type: !52, isDefinition: true)
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, globals: !132)
!130 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!131 = !{}
!132 = !{!127}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !135, file: !141, line: 69, type: !142, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !137, retainedTypes: !138, globals: !140)
!136 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!137 = !{!17}
!138 = !{!56, !139}
!139 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!133}
!141 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !143, line: 55, baseType: !144)
!143 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "file_name", scope: !149, file: !152, line: 37, type: !52, isLocal: true, isDefinition: true)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, globals: !151)
!150 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!151 = !{!147}
!152 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "file_name", scope: !155, file: !160, line: 46, type: !52, isLocal: true, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, globals: !157)
!156 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!157 = !{!153, !158}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !155, file: !160, line: 56, type: !69, isLocal: true, isDefinition: true)
!160 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "exit_failure", scope: !163, file: !166, line: 24, type: !167, isDefinition: true)
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, globals: !165)
!164 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!165 = !{!161}
!166 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!167 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "program_name", scope: !170, file: !174, line: 33, type: !52, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !172, globals: !173)
!171 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!172 = !{!56, !55}
!173 = !{!168}
!174 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !177, file: !207, line: 85, type: !242, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !200, globals: !204)
!178 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!179 = !{!17, !180, !185}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 242, baseType: !7, size: 32, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!183 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!184 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !186, line: 46, baseType: !7, size: 32, elements: !187)
!186 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!188 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!189 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!190 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!191 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!192 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!193 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!194 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!195 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!196 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!197 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!198 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!199 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!200 = !{!63, !201, !202, !55}
!201 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !203, line: 62, baseType: !42)
!203 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!204 = !{!175, !205, !212, !224, !226, !231, !238, !240}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !177, file: !207, line: 101, type: !208, isDefinition: true)
!207 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 320, elements: !210)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!210 = !{!211}
!211 = !DISubrange(count: 10)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !177, file: !207, line: 1052, type: !214, isDefinition: true)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !207, line: 65, size: 448, elements: !215)
!215 = !{!216, !217, !218, !222, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !214, file: !207, line: 68, baseType: !17, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !214, file: !207, line: 71, baseType: !63, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !214, file: !207, line: 75, baseType: !219, size: 256, offset: 64)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !214, file: !207, line: 78, baseType: !52, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !214, file: !207, line: 81, baseType: !52, size: 64, offset: 384)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !177, file: !207, line: 116, type: !214, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "slot0", scope: !177, file: !207, line: 842, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 256)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "slotvec", scope: !177, file: !207, line: 845, type: !233, isLocal: true, isDefinition: true)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !207, line: 834, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !207, line: 836, baseType: !202, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !234, file: !207, line: 837, baseType: !55, size: 64, offset: 64)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "nslots", scope: !177, file: !207, line: 843, type: !63, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "slotvec0", scope: !177, file: !207, line: 844, type: !234, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 704, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 11)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !247, file: !250, line: 26, type: !251, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, globals: !249)
!248 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!249 = !{!245}
!250 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 376, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 47)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!255 = distinct !DIGlobalVariable(name: "initialized", scope: !256, file: !257, line: 34, type: !69, isLocal: true, isDefinition: true)
!256 = distinct !DISubprogram(name: "can_write_any_file", scope: !257, file: !257, line: 32, type: !258, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !266)
!257 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!258 = !DISubroutineType(types: !259)
!259 = !{!69}
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, globals: !262)
!261 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!262 = !{!263, !264}
!263 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "can_write", scope: !256, file: !257, line: 35, type: !69, isLocal: true, isDefinition: true)
!266 = !{!267}
!267 = !DILocalVariable(name: "can", scope: !268, file: !257, line: 39, type: !69)
!268 = distinct !DILexicalBlock(scope: !269, file: !257, line: 38, column: 5)
!269 = distinct !DILexicalBlock(scope: !256, file: !257, line: 37, column: 7)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "default_tuning", scope: !272, file: !276, line: 130, type: !277, isLocal: true, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !274, globals: !275)
!273 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!274 = !{!42, !56, !202}
!275 = !{!270}
!276 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !279, line: 65, baseType: !280)
!279 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !279, line: 53, size: 160, elements: !281)
!281 = !{!282, !284, !285, !286, !287}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !280, file: !279, line: 58, baseType: !283, size: 32)
!283 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !280, file: !279, line: 59, baseType: !283, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !280, file: !279, line: 60, baseType: !283, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !280, file: !279, line: 61, baseType: !283, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !280, file: !279, line: 62, baseType: !69, size: 8, offset: 128)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !290, file: !291, line: 339, type: !63, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "rpl_fcntl", scope: !291, file: !291, line: 276, type: !292, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !294, retainedNodes: !297)
!291 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!292 = !DISubroutineType(types: !293)
!293 = !{!63, !63, !63, null}
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, globals: !296)
!295 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!296 = !{!288}
!297 = !{!298, !299, !300, !313, !314, !317, !320, !323}
!298 = !DILocalVariable(name: "fd", arg: 1, scope: !290, file: !291, line: 276, type: !63)
!299 = !DILocalVariable(name: "action", arg: 2, scope: !290, file: !291, line: 276, type: !63)
!300 = !DILocalVariable(name: "arg", scope: !290, file: !291, line: 278, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !302, line: 30, baseType: !303)
!302 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !295, line: 278, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 192, elements: !311)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !295, line: 278, size: 192, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !305, file: !295, line: 278, baseType: !7, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !305, file: !295, line: 278, baseType: !7, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !305, file: !295, line: 278, baseType: !56, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !305, file: !295, line: 278, baseType: !56, size: 64, offset: 128)
!311 = !{!312}
!312 = !DISubrange(count: 1)
!313 = !DILocalVariable(name: "result", scope: !290, file: !291, line: 279, type: !63)
!314 = !DILocalVariable(name: "target", scope: !315, file: !291, line: 326, type: !63)
!315 = distinct !DILexicalBlock(scope: !316, file: !291, line: 325, column: 7)
!316 = distinct !DILexicalBlock(scope: !290, file: !291, line: 282, column: 5)
!317 = !DILocalVariable(name: "flags", scope: !318, file: !291, line: 363, type: !63)
!318 = distinct !DILexicalBlock(scope: !319, file: !291, line: 362, column: 11)
!319 = distinct !DILexicalBlock(scope: !315, file: !291, line: 361, column: 13)
!320 = !DILocalVariable(name: "saved_errno", scope: !321, file: !291, line: 366, type: !63)
!321 = distinct !DILexicalBlock(scope: !322, file: !291, line: 365, column: 15)
!322 = distinct !DILexicalBlock(scope: !318, file: !291, line: 364, column: 17)
!323 = !DILocalVariable(name: "p", scope: !324, file: !291, line: 408, type: !56)
!324 = distinct !DILexicalBlock(scope: !316, file: !291, line: 406, column: 7)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !349)
!326 = !DIFile(filename: "src/remove.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!327 = !{!31, !5, !17, !328, !333, !337}
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !326, line: 35, baseType: !7, size: 32, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIEnumerator(name: "T_UNKNOWN", value: 2, isUnsigned: true)
!331 = !DIEnumerator(name: "T_NO", value: 3, isUnsigned: true)
!332 = !DIEnumerator(name: "T_YES", value: 4, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !326, line: 46, baseType: !7, size: 32, elements: !334)
!334 = !{!335, !336}
!335 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2, isUnsigned: true)
!336 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3, isUnsigned: true)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 97, baseType: !7, size: 32, elements: !339)
!338 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348}
!340 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!341 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!342 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!343 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!344 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!345 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!346 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!347 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!348 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!349 = !{!56, !63}
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !352)
!351 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!352 = !{!55}
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!354 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !357)
!356 = !DIFile(filename: "./lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!357 = !{!56}
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !357)
!359 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!361 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !364, retainedTypes: !357)
!363 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!364 = !{!365}
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 41, baseType: !7, size: 32, elements: !367)
!366 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!367 = !{!368}
!368 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !371, retainedTypes: !385)
!370 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!371 = !{!372}
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !374, file: !373, line: 186, baseType: !7, size: 32, elements: !383)
!373 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!374 = distinct !DISubprogram(name: "x2nrealloc", scope: !373, file: !373, line: 174, type: !375, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !369, retainedNodes: !378)
!375 = !DISubroutineType(types: !376)
!376 = !{!56, !56, !377, !202}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!378 = !{!379, !380, !381, !382}
!379 = !DILocalVariable(name: "p", arg: 1, scope: !374, file: !373, line: 174, type: !56)
!380 = !DILocalVariable(name: "pn", arg: 2, scope: !374, file: !373, line: 174, type: !377)
!381 = !DILocalVariable(name: "s", arg: 3, scope: !374, file: !373, line: 174, type: !202)
!382 = !DILocalVariable(name: "n", scope: !374, file: !373, line: 176, type: !202)
!383 = !{!384}
!384 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!385 = !{!202, !55, !56}
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!387 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !357)
!389 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!391 = !DIFile(filename: "./lib/yesno.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !357)
!393 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !357)
!395 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!397 = !DIFile(filename: "./lib/freadahead.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !357)
!399 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !402, retainedTypes: !554)
!401 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!402 = !{!403, !408, !413, !545, !548, !337, !551}
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !404, line: 155, baseType: !7, size: 32, elements: !405)
!404 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!405 = !{!406, !407}
!406 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!407 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !404, line: 669, baseType: !7, size: 32, elements: !409)
!409 = !{!410, !411, !412}
!410 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!411 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!412 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !415, file: !414, line: 54, baseType: !7, size: 32, elements: !543)
!414 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!415 = distinct !DISubprogram(name: "setup_dir", scope: !414, file: !414, line: 50, type: !416, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !400, retainedNodes: !541)
!416 = !DISubroutineType(types: !417)
!417 = !{!69, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !420, line: 199, baseType: !421)
!420 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 80, size: 1024, elements: !422)
!422 = !{!423, !492, !493, !495, !496, !497, !498, !499, !500, !501, !508, !509, !512, !528}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !421, file: !420, line: 81, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !420, line: 201, size: 2112, elements: !426)
!426 = !{!427, !428, !429, !430, !434, !436, !437, !438, !439, !440, !441, !442, !443, !445, !446, !449, !450, !451, !452, !488}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !425, file: !420, line: 202, baseType: !424, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !425, file: !420, line: 203, baseType: !424, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !425, file: !420, line: 204, baseType: !424, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !425, file: !420, line: 205, baseType: !431, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !338, line: 127, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !338, line: 127, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !425, file: !420, line: 208, baseType: !435, size: 64, offset: 256)
!435 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !425, file: !420, line: 209, baseType: !56, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !425, file: !420, line: 210, baseType: !55, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !425, file: !420, line: 211, baseType: !55, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !425, file: !420, line: 212, baseType: !63, size: 32, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !425, file: !420, line: 213, baseType: !63, size: 32, offset: 544)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !425, file: !420, line: 214, baseType: !202, size: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !425, file: !420, line: 216, baseType: !418, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !425, file: !420, line: 220, baseType: !444, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !203, line: 51, baseType: !435)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !425, file: !420, line: 222, baseType: !202, size: 64, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !425, file: !420, line: 227, baseType: !447, size: 64, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !85, line: 74, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !46, line: 149, baseType: !42)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !425, file: !420, line: 243, baseType: !201, size: 16, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !425, file: !420, line: 247, baseType: !201, size: 16, offset: 912)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !425, file: !420, line: 253, baseType: !201, size: 16, offset: 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !425, file: !420, line: 255, baseType: !453, size: 1152, offset: 960)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1152, elements: !311)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !455, line: 46, size: 1152, elements: !456)
!455 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!456 = !{!457, !458, !459, !460, !462, !464, !466, !467, !468, !470, !472, !474, !482, !483, !484}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !454, file: !455, line: 48, baseType: !89, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !454, file: !455, line: 53, baseType: !86, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !454, file: !455, line: 61, baseType: !448, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !454, file: !455, line: 62, baseType: !461, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !46, line: 148, baseType: !7)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !454, file: !455, line: 64, baseType: !463, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !46, line: 144, baseType: !7)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !454, file: !455, line: 65, baseType: !465, size: 32, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !46, line: 145, baseType: !7)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !454, file: !455, line: 67, baseType: !63, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !454, file: !455, line: 69, baseType: !89, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !454, file: !455, line: 74, baseType: !469, size: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 150, baseType: !435)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !454, file: !455, line: 78, baseType: !471, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !46, line: 172, baseType: !435)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !454, file: !455, line: 80, baseType: !473, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !46, line: 177, baseType: !435)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !454, file: !455, line: 91, baseType: !475, size: 128, offset: 576)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !476, line: 9, size: 128, elements: !477)
!476 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!477 = !{!478, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !475, file: !476, line: 11, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !46, line: 158, baseType: !435)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !475, file: !476, line: 12, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !46, line: 194, baseType: !435)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !454, file: !455, line: 92, baseType: !475, size: 128, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !454, file: !455, line: 93, baseType: !475, size: 128, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !454, file: !455, line: 106, baseType: !485, size: 192, offset: 960)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 192, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 3)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !425, file: !420, line: 256, baseType: !489, offset: 2112)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: -1)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !421, file: !420, line: 82, baseType: !424, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !421, file: !420, line: 83, baseType: !494, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !421, file: !420, line: 84, baseType: !88, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !421, file: !420, line: 85, baseType: !55, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !421, file: !420, line: 86, baseType: !63, size: 32, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !421, file: !420, line: 87, baseType: !63, size: 32, offset: 352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !421, file: !420, line: 89, baseType: !202, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !421, file: !420, line: 90, baseType: !202, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !421, file: !420, line: 91, baseType: !502, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!63, !505, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !421, file: !420, line: 162, baseType: !63, size: 32, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !421, file: !420, line: 171, baseType: !510, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !420, line: 171, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !421, file: !420, line: 193, baseType: !513, size: 64, offset: 704)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !420, line: 173, size: 64, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !513, file: !420, line: 186, baseType: !510, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !513, file: !420, line: 192, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !519, line: 28, size: 256, elements: !520)
!519 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!520 = !{!521, !526, !527}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !518, file: !519, line: 30, baseType: !522, size: 128)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !81, line: 7, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !522, file: !81, line: 9, baseType: !84, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !522, file: !81, line: 10, baseType: !88, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !518, file: !519, line: 31, baseType: !43, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !518, file: !519, line: 32, baseType: !63, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !421, file: !420, line: 198, baseType: !529, size: 256, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !530, line: 39, baseType: !531)
!530 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !530, line: 31, size: 256, elements: !532)
!532 = !{!533, !537, !538, !539, !540}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !531, file: !530, line: 33, baseType: !534, size: 128)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 4)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !531, file: !530, line: 34, baseType: !63, size: 32, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !531, file: !530, line: 35, baseType: !7, size: 32, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !531, file: !530, line: 36, baseType: !7, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !531, file: !530, line: 37, baseType: !69, size: 8, offset: 224)
!541 = !{!542}
!542 = !DILocalVariable(name: "fts", arg: 1, scope: !415, file: !414, line: 50, type: !418)
!543 = !{!544}
!544 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 712, baseType: !7, size: 32, elements: !546)
!546 = !{!547}
!547 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 666, baseType: !7, size: 32, elements: !549)
!549 = !{!550}
!550 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 150, baseType: !7, size: 32, elements: !552)
!552 = !{!553}
!553 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!554 = !{!56, !447, !43, !55, !435, !555, !560}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!63, !558, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !420, line: 257, baseType: !425)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131, retainedTypes: !566)
!565 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!566 = !{!202}
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!568 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!570 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!572 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!574 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !577)
!576 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!577 = !{!578}
!578 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !530, line: 20, baseType: !7, size: 32, elements: !579)
!579 = !{!580}
!580 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !583, retainedTypes: !357)
!582 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!583 = !{!584}
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !585, line: 41, baseType: !7, size: 32, elements: !586)
!585 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!587 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!588 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!589 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!590 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!591 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!592 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!593 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!594 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!595 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!596 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!597 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!598 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!599 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!600 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!601 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!602 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!603 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!604 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!605 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!606 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!607 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!608 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!609 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!610 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!611 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!612 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!613 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!614 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!615 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!616 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!617 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!618 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!619 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!620 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!621 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!622 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!623 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!624 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!625 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!626 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!627 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!628 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!629 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!630 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!631 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!632 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!633 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!634 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!635 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!636 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!695 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!698 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!699 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!700 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!701 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!702 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!703 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!704 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!705 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!706 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!707 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!708 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!709 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!782 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!855 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!856 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!857 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!858 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!859 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!860 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!861 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!862 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!863 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!864 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!865 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!866 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!867 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!868 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!869 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!871 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!872 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!873 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!874 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!875 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!876 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!902 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!903 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!904 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!905 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!906 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!911 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!912 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!913 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!914 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!971 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!973 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!975 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !131)
!977 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!978 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!979 = !{i32 2, !"Dwarf Version", i32 4}
!980 = !{i32 2, !"Debug Info Version", i32 3}
!981 = !{i32 1, !"wchar_size", i32 4}
!982 = !{i32 7, !"PIC Level", i32 2}
!983 = !{i32 7, !"PIE Level", i32 2}
!984 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 127, type: !985, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !63}
!987 = !{!988}
!988 = !DILocalVariable(name: "status", arg: 1, scope: !984, file: !3, line: 127, type: !63)
!989 = !DILocalVariable(name: "infomap", scope: !990, file: !38, line: 632, type: !1004)
!990 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !38, file: !38, line: 630, type: !991, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !52}
!993 = !{!994, !989, !995, !996, !1003}
!994 = !DILocalVariable(name: "program", arg: 1, scope: !990, file: !38, line: 630, type: !52)
!995 = !DILocalVariable(name: "node", scope: !990, file: !38, line: 642, type: !52)
!996 = !DILocalVariable(name: "map_prog", scope: !990, file: !38, line: 643, type: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !990, file: !38, line: 632, size: 128, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !999, file: !38, line: 632, baseType: !52, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !999, file: !38, line: 632, baseType: !52, size: 64, offset: 64)
!1003 = !DILocalVariable(name: "lc_messages", scope: !990, file: !38, line: 655, type: !52)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 896, elements: !113)
!1005 = !DILocation(line: 632, column: 67, scope: !990, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 185, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 132, column: 5)
!1008 = distinct !DILexicalBlock(scope: !984, file: !3, line: 129, column: 7)
!1009 = !DILocation(line: 127, column: 12, scope: !984)
!1010 = !DILocation(line: 129, column: 14, scope: !1008)
!1011 = !DILocation(line: 129, column: 7, scope: !984)
!1012 = !DILocation(line: 130, column: 5, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 130, column: 5)
!1014 = !{!1015, !1015, i64 0}
!1015 = !{!"any pointer", !1016, i64 0}
!1016 = !{!"omnipotent char", !1017, i64 0}
!1017 = !{!"Simple C/C++ TBAA"}
!1018 = !DILocation(line: 133, column: 7, scope: !1007)
!1019 = !DILocation(line: 134, column: 7, scope: !1007)
!1020 = !DILocation(line: 140, column: 7, scope: !1007)
!1021 = !DILocation(line: 147, column: 7, scope: !1007)
!1022 = !DILocation(line: 152, column: 7, scope: !1007)
!1023 = !DILocation(line: 158, column: 7, scope: !1007)
!1024 = !DILocation(line: 163, column: 7, scope: !1007)
!1025 = !DILocation(line: 164, column: 7, scope: !1007)
!1026 = !DILocation(line: 165, column: 7, scope: !1007)
!1027 = !DILocation(line: 170, column: 7, scope: !1007)
!1028 = !DILocation(line: 179, column: 7, scope: !1007)
!1029 = !DILocation(line: 632, column: 3, scope: !990, inlinedAt: !1006)
!1030 = !DILocation(line: 643, column: 36, scope: !990, inlinedAt: !1006)
!1031 = !DILocation(line: 643, column: 25, scope: !990, inlinedAt: !1006)
!1032 = !DILocation(line: 645, column: 33, scope: !990, inlinedAt: !1006)
!1033 = !DILocation(line: 645, column: 3, scope: !990, inlinedAt: !1006)
!1034 = !DILocation(line: 646, column: 13, scope: !990, inlinedAt: !1006)
!1035 = !DILocation(line: 645, column: 20, scope: !990, inlinedAt: !1006)
!1036 = !{!1037, !1015, i64 0}
!1037 = !{!"infomap", !1015, i64 0, !1015, i64 8}
!1038 = !DILocation(line: 645, column: 10, scope: !990, inlinedAt: !1006)
!1039 = !DILocation(line: 645, column: 28, scope: !990, inlinedAt: !1006)
!1040 = distinct !{!1040, !1041, !1042}
!1041 = !DILocation(line: 645, column: 3, scope: !990)
!1042 = !DILocation(line: 646, column: 13, scope: !990)
!1043 = !DILocation(line: 648, column: 17, scope: !1044, inlinedAt: !1006)
!1044 = distinct !DILexicalBlock(scope: !990, file: !38, line: 648, column: 7)
!1045 = !{!1037, !1015, i64 8}
!1046 = !DILocation(line: 648, column: 7, scope: !1044, inlinedAt: !1006)
!1047 = !DILocation(line: 648, column: 7, scope: !990, inlinedAt: !1006)
!1048 = !DILocation(line: 642, column: 15, scope: !990, inlinedAt: !1006)
!1049 = !DILocation(line: 651, column: 3, scope: !990, inlinedAt: !1006)
!1050 = !DILocation(line: 655, column: 29, scope: !990, inlinedAt: !1006)
!1051 = !DILocation(line: 655, column: 15, scope: !990, inlinedAt: !1006)
!1052 = !DILocation(line: 656, column: 7, scope: !1053, inlinedAt: !1006)
!1053 = distinct !DILexicalBlock(scope: !990, file: !38, line: 656, column: 7)
!1054 = !DILocation(line: 656, column: 19, scope: !1053, inlinedAt: !1006)
!1055 = !DILocation(line: 656, column: 22, scope: !1053, inlinedAt: !1006)
!1056 = !DILocation(line: 656, column: 7, scope: !990, inlinedAt: !1006)
!1057 = !DILocation(line: 662, column: 7, scope: !1058, inlinedAt: !1006)
!1058 = distinct !DILexicalBlock(scope: !1053, file: !38, line: 657, column: 5)
!1059 = !DILocation(line: 664, column: 5, scope: !1058, inlinedAt: !1006)
!1060 = !DILocation(line: 665, column: 3, scope: !990, inlinedAt: !1006)
!1061 = !DILocation(line: 667, column: 3, scope: !990, inlinedAt: !1006)
!1062 = !DILocation(line: 669, column: 1, scope: !990, inlinedAt: !1006)
!1063 = !DILocation(line: 187, column: 3, scope: !984)
!1064 = !DILocation(line: 209, column: 11, scope: !60)
!1065 = !DILocation(line: 209, column: 24, scope: !60)
!1066 = !DILocation(line: 211, column: 8, scope: !60)
!1067 = !DILocation(line: 212, column: 3, scope: !60)
!1068 = !DILocation(line: 213, column: 8, scope: !60)
!1069 = !DILocation(line: 217, column: 21, scope: !60)
!1070 = !DILocation(line: 217, column: 3, scope: !60)
!1071 = !DILocation(line: 218, column: 3, scope: !60)
!1072 = !DILocation(line: 219, column: 3, scope: !60)
!1073 = !DILocation(line: 220, column: 3, scope: !60)
!1074 = !DILocation(line: 222, column: 3, scope: !60)
!1075 = !DILocation(line: 212, column: 21, scope: !60)
!1076 = !DILocalVariable(name: "x", arg: 1, scope: !1077, file: !3, line: 191, type: !1080)
!1077 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 191, type: !1078, isLocal: true, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1081)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!1081 = !{!1076}
!1082 = !DILocation(line: 191, column: 36, scope: !1077, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 224, column: 3, scope: !60)
!1084 = !DILocation(line: 193, column: 27, scope: !1077, inlinedAt: !1083)
!1085 = !{!1086, !1087, i64 0}
