source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.24 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 63, type: !117, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !57, nameTableKind: None)
!3 = !DIFile(filename: "src/rm.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !12, !17, !31, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !6, line: 23, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/remove.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "interactive_type", file: !3, line: 56, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "interactive_never", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "interactive_once", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "interactive_always", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 32, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !6, line: 78, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !39, file: !38, line: 187, baseType: !7, size: 32, elements: !49)
!38 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = distinct !DISubprogram(name: "select_plural", scope: !38, file: !38, line: 183, type: !40, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !47)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43}
!42 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !44, line: 102, baseType: !45)
!44 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !46, line: 73, baseType: !42)
!46 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!47 = !{!48}
!48 = !DILocalVariable(name: "n", arg: 1, scope: !39, file: !38, line: 183, type: !43)
!49 = !{!50}
!50 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!51 = !{!52, !54, !56}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !{!58, !0, !103, !109}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !60, file: !3, line: 345, type: !80, isLocal: true, isDefinition: true)
!60 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 209, type: !61, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !65)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !63, !64}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!65 = !{!66, !67, !68, !70, !94, !95, !96, !100, !101, !102}
!66 = !DILocalVariable(name: "argc", arg: 1, scope: !60, file: !3, line: 209, type: !63)
!67 = !DILocalVariable(name: "argv", arg: 2, scope: !60, file: !3, line: 209, type: !64)
!68 = !DILocalVariable(name: "preserve_root", scope: !60, file: !3, line: 211, type: !69)
!69 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DILocalVariable(name: "x", scope: !60, file: !3, line: 212, type: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !6, line: 32, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !90, !91, !92, !93}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !71, file: !6, line: 35, baseType: !69, size: 8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !71, file: !6, line: 38, baseType: !5, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !71, file: !6, line: 47, baseType: !69, size: 8, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !71, file: !6, line: 50, baseType: !69, size: 8, offset: 72)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !71, file: !6, line: 53, baseType: !69, size: 8, offset: 80)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !71, file: !6, line: 57, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !81, line: 7, size: 128, elements: !82)
!81 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!82 = !{!83, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !80, file: !81, line: 9, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !85, line: 47, baseType: !86)
!85 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !46, line: 148, baseType: !42)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !80, file: !81, line: 10, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !85, line: 59, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !46, line: 145, baseType: !42)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !71, file: !6, line: 61, baseType: !69, size: 8, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !71, file: !6, line: 64, baseType: !69, size: 8, offset: 200)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !71, file: !6, line: 67, baseType: !69, size: 8, offset: 208)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !71, file: !6, line: 75, baseType: !69, size: 8, offset: 216)
!94 = !DILocalVariable(name: "prompt_once", scope: !60, file: !3, line: 213, type: !69)
!95 = !DILocalVariable(name: "c", scope: !60, file: !3, line: 214, type: !63)
!96 = !DILocalVariable(name: "i", scope: !97, file: !3, line: 262, type: !63)
!97 = distinct !DILexicalBlock(scope: !98, file: !3, line: 261, column: 11)
!98 = distinct !DILexicalBlock(scope: !99, file: !3, line: 232, column: 9)
!99 = distinct !DILexicalBlock(scope: !60, file: !3, line: 230, column: 5)
!100 = !DILocalVariable(name: "n_files", scope: !60, file: !3, line: 352, type: !43)
!101 = !DILocalVariable(name: "file", scope: !60, file: !3, line: 353, type: !64)
!102 = !DILocalVariable(name: "status", scope: !60, file: !3, line: 370, type: !31)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "interactive_types", scope: !2, file: !3, line: 92, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 192, elements: !107)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!107 = !{!108}
!108 = !DISubrange(count: 6)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "interactive_args", scope: !2, file: !3, line: 86, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 448, elements: !115)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!115 = !{!116}
!116 = !DISubrange(count: 7)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 3072, elements: !127)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !120, line: 50, size: 256, elements: !121)
!120 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!121 = !{!122, !123, !124, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 52, baseType: !113, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !119, file: !120, line: 55, baseType: !63, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !119, file: !120, line: 56, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !120, line: 57, baseType: !63, size: 32, offset: 192)
!127 = !{!128}
!128 = !DISubrange(count: 12)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "Version", scope: !131, file: !132, line: 2, type: !113, isDefinition: true)
!131 = distinct !DICompileUnit(language: DW_LANG_C99, file: !132, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, globals: !134, nameTableKind: None)
!132 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!133 = !{}
!134 = !{!129}
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !137, file: !138, line: 67, type: !143, isDefinition: true)
!137 = distinct !DICompileUnit(language: DW_LANG_C99, file: !138, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !139, retainedTypes: !140, globals: !142, nameTableKind: None)
!138 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !{!17}
!140 = !{!56, !113, !141}
!141 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!142 = !{!135}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !144, line: 61, baseType: !145)
!144 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "file_name", scope: !150, file: !151, line: 37, type: !113, isLocal: true, isDefinition: true)
!150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !151, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, globals: !152, nameTableKind: None)
!151 = !DIFile(filename: "lib/closein.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!152 = !{!148}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "file_name", scope: !155, file: !156, line: 46, type: !113, isLocal: true, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, globals: !157, nameTableKind: None)
!156 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !{!153, !158}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !155, file: !156, line: 56, type: !69, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "exit_failure", scope: !162, file: !163, line: 24, type: !165, isDefinition: true)
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, globals: !164, nameTableKind: None)
!163 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!164 = !{!160}
!165 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "program_name", scope: !168, file: !169, line: 33, type: !113, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !170, globals: !171, nameTableKind: None)
!169 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !{!56, !54}
!171 = !{!166}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !174, file: !175, line: 85, type: !238, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !176, retainedTypes: !197, globals: !201, nameTableKind: None)
!175 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !{!17, !177, !182}
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 242, baseType: !7, size: 32, elements: !178)
!178 = !{!179, !180, !181}
!179 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!180 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!181 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 46, baseType: !7, size: 32, elements: !184)
!183 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!185 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!186 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!187 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!188 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!189 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!190 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!191 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!192 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!193 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!194 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!195 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!196 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!197 = !{!63, !198, !199, !54}
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !200, line: 46, baseType: !42)
!200 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!201 = !{!172, !202, !208, !220, !222, !227, !234, !236}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !174, file: !175, line: 101, type: !204, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 320, elements: !206)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!206 = !{!207}
!207 = !DISubrange(count: 10)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !174, file: !175, line: 1052, type: !210, isDefinition: true)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !175, line: 65, size: 448, elements: !211)
!211 = !{!212, !213, !214, !218, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !210, file: !175, line: 68, baseType: !17, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !210, file: !175, line: 71, baseType: !63, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !210, file: !175, line: 75, baseType: !215, size: 256, offset: 64)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 8)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !210, file: !175, line: 78, baseType: !113, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !210, file: !175, line: 81, baseType: !113, size: 64, offset: 384)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !174, file: !175, line: 116, type: !210, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "slot0", scope: !174, file: !175, line: 842, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 256)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "slotvec", scope: !174, file: !175, line: 845, type: !229, isLocal: true, isDefinition: true)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !175, line: 834, size: 128, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !175, line: 836, baseType: !199, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !230, file: !175, line: 837, baseType: !54, size: 64, offset: 64)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "nslots", scope: !174, file: !175, line: 843, type: !63, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "slotvec0", scope: !174, file: !175, line: 844, type: !230, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 704, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 11)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !243, file: !244, line: 26, type: !246, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, globals: !245, nameTableKind: None)
!244 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !{!241}
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 376, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 47)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!250 = distinct !DIGlobalVariable(name: "initialized", scope: !251, file: !252, line: 34, type: !69, isLocal: true, isDefinition: true)
!251 = distinct !DISubprogram(name: "can_write_any_file", scope: !252, file: !252, line: 32, type: !253, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !255, retainedNodes: !260)
!252 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !DISubroutineType(types: !254)
!254 = !{!69}
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, globals: !256, nameTableKind: None)
!256 = !{!257, !258}
!257 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "can_write", scope: !251, file: !252, line: 35, type: !69, isLocal: true, isDefinition: true)
!260 = !{!261}
!261 = !DILocalVariable(name: "can", scope: !262, file: !252, line: 39, type: !69)
!262 = distinct !DILexicalBlock(scope: !263, file: !252, line: 38, column: 5)
!263 = distinct !DILexicalBlock(scope: !251, file: !252, line: 37, column: 7)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "default_tuning", scope: !266, file: !267, line: 130, type: !270, isLocal: true, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !268, globals: !269, nameTableKind: None)
!267 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = !{!42, !56, !199}
!269 = !{!264}
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !272, line: 65, baseType: !273)
!272 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !272, line: 53, size: 160, elements: !274)
!274 = !{!275, !277, !278, !279, !280}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !273, file: !272, line: 58, baseType: !276, size: 32)
!276 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !273, file: !272, line: 59, baseType: !276, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !273, file: !272, line: 60, baseType: !276, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !273, file: !272, line: 61, baseType: !276, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !273, file: !272, line: 62, baseType: !69, size: 8, offset: 128)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !283, file: !284, line: 507, type: !63, isLocal: true, isDefinition: true)
!283 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !284, file: !284, line: 488, type: !285, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !287, retainedNodes: !289)
!284 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!285 = !DISubroutineType(types: !286)
!286 = !{!63, !63, !63}
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, globals: !288, nameTableKind: None)
!288 = !{!281}
!289 = !{!290, !291, !292, !293, !296}
!290 = !DILocalVariable(name: "fd", arg: 1, scope: !283, file: !284, line: 488, type: !63)
!291 = !DILocalVariable(name: "target", arg: 2, scope: !283, file: !284, line: 488, type: !63)
!292 = !DILocalVariable(name: "result", scope: !283, file: !284, line: 490, type: !63)
!293 = !DILocalVariable(name: "flags", scope: !294, file: !284, line: 531, type: !63)
!294 = distinct !DILexicalBlock(scope: !295, file: !284, line: 530, column: 5)
!295 = distinct !DILexicalBlock(scope: !283, file: !284, line: 529, column: 7)
!296 = !DILocalVariable(name: "saved_errno", scope: !297, file: !284, line: 534, type: !63)
!297 = distinct !DILexicalBlock(scope: !298, file: !284, line: 533, column: 9)
!298 = distinct !DILexicalBlock(scope: !294, file: !284, line: 532, column: 11)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !301, retainedTypes: !323, nameTableKind: None)
!300 = !DIFile(filename: "src/remove.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !{!31, !5, !17, !302, !307, !311}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !300, line: 35, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIEnumerator(name: "T_UNKNOWN", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "T_NO", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "T_YES", value: 4, isUnsigned: true)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !300, line: 46, baseType: !7, size: 32, elements: !308)
!308 = !{!309, !310}
!309 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2, isUnsigned: true)
!310 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 97, baseType: !7, size: 32, elements: !313)
!312 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322}
!314 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!317 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!318 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!319 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!320 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!321 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!322 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!323 = !{!56, !63}
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !326, nameTableKind: None)
!325 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!326 = !{!54}
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!328 = !DIFile(filename: "lib/file-type.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !331, nameTableKind: None)
!330 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!331 = !{!56}
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !331, nameTableKind: None)
!333 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!334 = distinct !DICompileUnit(language: DW_LANG_C99, file: !335, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!335 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !338, retainedTypes: !331, nameTableKind: None)
!337 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!338 = !{!339}
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !337, line: 40, baseType: !7, size: 32, elements: !340)
!340 = !{!341}
!341 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !344, retainedTypes: !358, nameTableKind: None)
!343 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !{!345}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !347, file: !346, line: 186, baseType: !7, size: 32, elements: !356)
!346 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = distinct !DISubprogram(name: "x2nrealloc", scope: !346, file: !346, line: 174, type: !348, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !351)
!348 = !DISubroutineType(types: !349)
!349 = !{!56, !56, !350, !199}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!351 = !{!352, !353, !354, !355}
!352 = !DILocalVariable(name: "p", arg: 1, scope: !347, file: !346, line: 174, type: !56)
!353 = !DILocalVariable(name: "pn", arg: 2, scope: !347, file: !346, line: 174, type: !350)
!354 = !DILocalVariable(name: "s", arg: 3, scope: !347, file: !346, line: 174, type: !199)
!355 = !DILocalVariable(name: "n", scope: !347, file: !346, line: 176, type: !199)
!356 = !{!357}
!357 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!358 = !{!199, !54, !56}
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!360 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !331, nameTableKind: None)
!362 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!364 = !DIFile(filename: "lib/yesno.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !331, nameTableKind: None)
!366 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !331, nameTableKind: None)
!368 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!370 = !DIFile(filename: "lib/freadahead.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !331, nameTableKind: None)
!372 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !375, retainedTypes: !528, nameTableKind: None)
!374 = !DIFile(filename: "lib/fts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!375 = !{!376, !380, !385, !519, !522, !311, !525}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !374, line: 156, baseType: !7, size: 32, elements: !377)
!377 = !{!378, !379}
!378 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!379 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !374, line: 643, baseType: !7, size: 32, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!383 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!384 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !387, file: !386, line: 54, baseType: !7, size: 32, elements: !517)
!386 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!387 = distinct !DISubprogram(name: "setup_dir", scope: !386, file: !386, line: 50, type: !388, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !373, retainedNodes: !515)
!388 = !DISubroutineType(types: !389)
!389 = !{!69, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !392, line: 197, baseType: !393)
!392 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 80, size: 1024, elements: !394)
!394 = !{!395, !466, !467, !469, !470, !471, !472, !473, !474, !475, !482, !483, !486, !502}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !393, file: !392, line: 81, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !392, line: 199, size: 2112, elements: !398)
!398 = !{!399, !400, !401, !402, !406, !408, !409, !410, !411, !412, !413, !414, !415, !417, !418, !421, !422, !423, !424, !462}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !397, file: !392, line: 200, baseType: !396, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !397, file: !392, line: 201, baseType: !396, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !397, file: !392, line: 202, baseType: !396, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !397, file: !392, line: 203, baseType: !403, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !312, line: 127, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !312, line: 127, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !397, file: !392, line: 206, baseType: !407, size: 64, offset: 256)
!407 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !397, file: !392, line: 207, baseType: !56, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !397, file: !392, line: 208, baseType: !54, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !397, file: !392, line: 209, baseType: !54, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !397, file: !392, line: 210, baseType: !63, size: 32, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !397, file: !392, line: 211, baseType: !63, size: 32, offset: 544)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !397, file: !392, line: 212, baseType: !199, size: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !397, file: !392, line: 214, baseType: !390, size: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !397, file: !392, line: 218, baseType: !416, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !200, line: 35, baseType: !407)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !397, file: !392, line: 220, baseType: !199, size: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !397, file: !392, line: 225, baseType: !419, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !85, line: 74, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !46, line: 151, baseType: !42)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !397, file: !392, line: 241, baseType: !198, size: 16, offset: 896)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !397, file: !392, line: 245, baseType: !198, size: 16, offset: 912)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !397, file: !392, line: 251, baseType: !198, size: 16, offset: 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !397, file: !392, line: 253, baseType: !425, size: 1152, offset: 960)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 1152, elements: !460)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !427, line: 26, size: 1152, elements: !428)
!427 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!428 = !{!429, !430, !431, !432, !434, !436, !438, !439, !440, !442, !444, !446, !454, !455, !456}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !426, file: !427, line: 28, baseType: !89, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !426, file: !427, line: 33, baseType: !86, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !426, file: !427, line: 41, baseType: !420, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !426, file: !427, line: 42, baseType: !433, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !46, line: 150, baseType: !7)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !426, file: !427, line: 44, baseType: !435, size: 32, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !46, line: 146, baseType: !7)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !426, file: !427, line: 45, baseType: !437, size: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !46, line: 147, baseType: !7)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !426, file: !427, line: 47, baseType: !63, size: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !426, file: !427, line: 49, baseType: !89, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !426, file: !427, line: 54, baseType: !441, size: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 152, baseType: !407)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !426, file: !427, line: 58, baseType: !443, size: 64, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !46, line: 175, baseType: !407)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !426, file: !427, line: 60, baseType: !445, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !46, line: 180, baseType: !407)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !426, file: !427, line: 71, baseType: !447, size: 128, offset: 576)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !448, line: 10, size: 128, elements: !449)
!448 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!449 = !{!450, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !447, file: !448, line: 12, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !46, line: 160, baseType: !407)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !447, file: !448, line: 16, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !46, line: 197, baseType: !407)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !426, file: !427, line: 72, baseType: !447, size: 128, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !426, file: !427, line: 73, baseType: !447, size: 128, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !426, file: !427, line: 86, baseType: !457, size: 192, offset: 960)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 192, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 3)
!460 = !{!461}
!461 = !DISubrange(count: 1)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !397, file: !392, line: 254, baseType: !463, offset: 2112)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: -1)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !393, file: !392, line: 82, baseType: !396, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !393, file: !392, line: 83, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !393, file: !392, line: 84, baseType: !88, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !393, file: !392, line: 85, baseType: !54, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !393, file: !392, line: 86, baseType: !63, size: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !393, file: !392, line: 87, baseType: !63, size: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !393, file: !392, line: 89, baseType: !199, size: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !393, file: !392, line: 90, baseType: !199, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !393, file: !392, line: 91, baseType: !476, size: 64, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!63, !479, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !393, file: !392, line: 160, baseType: !63, size: 32, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !393, file: !392, line: 169, baseType: !484, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !392, line: 169, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !393, file: !392, line: 191, baseType: !487, size: 64, offset: 704)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !393, file: !392, line: 171, size: 64, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !487, file: !392, line: 184, baseType: !484, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !487, file: !392, line: 190, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !493, line: 28, size: 256, elements: !494)
!493 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!494 = !{!495, !500, !501}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !492, file: !493, line: 30, baseType: !496, size: 128)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !81, line: 7, size: 128, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !496, file: !81, line: 9, baseType: !84, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !496, file: !81, line: 10, baseType: !88, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !492, file: !493, line: 31, baseType: !43, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !492, file: !493, line: 32, baseType: !63, size: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !393, file: !392, line: 196, baseType: !503, size: 256, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !504, line: 39, baseType: !505)
!504 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !504, line: 31, size: 256, elements: !506)
!506 = !{!507, !511, !512, !513, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !505, file: !504, line: 33, baseType: !508, size: 128)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 4)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !505, file: !504, line: 34, baseType: !63, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !505, file: !504, line: 35, baseType: !7, size: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !505, file: !504, line: 36, baseType: !7, size: 32, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !505, file: !504, line: 37, baseType: !69, size: 8, offset: 224)
!515 = !{!516}
!516 = !DILocalVariable(name: "fts", arg: 1, scope: !387, file: !386, line: 50, type: !390)
!517 = !{!518}
!518 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!519 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !374, line: 686, baseType: !7, size: 32, elements: !520)
!520 = !{!521}
!521 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !374, line: 640, baseType: !7, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !374, line: 151, baseType: !7, size: 32, elements: !526)
!526 = !{!527}
!527 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!528 = !{!56, !419, !43, !54, !407, !529, !532}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!63, !52, !52}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !392, line: 255, baseType: !397)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !538, nameTableKind: None)
!537 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = !{!199}
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!540 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!542 = !DIFile(filename: "lib/cycle-check.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!544 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!546 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !549, nameTableKind: None)
!548 = !DIFile(filename: "lib/i-ring.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = !{!550}
!550 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !504, line: 20, baseType: !7, size: 32, elements: !551)
!551 = !{!552}
!552 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !555, retainedTypes: !331, nameTableKind: None)
!554 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = !{!556}
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !557, line: 41, baseType: !7, size: 32, elements: !558)
!557 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!559 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!560 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!561 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!562 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!563 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!564 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!565 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!566 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!567 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!568 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!569 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!570 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!571 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!572 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!573 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!574 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!575 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!576 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!577 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!578 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!579 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!580 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!581 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!582 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!583 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!584 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!585 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!586 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!587 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!588 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!589 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!590 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!591 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!592 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!593 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!594 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!595 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!596 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!597 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!598 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!599 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!600 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!601 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!602 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!603 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!604 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!605 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!606 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!607 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!608 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!667 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!670 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!671 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!672 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!673 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!674 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!675 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!676 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!677 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!678 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!679 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!680 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!681 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!754 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!827 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!828 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!829 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!830 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!831 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!832 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!833 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!834 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!835 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!836 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!837 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!838 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!839 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!840 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!841 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!843 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!844 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!845 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!846 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!847 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!848 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!874 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!875 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!876 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!877 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!878 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!883 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!884 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!885 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!886 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!942 = distinct !DICompileUnit(language: DW_LANG_C99, file: !943, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!943 = !DIFile(filename: "lib/openat-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!944 = distinct !DICompileUnit(language: DW_LANG_C99, file: !945, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!945 = !DIFile(filename: "lib/opendirat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, retainedTypes: !331, nameTableKind: None)
!947 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!949 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!951 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !133, nameTableKind: None)
!953 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!954 = !{!"clang version 12.0.1"}
!955 = !{i32 7, !"Dwarf Version", i32 4}
!956 = !{i32 2, !"Debug Info Version", i32 3}
!957 = !{i32 1, !"wchar_size", i32 4}
!958 = !{i32 7, !"PIC Level", i32 2}
!959 = !{i32 7, !"PIE Level", i32 2}
!960 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 127, type: !961, scopeLine: 128, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !963)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !63}
!963 = !{!964}
!964 = !DILocalVariable(name: "status", arg: 1, scope: !960, file: !3, line: 127, type: !63)
!965 = !DILocation(scope: !960)
!966 = !DILocation(line: 129, column: 14, scope: !967)
!967 = distinct !DILexicalBlock(scope: !960, file: !3, line: 129, column: 7)
!968 = !DILocation(line: 129, column: 7, scope: !960)
!969 = !DILocation(line: 130, column: 5, scope: !970)
!970 = distinct !DILexicalBlock(scope: !967, file: !3, line: 130, column: 5)
!971 = !{!972, !972, i64 0}
!972 = !{!"any pointer", !973, i64 0}
!973 = !{!"omnipotent char", !974, i64 0}
!974 = !{!"Simple C/C++ TBAA"}
!975 = !DILocation(line: 133, column: 7, scope: !976)
!976 = distinct !DILexicalBlock(scope: !967, file: !3, line: 132, column: 5)
!977 = !DILocation(line: 134, column: 7, scope: !976)
!978 = !DILocation(line: 140, column: 7, scope: !976)
!979 = !DILocation(line: 147, column: 7, scope: !976)
!980 = !DILocation(line: 152, column: 7, scope: !976)
!981 = !DILocation(line: 158, column: 7, scope: !976)
!982 = !DILocation(line: 163, column: 7, scope: !976)
!983 = !DILocation(line: 164, column: 7, scope: !976)
!984 = !DILocation(line: 165, column: 7, scope: !976)
!985 = !DILocation(line: 170, column: 7, scope: !976)
!986 = !DILocation(line: 179, column: 7, scope: !976)
!987 = !DILocalVariable(name: "program", arg: 1, scope: !988, file: !38, line: 634, type: !113)
!988 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !38, file: !38, line: 634, type: !989, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !991)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !113}
!991 = !{!987, !992, !999, !1000, !1002}
!992 = !DILocalVariable(name: "infomap", scope: !988, file: !38, line: 636, type: !993)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 896, elements: !115)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !988, file: !38, line: 636, size: 128, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !995, file: !38, line: 636, baseType: !113, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !995, file: !38, line: 636, baseType: !113, size: 64, offset: 64)
!999 = !DILocalVariable(name: "node", scope: !988, file: !38, line: 646, type: !113)
!1000 = !DILocalVariable(name: "map_prog", scope: !988, file: !38, line: 647, type: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!1002 = !DILocalVariable(name: "lc_messages", scope: !988, file: !38, line: 659, type: !113)
!1003 = !DILocation(scope: !988, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 185, column: 7, scope: !976)
!1005 = !DILocation(line: 636, column: 3, scope: !988, inlinedAt: !1004)
!1006 = !DILocation(line: 636, column: 67, scope: !988, inlinedAt: !1004)
!1007 = !DILocation(line: 647, column: 36, scope: !988, inlinedAt: !1004)
!1008 = !DILocation(line: 649, column: 3, scope: !988, inlinedAt: !1004)
!1009 = !DILocation(line: 649, column: 33, scope: !988, inlinedAt: !1004)
!1010 = !DILocation(line: 650, column: 13, scope: !988, inlinedAt: !1004)
!1011 = !DILocation(line: 649, column: 20, scope: !988, inlinedAt: !1004)
!1012 = !{!1013, !972, i64 0}
!1013 = !{!"infomap", !972, i64 0, !972, i64 8}
!1014 = !DILocation(line: 649, column: 10, scope: !988, inlinedAt: !1004)
!1015 = !DILocation(line: 649, column: 28, scope: !988, inlinedAt: !1004)
!1016 = distinct !{!1016, !1008, !1010, !1017}
!1017 = !{!"llvm.loop.mustprogress"}
!1018 = !DILocation(line: 652, column: 17, scope: !1019, inlinedAt: !1004)
!1019 = distinct !DILexicalBlock(scope: !988, file: !38, line: 652, column: 7)
!1020 = !{!1013, !972, i64 8}
!1021 = !DILocation(line: 652, column: 7, scope: !1019, inlinedAt: !1004)
!1022 = !DILocation(line: 652, column: 7, scope: !988, inlinedAt: !1004)
!1023 = !DILocation(line: 655, column: 3, scope: !988, inlinedAt: !1004)
!1024 = !DILocation(line: 659, column: 29, scope: !988, inlinedAt: !1004)
!1025 = !DILocation(line: 660, column: 7, scope: !1026, inlinedAt: !1004)
!1026 = distinct !DILexicalBlock(scope: !988, file: !38, line: 660, column: 7)
!1027 = !DILocation(line: 660, column: 19, scope: !1026, inlinedAt: !1004)
!1028 = !DILocation(line: 660, column: 22, scope: !1026, inlinedAt: !1004)
!1029 = !DILocation(line: 660, column: 7, scope: !988, inlinedAt: !1004)
!1030 = !DILocation(line: 666, column: 7, scope: !1031, inlinedAt: !1004)
!1031 = distinct !DILexicalBlock(scope: !1026, file: !38, line: 661, column: 5)
!1032 = !DILocation(line: 668, column: 5, scope: !1031, inlinedAt: !1004)
!1033 = !DILocation(line: 669, column: 3, scope: !988, inlinedAt: !1004)
!1034 = !DILocation(line: 671, column: 3, scope: !988, inlinedAt: !1004)
!1035 = !DILocation(line: 673, column: 1, scope: !988, inlinedAt: !1004)
!1036 = !DILocation(line: 187, column: 3, scope: !960)
!1037 = !DISubprogram(name: "dcgettext", scope: !1038, file: !1038, line: 51, type: !1039, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1038 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!54, !113, !113, !63}
!1041 = !DISubprogram(name: "fputs_unlocked", scope: !1042, file: !1042, line: 667, type: !1043, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1042 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!63, !113, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1047, line: 49, size: 1728, elements: !1048)
!1047 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1064, !1065, !1066, !1067, !1068, !1069, !1071, !1073, !1076, !1078, !1081, !1084, !1085, !1086, !1087, !1088}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1046, file: !1047, line: 51, baseType: !63, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1046, file: !1047, line: 54, baseType: !54, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1046, file: !1047, line: 55, baseType: !54, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1046, file: !1047, line: 56, baseType: !54, size: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1046, file: !1047, line: 57, baseType: !54, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1046, file: !1047, line: 58, baseType: !54, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1046, file: !1047, line: 59, baseType: !54, size: 64, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1046, file: !1047, line: 60, baseType: !54, size: 64, offset: 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1046, file: !1047, line: 61, baseType: !54, size: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1046, file: !1047, line: 64, baseType: !54, size: 64, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1046, file: !1047, line: 65, baseType: !54, size: 64, offset: 640)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1046, file: !1047, line: 66, baseType: !54, size: 64, offset: 704)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1046, file: !1047, line: 68, baseType: !1062, size: 64, offset: 768)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1047, line: 36, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1046, file: !1047, line: 70, baseType: !1045, size: 64, offset: 832)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1046, file: !1047, line: 72, baseType: !63, size: 32, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1046, file: !1047, line: 73, baseType: !63, size: 32, offset: 928)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1046, file: !1047, line: 74, baseType: !441, size: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1046, file: !1047, line: 77, baseType: !198, size: 16, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1046, file: !1047, line: 78, baseType: !1070, size: 8, offset: 1040)
!1070 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1046, file: !1047, line: 79, baseType: !1072, size: 8, offset: 1048)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, elements: !460)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1046, file: !1047, line: 81, baseType: !1074, size: 64, offset: 1088)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1047, line: 43, baseType: null)
