; ModuleID = 'coreutils-8.32/src/rmdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "remove_empty_parents", scope: !2, file: !3, line: 40, type: !28, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/rmdir.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !{!25, !26, !29, !31}
!25 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "ignore_fail_on_non_empty", scope: !2, file: !3, line: 44, type: !28, isLocal: true, isDefinition: true)
!28 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 47, type: !28, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 56, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1792, elements: !46)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !36, line: 50, size: 256, elements: !37)
!36 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!37 = !{!38, !41, !43, !45}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !36, line: 52, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !35, file: !36, line: 55, baseType: !42, size: 32, offset: 64)
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !35, file: !36, line: 56, baseType: !44, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !35, file: !36, line: 57, baseType: !42, size: 32, offset: 192)
!46 = !{!47}
!47 = !DISubrange(count: 7)
!48 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!49 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "Version", scope: !52, file: !53, line: 2, type: !39, isLocal: false, isDefinition: true)
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, globals: !55, splitDebugInlining: false, nameTableKind: None)
!53 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!54 = !{}
!55 = !{!50}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "file_name", scope: !58, file: !59, line: 46, type: !39, isLocal: true, isDefinition: true)
!58 = distinct !DICompileUnit(language: DW_LANG_C99, file: !59, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, globals: !60, splitDebugInlining: false, nameTableKind: None)
!59 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!60 = !{!56, !61}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !58, file: !59, line: 56, type: !28, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "exit_failure", scope: !65, file: !66, line: 24, type: !68, isLocal: false, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, globals: !67, splitDebugInlining: false, nameTableKind: None)
!66 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!67 = !{!63}
!68 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "program_name", scope: !71, file: !72, line: 33, type: !39, isLocal: false, isDefinition: true)
!71 = distinct !DICompileUnit(language: DW_LANG_C99, file: !72, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !73, globals: !74, splitDebugInlining: false, nameTableKind: None)
!72 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!73 = !{!23, !21}
!74 = !{!69}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !77, file: !78, line: 85, type: !142, isLocal: false, isDefinition: true)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !79, retainedTypes: !100, globals: !105, splitDebugInlining: false, nameTableKind: None)
!78 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!79 = !{!5, !80, !85}
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 46, baseType: !7, size: 32, elements: !87)
!86 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!88 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!89 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!90 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!91 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!92 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!93 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!94 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!95 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!96 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!99 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!100 = !{!42, !101, !102, !21}
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!104 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!105 = !{!75, !106, !112, !124, !126, !131, !138, !140}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !77, file: !78, line: 101, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 320, elements: !110)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!110 = !{!111}
!111 = !DISubrange(count: 10)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !77, file: !78, line: 1052, type: !114, isLocal: false, isDefinition: true)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !78, line: 65, size: 448, elements: !115)
!115 = !{!116, !117, !118, !122, !123}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !114, file: !78, line: 68, baseType: !5, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !114, file: !78, line: 71, baseType: !42, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !114, file: !78, line: 75, baseType: !119, size: 256, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !114, file: !78, line: 78, baseType: !39, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !114, file: !78, line: 81, baseType: !39, size: 64, offset: 384)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !77, file: !78, line: 116, type: !114, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "slot0", scope: !77, file: !78, line: 842, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 256)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "slotvec", scope: !77, file: !78, line: 845, type: !133, isLocal: true, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !78, line: 834, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !78, line: 836, baseType: !102, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !78, line: 837, baseType: !21, size: 64, offset: 64)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "nslots", scope: !77, file: !78, line: 843, type: !42, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "slotvec0", scope: !77, file: !78, line: 844, type: !134, isLocal: true, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 704, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!144 = !{!145}
!145 = !DISubrange(count: 11)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !148, file: !149, line: 26, type: !151, isLocal: false, isDefinition: true)
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !149, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, globals: !150, splitDebugInlining: false, nameTableKind: None)
!149 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !{!146}
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 376, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 47)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!155 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!156 = !{!157}
!157 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = distinct !DICompileUnit(language: DW_LANG_C99, file: !159, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, splitDebugInlining: false, nameTableKind: None)
!159 = !DIFile(filename: "lib/stripslash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !{!163}
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !161, line: 40, baseType: !7, size: 32, elements: !164)
!164 = !{!165}
!165 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!166 = !{!23}
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !183, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !{!170}
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !172, file: !171, line: 186, baseType: !7, size: 32, elements: !181)
!171 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = distinct !DISubprogram(name: "x2nrealloc", scope: !171, file: !171, line: 174, type: !173, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{!23, !23, !175, !102}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(name: "p", arg: 1, scope: !172, file: !171, line: 174, type: !23)
!178 = !DILocalVariable(name: "pn", arg: 2, scope: !172, file: !171, line: 174, type: !175)
!179 = !DILocalVariable(name: "s", arg: 3, scope: !172, file: !171, line: 174, type: !102)
!180 = !DILocalVariable(name: "n", scope: !172, file: !171, line: 176, type: !102)
!181 = !{!182}
!182 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!183 = !{!102, !21, !23}
!184 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, splitDebugInlining: false, nameTableKind: None)
!185 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !187, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!187 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !190, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!190 = !{!102}
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !195, splitDebugInlining: false, nameTableKind: None)
!194 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!195 = !{!21}
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !{!201}
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 41, baseType: !7, size: 32, elements: !203)
!202 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!204 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!205 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!206 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!207 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!208 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!209 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!210 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!211 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!212 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!213 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!214 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!215 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!216 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!217 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!218 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!219 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!220 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!221 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!222 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!223 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!224 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!225 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!226 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!227 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!228 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!229 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!230 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!231 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!232 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!233 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!234 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!235 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!236 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!237 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!238 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!239 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!240 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!241 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!242 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!243 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!244 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!245 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!246 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!247 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!248 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!249 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!250 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!251 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!252 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!253 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!254 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!255 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!256 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!257 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!258 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!259 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!260 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!261 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!262 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!263 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!264 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!265 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!266 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!267 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!268 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!269 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!270 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!271 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!312 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!315 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!316 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!317 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!318 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!319 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!320 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!321 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!322 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!323 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!324 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!325 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!326 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!399 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!472 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!473 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!474 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!475 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!476 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!477 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!478 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!479 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!480 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!481 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!482 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!483 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!484 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!485 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!486 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!488 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!489 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!490 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!491 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!492 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!493 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!519 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!520 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!521 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!522 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!523 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!528 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!529 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!530 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!531 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!595 = !{!"clang version 12.0.1"}
!596 = !{i32 7, !"Dwarf Version", i32 4}
!597 = !{i32 2, !"Debug Info Version", i32 3}
!598 = !{i32 1, !"wchar_size", i32 4}
!599 = !{i32 7, !"PIC Level", i32 2}
!600 = !{i32 7, !"PIE Level", i32 2}
!601 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 158, type: !602, scopeLine: 159, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !42}
!604 = !{!605}
!605 = !DILocalVariable(name: "status", arg: 1, scope: !601, file: !3, line: 158, type: !42)
!606 = !DILocation(line: 0, scope: !601)
!607 = !DILocation(line: 160, column: 14, scope: !608)
!608 = distinct !DILexicalBlock(scope: !601, file: !3, line: 160, column: 7)
!609 = !DILocation(line: 160, column: 7, scope: !601)
!610 = !DILocation(line: 161, column: 5, scope: !611)
!611 = distinct !DILexicalBlock(scope: !608, file: !3, line: 161, column: 5)
!612 = !{!613, !613, i64 0}
!613 = !{!"any pointer", !614, i64 0}
!614 = !{!"omnipotent char", !615, i64 0}
!615 = !{!"Simple C/C++ TBAA"}
!616 = !DILocation(line: 164, column: 7, scope: !617)
!617 = distinct !DILexicalBlock(scope: !608, file: !3, line: 163, column: 5)
!618 = !DILocation(line: 165, column: 7, scope: !617)
!619 = !DILocation(line: 172, column: 7, scope: !617)
!620 = !DILocation(line: 178, column: 7, scope: !617)
!621 = !DILocation(line: 179, column: 7, scope: !617)
!622 = !DILocalVariable(name: "program", arg: 1, scope: !623, file: !624, line: 634, type: !39)
!623 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !624, file: !624, line: 634, type: !625, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !627)
!624 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!625 = !DISubroutineType(types: !626)
!626 = !{null, !39}
!627 = !{!622, !628, !635, !636, !638}
!628 = !DILocalVariable(name: "infomap", scope: !623, file: !624, line: 636, type: !629)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 896, elements: !46)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !623, file: !624, line: 636, size: 128, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !631, file: !624, line: 636, baseType: !39, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !631, file: !624, line: 636, baseType: !39, size: 64, offset: 64)
!635 = !DILocalVariable(name: "node", scope: !623, file: !624, line: 646, type: !39)
!636 = !DILocalVariable(name: "map_prog", scope: !623, file: !624, line: 647, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!638 = !DILocalVariable(name: "lc_messages", scope: !623, file: !624, line: 659, type: !39)
!639 = !DILocation(line: 0, scope: !623, inlinedAt: !640)
!640 = distinct !DILocation(line: 180, column: 7, scope: !617)
!641 = !DILocation(line: 636, column: 3, scope: !623, inlinedAt: !640)
!642 = !DILocation(line: 636, column: 67, scope: !623, inlinedAt: !640)
!643 = !DILocation(line: 647, column: 36, scope: !623, inlinedAt: !640)
!644 = !DILocation(line: 649, column: 3, scope: !623, inlinedAt: !640)
!645 = !DILocation(line: 649, column: 33, scope: !623, inlinedAt: !640)
!646 = !DILocation(line: 650, column: 13, scope: !623, inlinedAt: !640)
!647 = !DILocation(line: 649, column: 20, scope: !623, inlinedAt: !640)
!648 = !{!649, !613, i64 0}
!649 = !{!"infomap", !613, i64 0, !613, i64 8}
!650 = !DILocation(line: 649, column: 10, scope: !623, inlinedAt: !640)
!651 = !DILocation(line: 649, column: 28, scope: !623, inlinedAt: !640)
!652 = distinct !{!652, !644, !646, !653}
!653 = !{!"llvm.loop.mustprogress"}
!654 = !DILocation(line: 652, column: 17, scope: !655, inlinedAt: !640)
!655 = distinct !DILexicalBlock(scope: !623, file: !624, line: 652, column: 7)
!656 = !{!649, !613, i64 8}
!657 = !DILocation(line: 652, column: 7, scope: !655, inlinedAt: !640)
!658 = !DILocation(line: 652, column: 7, scope: !623, inlinedAt: !640)
!659 = !DILocation(line: 655, column: 3, scope: !623, inlinedAt: !640)
!660 = !DILocation(line: 659, column: 29, scope: !623, inlinedAt: !640)
!661 = !DILocation(line: 660, column: 7, scope: !662, inlinedAt: !640)
!662 = distinct !DILexicalBlock(scope: !623, file: !624, line: 660, column: 7)
!663 = !DILocation(line: 660, column: 19, scope: !662, inlinedAt: !640)
!664 = !DILocation(line: 660, column: 22, scope: !662, inlinedAt: !640)
!665 = !DILocation(line: 660, column: 7, scope: !623, inlinedAt: !640)
!666 = !DILocation(line: 666, column: 7, scope: !667, inlinedAt: !640)
!667 = distinct !DILexicalBlock(scope: !662, file: !624, line: 661, column: 5)
!668 = !DILocation(line: 668, column: 5, scope: !667, inlinedAt: !640)
!669 = !DILocation(line: 669, column: 3, scope: !623, inlinedAt: !640)
!670 = !DILocation(line: 671, column: 3, scope: !623, inlinedAt: !640)
!671 = !DILocation(line: 673, column: 1, scope: !623, inlinedAt: !640)
!672 = !DILocation(line: 182, column: 3, scope: !601)
!673 = !DISubprogram(name: "dcgettext", scope: !674, file: !674, line: 51, type: !675, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!674 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!675 = !DISubroutineType(types: !676)
!676 = !{!21, !39, !39, !42}
!677 = !DISubprogram(name: "fputs_unlocked", scope: !678, file: !678, line: 667, type: !679, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!678 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!679 = !DISubroutineType(types: !680)
!680 = !{!42, !39, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !683, line: 49, size: 1728, elements: !684)
!683 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !700, !701, !702, !703, !707, !708, !710, !714, !717, !719, !722, !725, !726, !727, !728, !729}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !682, file: !683, line: 51, baseType: !42, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !682, file: !683, line: 54, baseType: !21, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !682, file: !683, line: 55, baseType: !21, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !682, file: !683, line: 56, baseType: !21, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !682, file: !683, line: 57, baseType: !21, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !682, file: !683, line: 58, baseType: !21, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !682, file: !683, line: 59, baseType: !21, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !682, file: !683, line: 60, baseType: !21, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !682, file: !683, line: 61, baseType: !21, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !682, file: !683, line: 64, baseType: !21, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !682, file: !683, line: 65, baseType: !21, size: 64, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !682, file: !683, line: 66, baseType: !21, size: 64, offset: 704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !682, file: !683, line: 68, baseType: !698, size: 64, offset: 768)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !683, line: 36, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !682, file: !683, line: 70, baseType: !681, size: 64, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !682, file: !683, line: 72, baseType: !42, size: 32, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !682, file: !683, line: 73, baseType: !42, size: 32, offset: 928)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !682, file: !683, line: 74, baseType: !704, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !705, line: 152, baseType: !706)
!705 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!706 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !682, file: !683, line: 77, baseType: !101, size: 16, offset: 1024)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !682, file: !683, line: 78, baseType: !709, size: 8, offset: 1040)
!709 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !682, file: !683, line: 79, baseType: !711, size: 8, offset: 1048)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 1)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !682, file: !683, line: 81, baseType: !715, size: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !683, line: 43, baseType: null)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !682, file: !683, line: 89, baseType: !718, size: 64, offset: 1152)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !705, line: 153, baseType: !706)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !682, file: !683, line: 91, baseType: !720, size: 64, offset: 1216)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !683, line: 37, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !682, file: !683, line: 92, baseType: !723, size: 64, offset: 1280)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !683, line: 38, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !682, file: !683, line: 93, baseType: !681, size: 64, offset: 1344)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !682, file: !683, line: 94, baseType: !23, size: 64, offset: 1408)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !682, file: !683, line: 95, baseType: !102, size: 64, offset: 1472)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !682, file: !683, line: 96, baseType: !42, size: 32, offset: 1536)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !682, file: !683, line: 98, baseType: !730, size: 160, offset: 1568)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 20)
!733 = !DISubprogram(name: "setlocale", scope: !734, file: !734, line: 122, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!734 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!735 = !DISubroutineType(types: !736)
!736 = !{!21, !42, !39}
!737 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 186, type: !738, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !741)
!738 = !DISubroutineType(types: !739)
!739 = !{!42, !42, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!741 = !{!742, !743, !744, !745, !746, !750}
!742 = !DILocalVariable(name: "argc", arg: 1, scope: !737, file: !3, line: 186, type: !42)
!743 = !DILocalVariable(name: "argv", arg: 2, scope: !737, file: !3, line: 186, type: !740)
!744 = !DILocalVariable(name: "ok", scope: !737, file: !3, line: 188, type: !28)
!745 = !DILocalVariable(name: "optc", scope: !737, file: !3, line: 189, type: !42)
!746 = !DILocalVariable(name: "dir", scope: !747, file: !3, line: 229, type: !21)
!747 = distinct !DILexicalBlock(scope: !748, file: !3, line: 228, column: 5)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 227, column: 3)
!749 = distinct !DILexicalBlock(scope: !737, file: !3, line: 227, column: 3)
!750 = !DILocalVariable(name: "rmdir_errno", scope: !751, file: !3, line: 237, type: !42)
!751 = distinct !DILexicalBlock(scope: !752, file: !3, line: 236, column: 9)
!752 = distinct !DILexicalBlock(scope: !747, file: !3, line: 235, column: 11)
!753 = !DILocation(line: 0, scope: !737)
!754 = !DILocation(line: 192, column: 21, scope: !737)
!755 = !DILocation(line: 192, column: 3, scope: !737)
!756 = !DILocation(line: 193, column: 3, scope: !737)
!757 = !DILocation(line: 194, column: 3, scope: !737)
!758 = !DILocation(line: 195, column: 3, scope: !737)
!759 = !DILocation(line: 197, column: 3, scope: !737)
!760 = !DILocation(line: 199, column: 24, scope: !737)
!761 = !DILocation(line: 201, column: 3, scope: !737)
!762 = !DILocation(line: 201, column: 18, scope: !737)
!763 = !DILocation(line: 210, column: 11, scope: !764)
!764 = distinct !DILexicalBlock(scope: !765, file: !3, line: 204, column: 9)
!765 = distinct !DILexicalBlock(scope: !737, file: !3, line: 202, column: 5)
!766 = !DILocation(line: 213, column: 11, scope: !764)
!767 = !DILocation(line: 214, column: 9, scope: !764)
!768 = !DILocation(line: 215, column: 9, scope: !764)
!769 = !DILocation(line: 217, column: 11, scope: !764)
!770 = !DILocation(line: 0, scope: !764)
!771 = distinct !{!771, !761, !772, !653}
!772 = !DILocation(line: 219, column: 5, scope: !737)
!773 = !DILocation(line: 221, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !737, file: !3, line: 221, column: 7)
!775 = !{!776, !776, i64 0}
!776 = !{!"int", !614, i64 0}
!777 = !DILocation(line: 221, column: 14, scope: !774)
!778 = !DILocation(line: 221, column: 7, scope: !737)
!779 = !DILocation(line: 227, column: 17, scope: !748)
!780 = !DILocation(line: 227, column: 3, scope: !749)
!781 = !DILocation(line: 223, column: 20, scope: !782)
!782 = distinct !DILexicalBlock(scope: !774, file: !3, line: 222, column: 5)
!783 = !DILocation(line: 223, column: 7, scope: !782)
!784 = !DILocation(line: 224, column: 7, scope: !782)
!785 = !DILocation(line: 229, column: 19, scope: !747)
!786 = !DILocation(line: 0, scope: !747)
!787 = !DILocation(line: 232, column: 11, scope: !788)
!788 = distinct !DILexicalBlock(scope: !747, file: !3, line: 232, column: 11)
!789 = !DILocation(line: 232, column: 11, scope: !747)
!790 = !DILocation(line: 233, column: 23, scope: !788)
!791 = !DILocation(line: 233, column: 31, scope: !788)
!792 = !DILocation(line: 233, column: 60, scope: !788)
!793 = !DILocation(line: 233, column: 9, scope: !788)
!794 = !DILocation(line: 235, column: 11, scope: !752)
!795 = !DILocation(line: 235, column: 23, scope: !752)
!796 = !DILocation(line: 235, column: 11, scope: !747)
!797 = !DILocation(line: 237, column: 29, scope: !751)
!798 = !DILocation(line: 0, scope: !751)
!799 = !DILocation(line: 238, column: 15, scope: !800)
!800 = distinct !DILexicalBlock(scope: !751, file: !3, line: 238, column: 15)
!801 = !DILocation(line: 238, column: 15, scope: !751)
!802 = !DILocation(line: 243, column: 34, scope: !751)
!803 = !DILocation(line: 243, column: 60, scope: !751)
!804 = !DILocation(line: 243, column: 11, scope: !751)
!805 = !DILocation(line: 245, column: 9, scope: !752)
!806 = !DILocation(line: 246, column: 16, scope: !807)
!807 = distinct !DILexicalBlock(scope: !752, file: !3, line: 246, column: 16)
!808 = !DILocation(line: 246, column: 16, scope: !752)
!809 = !DILocalVariable(name: "dir", arg: 1, scope: !810, file: !3, line: 114, type: !21)
!810 = distinct !DISubprogram(name: "remove_parents", scope: !3, file: !3, line: 114, type: !811, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!28, !21}
!813 = !{!809, !814, !815, !816}
!814 = !DILocalVariable(name: "slash", scope: !810, file: !3, line: 116, type: !21)
!815 = !DILocalVariable(name: "ok", scope: !810, file: !3, line: 117, type: !28)
!816 = !DILocalVariable(name: "rmdir_errno", scope: !817, file: !3, line: 136, type: !42)
!817 = distinct !DILexicalBlock(scope: !810, file: !3, line: 121, column: 5)
!818 = !DILocation(line: 0, scope: !810, inlinedAt: !819)
!819 = distinct !DILocation(line: 248, column: 17, scope: !820)
!820 = distinct !DILexicalBlock(scope: !807, file: !3, line: 247, column: 9)
!821 = !DILocation(line: 119, column: 3, scope: !810, inlinedAt: !819)
!822 = !DILocation(line: 120, column: 3, scope: !810, inlinedAt: !819)
!823 = !DILocation(line: 122, column: 15, scope: !817, inlinedAt: !819)
!824 = !DILocation(line: 123, column: 17, scope: !825, inlinedAt: !819)
!825 = distinct !DILexicalBlock(scope: !817, file: !3, line: 123, column: 11)
!826 = !DILocation(line: 123, column: 11, scope: !817, inlinedAt: !819)
!827 = !DILocation(line: 127, column: 20, scope: !817, inlinedAt: !819)
!828 = !DILocation(line: 127, column: 26, scope: !817, inlinedAt: !819)
!829 = !DILocation(line: 127, column: 29, scope: !817, inlinedAt: !819)
!830 = !{!614, !614, i64 0}
!831 = !DILocation(line: 127, column: 36, scope: !817, inlinedAt: !819)
!832 = !DILocation(line: 127, column: 7, scope: !817, inlinedAt: !819)
!833 = !DILocation(line: 128, column: 9, scope: !817, inlinedAt: !819)
!834 = distinct !{!834, !832, !835, !653}
!835 = !DILocation(line: 128, column: 11, scope: !817, inlinedAt: !819)
!836 = !DILocation(line: 0, scope: !817, inlinedAt: !819)
!837 = !DILocation(line: 129, column: 7, scope: !817, inlinedAt: !819)
!838 = !DILocation(line: 129, column: 16, scope: !817, inlinedAt: !819)
!839 = !DILocation(line: 132, column: 11, scope: !840, inlinedAt: !819)
!840 = distinct !DILexicalBlock(scope: !817, file: !3, line: 132, column: 11)
!841 = !DILocation(line: 132, column: 11, scope: !817, inlinedAt: !819)
!842 = !DILocation(line: 133, column: 23, scope: !840, inlinedAt: !819)
!843 = !DILocation(line: 133, column: 31, scope: !840, inlinedAt: !819)
!844 = !DILocation(line: 133, column: 60, scope: !840, inlinedAt: !819)
!845 = !DILocation(line: 133, column: 9, scope: !840, inlinedAt: !819)
!846 = !DILocation(line: 135, column: 13, scope: !817, inlinedAt: !819)
!847 = !DILocation(line: 135, column: 25, scope: !817, inlinedAt: !819)
!848 = !DILocation(line: 136, column: 25, scope: !817, inlinedAt: !819)
!849 = !DILocation(line: 138, column: 11, scope: !817, inlinedAt: !819)
!850 = !DILocation(line: 141, column: 15, scope: !851, inlinedAt: !819)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 141, column: 15)
!852 = distinct !DILexicalBlock(scope: !853, file: !3, line: 139, column: 9)
!853 = distinct !DILexicalBlock(scope: !817, file: !3, line: 138, column: 11)
!854 = !DILocation(line: 141, column: 15, scope: !852, inlinedAt: !819)
!855 = !DILocation(line: 148, column: 38, scope: !856, inlinedAt: !819)
!856 = distinct !DILexicalBlock(scope: !851, file: !3, line: 146, column: 13)
!857 = !DILocation(line: 149, column: 22, scope: !856, inlinedAt: !819)
!858 = !DILocation(line: 148, column: 15, scope: !856, inlinedAt: !819)
!859 = !DILocation(line: 248, column: 14, scope: !820)
!860 = !DILocation(line: 249, column: 9, scope: !820)
!861 = !DILocation(line: 188, column: 8, scope: !737)
!862 = !DILocation(line: 227, column: 25, scope: !748)
!863 = distinct !{!863, !780, !864, !653}
!864 = !DILocation(line: 250, column: 5, scope: !749)
!865 = !DILocation(line: 252, column: 10, scope: !737)
!866 = !DILocation(line: 253, column: 1, scope: !737)
!867 = !DISubprogram(name: "bindtextdomain", scope: !674, file: !674, line: 86, type: !868, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!868 = !DISubroutineType(types: !869)
!869 = !{!21, !39, !39}
!870 = !DISubprogram(name: "textdomain", scope: !674, file: !674, line: 82, type: !871, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!871 = !DISubroutineType(types: !872)
!872 = !{!21, !39}
!873 = !DISubprogram(name: "atexit", scope: !874, file: !874, line: 595, type: !875, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!874 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!875 = !DISubroutineType(types: !876)
!876 = !{!42, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null}
!880 = !DISubprogram(name: "getopt_long", scope: !36, file: !36, line: 66, type: !881, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!881 = !DISubroutineType(types: !882)
!882 = !{!42, !42, !883, !39, !885, !44}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!886 = !DISubprogram(name: "error", scope: !887, file: !887, line: 52, type: !888, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!887 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!888 = !DISubroutineType(types: !889)
!889 = !{null, !42, !42, !39, null}
!890 = !DISubprogram(name: "rmdir", scope: !891, file: !891, line: 847, type: !892, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!891 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!892 = !DISubroutineType(types: !893)
!893 = !{!42, !39}
!894 = distinct !DISubprogram(name: "ignorable_failure", scope: !3, file: !3, line: 99, type: !895, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{!28, !42, !39}
!897 = !{!898, !899}
!898 = !DILocalVariable(name: "error_number", arg: 1, scope: !894, file: !3, line: 99, type: !42)
!899 = !DILocalVariable(name: "dir", arg: 2, scope: !894, file: !3, line: 99, type: !39)
!900 = !DILocation(line: 0, scope: !894)
!901 = !DILocation(line: 101, column: 11, scope: !894)
!902 = !DILocation(line: 102, column: 11, scope: !894)
!903 = !DILocation(line: 103, column: 15, scope: !894)
!904 = !DILocalVariable(name: "fd_cwd", arg: 1, scope: !905, file: !624, line: 292, type: !42)
!905 = distinct !DISubprogram(name: "is_empty_dir", scope: !624, file: !624, line: 292, type: !895, scopeLine: 293, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !906)
!906 = !{!904, !907, !908, !913, !925, !926}
!907 = !DILocalVariable(name: "dir", arg: 2, scope: !905, file: !624, line: 292, type: !39)
!908 = !DILocalVariable(name: "dirp", scope: !905, file: !624, line: 294, type: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !911, line: 127, baseType: !912)
!911 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !911, line: 127, flags: DIFlagFwdDecl)
!913 = !DILocalVariable(name: "dp", scope: !905, file: !624, line: 295, type: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !917, line: 22, size: 2240, elements: !918)
!917 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!918 = !{!919, !921, !922, !923, !924}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !916, file: !917, line: 25, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !705, line: 148, baseType: !104)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !916, file: !917, line: 26, baseType: !704, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !916, file: !917, line: 31, baseType: !101, size: 16, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !916, file: !917, line: 32, baseType: !157, size: 8, offset: 144)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !916, file: !917, line: 33, baseType: !128, size: 2048, offset: 152)
!925 = !DILocalVariable(name: "saved_errno", scope: !905, file: !624, line: 296, type: !42)
!926 = !DILocalVariable(name: "fd", scope: !905, file: !624, line: 297, type: !42)
!927 = !DILocation(line: 0, scope: !905, inlinedAt: !928)
!928 = distinct !DILocation(line: 104, column: 24, scope: !894)
!929 = !DILocation(line: 297, column: 12, scope: !905, inlinedAt: !928)
!930 = !DILocation(line: 301, column: 10, scope: !931, inlinedAt: !928)
!931 = distinct !DILexicalBlock(scope: !905, file: !624, line: 301, column: 7)
!932 = !DILocation(line: 301, column: 7, scope: !905, inlinedAt: !928)
!933 = !DILocation(line: 304, column: 10, scope: !905, inlinedAt: !928)
!934 = !DILocation(line: 305, column: 12, scope: !935, inlinedAt: !928)
!935 = distinct !DILexicalBlock(scope: !905, file: !624, line: 305, column: 7)
!936 = !DILocation(line: 305, column: 7, scope: !905, inlinedAt: !928)
!937 = !DILocation(line: 307, column: 7, scope: !938, inlinedAt: !928)
!938 = distinct !DILexicalBlock(scope: !935, file: !624, line: 306, column: 5)
!939 = !DILocation(line: 308, column: 7, scope: !938, inlinedAt: !928)
!940 = !DILocation(line: 311, column: 3, scope: !905, inlinedAt: !928)
!941 = !DILocation(line: 311, column: 9, scope: !905, inlinedAt: !928)
!942 = !DILocalVariable(name: "dirp", arg: 1, scope: !943, file: !624, line: 278, type: !909)
!943 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !624, file: !624, line: 278, type: !944, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !946)
!944 = !DISubroutineType(types: !945)
!945 = !{!914, !909}
!946 = !{!942, !947}
!947 = !DILocalVariable(name: "dp", scope: !948, file: !624, line: 282, type: !914)
!948 = distinct !DILexicalBlock(scope: !943, file: !624, line: 281, column: 5)
!949 = !DILocation(line: 0, scope: !943, inlinedAt: !950)
!950 = distinct !DILocation(line: 312, column: 8, scope: !905, inlinedAt: !928)
!951 = !DILocation(line: 282, column: 33, scope: !948, inlinedAt: !950)
!952 = !DILocation(line: 0, scope: !948, inlinedAt: !950)
!953 = !DILocation(line: 283, column: 14, scope: !954, inlinedAt: !950)
!954 = distinct !DILexicalBlock(scope: !948, file: !624, line: 283, column: 11)
!955 = !DILocation(line: 283, column: 22, scope: !954, inlinedAt: !950)
!956 = !DILocation(line: 283, column: 42, scope: !954, inlinedAt: !950)
!957 = !DILocalVariable(name: "file_name", arg: 1, scope: !958, file: !624, line: 265, type: !39)
!958 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !624, file: !624, line: 265, type: !959, scopeLine: 266, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !961)
!959 = !DISubroutineType(types: !960)
!960 = !{!28, !39}
!961 = !{!957, !962}
!962 = !DILocalVariable(name: "sep", scope: !963, file: !624, line: 269, type: !22)
!963 = distinct !DILexicalBlock(scope: !964, file: !624, line: 268, column: 5)
!964 = distinct !DILexicalBlock(scope: !958, file: !624, line: 267, column: 7)
!965 = !DILocation(line: 0, scope: !958, inlinedAt: !966)
!966 = distinct !DILocation(line: 283, column: 27, scope: !954, inlinedAt: !950)
!967 = !DILocation(line: 267, column: 7, scope: !964, inlinedAt: !966)
!968 = !DILocation(line: 267, column: 20, scope: !964, inlinedAt: !966)
!969 = !DILocation(line: 267, column: 7, scope: !958, inlinedAt: !966)
!970 = !DILocation(line: 269, column: 29, scope: !963, inlinedAt: !966)
!971 = !DILocation(line: 269, column: 42, scope: !963, inlinedAt: !966)
!972 = !DILocation(line: 269, column: 18, scope: !963, inlinedAt: !966)
!973 = !DILocation(line: 0, scope: !963, inlinedAt: !966)
!974 = !DILocation(line: 283, column: 11, scope: !948, inlinedAt: !950)
!975 = !DILocation(line: 313, column: 17, scope: !905, inlinedAt: !928)
!976 = !DILocation(line: 314, column: 3, scope: !905, inlinedAt: !928)
!977 = !DILocation(line: 315, column: 9, scope: !905, inlinedAt: !928)
!978 = !DILocation(line: 316, column: 10, scope: !979, inlinedAt: !928)
!979 = distinct !DILexicalBlock(scope: !905, file: !624, line: 316, column: 7)
!980 = !DILocation(line: 316, column: 7, scope: !905, inlinedAt: !928)
!981 = !DILocation(line: 105, column: 19, scope: !894)
!982 = !DILocation(line: 105, column: 22, scope: !894)
!983 = !DILocation(line: 105, column: 28, scope: !894)
!984 = !DILocation(line: 101, column: 3, scope: !894)
!985 = !DISubprogram(name: "openat", scope: !986, file: !986, line: 220, type: !987, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!986 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!987 = !DISubroutineType(types: !988)
!988 = !{!42, !42, !39, !42, null}
!989 = !DISubprogram(name: "fdopendir", scope: !911, file: !911, line: 141, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!990 = !DISubroutineType(types: !991)
!991 = !{!992, !42}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!993 = !DISubprogram(name: "close", scope: !891, file: !891, line: 353, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!994 = !DISubroutineType(types: !995)
!995 = !{!42, !42}
!996 = !DISubprogram(name: "readdir", scope: !911, file: !911, line: 162, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!997 = !DISubroutineType(types: !998)
!998 = !{!999, !992}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!1000 = !DISubprogram(name: "closedir", scope: !911, file: !911, line: 149, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!42, !992}
!1003 = distinct !DISubprogram(name: "prog_fprintf", scope: !155, file: !155, line: 28, type: !1004, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !1041)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null, !1006, !39, null}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1008, line: 7, baseType: !1009)
!1008 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !683, line: 49, size: 1728, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1009, file: !683, line: 51, baseType: !42, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1009, file: !683, line: 54, baseType: !21, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1009, file: !683, line: 55, baseType: !21, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1009, file: !683, line: 56, baseType: !21, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1009, file: !683, line: 57, baseType: !21, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1009, file: !683, line: 58, baseType: !21, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1009, file: !683, line: 59, baseType: !21, size: 64, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1009, file: !683, line: 60, baseType: !21, size: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1009, file: !683, line: 61, baseType: !21, size: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1009, file: !683, line: 64, baseType: !21, size: 64, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1009, file: !683, line: 65, baseType: !21, size: 64, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1009, file: !683, line: 66, baseType: !21, size: 64, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1009, file: !683, line: 68, baseType: !698, size: 64, offset: 768)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1009, file: !683, line: 70, baseType: !1025, size: 64, offset: 832)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1009, file: !683, line: 72, baseType: !42, size: 32, offset: 896)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1009, file: !683, line: 73, baseType: !42, size: 32, offset: 928)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1009, file: !683, line: 74, baseType: !704, size: 64, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1009, file: !683, line: 77, baseType: !101, size: 16, offset: 1024)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1009, file: !683, line: 78, baseType: !709, size: 8, offset: 1040)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1009, file: !683, line: 79, baseType: !711, size: 8, offset: 1048)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1009, file: !683, line: 81, baseType: !715, size: 64, offset: 1088)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1009, file: !683, line: 89, baseType: !718, size: 64, offset: 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1009, file: !683, line: 91, baseType: !720, size: 64, offset: 1216)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1009, file: !683, line: 92, baseType: !723, size: 64, offset: 1280)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1009, file: !683, line: 93, baseType: !1025, size: 64, offset: 1344)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1009, file: !683, line: 94, baseType: !23, size: 64, offset: 1408)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1009, file: !683, line: 95, baseType: !102, size: 64, offset: 1472)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1009, file: !683, line: 96, baseType: !42, size: 32, offset: 1536)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1009, file: !683, line: 98, baseType: !730, size: 160, offset: 1568)
!1041 = !{!1042, !1043, !1044}
!1042 = !DILocalVariable(name: "fp", arg: 1, scope: !1003, file: !155, line: 28, type: !1006)
!1043 = !DILocalVariable(name: "fmt", arg: 2, scope: !1003, file: !155, line: 28, type: !39)
!1044 = !DILocalVariable(name: "ap", scope: !1003, file: !155, line: 30, type: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !678, line: 52, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1047, line: 32, baseType: !1048)
!1047 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stdarg.h", directory: "")
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !155, baseType: !1049)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 192, elements: !712)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1050, file: !155, line: 30, baseType: !7, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1050, file: !155, line: 30, baseType: !7, size: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1050, file: !155, line: 30, baseType: !23, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1050, file: !155, line: 30, baseType: !23, size: 64, offset: 128)
!1056 = !DILocation(line: 0, scope: !1003)
!1057 = !DILocation(line: 30, column: 3, scope: !1003)
!1058 = !DILocation(line: 30, column: 11, scope: !1003)
!1059 = !DILocation(line: 31, column: 3, scope: !1003)
!1060 = !DILocation(line: 32, column: 3, scope: !1003)
!1061 = !DILocation(line: 33, column: 3, scope: !1003)
!1062 = !DILocalVariable(name: "__stream", arg: 1, scope: !1063, file: !1064, line: 132, type: !1067)
!1063 = distinct !DISubprogram(name: "vfprintf", scope: !1064, file: !1064, line: 132, type: !1065, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !1070)
!1064 = !DIFile(filename: "/usr/include/bits/stdio2.h", directory: "")
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!42, !1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1006)
!1068 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1070 = !{!1062, !1071, !1072}
!1071 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1063, file: !1064, line: 133, type: !1068)
!1072 = !DILocalVariable(name: "__ap", arg: 3, scope: !1063, file: !1064, line: 133, type: !1069)
!1073 = !DILocation(line: 0, scope: !1063, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 34, column: 3, scope: !1003)
!1075 = !DILocation(line: 135, column: 10, scope: !1063, inlinedAt: !1074)
!1076 = !DILocation(line: 35, column: 3, scope: !1003)
!1077 = !DILocalVariable(name: "__c", arg: 1, scope: !1078, file: !1079, line: 91, type: !42)
!1078 = distinct !DISubprogram(name: "fputc_unlocked", scope: !1079, file: !1079, line: 91, type: !1080, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !1082)
!1079 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!42, !42, !1006}
!1082 = !{!1077, !1083}
!1083 = !DILocalVariable(name: "__stream", arg: 2, scope: !1078, file: !1079, line: 91, type: !1006)
!1084 = !DILocation(line: 0, scope: !1078, inlinedAt: !1085)
!1085 = distinct !DILocation(line: 36, column: 3, scope: !1003)
!1086 = !DILocation(line: 93, column: 10, scope: !1078, inlinedAt: !1085)
!1087 = !{!1088, !613, i64 40}
!1088 = !{!"_IO_FILE", !776, i64 0, !613, i64 8, !613, i64 16, !613, i64 24, !613, i64 32, !613, i64 40, !613, i64 48, !613, i64 56, !613, i64 64, !613, i64 72, !613, i64 80, !613, i64 88, !613, i64 96, !613, i64 104, !776, i64 112, !776, i64 116, !1089, i64 120, !1090, i64 128, !614, i64 130, !614, i64 131, !613, i64 136, !1089, i64 144, !613, i64 152, !613, i64 160, !613, i64 168, !613, i64 176, !1089, i64 184, !776, i64 192, !614, i64 196}
!1089 = !{!"long", !614, i64 0}
!1090 = !{!"short", !614, i64 0}
!1091 = !{!1088, !613, i64 48}
!1092 = !{!"branch_weights", i32 2000, i32 1}
!1093 = !DILocation(line: 37, column: 1, scope: !1003)
!1094 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !59, file: !59, line: 51, type: !625, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !58, retainedNodes: !1095)
!1095 = !{!1096}
!1096 = !DILocalVariable(name: "file", arg: 1, scope: !1094, file: !59, line: 51, type: !39)
!1097 = !DILocation(line: 0, scope: !1094)
!1098 = !DILocation(line: 53, column: 13, scope: !1094)
!1099 = !DILocation(line: 54, column: 1, scope: !1094)
!1100 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !59, file: !59, line: 88, type: !1101, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !58, retainedNodes: !1103)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !28}
!1103 = !{!1104}
!1104 = !DILocalVariable(name: "ignore", arg: 1, scope: !1100, file: !59, line: 88, type: !28)
!1105 = !DILocation(line: 0, scope: !1100)
!1106 = !DILocation(line: 90, column: 16, scope: !1100)
!1107 = !{!1108, !1108, i64 0}
!1108 = !{!"_Bool", !614, i64 0}
!1109 = !DILocation(line: 91, column: 1, scope: !1100)
!1110 = distinct !DISubprogram(name: "close_stdout", scope: !59, file: !59, line: 117, type: !878, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !58, retainedNodes: !1111)
!1111 = !{!1112}
!1112 = !DILocalVariable(name: "write_error", scope: !1113, file: !59, line: 122, type: !39)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !59, line: 121, column: 5)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !59, line: 119, column: 7)
!1115 = !DILocation(line: 119, column: 21, scope: !1114)
!1116 = !DILocation(line: 119, column: 7, scope: !1114)
!1117 = !DILocation(line: 119, column: 29, scope: !1114)
!1118 = !DILocation(line: 120, column: 7, scope: !1114)
!1119 = !DILocation(line: 120, column: 12, scope: !1114)
!1120 = !{i8 0, i8 2}
!1121 = !DILocation(line: 120, column: 25, scope: !1114)
!1122 = !DILocation(line: 120, column: 28, scope: !1114)
!1123 = !DILocation(line: 120, column: 34, scope: !1114)
!1124 = !DILocation(line: 119, column: 7, scope: !1110)
!1125 = !DILocation(line: 122, column: 33, scope: !1113)
!1126 = !DILocation(line: 0, scope: !1113)
!1127 = !DILocation(line: 123, column: 11, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1113, file: !59, line: 123, column: 11)
!1129 = !DILocation(line: 0, scope: !1128)
!1130 = !DILocation(line: 123, column: 11, scope: !1113)
!1131 = !DILocation(line: 124, column: 36, scope: !1128)
!1132 = !DILocation(line: 124, column: 9, scope: !1128)
!1133 = !DILocation(line: 127, column: 9, scope: !1128)
!1134 = !DILocation(line: 129, column: 14, scope: !1113)
!1135 = !DILocation(line: 129, column: 7, scope: !1113)
!1136 = !DILocation(line: 134, column: 42, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1110, file: !59, line: 134, column: 7)
!1138 = !DILocation(line: 134, column: 28, scope: !1137)
!1139 = !DILocation(line: 134, column: 50, scope: !1137)
!1140 = !DILocation(line: 134, column: 7, scope: !1110)
!1141 = !DILocation(line: 135, column: 12, scope: !1137)
!1142 = !DILocation(line: 135, column: 5, scope: !1137)
!1143 = !DILocation(line: 136, column: 1, scope: !1110)
!1144 = distinct !DISubprogram(name: "strip_trailing_slashes", scope: !159, file: !159, line: 31, type: !811, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !158, retainedNodes: !1145)
!1145 = !{!1146, !1147, !1148, !1149}
!1146 = !DILocalVariable(name: "file", arg: 1, scope: !1144, file: !159, line: 31, type: !21)
!1147 = !DILocalVariable(name: "base", scope: !1144, file: !159, line: 33, type: !21)
!1148 = !DILocalVariable(name: "base_lim", scope: !1144, file: !159, line: 34, type: !21)
!1149 = !DILocalVariable(name: "had_slash", scope: !1144, file: !159, line: 35, type: !28)
!1150 = !DILocation(line: 0, scope: !1144)
