source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1
@.str.2 = private unnamed_addr constant [187 x i8] c"Remove the DIRECTORY(ies), if they are empty.\0A\0A      --ignore-fail-on-non-empty\0A                  ignore each failure that is solely because a directory\0A                    is non-empty\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "remove_empty_parents", scope: !2, file: !3, line: 40, type: !184, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !185, nameTableKind: None)
!3 = !DIFile(filename: "src/rmdir.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !31, !92, !96, !100, !103, !106, !113, !25, !82, !128, !132, !136, !139, !143, !147, !151, !157, !160, !163, !180}
!21 = !DISubprogram(name: "dcgettext", scope: !22, file: !22, line: 51, type: !23, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!22 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !27, !27, !29}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !{}
!31 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !33, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!29, !27, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !38)
!37 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !54, !55, !56, !57, !61, !63, !65, !69, !72, !74, !77, !80, !81, !83, !87, !88}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !36, file: !37, line: 51, baseType: !29, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !36, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !36, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !36, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !36, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !36, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !36, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !36, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !36, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !36, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !36, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !36, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !36, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !37, line: 36, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !36, file: !37, line: 70, baseType: !35, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !36, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !36, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !36, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !59, line: 152, baseType: !60)
!59 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !36, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !36, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !36, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !36, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !37, line: 43, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !36, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !59, line: 153, baseType: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !36, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !37, line: 37, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !36, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !37, line: 38, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !36, file: !37, line: 93, baseType: !35, size: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !36, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !36, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!86 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !36, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !36, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DISubprogram(name: "set_program_name", scope: !93, file: !93, line: 37, type: !94, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!93 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !DISubroutineType(types: !95)
!95 = !{null, !27}
!96 = !DISubprogram(name: "setlocale", scope: !97, file: !97, line: 122, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!97 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{!25, !29, !27}
!100 = !DISubprogram(name: "bindtextdomain", scope: !22, file: !22, line: 86, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!101 = !DISubroutineType(types: !102)
!102 = !{!25, !27, !27}
!103 = !DISubprogram(name: "textdomain", scope: !22, file: !22, line: 82, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!104 = !DISubroutineType(types: !105)
!105 = !{!25, !27}
!106 = !DISubprogram(name: "atexit", scope: !107, file: !107, line: 595, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!107 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!29, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DISubprogram(name: "getopt_long", scope: !114, file: !114, line: 66, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!114 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!29, !29, !117, !27, !119, !126}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !114, line: 50, size: 256, elements: !122)
!122 = !{!123, !124, !125, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !114, line: 52, baseType: !27, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !121, file: !114, line: 55, baseType: !29, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !114, line: 56, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !114, line: 57, baseType: !29, size: 32, offset: 192)
!128 = !DISubprogram(name: "version_etc", scope: !129, file: !129, line: 69, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!129 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !35, !27, !27, !27, null}
!132 = !DISubprogram(name: "error", scope: !133, file: !133, line: 52, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!133 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !29, !29, !27, null}
!136 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!137 = !DISubroutineType(types: !138)
!138 = !{!25, !5, !27}
!139 = !DISubprogram(name: "prog_fprintf", scope: !140, file: !140, line: 22, type: !141, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!140 = !DIFile(filename: "src/prog-fprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !DISubroutineType(types: !142)
!142 = !{null, !35, !27, null}
!143 = !DISubprogram(name: "rmdir", scope: !144, file: !144, line: 834, type: !145, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!144 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!145 = !DISubroutineType(types: !146)
!146 = !{!29, !27}
!147 = !DISubprogram(name: "openat", scope: !148, file: !148, line: 220, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!148 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!149 = !DISubroutineType(types: !150)
!150 = !{!29, !29, !27, !29, null}
!151 = !DISubprogram(name: "fdopendir", scope: !152, file: !152, line: 141, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!152 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !29}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !152, line: 127, flags: DIFlagFwdDecl)
!157 = !DISubprogram(name: "close", scope: !144, file: !144, line: 353, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!158 = !DISubroutineType(types: !159)
!159 = !{!29, !29}
!160 = !DISubprogram(name: "closedir", scope: !152, file: !152, line: 149, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!161 = !DISubroutineType(types: !162)
!162 = !{!29, !155}
!163 = !DISubprogram(name: "readdir", scope: !152, file: !152, line: 162, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !155}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !168, line: 22, size: 2240, elements: !169)
!168 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!169 = !{!170, !172, !173, !174, !176}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !167, file: !168, line: 25, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !59, line: 148, baseType: !86)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !167, file: !168, line: 26, baseType: !58, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !167, file: !168, line: 31, baseType: !62, size: 16, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !167, file: !168, line: 32, baseType: !175, size: 8, offset: 144)
!175 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !167, file: !168, line: 33, baseType: !177, size: 2048, offset: 152)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 256)
!180 = !DISubprogram(name: "strip_trailing_slashes", scope: !181, file: !181, line: 48, type: !182, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!181 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !25}
!184 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!185 = !{!186, !187, !189, !191}
!186 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "ignore_fail_on_non_empty", scope: !2, file: !3, line: 44, type: !184, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 47, type: !184, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 56, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 1792, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 7)
!196 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!197 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "Version", scope: !200, file: !201, line: 2, type: !27, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !202, nameTableKind: None)
!201 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !{!198}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "file_name", scope: !205, file: !206, line: 46, type: !27, isLocal: true, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !207, globals: !245, nameTableKind: None)
!206 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !{!208, !21, !244, !132}
!208 = !DISubprogram(name: "close_stream", scope: !209, file: !209, line: 2, type: !210, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!209 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !DISubroutineType(types: !211)
!211 = !{!29, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !213, file: !37, line: 51, baseType: !29, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !213, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !213, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !213, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !213, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !213, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !213, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !213, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !213, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !213, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !213, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !213, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !213, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !213, file: !37, line: 70, baseType: !212, size: 64, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !213, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !213, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !213, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !213, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !213, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !213, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !213, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !213, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !213, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !213, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !213, file: !37, line: 93, baseType: !212, size: 64, offset: 1344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !213, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !213, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !213, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !213, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!244 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!245 = !{!203, !246}
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !205, file: !206, line: 56, type: !184, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "exit_failure", scope: !250, file: !251, line: 24, type: !253, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !252, nameTableKind: None)
!251 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = !{!248}
!253 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "program_name", scope: !256, file: !257, line: 33, type: !27, isDefinition: true)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !258, globals: !294, nameTableKind: None)
!257 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!258 = !{!82, !259, !25}
!259 = !DISubprogram(name: "fputs", scope: !32, file: !32, line: 626, type: !260, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!260 = !DISubroutineType(types: !261)
!261 = !{!29, !27, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !37, line: 51, baseType: !29, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !37, line: 70, baseType: !262, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !37, line: 93, baseType: !262, size: 64, offset: 1344)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!294 = !{!254}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !297, file: !298, line: 85, type: !415, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !299, retainedTypes: !320, globals: !391, nameTableKind: None)
!298 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!5, !300, !305}
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 46, baseType: !7, size: 32, elements: !307)
!306 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!308 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!309 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!310 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!311 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!312 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!313 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!314 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!315 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!316 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!317 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!318 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!319 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!320 = !{!321, !327, !343, !346, !29, !62, !349, !84, !366, !370, !21, !376, !380, !25, !384, !387, !388}
!321 = !DISubprogram(name: "xmemdup", scope: !322, file: !322, line: 62, type: !323, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!322 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = !DISubroutineType(types: !324)
!324 = !{!82, !325, !86}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!327 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !328, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!328 = !DISubroutineType(types: !329)
!329 = !{!25, !27, !86, !330, !331}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !298, line: 65, size: 448, elements: !334)
!334 = !{!335, !336, !337, !341, !342}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !333, file: !298, line: 68, baseType: !5, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !333, file: !298, line: 71, baseType: !29, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !333, file: !298, line: 75, baseType: !338, size: 256, offset: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !333, file: !298, line: 78, baseType: !27, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !333, file: !298, line: 81, baseType: !27, size: 64, offset: 384)
!343 = !DISubprogram(name: "free", scope: !107, file: !107, line: 565, type: !344, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !82}
!346 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !347, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!347 = !DISubroutineType(types: !348)
!348 = !{!25, !29, !27, !27, !27, !86}
!349 = !DISubprogram(name: "rpl_mbrtowc", scope: !350, file: !350, line: 717, type: !351, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!350 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!351 = !DISubroutineType(types: !352)
!352 = !{!86, !126, !27, !86, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 13, size: 64, elements: !356)
!355 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !354, file: !355, line: 15, baseType: !29, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !354, file: !355, line: 20, baseType: !359, size: 32, offset: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !354, file: !355, line: 16, size: 32, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !359, file: !355, line: 18, baseType: !7, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !359, file: !355, line: 19, baseType: !363, size: 32)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 4)
!366 = !DISubprogram(name: "iswprint", scope: !367, file: !367, line: 120, type: !368, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!367 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!368 = !DISubroutineType(types: !369)
!369 = !{!29, !7}
!370 = !DISubprogram(name: "mbsinit", scope: !371, file: !371, line: 292, type: !372, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!371 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!372 = !DISubroutineType(types: !373)
!373 = !{!29, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!376 = !DISubprogram(name: "locale_charset", scope: !377, file: !377, line: 35, type: !378, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!377 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!378 = !DISubroutineType(types: !379)
!379 = !{!27}
!380 = !DISubprogram(name: "c_strcasecmp", scope: !381, file: !381, line: 42, type: !382, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!381 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!382 = !DISubroutineType(types: !383)
!383 = !{!29, !27, !27}
!384 = !DISubprogram(name: "xmalloc", scope: !322, file: !322, line: 53, type: !385, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!385 = !DISubroutineType(types: !386)
!386 = !{!82, !86}
!387 = !DISubprogram(name: "xalloc_die", scope: !322, file: !322, line: 51, type: !111, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!388 = !DISubprogram(name: "xrealloc", scope: !322, file: !322, line: 59, type: !389, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!389 = !DISubroutineType(types: !390)
!390 = !{!82, !82, !86}
!391 = !{!295, !392, !398, !400, !402, !404, !411, !413}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !297, file: !298, line: 101, type: !394, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 320, elements: !396)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!396 = !{!397}
!397 = !DISubrange(count: 10)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !297, file: !298, line: 1052, type: !333, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !297, file: !298, line: 116, type: !333, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "slot0", scope: !297, file: !298, line: 842, type: !177, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "slotvec", scope: !297, file: !298, line: 845, type: !406, isLocal: true, isDefinition: true)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !298, line: 834, size: 128, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !407, file: !298, line: 836, baseType: !84, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !407, file: !298, line: 837, baseType: !25, size: 64, offset: 64)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "nslots", scope: !297, file: !298, line: 843, type: !29, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "slotvec0", scope: !297, file: !298, line: 844, type: !407, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 704, elements: !417)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!417 = !{!418}
!418 = !DISubrange(count: 11)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !421, file: !422, line: 26, type: !424, isDefinition: true)
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !423, nameTableKind: None)
!422 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!423 = !{!419}
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 376, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 47)
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !429, nameTableKind: None)
!428 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!429 = !{!430, !175}
!430 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !431, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!431 = !DISubroutineType(types: !432)
!432 = !{!29, !27, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !434, file: !37, line: 51, baseType: !29, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !434, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !434, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !434, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !434, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !434, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !434, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !434, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !434, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !434, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !434, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !434, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !434, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !434, file: !37, line: 70, baseType: !433, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !434, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !434, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !434, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !434, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !434, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !434, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !434, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !434, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !434, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !434, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !434, file: !37, line: 93, baseType: !433, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !434, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !434, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !434, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !434, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !467, nameTableKind: None)
!466 = !DIFile(filename: "lib/stripslash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!468, !469}
!468 = !DISubprogram(name: "last_component", scope: !181, file: !181, line: 46, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!469 = !DISubprogram(name: "base_len", scope: !181, file: !181, line: 44, type: !470, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!470 = !DISubroutineType(types: !471)
!471 = !{!86, !27}
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !474, retainedTypes: !478, nameTableKind: None)
!473 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!474 = !{!475}
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !473, line: 40, baseType: !7, size: 32, elements: !476)
!476 = !{!477}
!477 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!478 = !{!21, !479, !82}
!479 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !480, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!480 = !DISubroutineType(types: !481)
!481 = !{!29, !27, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !483, file: !37, line: 51, baseType: !29, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !483, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !483, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !483, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !483, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !483, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !483, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !483, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !483, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !483, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !483, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !483, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !483, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !483, file: !37, line: 70, baseType: !482, size: 64, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !483, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !483, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !483, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !483, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !483, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !483, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !483, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !483, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !483, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !483, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !483, file: !37, line: 93, baseType: !482, size: 64, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !483, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !483, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !483, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !483, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !516, retainedTypes: !529, nameTableKind: None)
!515 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!516 = !{!517}
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !518, file: !322, line: 186, baseType: !7, size: 32, elements: !527)
!518 = distinct !DISubprogram(name: "x2nrealloc", scope: !322, file: !322, line: 174, type: !519, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !514, retainedNodes: !522)
!519 = !DISubroutineType(types: !520)
!520 = !{!82, !82, !521, !84}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!522 = !{!523, !524, !525, !526}
!523 = !DILocalVariable(name: "p", arg: 1, scope: !518, file: !322, line: 174, type: !82)
!524 = !DILocalVariable(name: "pn", arg: 2, scope: !518, file: !322, line: 174, type: !521)
!525 = !DILocalVariable(name: "s", arg: 3, scope: !518, file: !322, line: 174, type: !84)
!526 = !DILocalVariable(name: "n", scope: !518, file: !322, line: 176, type: !84)
!527 = !{!528}
!528 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!529 = !{!84, !387, !384, !388, !25, !343, !82, !530, !533}
!530 = !DISubprogram(name: "xcalloc", scope: !322, file: !322, line: 57, type: !531, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!531 = !DISubroutineType(types: !532)
!532 = !{!82, !86, !86}
!533 = !DISubprogram(name: "rpl_calloc", scope: !534, file: !534, line: 688, type: !531, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!534 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !537, nameTableKind: None)
!536 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!537 = !{!21, !132}
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !540, nameTableKind: None)
!539 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!540 = !{!82}
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !543, nameTableKind: None)
!542 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!543 = !{!544, !84, !556}
!544 = !DISubprogram(name: "mbrtowc", scope: !371, file: !371, line: 296, type: !545, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!545 = !DISubroutineType(types: !546)
!546 = !{!86, !126, !27, !86, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 13, size: 64, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !548, file: !355, line: 15, baseType: !29, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !548, file: !355, line: 20, baseType: !552, size: 32, offset: 32)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !548, file: !355, line: 16, size: 32, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !552, file: !355, line: 18, baseType: !7, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !552, file: !355, line: 19, baseType: !363, size: 32)
!556 = !DISubprogram(name: "hard_locale", scope: !557, file: !557, line: 26, type: !558, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!557 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !DISubroutineType(types: !559)
!559 = !{!184, !29}
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !562, nameTableKind: None)
!561 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!562 = !{!563}
!563 = !DISubprogram(name: "rpl_fclose", scope: !564, file: !564, line: 672, type: !565, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!564 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!565 = !DISubroutineType(types: !566)
!566 = !{!29, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !568, file: !37, line: 51, baseType: !29, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !568, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !568, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !568, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !568, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !568, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !568, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !568, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !568, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !568, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !568, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !568, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !568, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !568, file: !37, line: 70, baseType: !567, size: 64, offset: 832)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !568, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !568, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !568, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !568, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !568, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !568, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !568, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !568, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !568, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !568, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !568, file: !37, line: 93, baseType: !567, size: 64, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !568, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !568, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !568, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !568, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !601, nameTableKind: None)
!600 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!601 = !{!25}
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !604, nameTableKind: None)
!603 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!604 = !{!605}
!605 = !DISubprogram(name: "setlocale_null_r", scope: !606, file: !606, line: 64, type: !607, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!606 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!607 = !DISubroutineType(types: !608)
!608 = !{!29, !29, !25, !86}
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !611, retainedTypes: !998, nameTableKind: None)
!610 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!611 = !{!612}
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 41, baseType: !7, size: 32, elements: !614)
!613 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!615 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!616 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!617 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!618 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!619 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!620 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!621 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!622 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!623 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!624 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!625 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!626 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!627 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!628 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!629 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!630 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!631 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!632 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!633 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!634 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!635 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!636 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!637 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!638 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!639 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!640 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!641 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!642 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!643 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!644 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!645 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!646 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!647 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!648 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!649 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!650 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!651 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!652 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!653 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!654 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!655 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!656 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!657 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!658 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!659 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!660 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!661 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!662 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!663 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!664 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!723 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!726 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!727 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!728 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!729 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!730 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!731 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!732 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!733 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!734 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!735 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!736 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!737 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!810 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!883 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!884 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!885 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!886 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!887 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!888 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!889 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!890 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!891 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!892 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!893 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!894 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!895 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!896 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!897 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!899 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!900 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!901 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!902 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!903 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!904 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!930 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!931 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!932 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!933 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!934 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!939 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!940 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!941 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!942 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!998 = !{!999, !82}
!999 = !DISubprogram(name: "nl_langinfo", scope: !613, file: !613, line: 661, type: !1000, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!25, !29}
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !1004, nameTableKind: None)
!1003 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1004 = !{!82, !96}
!1005 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1006, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !1007, nameTableKind: None)
!1006 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1007 = !{!1008, !1043, !1044, !1047}
!1008 = !DISubprogram(name: "fileno", scope: !32, file: !32, line: 786, type: !1009, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!29, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1012, file: !37, line: 51, baseType: !29, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1012, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1012, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1012, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
