source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [107 x i8] c"Usage: %s CONTEXT COMMAND [args]\0A  or:  %s [ -c ] [-u USER] [-r ROLE] [-t TYPE] [-l RANGE] COMMAND [args]\0A\00", align 1
@.str.2 = private unnamed_addr constant [126 x i8] c"Run a program in a different SELinux security context.\0AWith neither CONTEXT nor COMMAND, print the current security context.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !122, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !121, nameTableKind: None)
!3 = !DIFile(filename: "src/runcon.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !15, !76, !80, !84, !87, !90, !97, !112, !10, !66, !116, !120}
!6 = !DISubprogram(name: "dcgettext", scope: !7, file: !7, line: 51, type: !8, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !17, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!14, !12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !61, !64, !65, !67, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !14, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 152, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 153, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DISubprogram(name: "set_program_name", scope: !77, file: !77, line: 37, type: !78, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !12}
!80 = !DISubprogram(name: "setlocale", scope: !81, file: !81, line: 122, type: !82, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !14, !12}
!84 = !DISubprogram(name: "bindtextdomain", scope: !7, file: !7, line: 86, type: !85, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !12, !12}
!87 = !DISubprogram(name: "textdomain", scope: !7, file: !7, line: 82, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !12}
!90 = !DISubprogram(name: "atexit", scope: !91, file: !91, line: 595, type: !92, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!14, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "getopt_long", scope: !98, file: !98, line: 66, type: !99, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!98 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!14, !14, !101, !12, !103, !110}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !98, line: 50, size: 256, elements: !106)
!106 = !{!107, !108, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !98, line: 52, baseType: !12, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !105, file: !98, line: 55, baseType: !14, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !98, line: 56, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !98, line: 57, baseType: !14, size: 32, offset: 192)
!112 = !DISubprogram(name: "error", scope: !113, file: !113, line: 52, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!113 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !14, !14, !12, null}
!116 = !DISubprogram(name: "version_etc", scope: !117, file: !117, line: 69, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !19, !12, !12, !12, null}
!120 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !{!0}
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2048, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 8)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "Version", scope: !127, file: !128, line: 2, type: !12, isDefinition: true)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !128, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !129, nameTableKind: None)
!128 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!129 = !{!125}
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "file_name", scope: !132, file: !133, line: 46, type: !12, isLocal: true, isDefinition: true)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !134, globals: !173, nameTableKind: None)
!133 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !{!135, !6, !171, !112}
!135 = !DISubprogram(name: "close_stream", scope: !136, file: !136, line: 2, type: !137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!136 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!137 = !DISubroutineType(types: !138)
!138 = !{!14, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !140, file: !21, line: 51, baseType: !14, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !140, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !140, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !140, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !140, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !140, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !140, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !140, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !140, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !140, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !140, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !140, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !140, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !140, file: !21, line: 70, baseType: !139, size: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !140, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !140, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !140, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !140, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !140, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !140, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !140, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !140, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !140, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !140, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !140, file: !21, line: 93, baseType: !139, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !140, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !140, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !140, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !140, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!171 = !DISubprogram(name: "quotearg_colon", scope: !172, file: !172, line: 391, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!172 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !{!130, !174}
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !132, file: !133, line: 56, type: !176, isLocal: true, isDefinition: true)
!176 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "exit_failure", scope: !179, file: !180, line: 24, type: !182, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !181, nameTableKind: None)
!180 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !{!177}
!182 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "program_name", scope: !185, file: !186, line: 33, type: !12, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !187, globals: !223, nameTableKind: None)
!186 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !{!66, !188, !10}
!188 = !DISubprogram(name: "fputs", scope: !16, file: !16, line: 626, type: !189, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!189 = !DISubroutineType(types: !190)
!190 = !{!14, !12, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !192, file: !21, line: 51, baseType: !14, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !192, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !192, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !192, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !192, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !192, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !192, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !192, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !192, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !192, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !192, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !192, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !192, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !192, file: !21, line: 70, baseType: !191, size: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !192, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !192, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !192, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !192, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !192, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !192, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !192, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !192, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !192, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !192, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !192, file: !21, line: 93, baseType: !191, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !192, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !192, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !192, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !192, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!223 = !{!183}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !226, file: !227, line: 85, type: !359, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !228, retainedTypes: !263, globals: !332, nameTableKind: None)
!227 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !{!229, !243, !248}
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !172, line: 32, baseType: !230, size: 32, elements: !231)
!230 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!232 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!233 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!234 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!235 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!236 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!237 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!238 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!239 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!240 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!241 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!242 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !172, line: 242, baseType: !230, size: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 46, baseType: !230, size: 32, elements: !250)
!249 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!251 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!252 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!253 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!254 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!255 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!256 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!257 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!258 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!259 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!260 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!261 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!262 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!263 = !{!264, !270, !284, !287, !14, !46, !290, !68, !307, !311, !6, !317, !321, !10, !325, !328, !329}
!264 = !DISubprogram(name: "xmemdup", scope: !265, file: !265, line: 62, type: !266, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!265 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = !DISubroutineType(types: !267)
!267 = !{!66, !268, !70}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!270 = !DISubprogram(name: "quotearg_alloc_mem", scope: !172, file: !172, line: 342, type: !271, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!271 = !DISubroutineType(types: !272)
!272 = !{!10, !12, !70, !273, !274}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !227, line: 65, size: 448, elements: !277)
!277 = !{!278, !279, !280, !282, !283}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !276, file: !227, line: 68, baseType: !229, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !227, line: 71, baseType: !14, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !276, file: !227, line: 75, baseType: !281, size: 256, offset: 64)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 256, elements: !123)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !276, file: !227, line: 78, baseType: !12, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !276, file: !227, line: 81, baseType: !12, size: 64, offset: 384)
!284 = !DISubprogram(name: "free", scope: !91, file: !91, line: 565, type: !285, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !66}
!287 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !172, file: !172, line: 408, type: !288, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!288 = !DISubroutineType(types: !289)
!289 = !{!10, !14, !12, !12, !12, !70}
!290 = !DISubprogram(name: "rpl_mbrtowc", scope: !291, file: !291, line: 717, type: !292, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!291 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = !DISubroutineType(types: !293)
!293 = !{!70, !110, !12, !70, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 13, size: 64, elements: !297)
!296 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !296, line: 15, baseType: !14, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !296, line: 20, baseType: !300, size: 32, offset: 32)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !296, line: 16, size: 32, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !300, file: !296, line: 18, baseType: !230, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !300, file: !296, line: 19, baseType: !304, size: 32)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 4)
!307 = !DISubprogram(name: "iswprint", scope: !308, file: !308, line: 120, type: !309, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!308 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!309 = !DISubroutineType(types: !310)
!310 = !{!14, !230}
!311 = !DISubprogram(name: "mbsinit", scope: !312, file: !312, line: 292, type: !313, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!312 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!313 = !DISubroutineType(types: !314)
!314 = !{!14, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!317 = !DISubprogram(name: "locale_charset", scope: !318, file: !318, line: 35, type: !319, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!318 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !DISubroutineType(types: !320)
!320 = !{!12}
!321 = !DISubprogram(name: "c_strcasecmp", scope: !322, file: !322, line: 42, type: !323, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!322 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = !DISubroutineType(types: !324)
!324 = !{!14, !12, !12}
!325 = !DISubprogram(name: "xmalloc", scope: !265, file: !265, line: 53, type: !326, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!326 = !DISubroutineType(types: !327)
!327 = !{!66, !70}
!328 = !DISubprogram(name: "xalloc_die", scope: !265, file: !265, line: 51, type: !95, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!329 = !DISubprogram(name: "xrealloc", scope: !265, file: !265, line: 59, type: !330, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!330 = !DISubroutineType(types: !331)
!331 = !{!66, !66, !70}
!332 = !{!224, !333, !339, !341, !343, !348, !355, !357}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !226, file: !227, line: 101, type: !335, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 320, elements: !337)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!337 = !{!338}
!338 = !DISubrange(count: 10)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !226, file: !227, line: 1052, type: !276, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !226, file: !227, line: 116, type: !276, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "slot0", scope: !226, file: !227, line: 842, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 256)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "slotvec", scope: !226, file: !227, line: 845, type: !350, isLocal: true, isDefinition: true)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !227, line: 834, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !351, file: !227, line: 836, baseType: !68, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !351, file: !227, line: 837, baseType: !10, size: 64, offset: 64)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "nslots", scope: !226, file: !227, line: 843, type: !14, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "slotvec0", scope: !226, file: !227, line: 844, type: !351, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 704, elements: !361)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!361 = !{!362}
!362 = !DISubrange(count: 11)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !365, file: !366, line: 26, type: !368, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !367, nameTableKind: None)
!366 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!367 = !{!363}
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 47)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !373, retainedTypes: !377, nameTableKind: None)
!372 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !{!374}
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !372, line: 40, baseType: !230, size: 32, elements: !375)
!375 = !{!376}
!376 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!377 = !{!6, !378, !66}
!378 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !379, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!379 = !DISubroutineType(types: !380)
!380 = !{!14, !12, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !382, file: !21, line: 51, baseType: !14, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !382, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !382, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !382, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !382, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !382, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !382, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !382, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !382, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !382, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !382, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !382, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !382, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !382, file: !21, line: 70, baseType: !381, size: 64, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !382, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !382, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !382, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !382, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !382, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !382, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !382, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !382, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !382, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !382, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !382, file: !21, line: 93, baseType: !381, size: 64, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !382, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !382, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !382, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !382, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !415, retainedTypes: !428, nameTableKind: None)
!414 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!415 = !{!416}
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !417, file: !265, line: 186, baseType: !230, size: 32, elements: !426)
!417 = distinct !DISubprogram(name: "x2nrealloc", scope: !265, file: !265, line: 174, type: !418, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !413, retainedNodes: !421)
!418 = !DISubroutineType(types: !419)
!419 = !{!66, !66, !420, !68}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!421 = !{!422, !423, !424, !425}
!422 = !DILocalVariable(name: "p", arg: 1, scope: !417, file: !265, line: 174, type: !66)
!423 = !DILocalVariable(name: "pn", arg: 2, scope: !417, file: !265, line: 174, type: !420)
!424 = !DILocalVariable(name: "s", arg: 3, scope: !417, file: !265, line: 174, type: !68)
!425 = !DILocalVariable(name: "n", scope: !417, file: !265, line: 176, type: !68)
!426 = !{!427}
!427 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!428 = !{!68, !328, !325, !329, !10, !284, !66, !429, !432}
!429 = !DISubprogram(name: "xcalloc", scope: !265, file: !265, line: 57, type: !430, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!430 = !DISubroutineType(types: !431)
!431 = !{!66, !70, !70}
!432 = !DISubprogram(name: "rpl_calloc", scope: !433, file: !433, line: 688, type: !430, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!433 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !436, nameTableKind: None)
!435 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = !{!6, !112}
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !439, nameTableKind: None)
!438 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!439 = !{!66}
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !442, nameTableKind: None)
!441 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!443, !68, !455}
!443 = !DISubprogram(name: "mbrtowc", scope: !312, file: !312, line: 296, type: !444, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!444 = !DISubroutineType(types: !445)
!445 = !{!70, !110, !12, !70, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 13, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !447, file: !296, line: 15, baseType: !14, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !447, file: !296, line: 20, baseType: !451, size: 32, offset: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !447, file: !296, line: 16, size: 32, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !451, file: !296, line: 18, baseType: !230, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !451, file: !296, line: 19, baseType: !304, size: 32)
!455 = !DISubprogram(name: "hard_locale", scope: !456, file: !456, line: 26, type: !457, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!456 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!457 = !DISubroutineType(types: !458)
!458 = !{!176, !14}
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !461, nameTableKind: None)
!460 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!461 = !{!462}
!462 = !DISubprogram(name: "rpl_fclose", scope: !463, file: !463, line: 672, type: !464, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!463 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!464 = !DISubroutineType(types: !465)
!465 = !{!14, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !467, file: !21, line: 51, baseType: !14, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !467, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !467, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !467, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !467, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !467, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !467, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !467, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !467, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !467, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !467, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !467, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !467, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !467, file: !21, line: 70, baseType: !466, size: 64, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !467, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !467, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !467, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !467, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !467, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !467, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !467, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !467, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !467, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !467, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !467, file: !21, line: 93, baseType: !466, size: 64, offset: 1344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !467, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !467, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !467, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !467, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !500, nameTableKind: None)
!499 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = !{!501}
!501 = !DISubprogram(name: "setlocale_null_r", scope: !502, file: !502, line: 64, type: !503, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!502 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !DISubroutineType(types: !504)
!504 = !{!14, !14, !10, !70}
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !507, retainedTypes: !894, nameTableKind: None)
!506 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!507 = !{!508}
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 41, baseType: !230, size: 32, elements: !510)
!509 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!511 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!512 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!513 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!514 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!515 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!516 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!517 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!518 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!519 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!520 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!521 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!522 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!523 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!524 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!525 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!526 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!527 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!528 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!529 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!530 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!531 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!532 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!533 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!534 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!535 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!536 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!537 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!538 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!539 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!540 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!541 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!542 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!543 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!544 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!545 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!546 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!547 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!548 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!549 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!550 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!551 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!552 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!553 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!554 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!555 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!556 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!557 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!558 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!559 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!560 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!619 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!622 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!623 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!624 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!625 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!626 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!627 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!628 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!629 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!630 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!631 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!632 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!633 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!706 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!779 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!780 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!781 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!782 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!783 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!784 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!785 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!786 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!787 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!788 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!789 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!790 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!791 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!792 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!793 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!795 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!796 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!797 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!798 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!799 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!800 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!826 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!827 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!828 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!829 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!830 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!835 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!836 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!837 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!838 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!894 = !{!895, !66}
!895 = !DISubprogram(name: "nl_langinfo", scope: !509, file: !509, line: 661, type: !896, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!896 = !DISubroutineType(types: !897)
!897 = !{!10, !14}
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !900, nameTableKind: None)
!899 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!900 = !{!66, !80}
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !903, nameTableKind: None)
!902 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!903 = !{!904, !939, !940, !944}
!904 = !DISubprogram(name: "fileno", scope: !16, file: !16, line: 786, type: !905, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!905 = !DISubroutineType(types: !906)
!906 = !{!14, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !908, file: !21, line: 51, baseType: !14, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !908, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !908, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !908, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !908, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !908, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !908, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !908, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !908, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !908, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !908, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !908, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !908, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !908, file: !21, line: 70, baseType: !907, size: 64, offset: 832)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !908, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !908, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !908, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !908, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !908, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !908, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !908, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !908, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !908, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !908, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !908, file: !21, line: 93, baseType: !907, size: 64, offset: 1344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !908, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !908, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !908, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !908, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!939 = !DISubprogram(name: "fclose", scope: !16, file: !16, line: 213, type: !905, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!940 = !DISubprogram(name: "lseek", scope: !941, file: !941, line: 334, type: !942, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!941 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!942 = !DISubroutineType(types: !943)
!943 = !{!44, !14, !44, !14}
!944 = !DISubprogram(name: "rpl_fflush", scope: !463, file: !463, line: 718, type: !905, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !947, nameTableKind: None)
!946 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!947 = !{!66, !948, !983}
!948 = !DISubprogram(name: "fflush", scope: !16, file: !16, line: 218, type: !949, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!949 = !DISubroutineType(types: !950)
!950 = !{!14, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !952, file: !21, line: 51, baseType: !14, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !952, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !952, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !952, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !952, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !952, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !952, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !952, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !952, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !952, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !952, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !952, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !952, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !952, file: !21, line: 70, baseType: !951, size: 64, offset: 832)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !952, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !952, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !952, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !952, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !952, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !952, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !952, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !952, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !952, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !952, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !952, file: !21, line: 93, baseType: !951, size: 64, offset: 1344)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !952, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !952, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !952, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !952, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!983 = !DISubprogram(name: "rpl_fseeko", scope: !463, file: !463, line: 1034, type: !984, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!984 = !DISubroutineType(types: !985)
!985 = !{!14, !951, !44, !14}
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !988, nameTableKind: None)
!987 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!988 = !{!66, !989, !940, !1024}
!989 = !DISubprogram(name: "fileno", scope: !16, file: !16, line: 786, type: !990, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!990 = !DISubroutineType(types: !991)
!991 = !{!14, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !993, file: !21, line: 51, baseType: !14, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !993, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !993, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !993, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !993, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !993, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !993, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !993, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !993, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
