; ModuleID = 'coreutils-8.32/src/seq.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.operand = type { x86_fp80, i64, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [104 x i8] c"Usage: %s [OPTION]... LAST\0A  or:  %s [OPTION]... FIRST LAST\0A  or:  %s [OPTION]... FIRST INCREMENT LAST\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "locale_ok", scope: !2, file: !3, line: 51, type: !145, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !177, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/seq.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !32, !93, !97, !101, !104, !107, !7, !114, !26, !83, !129, !133, !137, !141, !153, !155, !156, !159, !162, !85, !28, !165, !170, !171, !174, !30, !63}
!22 = !DISubprogram(name: "dcgettext", scope: !23, file: !23, line: 51, type: !24, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!23 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !28, !28, !30}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !{}
!32 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !34, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!30, !28, !36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !39)
!38 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !55, !56, !57, !58, !62, !64, !66, !70, !73, !75, !78, !81, !82, !84, !88, !89}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 51, baseType: !30, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 36, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 70, baseType: !36, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 152, baseType: !61)
!60 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!65 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 43, baseType: null)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 153, baseType: !61)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !37, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !38, line: 37, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !37, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !38, line: 38, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !37, file: !38, line: 93, baseType: !36, size: 64, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !37, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DISubprogram(name: "set_program_name", scope: !94, file: !94, line: 37, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!94 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!95 = !DISubroutineType(types: !96)
!96 = !{null, !28}
!97 = !DISubprogram(name: "setlocale", scope: !98, file: !98, line: 122, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!98 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!26, !30, !28}
!101 = !DISubprogram(name: "bindtextdomain", scope: !23, file: !23, line: 86, type: !102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!102 = !DISubroutineType(types: !103)
!103 = !{!26, !28, !28}
!104 = !DISubprogram(name: "textdomain", scope: !23, file: !23, line: 82, type: !105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!105 = !DISubroutineType(types: !106)
!106 = !{!26, !28}
!107 = !DISubprogram(name: "atexit", scope: !108, file: !108, line: 595, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!108 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!30, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null}
!114 = !DISubprogram(name: "getopt_long", scope: !115, file: !115, line: 66, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!115 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!116 = !DISubroutineType(types: !117)
!117 = !{!30, !30, !118, !28, !120, !127}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !115, line: 50, size: 256, elements: !123)
!123 = !{!124, !125, !126, !128}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !115, line: 52, baseType: !28, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !122, file: !115, line: 55, baseType: !30, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !115, line: 56, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !122, file: !115, line: 57, baseType: !30, size: 32, offset: 192)
!129 = !DISubprogram(name: "version_etc", scope: !130, file: !130, line: 69, type: !131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!130 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!131 = !DISubroutineType(types: !132)
!132 = !{null, !36, !28, !28, !28, null}
!133 = !DISubprogram(name: "error", scope: !134, file: !134, line: 52, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!134 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!135 = !DISubroutineType(types: !136)
!136 = !{null, !30, !30, !28, null}
!137 = !DISubprogram(name: "quote", scope: !138, file: !138, line: 44, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!138 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{!28, !28}
!141 = !DISubprogram(name: "xstrtold", scope: !142, file: !142, line: 28, type: !143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!142 = !DIFile(filename: "./lib/xstrtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !28, !146, !147, !149}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!148, !28, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!153 = !DISubprogram(name: "xalloc_die", scope: !154, file: !154, line: 51, type: !112, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !31)
!154 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !DISubprogram(name: "xstrdup", scope: !154, file: !154, line: 64, type: !105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!156 = !DISubprogram(name: "free", scope: !108, file: !108, line: 565, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !83}
!159 = !DISubprogram(name: "xmalloc", scope: !154, file: !154, line: 53, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!160 = !DISubroutineType(types: !161)
!161 = !{!83, !87}
!162 = !DISubprogram(name: "xrealloc", scope: !154, file: !154, line: 59, type: !163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!163 = !DISubroutineType(types: !164)
!164 = !{!83, !83, !87}
!165 = !DISubprogram(name: "fwrite_unlocked", scope: !33, file: !33, line: 675, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!166 = !DISubroutineType(types: !167)
!167 = !{!87, !168, !87, !87, !36}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DISubprogram(name: "clearerr_unlocked", scope: !33, file: !33, line: 765, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !36}
!174 = !DISubprogram(name: "quote_n", scope: !138, file: !138, line: 40, type: !175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!175 = !DISubroutineType(types: !176)
!176 = !{!28, !30, !28}
!177 = !{!0, !178, !180, !182, !187, !192}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "equal_width", scope: !2, file: !3, line: 54, type: !145, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "separator", scope: !2, file: !3, line: 57, type: !28, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 63, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 1536, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 6)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "terminator", scope: !2, file: !3, line: 61, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 16, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 2)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "format_buf", scope: !194, file: !3, line: 374, type: !218, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "get_default_format", scope: !3, file: !3, line: 372, type: !195, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !203)
!195 = !DISubroutineType(types: !196)
!196 = !{!28, !197, !197, !197}
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "operand", file: !3, line: 135, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "operand", file: !3, line: 120, size: 256, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !198, file: !3, line: 123, baseType: !148, size: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !198, file: !3, line: 129, baseType: !85, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !198, file: !3, line: 133, baseType: !30, size: 32, offset: 192)
!203 = !{!204, !205, !206, !207, !208, !213, !214, !215}
!204 = !DILocalVariable(name: "first", arg: 1, scope: !194, file: !3, line: 372, type: !197)
!205 = !DILocalVariable(name: "step", arg: 2, scope: !194, file: !3, line: 372, type: !197)
!206 = !DILocalVariable(name: "last", arg: 3, scope: !194, file: !3, line: 372, type: !197)
!207 = !DILocalVariable(name: "prec", scope: !194, file: !3, line: 376, type: !30)
!208 = !DILocalVariable(name: "first_width", scope: !209, file: !3, line: 383, type: !85)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 381, column: 9)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 380, column: 11)
!211 = distinct !DILexicalBlock(scope: !212, file: !3, line: 379, column: 5)
!212 = distinct !DILexicalBlock(scope: !194, file: !3, line: 378, column: 7)
!213 = !DILocalVariable(name: "last_width", scope: !209, file: !3, line: 385, type: !85)
!214 = !DILocalVariable(name: "width", scope: !209, file: !3, line: 392, type: !85)
!215 = !DILocalVariable(name: "w", scope: !216, file: !3, line: 395, type: !30)
!216 = distinct !DILexicalBlock(scope: !217, file: !3, line: 394, column: 13)
!217 = distinct !DILexicalBlock(scope: !209, file: !3, line: 393, column: 15)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 28)
!221 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "Version", scope: !224, file: !225, line: 2, type: !28, isLocal: false, isDefinition: true)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, globals: !226, splitDebugInlining: false, nameTableKind: None)
!225 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!226 = !{!222}
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "file_name", scope: !229, file: !230, line: 46, type: !28, isLocal: true, isDefinition: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !231, globals: !270, splitDebugInlining: false, nameTableKind: None)
!230 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!231 = !{!232, !22, !268, !133}
!232 = !DISubprogram(name: "close_stream", scope: !233, file: !233, line: 2, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!233 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = !DISubroutineType(types: !235)
!235 = !{!30, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !237, file: !38, line: 51, baseType: !30, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !237, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !237, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !237, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !237, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !237, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !237, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !237, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !237, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !237, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !237, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !237, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !237, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !237, file: !38, line: 70, baseType: !236, size: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !237, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !237, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !237, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !237, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !237, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !237, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !237, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !237, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !237, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !237, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !237, file: !38, line: 93, baseType: !236, size: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !237, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !237, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !237, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !237, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!268 = !DISubprogram(name: "quotearg_colon", scope: !269, file: !269, line: 391, type: !105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!269 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = !{!227, !271}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !229, file: !230, line: 56, type: !145, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "exit_failure", scope: !275, file: !276, line: 24, type: !278, isLocal: false, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, globals: !277, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!277 = !{!273}
!278 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "program_name", scope: !281, file: !282, line: 33, type: !28, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !283, globals: !319, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!283 = !{!83, !284, !26}
!284 = !DISubprogram(name: "fputs", scope: !33, file: !33, line: 626, type: !285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!285 = !DISubroutineType(types: !286)
!286 = !{!30, !28, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !288, file: !38, line: 51, baseType: !30, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !288, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !288, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !288, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !288, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !288, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !288, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !288, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !288, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !288, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !288, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !288, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !288, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !288, file: !38, line: 70, baseType: !287, size: 64, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !288, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !288, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !288, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !288, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !288, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !288, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !288, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !288, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !288, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !288, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !288, file: !38, line: 93, baseType: !287, size: 64, offset: 1344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !288, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !288, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !288, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !288, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!319 = !{!279}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !322, file: !323, line: 85, type: !428, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !324, retainedTypes: !343, globals: !401, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!324 = !{!325, !338, !5}
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !269, line: 32, baseType: !7, size: 32, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!327 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!331 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!332 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!333 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!334 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!335 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!336 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!337 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !269, line: 242, baseType: !7, size: 32, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!341 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!342 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!343 = !{!344, !347, !156, !363, !30, !63, !366, !85, !383, !387, !22, !393, !397, !26, !159, !153, !162}
!344 = !DISubprogram(name: "xmemdup", scope: !154, file: !154, line: 62, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!345 = !DISubroutineType(types: !346)
!346 = !{!83, !168, !87}
!347 = !DISubprogram(name: "quotearg_alloc_mem", scope: !269, file: !269, line: 342, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!348 = !DISubroutineType(types: !349)
!349 = !{!26, !28, !87, !350, !351}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !323, line: 65, size: 448, elements: !354)
!354 = !{!355, !356, !357, !361, !362}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !353, file: !323, line: 68, baseType: !325, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !353, file: !323, line: 71, baseType: !30, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !353, file: !323, line: 75, baseType: !358, size: 256, offset: 64)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !353, file: !323, line: 78, baseType: !28, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !353, file: !323, line: 81, baseType: !28, size: 64, offset: 384)
!363 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !269, file: !269, line: 408, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!364 = !DISubroutineType(types: !365)
!365 = !{!26, !30, !28, !28, !28, !87}
!366 = !DISubprogram(name: "rpl_mbrtowc", scope: !367, file: !367, line: 717, type: !368, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!367 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!368 = !DISubroutineType(types: !369)
!369 = !{!87, !127, !28, !87, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 13, size: 64, elements: !373)
!372 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !371, file: !372, line: 15, baseType: !30, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !371, file: !372, line: 20, baseType: !376, size: 32, offset: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !372, line: 16, size: 32, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !376, file: !372, line: 18, baseType: !7, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !376, file: !372, line: 19, baseType: !380, size: 32)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 4)
!383 = !DISubprogram(name: "iswprint", scope: !384, file: !384, line: 120, type: !385, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!384 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!385 = !DISubroutineType(types: !386)
!386 = !{!30, !7}
!387 = !DISubprogram(name: "mbsinit", scope: !388, file: !388, line: 292, type: !389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!388 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!389 = !DISubroutineType(types: !390)
!390 = !{!30, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!393 = !DISubprogram(name: "locale_charset", scope: !394, file: !394, line: 35, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!394 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!395 = !DISubroutineType(types: !396)
!396 = !{!28}
!397 = !DISubprogram(name: "c_strcasecmp", scope: !398, file: !398, line: 42, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!398 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!399 = !DISubroutineType(types: !400)
!400 = !{!30, !28, !28}
!401 = !{!320, !402, !408, !410, !412, !417, !424, !426}
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !322, file: !323, line: 101, type: !404, isLocal: false, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 320, elements: !406)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!406 = !{!407}
!407 = !DISubrange(count: 10)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !322, file: !323, line: 1052, type: !353, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !322, file: !323, line: 116, type: !353, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "slot0", scope: !322, file: !323, line: 842, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 256)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "slotvec", scope: !322, file: !323, line: 845, type: !419, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !323, line: 834, size: 128, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !420, file: !323, line: 836, baseType: !85, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !420, file: !323, line: 837, baseType: !26, size: 64, offset: 64)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "nslots", scope: !322, file: !323, line: 843, type: !30, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "slotvec0", scope: !322, file: !323, line: 844, type: !420, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 704, elements: !430)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!430 = !{!431}
!431 = !DISubrange(count: 11)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !434, file: !435, line: 26, type: !437, isLocal: false, isDefinition: true)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, globals: !436, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = !{!432}
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 376, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 47)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !442, file: !474, line: 50, type: !475, isLocal: true, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !444, globals: !473, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/c-strtold.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!444 = !{!26, !445, !467, !470}
!445 = !DISubprogram(name: "uselocale", scope: !98, file: !98, line: 187, type: !446, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !450, line: 28, size: 1856, elements: !451)
!450 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!451 = !{!452, !458, !461, !464, !465}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !449, file: !450, line: 31, baseType: !453, size: 832)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 832, elements: !456)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !450, line: 31, flags: DIFlagFwdDecl)
!456 = !{!457}
!457 = !DISubrange(count: 13)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !449, file: !450, line: 34, baseType: !459, size: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !449, file: !450, line: 35, baseType: !462, size: 64, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !449, file: !450, line: 36, baseType: !462, size: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !449, file: !450, line: 39, baseType: !466, size: 832, offset: 1024)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 832, elements: !456)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !468, line: 24, baseType: !469)
!468 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !450, line: 42, baseType: !448)
!470 = !DISubprogram(name: "newlocale", scope: !98, file: !98, line: 141, type: !471, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!471 = !DISubroutineType(types: !472)
!472 = !{!448, !30, !28, !448}
!473 = !{!440}
!474 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!475 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !467)
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !478, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "lib/cl-strtold.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!478 = !{!479}
!479 = !DISubprogram(name: "c_strtold", scope: !480, file: !480, line: 41, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!480 = !DIFile(filename: "./lib/c-strtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !487, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!483 = !{!484}
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !482, line: 40, baseType: !7, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!487 = !{!22, !488, !83}
!488 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!489 = !DISubroutineType(types: !490)
!490 = !{!30, !28, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !492, file: !38, line: 51, baseType: !30, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !492, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !492, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !492, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !492, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !492, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !492, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !492, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !492, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !492, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !492, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !492, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !492, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !492, file: !38, line: 70, baseType: !491, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !492, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !492, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !492, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !492, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !492, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !492, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !492, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !492, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !492, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !492, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !492, file: !38, line: 93, baseType: !491, size: 64, offset: 1344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !492, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !492, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !492, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !492, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !525, retainedTypes: !538, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!525 = !{!526}
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !527, file: !154, line: 186, baseType: !7, size: 32, elements: !536)
!527 = distinct !DISubprogram(name: "x2nrealloc", scope: !154, file: !154, line: 174, type: !528, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !523, retainedNodes: !531)
!528 = !DISubroutineType(types: !529)
!529 = !{!83, !83, !530, !85}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!531 = !{!532, !533, !534, !535}
!532 = !DILocalVariable(name: "p", arg: 1, scope: !527, file: !154, line: 174, type: !83)
!533 = !DILocalVariable(name: "pn", arg: 2, scope: !527, file: !154, line: 174, type: !530)
!534 = !DILocalVariable(name: "s", arg: 3, scope: !527, file: !154, line: 174, type: !85)
!535 = !DILocalVariable(name: "n", scope: !527, file: !154, line: 176, type: !85)
!536 = !{!537}
!537 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!538 = !{!85, !153, !159, !162, !26, !156, !83, !539, !542}
!539 = !DISubprogram(name: "xcalloc", scope: !154, file: !154, line: 57, type: !540, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!540 = !DISubroutineType(types: !541)
!541 = !{!83, !87, !87}
!542 = !DISubprogram(name: "rpl_calloc", scope: !543, file: !543, line: 688, type: !540, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!543 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !546, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!546 = !{!22, !133}
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !549, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "lib/xstrtold.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = !{!83}
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !549, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !554, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!555, !85, !567}
!555 = !DISubprogram(name: "mbrtowc", scope: !388, file: !388, line: 296, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!556 = !DISubroutineType(types: !557)
!557 = !{!87, !127, !28, !87, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 13, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !559, file: !372, line: 15, baseType: !30, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !559, file: !372, line: 20, baseType: !563, size: 32, offset: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !372, line: 16, size: 32, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !563, file: !372, line: 18, baseType: !7, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !563, file: !372, line: 19, baseType: !380, size: 32)
!567 = !DISubprogram(name: "hard_locale", scope: !568, file: !568, line: 26, type: !569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!568 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !DISubroutineType(types: !570)
!570 = !{!145, !30}
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !573, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !{!574}
!574 = !DISubprogram(name: "rpl_fclose", scope: !575, file: !575, line: 672, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!575 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !DISubroutineType(types: !577)
!577 = !{!30, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !579, file: !38, line: 51, baseType: !30, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !579, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !579, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !579, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !579, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !579, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !579, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !579, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !579, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !579, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !579, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !579, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !579, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !579, file: !38, line: 70, baseType: !578, size: 64, offset: 832)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !579, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !579, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !579, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !579, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !579, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !579, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !579, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !579, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !579, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !579, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !579, file: !38, line: 93, baseType: !578, size: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !579, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !579, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !579, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !579, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !612, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!612 = !{!613}
!613 = !DISubprogram(name: "setlocale_null_r", scope: !614, file: !614, line: 64, type: !615, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!614 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!615 = !DISubroutineType(types: !616)
!616 = !{!30, !30, !26, !87}
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !619, retainedTypes: !1006, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!619 = !{!620}
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !621, line: 41, baseType: !7, size: 32, elements: !622)
!621 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!623 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!624 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!625 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!626 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!627 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!628 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!629 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!630 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!631 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!632 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!633 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!634 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!635 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!636 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!637 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!638 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!639 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!640 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!641 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!642 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!643 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!644 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!645 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!646 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!647 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!648 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!649 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!650 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!651 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!652 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!653 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!654 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!655 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!656 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!657 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!658 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!659 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!660 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!661 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!662 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!663 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!664 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!665 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!666 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!667 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!668 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!669 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!670 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!671 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!672 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!731 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!734 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!735 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!736 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!737 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!738 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!739 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!740 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!741 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!742 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!743 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!744 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!745 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!818 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!891 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!892 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!893 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!894 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!895 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!896 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!897 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!898 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!899 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!900 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!901 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!902 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!903 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!904 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!905 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!907 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!908 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!909 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!910 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!911 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!912 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!938 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!939 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!940 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!941 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!942 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!947 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!948 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!949 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!950 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1006 = !{!1007, !83}
!1007 = !DISubprogram(name: "nl_langinfo", scope: !621, file: !621, line: 661, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!26, !30}
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !1012, splitDebugInlining: false, nameTableKind: None)
!1011 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1012 = !{!83, !97}
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !1015, splitDebugInlining: false, nameTableKind: None)
!1014 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1015 = !{!1016, !1051, !1052, !1056}
!1016 = !DISubprogram(name: "fileno", scope: !33, file: !33, line: 786, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!30, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1020, file: !38, line: 51, baseType: !30, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1020, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1020, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1020, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1020, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1020, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1020, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1020, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1020, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1020, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1020, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
