source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.sha1_ctx = type { i32, i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"SHA1\00", align 1
@.str.36 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!3 = !DIFile(filename: "src/md5sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !35, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !37, file: !36, line: 187, baseType: !7, size: 32, elements: !47)
!36 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = distinct !DISubprogram(name: "select_plural", scope: !36, file: !36, line: 183, type: !38, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !44, line: 73, baseType: !40)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !{!46}
!46 = !DILocalVariable(name: "n", arg: 1, scope: !37, file: !36, line: 183, type: !41)
!47 = !{!48}
!48 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 45, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!58 = !{!59, !69, !128, !132, !136, !139, !142, !149, !152, !63, !119, !167, !171, !175, !121, !179, !183, !67, !186, !189, !192, !99, !194, !197, !193}
!59 = !DISubprogram(name: "dcgettext", scope: !60, file: !60, line: 51, type: !61, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!60 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !65, !65, !67}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{}
!69 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !71, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!67, !65, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !98, !100, !102, !106, !109, !111, !114, !117, !118, !120, !123, !124}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !67, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !73, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !97)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !97)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !73, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !40)
!122 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DISubprogram(name: "set_program_name", scope: !129, file: !129, line: 37, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!129 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !65}
!132 = !DISubprogram(name: "setlocale", scope: !133, file: !133, line: 122, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!133 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!63, !67, !65}
!136 = !DISubprogram(name: "bindtextdomain", scope: !60, file: !60, line: 86, type: !137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!137 = !DISubroutineType(types: !138)
!138 = !{!63, !65, !65}
!139 = !DISubprogram(name: "textdomain", scope: !60, file: !60, line: 82, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!140 = !DISubroutineType(types: !141)
!141 = !{!63, !65}
!142 = !DISubprogram(name: "atexit", scope: !143, file: !143, line: 595, type: !144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!143 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!67, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DISubprogram(name: "setvbuf", scope: !70, file: !70, line: 308, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!150 = !DISubroutineType(types: !151)
!151 = !{!67, !73, !63, !67, !40}
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 66, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!153 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!67, !67, !156, !65, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 50, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 52, baseType: !65, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 55, baseType: !67, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 57, baseType: !67, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 69, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !73, !65, !65, !65, null}
!171 = !DISubprogram(name: "error", scope: !172, file: !172, line: 52, type: !173, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!172 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{null, !67, !67, !65, null}
!175 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!176 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !DISubroutineType(types: !178)
!178 = !{!67, !73}
!179 = !DISubprogram(name: "fopen_safer", scope: !180, file: !180, line: 23, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!180 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !DISubroutineType(types: !182)
!182 = !{!73, !65, !65}
!183 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!184 = !DISubroutineType(types: !185)
!185 = !{!63, !67, !5, !65}
!186 = !DISubprogram(name: "free", scope: !143, file: !143, line: 565, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !119}
!189 = !DISubprogram(name: "dcngettext", scope: !60, file: !60, line: 73, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!190 = !DISubroutineType(types: !191)
!191 = !{!63, !65, !65, !65, !40, !67}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !DISubprogram(name: "fadvise", scope: !50, file: !50, line: 72, type: !195, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !73, !49}
!197 = !DISubprogram(name: "sha1_stream", scope: !198, file: !198, line: 97, type: !199, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!198 = !DIFile(filename: "./lib/sha1.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{!67, !73, !119}
!201 = !{!202, !205, !207, !0, !209, !211, !213, !215, !217, !219, !221, !276}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !204, isLocal: true, isDefinition: true)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !121, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !121, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !204, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !204, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !204, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !204, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !204, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !193, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "bin2hex", scope: !223, file: !3, line: 730, type: !273, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !224, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !65}
!226 = !{!227, !228, !232, !233, !234, !235, !236, !237, !238, !242, !243, !244, !245, !246, !247, !249, !250, !251, !255, !258, !259, !260, !264, !265, !271}
!227 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !223, file: !3, line: 652, type: !65)
!228 = !DILocalVariable(name: "checkfile_stream", scope: !223, file: !3, line: 654, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !74)
!231 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!232 = !DILocalVariable(name: "n_misformatted_lines", scope: !223, file: !3, line: 655, type: !41)
!233 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !223, file: !3, line: 656, type: !41)
!234 = !DILocalVariable(name: "n_mismatched_checksums", scope: !223, file: !3, line: 657, type: !41)
!235 = !DILocalVariable(name: "n_open_or_read_failures", scope: !223, file: !3, line: 658, type: !41)
!236 = !DILocalVariable(name: "properly_formatted_lines", scope: !223, file: !3, line: 659, type: !204)
!237 = !DILocalVariable(name: "matched_checksums", scope: !223, file: !3, line: 660, type: !204)
!238 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !223, file: !3, line: 661, type: !239)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 192, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 24)
!242 = !DILocalVariable(name: "bin_buffer", scope: !223, file: !3, line: 663, type: !192)
!243 = !DILocalVariable(name: "line_number", scope: !223, file: !3, line: 664, type: !41)
!244 = !DILocalVariable(name: "line", scope: !223, file: !3, line: 665, type: !63)
!245 = !DILocalVariable(name: "line_chars_allocated", scope: !223, file: !3, line: 666, type: !121)
!246 = !DILocalVariable(name: "is_stdin", scope: !223, file: !3, line: 667, type: !204)
!247 = !DILocalVariable(name: "filename", scope: !248, file: !3, line: 690, type: !63)
!248 = distinct !DILexicalBlock(scope: !223, file: !3, line: 689, column: 5)
!249 = !DILocalVariable(name: "binary", scope: !248, file: !3, line: 691, type: !67)
!250 = !DILocalVariable(name: "hex_digest", scope: !248, file: !3, line: 692, type: !192)
!251 = !DILocalVariable(name: "line_length", scope: !248, file: !3, line: 693, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !253, line: 108, baseType: !254)
!253 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !44, line: 193, baseType: !97)
!255 = !DILocalVariable(name: "ok", scope: !256, file: !3, line: 734, type: !204)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 729, column: 9)
!257 = distinct !DILexicalBlock(scope: !248, file: !3, line: 712, column: 11)
!258 = !DILocalVariable(name: "missing", scope: !256, file: !3, line: 735, type: !204)
!259 = !DILocalVariable(name: "needs_escape", scope: !256, file: !3, line: 738, type: !204)
!260 = !DILocalVariable(name: "digest_bin_bytes", scope: !261, file: !3, line: 762, type: !121)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 761, column: 13)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 755, column: 20)
!263 = distinct !DILexicalBlock(scope: !256, file: !3, line: 744, column: 15)
!264 = !DILocalVariable(name: "cnt", scope: !261, file: !3, line: 763, type: !121)
!265 = !DILocalVariable(name: "__res", scope: !266, file: !3, line: 769, type: !67)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 769, column: 23)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 769, column: 23)
!268 = distinct !DILexicalBlock(scope: !269, file: !3, line: 768, column: 17)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 767, column: 15)
!270 = distinct !DILexicalBlock(scope: !261, file: !3, line: 767, column: 15)
!271 = !DILocalVariable(name: "__res", scope: !272, file: !3, line: 771, type: !67)
!272 = distinct !DILexicalBlock(scope: !267, file: !3, line: 771, column: 27)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 16)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !67, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 3328, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 13)
!281 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!282 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!283 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!284 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!285 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!286 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!287 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 42, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!288 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 40, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!289 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "Version", scope: !292, file: !293, line: 2, type: !65, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, globals: !294, nameTableKind: None)
!293 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = !{!290}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 46, type: !65, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !299, globals: !337, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!300, !59, !336, !171}
!300 = !DISubprogram(name: "close_stream", scope: !301, file: !301, line: 2, type: !302, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!301 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !DISubroutineType(types: !303)
!303 = !{!67, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !305, file: !75, line: 51, baseType: !67, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !305, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !305, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !305, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !305, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !305, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !305, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !305, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !305, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !305, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !305, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !305, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !305, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !305, file: !75, line: 70, baseType: !304, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !305, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !305, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !305, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !305, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !305, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !305, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !305, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !305, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !305, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !305, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !305, file: !75, line: 93, baseType: !304, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !305, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !305, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !305, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !305, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!336 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!337 = !{!295, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 56, type: !204, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "fillbuf", scope: !342, file: !343, line: 55, type: !373, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !344, globals: !372, nameTableKind: None)
!343 = !DIFile(filename: "lib/sha1.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !{!63, !345, !186, !370, !65, !371, !354}
!345 = !DISubprogram(name: "sha1_process_block", scope: !198, file: !198, line: 60, type: !346, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348, !40, !350}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sha1_ctx", file: !198, line: 40, size: 1280, elements: !352)
!352 = !{!353, !357, !358, !359, !360, !361, !365, !366}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !351, file: !198, line: 42, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !355, line: 26, baseType: !356)
!355 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !44, line: 42, baseType: !7)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !351, file: !198, line: 43, baseType: !354, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !351, file: !198, line: 44, baseType: !354, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !351, file: !198, line: 45, baseType: !354, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !351, file: !198, line: 46, baseType: !354, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !351, file: !198, line: 48, baseType: !362, size: 64, offset: 160)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 2)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !351, file: !198, line: 49, baseType: !354, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !351, file: !198, line: 50, baseType: !367, size: 1024, offset: 256)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 1024, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 32)
!370 = !DISubprogram(name: "sha1_process_bytes", scope: !198, file: !198, line: 67, type: !346, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !42, line: 90, baseType: !40)
!372 = !{!340}
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 512, elements: !375)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!375 = !{!376}
!376 = !DISubrange(count: 64)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "exit_failure", scope: !379, file: !380, line: 24, type: !382, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, globals: !381, nameTableKind: None)
!380 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!381 = !{!377}
!382 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "program_name", scope: !385, file: !386, line: 33, type: !65, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !387, globals: !423, nameTableKind: None)
!386 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!387 = !{!119, !388, !63}
!388 = !DISubprogram(name: "fputs", scope: !70, file: !70, line: 626, type: !389, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!389 = !DISubroutineType(types: !390)
!390 = !{!67, !65, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !392, file: !75, line: 51, baseType: !67, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !392, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !392, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !392, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !392, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !392, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !392, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !392, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !392, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !392, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !392, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !392, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !392, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !392, file: !75, line: 70, baseType: !391, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !392, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !392, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !392, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !392, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !392, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !392, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !392, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !392, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !392, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !392, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !392, file: !75, line: 93, baseType: !391, size: 64, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !392, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !392, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !392, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !392, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!423 = !{!383}
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !426, file: !427, line: 85, type: !527, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !428, retainedTypes: !434, globals: !500, nameTableKind: None)
!427 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!428 = !{!5, !429, !20}
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !430)
!430 = !{!431, !432, !433}
!431 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!432 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!433 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!434 = !{!435, !439, !186, !455, !67, !99, !458, !121, !475, !479, !59, !485, !489, !63, !493, !496, !497}
!435 = !DISubprogram(name: "xmemdup", scope: !436, file: !436, line: 62, type: !437, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!436 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!437 = !DISubroutineType(types: !438)
!438 = !{!119, !348, !40}
!439 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !440, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!440 = !DISubroutineType(types: !441)
!441 = !{!63, !65, !40, !442, !443}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !427, line: 65, size: 448, elements: !446)
!446 = !{!447, !448, !449, !453, !454}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !445, file: !427, line: 68, baseType: !5, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !445, file: !427, line: 71, baseType: !67, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !445, file: !427, line: 75, baseType: !450, size: 256, offset: 64)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !445, file: !427, line: 78, baseType: !65, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !445, file: !427, line: 81, baseType: !65, size: 64, offset: 384)
!455 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !456, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!456 = !DISubroutineType(types: !457)
!457 = !{!63, !67, !65, !65, !65, !40}
!458 = !DISubprogram(name: "rpl_mbrtowc", scope: !459, file: !459, line: 717, type: !460, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!459 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !DISubroutineType(types: !461)
!461 = !{!40, !165, !65, !40, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 13, size: 64, elements: !465)
!464 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !463, file: !464, line: 15, baseType: !67, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !463, file: !464, line: 20, baseType: !468, size: 32, offset: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !463, file: !464, line: 16, size: 32, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !468, file: !464, line: 18, baseType: !7, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !468, file: !464, line: 19, baseType: !472, size: 32)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 4)
!475 = !DISubprogram(name: "iswprint", scope: !476, file: !476, line: 120, type: !477, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!476 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!477 = !DISubroutineType(types: !478)
!478 = !{!67, !7}
!479 = !DISubprogram(name: "mbsinit", scope: !480, file: !480, line: 292, type: !481, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!480 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!481 = !DISubroutineType(types: !482)
!482 = !{!67, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!485 = !DISubprogram(name: "locale_charset", scope: !486, file: !486, line: 35, type: !487, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!486 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = !DISubroutineType(types: !488)
!488 = !{!65}
!489 = !DISubprogram(name: "c_strcasecmp", scope: !490, file: !490, line: 42, type: !491, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!490 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!491 = !DISubroutineType(types: !492)
!492 = !{!67, !65, !65}
!493 = !DISubprogram(name: "xmalloc", scope: !436, file: !436, line: 53, type: !494, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!494 = !DISubroutineType(types: !495)
!495 = !{!119, !40}
!496 = !DISubprogram(name: "xalloc_die", scope: !436, file: !436, line: 51, type: !147, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !68)
!497 = !DISubprogram(name: "xrealloc", scope: !436, file: !436, line: 59, type: !498, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!498 = !DISubroutineType(types: !499)
!499 = !{!119, !119, !40}
!500 = !{!424, !501, !507, !509, !511, !516, !523, !525}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !426, file: !427, line: 101, type: !503, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !505)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!505 = !{!506}
!506 = !DISubrange(count: 10)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !426, file: !427, line: 1052, type: !445, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !426, file: !427, line: 116, type: !445, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "slot0", scope: !426, file: !427, line: 842, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 256)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "slotvec", scope: !426, file: !427, line: 845, type: !518, isLocal: true, isDefinition: true)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !427, line: 834, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !427, line: 836, baseType: !121, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !519, file: !427, line: 837, baseType: !63, size: 64, offset: 64)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "nslots", scope: !426, file: !427, line: 843, type: !67, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "slotvec0", scope: !426, file: !427, line: 844, type: !519, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 704, elements: !529)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!529 = !{!530}
!530 = !DISubrange(count: 11)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !533, file: !534, line: 26, type: !536, isDefinition: true)
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, globals: !535, nameTableKind: None)
!534 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!535 = !{!531}
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 376, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 47)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !541, file: !542, line: 507, type: !67, isLocal: true, isDefinition: true)
!541 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !542, file: !542, line: 488, type: !543, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !545, retainedNodes: !556)
!542 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!543 = !DISubroutineType(types: !544)
!544 = !{!67, !67, !67}
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !546, globals: !555, nameTableKind: None)
!546 = !{!547, !551}
!547 = !DISubprogram(name: "fcntl", scope: !548, file: !548, line: 176, type: !549, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!548 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!549 = !DISubroutineType(types: !550)
!550 = !{!67, !67, !67, null}
!551 = !DISubprogram(name: "close", scope: !552, file: !552, line: 353, type: !553, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!552 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!553 = !DISubroutineType(types: !554)
!554 = !{!67, !67}
!555 = !{!539}
!556 = !{!557, !558, !559, !560, !563}
!557 = !DILocalVariable(name: "fd", arg: 1, scope: !541, file: !542, line: 488, type: !67)
!558 = !DILocalVariable(name: "target", arg: 2, scope: !541, file: !542, line: 488, type: !67)
!559 = !DILocalVariable(name: "result", scope: !541, file: !542, line: 490, type: !67)
!560 = !DILocalVariable(name: "flags", scope: !561, file: !542, line: 531, type: !67)
!561 = distinct !DILexicalBlock(scope: !562, file: !542, line: 530, column: 5)
!562 = distinct !DILexicalBlock(scope: !541, file: !542, line: 529, column: 7)
!563 = !DILocalVariable(name: "saved_errno", scope: !564, file: !542, line: 534, type: !67)
!564 = distinct !DILexicalBlock(scope: !565, file: !542, line: 533, column: 9)
!565 = distinct !DILexicalBlock(scope: !561, file: !542, line: 532, column: 11)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !568, retainedTypes: !569, nameTableKind: None)
!567 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!568 = !{!49}
!569 = !{!570, !573}
!570 = !DISubprogram(name: "posix_fadvise", scope: !548, file: !548, line: 288, type: !571, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!571 = !DISubroutineType(types: !572)
!572 = !{!67, !67, !97, !97, !67}
!573 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !574, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!574 = !DISubroutineType(types: !575)
!575 = !{!67, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !577, file: !75, line: 51, baseType: !67, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !577, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !577, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !577, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !577, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !577, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !577, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !577, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !577, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !577, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !577, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !577, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !577, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !577, file: !75, line: 70, baseType: !576, size: 64, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !577, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !577, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !577, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !577, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !577, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !577, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !577, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !577, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !577, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !577, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !577, file: !75, line: 93, baseType: !576, size: 64, offset: 1344)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !577, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !577, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !577, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !577, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !610, nameTableKind: None)
!609 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!610 = !{!611, !646, !648, !649, !551}
!611 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !612, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!612 = !DISubroutineType(types: !613)
!613 = !{!67, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !615, file: !75, line: 51, baseType: !67, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !615, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !615, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !615, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !615, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !615, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !615, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !615, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !615, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !615, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !615, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !615, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !615, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !615, file: !75, line: 70, baseType: !614, size: 64, offset: 832)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !615, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !615, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !615, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !615, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !615, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !615, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !615, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !615, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !615, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !615, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !615, file: !75, line: 93, baseType: !614, size: 64, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !615, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !615, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !615, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !615, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!646 = !DISubprogram(name: "dup_safer", scope: !647, file: !647, line: 20, type: !553, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!647 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!648 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !612, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!649 = !DISubprogram(name: "fdopen", scope: !70, file: !70, line: 279, type: !650, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!650 = !DISubroutineType(types: !651)
!651 = !{!614, !67, !65}
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !654, nameTableKind: None)
!653 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = !{!655}
!655 = !DISubprogram(name: "rpl_fcntl", scope: !656, file: !656, line: 588, type: !549, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!656 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !659, retainedTypes: !663, nameTableKind: None)
!658 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!659 = !{!660}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 40, baseType: !7, size: 32, elements: !661)
!661 = !{!662}
!662 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!663 = !{!59, !664, !119}
!664 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !665, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!665 = !DISubroutineType(types: !666)
!666 = !{!67, !65, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !668, file: !75, line: 51, baseType: !67, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !668, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !668, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !668, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !668, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !668, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !668, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !668, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !668, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !668, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !668, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !668, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !668, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !668, file: !75, line: 70, baseType: !667, size: 64, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !668, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !668, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !668, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !668, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !668, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !668, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !668, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !668, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !668, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !668, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !668, file: !75, line: 93, baseType: !667, size: 64, offset: 1344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !668, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !668, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !668, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !668, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !701, retainedTypes: !714, nameTableKind: None)
!700 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = !{!702}
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !703, file: !436, line: 186, baseType: !7, size: 32, elements: !712)
!703 = distinct !DISubprogram(name: "x2nrealloc", scope: !436, file: !436, line: 174, type: !704, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !699, retainedNodes: !707)
!704 = !DISubroutineType(types: !705)
!705 = !{!119, !119, !706, !121}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!707 = !{!708, !709, !710, !711}
!708 = !DILocalVariable(name: "p", arg: 1, scope: !703, file: !436, line: 174, type: !119)
!709 = !DILocalVariable(name: "pn", arg: 2, scope: !703, file: !436, line: 174, type: !706)
!710 = !DILocalVariable(name: "s", arg: 3, scope: !703, file: !436, line: 174, type: !121)
!711 = !DILocalVariable(name: "n", scope: !703, file: !436, line: 176, type: !121)
!712 = !{!713}
!713 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!714 = !{!121, !496, !493, !497, !63, !186, !119, !715, !718}
!715 = !DISubprogram(name: "xcalloc", scope: !436, file: !436, line: 57, type: !716, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!716 = !DISubroutineType(types: !717)
!717 = !{!119, !40, !40}
!718 = !DISubprogram(name: "rpl_calloc", scope: !719, file: !719, line: 688, type: !716, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!719 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !722, nameTableKind: None)
!721 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!722 = !{!59, !171}
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !725, nameTableKind: None)
!724 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!725 = !{!119}
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !728, nameTableKind: None)
!727 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!728 = !{!729, !764, !765, !768}
!729 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !730, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!730 = !DISubroutineType(types: !731)
!731 = !{!67, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !733, file: !75, line: 51, baseType: !67, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !733, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !733, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !733, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !733, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !733, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !733, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !733, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !733, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !733, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !733, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !733, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !733, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !733, file: !75, line: 70, baseType: !732, size: 64, offset: 832)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !733, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !733, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !733, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !733, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !733, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !733, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !733, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !733, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !733, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !733, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !733, file: !75, line: 93, baseType: !732, size: 64, offset: 1344)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !733, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !733, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !733, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !733, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!764 = !DISubprogram(name: "fclose", scope: !70, file: !70, line: 213, type: !730, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!765 = !DISubprogram(name: "lseek", scope: !552, file: !552, line: 334, type: !766, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!766 = !DISubroutineType(types: !767)
!767 = !{!97, !67, !97, !67}
!768 = !DISubprogram(name: "rpl_fflush", scope: !176, file: !176, line: 718, type: !730, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !771, nameTableKind: None)
!770 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!771 = !{!119, !772, !807}
!772 = !DISubprogram(name: "fflush", scope: !70, file: !70, line: 218, type: !773, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!773 = !DISubroutineType(types: !774)
!774 = !{!67, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !776, file: !75, line: 51, baseType: !67, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !776, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !776, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !776, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !776, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !776, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !776, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !776, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !776, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !776, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !776, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !776, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !776, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !776, file: !75, line: 70, baseType: !775, size: 64, offset: 832)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !776, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !776, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !776, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !776, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !776, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !776, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !776, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !776, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !776, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !776, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !776, file: !75, line: 93, baseType: !775, size: 64, offset: 1344)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !776, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !776, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !776, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !776, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!807 = !DISubprogram(name: "rpl_fseeko", scope: !176, file: !176, line: 1034, type: !808, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!808 = !DISubroutineType(types: !809)
!809 = !{!67, !775, !97, !67}
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !812, nameTableKind: None)
!811 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!812 = !{!119, !813, !765, !848}
!813 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !814, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!814 = !DISubroutineType(types: !815)
!815 = !{!67, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !817, file: !75, line: 51, baseType: !67, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !817, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !817, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !817, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !817, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !817, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !817, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !817, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !817, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !817, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !817, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !817, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !817, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !817, file: !75, line: 70, baseType: !816, size: 64, offset: 832)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !817, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !817, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !817, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !817, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !817, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !817, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !817, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !817, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !817, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !817, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !817, file: !75, line: 93, baseType: !816, size: 64, offset: 1344)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !817, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !817, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !817, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !817, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!848 = !DISubprogram(name: "fseeko", scope: !70, file: !70, line: 707, type: !849, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!849 = !DISubroutineType(types: !850)
!850 = !{!67, !816, !97, !67}
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !853, nameTableKind: None)
!852 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!853 = !{!854, !121, !866}
!854 = !DISubprogram(name: "mbrtowc", scope: !480, file: !480, line: 296, type: !855, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!855 = !DISubroutineType(types: !856)
!856 = !{!40, !165, !65, !40, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 13, size: 64, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !858, file: !464, line: 15, baseType: !67, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !858, file: !464, line: 20, baseType: !862, size: 32, offset: 32)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !858, file: !464, line: 16, size: 32, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !862, file: !464, line: 18, baseType: !7, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !862, file: !464, line: 19, baseType: !472, size: 32)
!866 = !DISubprogram(name: "hard_locale", scope: !867, file: !867, line: 26, type: !868, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!867 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!868 = !DISubroutineType(types: !869)
!869 = !{!204, !67}
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !872, nameTableKind: None)
!871 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!872 = !{!873}
!873 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !874, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!874 = !DISubroutineType(types: !875)
!875 = !{!67, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !877, file: !75, line: 51, baseType: !67, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !877, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !877, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !877, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !877, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !877, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !877, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !877, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !877, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !877, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !877, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !877, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !877, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !877, file: !75, line: 70, baseType: !876, size: 64, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !877, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !877, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !877, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !877, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !877, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !877, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !877, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !877, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !877, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !877, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !877, file: !75, line: 93, baseType: !876, size: 64, offset: 1344)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !877, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !877, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !877, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !877, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !910, nameTableKind: None)
!909 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!910 = !{!911}
!911 = !DISubprogram(name: "setlocale_null_r", scope: !912, file: !912, line: 64, type: !913, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!912 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!913 = !DISubroutineType(types: !914)
!914 = !{!67, !67, !63, !40}
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !917, retainedTypes: !1304, nameTableKind: None)
!916 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!917 = !{!918}
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !919, line: 41, baseType: !7, size: 32, elements: !920)
!919 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
