; ModuleID = 'coreutils-8.32/src/sha224sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.sha256_ctx = type { [8 x i32], [2 x i32], i64, [32 x i32] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"SHA224\00", align 1
@.str.36 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!3 = !DIFile(filename: "src/md5sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !35, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !37, file: !36, line: 187, baseType: !7, size: 32, elements: !47)
!36 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = distinct !DISubprogram(name: "select_plural", scope: !36, file: !36, line: 183, type: !38, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !44, line: 73, baseType: !40)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !{!46}
!46 = !DILocalVariable(name: "n", arg: 1, scope: !37, file: !36, line: 183, type: !41)
!47 = !{!48}
!48 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 45, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!58 = !{!59, !69, !128, !132, !136, !139, !142, !149, !152, !63, !119, !167, !171, !175, !121, !179, !183, !67, !186, !189, !192, !99, !194, !197, !193}
!59 = !DISubprogram(name: "dcgettext", scope: !60, file: !60, line: 51, type: !61, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!60 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !65, !65, !67}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{}
!69 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!67, !65, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !98, !100, !102, !106, !109, !111, !114, !117, !118, !120, !123, !124}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !67, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !73, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !97)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !97)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !73, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !40)
!122 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DISubprogram(name: "set_program_name", scope: !129, file: !129, line: 37, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!129 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !65}
!132 = !DISubprogram(name: "setlocale", scope: !133, file: !133, line: 122, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!133 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!63, !67, !65}
!136 = !DISubprogram(name: "bindtextdomain", scope: !60, file: !60, line: 86, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!137 = !DISubroutineType(types: !138)
!138 = !{!63, !65, !65}
!139 = !DISubprogram(name: "textdomain", scope: !60, file: !60, line: 82, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!140 = !DISubroutineType(types: !141)
!141 = !{!63, !65}
!142 = !DISubprogram(name: "atexit", scope: !143, file: !143, line: 595, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!143 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!67, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DISubprogram(name: "setvbuf", scope: !70, file: !70, line: 308, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!150 = !DISubroutineType(types: !151)
!151 = !{!67, !73, !63, !67, !40}
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 66, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!153 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!67, !67, !156, !65, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 50, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 52, baseType: !65, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 55, baseType: !67, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 57, baseType: !67, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 69, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !73, !65, !65, !65, null}
!171 = !DISubprogram(name: "error", scope: !172, file: !172, line: 52, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!172 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{null, !67, !67, !65, null}
!175 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!176 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !DISubroutineType(types: !178)
!178 = !{!67, !73}
!179 = !DISubprogram(name: "fopen_safer", scope: !180, file: !180, line: 23, type: !181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!180 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !DISubroutineType(types: !182)
!182 = !{!73, !65, !65}
!183 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!184 = !DISubroutineType(types: !185)
!185 = !{!63, !67, !5, !65}
!186 = !DISubprogram(name: "free", scope: !143, file: !143, line: 565, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !119}
!189 = !DISubprogram(name: "dcngettext", scope: !60, file: !60, line: 73, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!190 = !DISubroutineType(types: !191)
!191 = !{!63, !65, !65, !65, !40, !67}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !DISubprogram(name: "fadvise", scope: !50, file: !50, line: 72, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !73, !49}
!197 = !DISubprogram(name: "sha224_stream", scope: !198, file: !198, line: 103, type: !199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!198 = !DIFile(filename: "./lib/sha256.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{!67, !73, !119}
!201 = !{!202, !205, !207, !0, !209, !211, !213, !215, !217, !219, !221, !276}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !204, isLocal: true, isDefinition: true)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !121, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !121, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !204, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !204, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !204, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !204, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !204, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !193, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "bin2hex", scope: !223, file: !3, line: 730, type: !273, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !224, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !65}
!226 = !{!227, !228, !232, !233, !234, !235, !236, !237, !238, !242, !243, !244, !245, !246, !247, !249, !250, !251, !255, !258, !259, !260, !264, !265, !271}
!227 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !223, file: !3, line: 652, type: !65)
!228 = !DILocalVariable(name: "checkfile_stream", scope: !223, file: !3, line: 654, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !74)
!231 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!232 = !DILocalVariable(name: "n_misformatted_lines", scope: !223, file: !3, line: 655, type: !41)
!233 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !223, file: !3, line: 656, type: !41)
!234 = !DILocalVariable(name: "n_mismatched_checksums", scope: !223, file: !3, line: 657, type: !41)
!235 = !DILocalVariable(name: "n_open_or_read_failures", scope: !223, file: !3, line: 658, type: !41)
!236 = !DILocalVariable(name: "properly_formatted_lines", scope: !223, file: !3, line: 659, type: !204)
!237 = !DILocalVariable(name: "matched_checksums", scope: !223, file: !3, line: 660, type: !204)
!238 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !223, file: !3, line: 661, type: !239)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 256, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 32)
!242 = !DILocalVariable(name: "bin_buffer", scope: !223, file: !3, line: 663, type: !192)
!243 = !DILocalVariable(name: "line_number", scope: !223, file: !3, line: 664, type: !41)
!244 = !DILocalVariable(name: "line", scope: !223, file: !3, line: 665, type: !63)
!245 = !DILocalVariable(name: "line_chars_allocated", scope: !223, file: !3, line: 666, type: !121)
!246 = !DILocalVariable(name: "is_stdin", scope: !223, file: !3, line: 667, type: !204)
!247 = !DILocalVariable(name: "filename", scope: !248, file: !3, line: 690, type: !63)
!248 = distinct !DILexicalBlock(scope: !223, file: !3, line: 689, column: 5)
!249 = !DILocalVariable(name: "binary", scope: !248, file: !3, line: 691, type: !67)
!250 = !DILocalVariable(name: "hex_digest", scope: !248, file: !3, line: 692, type: !192)
!251 = !DILocalVariable(name: "line_length", scope: !248, file: !3, line: 693, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !253, line: 108, baseType: !254)
!253 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !44, line: 193, baseType: !97)
!255 = !DILocalVariable(name: "ok", scope: !256, file: !3, line: 734, type: !204)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 729, column: 9)
!257 = distinct !DILexicalBlock(scope: !248, file: !3, line: 712, column: 11)
!258 = !DILocalVariable(name: "missing", scope: !256, file: !3, line: 735, type: !204)
!259 = !DILocalVariable(name: "needs_escape", scope: !256, file: !3, line: 738, type: !204)
!260 = !DILocalVariable(name: "digest_bin_bytes", scope: !261, file: !3, line: 762, type: !121)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 761, column: 13)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 755, column: 20)
!263 = distinct !DILexicalBlock(scope: !256, file: !3, line: 744, column: 15)
!264 = !DILocalVariable(name: "cnt", scope: !261, file: !3, line: 763, type: !121)
!265 = !DILocalVariable(name: "__res", scope: !266, file: !3, line: 769, type: !67)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 769, column: 23)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 769, column: 23)
!268 = distinct !DILexicalBlock(scope: !269, file: !3, line: 768, column: 17)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 767, column: 15)
!270 = distinct !DILexicalBlock(scope: !261, file: !3, line: 767, column: 15)
!271 = !DILocalVariable(name: "__res", scope: !272, file: !3, line: 771, type: !67)
!272 = distinct !DILexicalBlock(scope: !267, file: !3, line: 771, column: 27)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 16)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !67, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 3328, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 13)
!281 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!282 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!283 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!284 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!285 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!286 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!287 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 58, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!288 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 56, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!289 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "Version", scope: !292, file: !293, line: 2, type: !65, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !294, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = !{!290}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 46, type: !65, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !299, globals: !337, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!300, !59, !336, !171}
!300 = !DISubprogram(name: "close_stream", scope: !301, file: !301, line: 2, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!301 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !DISubroutineType(types: !303)
!303 = !{!67, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !305, file: !75, line: 51, baseType: !67, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !305, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !305, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !305, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !305, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !305, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !305, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !305, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !305, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !305, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !305, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !305, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !305, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !305, file: !75, line: 70, baseType: !304, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !305, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !305, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !305, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !305, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !305, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !305, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !305, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !305, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !305, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !305, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !305, file: !75, line: 93, baseType: !304, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !305, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !305, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !305, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !305, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!336 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!337 = !{!295, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 56, type: !204, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "fillbuf", scope: !342, file: !343, line: 54, type: !383, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, retainedTypes: !351, globals: !376, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/sha256.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !{!345, !348}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 33, baseType: !7, size: 32, elements: !346)
!346 = !{!347}
!347 = !DIEnumerator(name: "SHA256_DIGEST_SIZE", value: 32, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 32, baseType: !7, size: 32, elements: !349)
!349 = !{!350}
!350 = !DIEnumerator(name: "SHA224_DIGEST_SIZE", value: 28, isUnsigned: true)
!351 = !{!352, !63, !374, !65, !375, !186}
!352 = !DISubprogram(name: "sha256_process_bytes", scope: !198, file: !198, line: 66, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355, !40, !357}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sha256_ctx", file: !198, line: 42, size: 1408, elements: !359)
!359 = !{!360, !367, !371, !372}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !358, file: !198, line: 44, baseType: !361, size: 256)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 256, elements: !365)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !363, line: 26, baseType: !364)
!363 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !44, line: 42, baseType: !7)
!365 = !{!366}
!366 = !DISubrange(count: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !358, file: !198, line: 46, baseType: !368, size: 64, offset: 256)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 64, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 2)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !358, file: !198, line: 47, baseType: !121, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !358, file: !198, line: 48, baseType: !373, size: 1024, offset: 384)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 1024, elements: !240)
!374 = !DISubprogram(name: "sha256_process_block", scope: !198, file: !198, line: 59, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !42, line: 90, baseType: !40)
!376 = !{!340, !377}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "sha256_round_constants", scope: !342, file: !343, line: 381, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 2048, elements: !381)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!381 = !{!382}
!382 = !DISubrange(count: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 512, elements: !381)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "exit_failure", scope: !387, file: !388, line: 24, type: !390, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!389 = !{!385}
!390 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "program_name", scope: !393, file: !394, line: 33, type: !65, isLocal: false, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !395, globals: !431, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!395 = !{!119, !396, !63}
!396 = !DISubprogram(name: "fputs", scope: !70, file: !70, line: 626, type: !397, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!397 = !DISubroutineType(types: !398)
!398 = !{!67, !65, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !400, file: !75, line: 51, baseType: !67, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !400, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !400, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !400, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !400, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !400, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !400, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !400, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !400, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !400, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !400, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !400, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !400, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !400, file: !75, line: 70, baseType: !399, size: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !400, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !400, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !400, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !400, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !400, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !400, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !400, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !400, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !400, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !400, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !400, file: !75, line: 93, baseType: !399, size: 64, offset: 1344)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !400, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !400, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !400, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !400, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!431 = !{!391}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !434, file: !435, line: 85, type: !533, isLocal: false, isDefinition: true)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !436, retainedTypes: !442, globals: !506, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = !{!5, !437, !20}
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!440 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!441 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!442 = !{!443, !447, !186, !461, !67, !99, !464, !121, !481, !485, !59, !491, !495, !63, !499, !502, !503}
!443 = !DISubprogram(name: "xmemdup", scope: !444, file: !444, line: 62, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!444 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!445 = !DISubroutineType(types: !446)
!446 = !{!119, !355, !40}
!447 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !448, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!448 = !DISubroutineType(types: !449)
!449 = !{!63, !65, !40, !450, !451}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !435, line: 65, size: 448, elements: !454)
!454 = !{!455, !456, !457, !459, !460}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !453, file: !435, line: 68, baseType: !5, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !453, file: !435, line: 71, baseType: !67, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !453, file: !435, line: 75, baseType: !458, size: 256, offset: 64)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !365)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !453, file: !435, line: 78, baseType: !65, size: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !453, file: !435, line: 81, baseType: !65, size: 64, offset: 384)
!461 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !462, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!462 = !DISubroutineType(types: !463)
!463 = !{!63, !67, !65, !65, !65, !40}
!464 = !DISubprogram(name: "rpl_mbrtowc", scope: !465, file: !465, line: 717, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!465 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!466 = !DISubroutineType(types: !467)
!467 = !{!40, !165, !65, !40, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !470, line: 13, size: 64, elements: !471)
!470 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !469, file: !470, line: 15, baseType: !67, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !469, file: !470, line: 20, baseType: !474, size: 32, offset: 32)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !469, file: !470, line: 16, size: 32, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !474, file: !470, line: 18, baseType: !7, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !474, file: !470, line: 19, baseType: !478, size: 32)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 4)
!481 = !DISubprogram(name: "iswprint", scope: !482, file: !482, line: 120, type: !483, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!482 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!483 = !DISubroutineType(types: !484)
!484 = !{!67, !7}
!485 = !DISubprogram(name: "mbsinit", scope: !486, file: !486, line: 292, type: !487, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!486 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!487 = !DISubroutineType(types: !488)
!488 = !{!67, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!491 = !DISubprogram(name: "locale_charset", scope: !492, file: !492, line: 35, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!492 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!493 = !DISubroutineType(types: !494)
!494 = !{!65}
!495 = !DISubprogram(name: "c_strcasecmp", scope: !496, file: !496, line: 42, type: !497, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!496 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = !DISubroutineType(types: !498)
!498 = !{!67, !65, !65}
!499 = !DISubprogram(name: "xmalloc", scope: !444, file: !444, line: 53, type: !500, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!500 = !DISubroutineType(types: !501)
!501 = !{!119, !40}
!502 = !DISubprogram(name: "xalloc_die", scope: !444, file: !444, line: 51, type: !147, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !68)
!503 = !DISubprogram(name: "xrealloc", scope: !444, file: !444, line: 59, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!504 = !DISubroutineType(types: !505)
!505 = !{!119, !119, !40}
!506 = !{!432, !507, !513, !515, !517, !522, !529, !531}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !434, file: !435, line: 101, type: !509, isLocal: false, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 320, elements: !511)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!511 = !{!512}
!512 = !DISubrange(count: 10)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !434, file: !435, line: 1052, type: !453, isLocal: false, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !434, file: !435, line: 116, type: !453, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "slot0", scope: !434, file: !435, line: 842, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 256)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "slotvec", scope: !434, file: !435, line: 845, type: !524, isLocal: true, isDefinition: true)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !435, line: 834, size: 128, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !525, file: !435, line: 836, baseType: !121, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !525, file: !435, line: 837, baseType: !63, size: 64, offset: 64)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "nslots", scope: !434, file: !435, line: 843, type: !67, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "slotvec0", scope: !434, file: !435, line: 844, type: !525, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 704, elements: !535)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!535 = !{!536}
!536 = !DISubrange(count: 11)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !539, file: !540, line: 26, type: !542, isLocal: false, isDefinition: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !541, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!541 = !{!537}
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 376, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 47)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !547, file: !548, line: 507, type: !67, isLocal: true, isDefinition: true)
!547 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !548, file: !548, line: 488, type: !549, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !551, retainedNodes: !562)
!548 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = !DISubroutineType(types: !550)
!550 = !{!67, !67, !67}
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !552, globals: !561, splitDebugInlining: false, nameTableKind: None)
!552 = !{!553, !557}
!553 = !DISubprogram(name: "fcntl", scope: !554, file: !554, line: 176, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!554 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!555 = !DISubroutineType(types: !556)
!556 = !{!67, !67, !67, null}
!557 = !DISubprogram(name: "close", scope: !558, file: !558, line: 353, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!558 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!559 = !DISubroutineType(types: !560)
!560 = !{!67, !67}
!561 = !{!545}
!562 = !{!563, !564, !565, !566, !569}
!563 = !DILocalVariable(name: "fd", arg: 1, scope: !547, file: !548, line: 488, type: !67)
!564 = !DILocalVariable(name: "target", arg: 2, scope: !547, file: !548, line: 488, type: !67)
!565 = !DILocalVariable(name: "result", scope: !547, file: !548, line: 490, type: !67)
!566 = !DILocalVariable(name: "flags", scope: !567, file: !548, line: 531, type: !67)
!567 = distinct !DILexicalBlock(scope: !568, file: !548, line: 530, column: 5)
!568 = distinct !DILexicalBlock(scope: !547, file: !548, line: 529, column: 7)
!569 = !DILocalVariable(name: "saved_errno", scope: !570, file: !548, line: 534, type: !67)
!570 = distinct !DILexicalBlock(scope: !571, file: !548, line: 533, column: 9)
!571 = distinct !DILexicalBlock(scope: !567, file: !548, line: 532, column: 11)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !574, retainedTypes: !575, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !{!49}
!575 = !{!576, !579}
!576 = !DISubprogram(name: "posix_fadvise", scope: !554, file: !554, line: 288, type: !577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!577 = !DISubroutineType(types: !578)
!578 = !{!67, !67, !97, !97, !67}
!579 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!580 = !DISubroutineType(types: !581)
!581 = !{!67, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !583, file: !75, line: 51, baseType: !67, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !583, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !583, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !583, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !583, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !583, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !583, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !583, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !583, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !583, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !583, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !583, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !583, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !583, file: !75, line: 70, baseType: !582, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !583, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !583, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !583, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !583, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !583, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !583, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !583, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !583, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !583, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !583, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !583, file: !75, line: 93, baseType: !582, size: 64, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !583, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !583, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !583, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !583, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !616, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!616 = !{!617, !652, !654, !655, !557}
!617 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !618, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!618 = !DISubroutineType(types: !619)
!619 = !{!67, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !621, file: !75, line: 51, baseType: !67, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !621, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !621, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !621, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !621, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !621, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !621, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !621, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !621, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !621, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !621, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !621, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !621, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !621, file: !75, line: 70, baseType: !620, size: 64, offset: 832)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !621, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !621, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !621, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !621, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !621, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !621, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !621, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !621, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !621, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !621, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !621, file: !75, line: 93, baseType: !620, size: 64, offset: 1344)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !621, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !621, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !621, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !621, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!652 = !DISubprogram(name: "dup_safer", scope: !653, file: !653, line: 20, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!653 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !618, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!655 = !DISubprogram(name: "fdopen", scope: !70, file: !70, line: 279, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!656 = !DISubroutineType(types: !657)
!657 = !{!620, !67, !65}
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !660, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!660 = !{!661}
!661 = !DISubprogram(name: "rpl_fcntl", scope: !662, file: !662, line: 588, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!662 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !665, retainedTypes: !669, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!665 = !{!666}
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !664, line: 40, baseType: !7, size: 32, elements: !667)
!667 = !{!668}
!668 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!669 = !{!59, !670, !119}
!670 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!671 = !DISubroutineType(types: !672)
!672 = !{!67, !65, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !674, file: !75, line: 51, baseType: !67, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !674, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !674, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !674, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !674, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !674, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !674, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !674, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !674, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !674, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !674, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !674, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !674, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !674, file: !75, line: 70, baseType: !673, size: 64, offset: 832)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !674, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !674, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !674, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !674, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !674, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !674, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !674, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !674, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !674, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !674, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !674, file: !75, line: 93, baseType: !673, size: 64, offset: 1344)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !674, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !674, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !674, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !674, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !707, retainedTypes: !720, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!707 = !{!708}
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !709, file: !444, line: 186, baseType: !7, size: 32, elements: !718)
!709 = distinct !DISubprogram(name: "x2nrealloc", scope: !444, file: !444, line: 174, type: !710, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !705, retainedNodes: !713)
!710 = !DISubroutineType(types: !711)
!711 = !{!119, !119, !712, !121}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!713 = !{!714, !715, !716, !717}
!714 = !DILocalVariable(name: "p", arg: 1, scope: !709, file: !444, line: 174, type: !119)
!715 = !DILocalVariable(name: "pn", arg: 2, scope: !709, file: !444, line: 174, type: !712)
!716 = !DILocalVariable(name: "s", arg: 3, scope: !709, file: !444, line: 174, type: !121)
!717 = !DILocalVariable(name: "n", scope: !709, file: !444, line: 176, type: !121)
!718 = !{!719}
!719 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!720 = !{!121, !502, !499, !503, !63, !186, !119, !721, !724}
!721 = !DISubprogram(name: "xcalloc", scope: !444, file: !444, line: 57, type: !722, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!722 = !DISubroutineType(types: !723)
!723 = !{!119, !40, !40}
!724 = !DISubprogram(name: "rpl_calloc", scope: !725, file: !725, line: 688, type: !722, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!725 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !728, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!728 = !{!59, !171}
!729 = distinct !DICompileUnit(language: DW_LANG_C99, file: !730, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !731, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!731 = !{!119}
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !734, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!734 = !{!735, !770, !771, !774}
!735 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!736 = !DISubroutineType(types: !737)
!737 = !{!67, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !739, file: !75, line: 51, baseType: !67, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !739, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !739, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !739, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !739, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !739, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !739, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !739, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !739, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !739, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !739, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !739, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !739, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !739, file: !75, line: 70, baseType: !738, size: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !739, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !739, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !739, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !739, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !739, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !739, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !739, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !739, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !739, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !739, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !739, file: !75, line: 93, baseType: !738, size: 64, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !739, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !739, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !739, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !739, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!770 = !DISubprogram(name: "fclose", scope: !70, file: !70, line: 213, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!771 = !DISubprogram(name: "lseek", scope: !558, file: !558, line: 334, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!772 = !DISubroutineType(types: !773)
!773 = !{!97, !67, !97, !67}
!774 = !DISubprogram(name: "rpl_fflush", scope: !176, file: !176, line: 718, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!775 = distinct !DICompileUnit(language: DW_LANG_C99, file: !776, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !777, splitDebugInlining: false, nameTableKind: None)
!776 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!777 = !{!119, !778, !813}
!778 = !DISubprogram(name: "fflush", scope: !70, file: !70, line: 218, type: !779, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!779 = !DISubroutineType(types: !780)
!780 = !{!67, !781}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !782, file: !75, line: 51, baseType: !67, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !782, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !782, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !782, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !782, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !782, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !782, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !782, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !782, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !782, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !782, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !782, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !782, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !782, file: !75, line: 70, baseType: !781, size: 64, offset: 832)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !782, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !782, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !782, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !782, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !782, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !782, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !782, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !782, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !782, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !782, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !782, file: !75, line: 93, baseType: !781, size: 64, offset: 1344)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !782, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !782, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !782, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !782, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!813 = !DISubprogram(name: "rpl_fseeko", scope: !176, file: !176, line: 1034, type: !814, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!814 = !DISubroutineType(types: !815)
!815 = !{!67, !781, !97, !67}
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !818, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!818 = !{!119, !819, !771, !854}
!819 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!820 = !DISubroutineType(types: !821)
!821 = !{!67, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !823, file: !75, line: 51, baseType: !67, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !823, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !823, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !823, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !823, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !823, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !823, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !823, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !823, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !823, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !823, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !823, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !823, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !823, file: !75, line: 70, baseType: !822, size: 64, offset: 832)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !823, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !823, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !823, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !823, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !823, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !823, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !823, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !823, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !823, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !823, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !823, file: !75, line: 93, baseType: !822, size: 64, offset: 1344)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !823, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !823, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !823, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !823, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!854 = !DISubprogram(name: "fseeko", scope: !70, file: !70, line: 707, type: !855, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!855 = !DISubroutineType(types: !856)
!856 = !{!67, !822, !97, !67}
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !859, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!859 = !{!860, !121, !872}
!860 = !DISubprogram(name: "mbrtowc", scope: !486, file: !486, line: 296, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!861 = !DISubroutineType(types: !862)
!862 = !{!40, !165, !65, !40, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !470, line: 13, size: 64, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !864, file: !470, line: 15, baseType: !67, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !864, file: !470, line: 20, baseType: !868, size: 32, offset: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !470, line: 16, size: 32, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !868, file: !470, line: 18, baseType: !7, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !868, file: !470, line: 19, baseType: !478, size: 32)
!872 = !DISubprogram(name: "hard_locale", scope: !873, file: !873, line: 26, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!873 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!874 = !DISubroutineType(types: !875)
!875 = !{!204, !67}
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !878, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!878 = !{!879}
!879 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !880, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!880 = !DISubroutineType(types: !881)
!881 = !{!67, !882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !883, file: !75, line: 51, baseType: !67, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !883, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !883, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !883, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !883, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !883, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !883, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !883, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !883, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !883, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !883, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !883, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !883, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !883, file: !75, line: 70, baseType: !882, size: 64, offset: 832)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !883, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !883, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !883, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !883, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !883, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !883, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !883, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !883, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !883, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !883, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !883, file: !75, line: 93, baseType: !882, size: 64, offset: 1344)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !883, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !883, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !883, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !883, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !916, splitDebugInlining: false, nameTableKind: None)
!915 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!916 = !{!917}
!917 = !DISubprogram(name: "setlocale_null_r", scope: !918, file: !918, line: 64, type: !919, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!918 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!919 = !DISubroutineType(types: !920)
!920 = !{!67, !67, !63, !40}
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !923, retainedTypes: !1310, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!923 = !{!924}
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !925, line: 41, baseType: !7, size: 32, elements: !926)
!925 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
