; ModuleID = 'coreutils-8.32/src/sha256sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.sha256_ctx = type { [8 x i32], [2 x i32], i64, [32 x i32] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"SHA256\00", align 1
@.str.36 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!3 = !DIFile(filename: "src/md5sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !35, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !37, file: !36, line: 187, baseType: !7, size: 32, elements: !47)
!36 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = distinct !DISubprogram(name: "select_plural", scope: !36, file: !36, line: 183, type: !38, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !44, line: 73, baseType: !40)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !{!46}
!46 = !DILocalVariable(name: "n", arg: 1, scope: !37, file: !36, line: 183, type: !41)
!47 = !{!48}
!48 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 45, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!58 = !{!59, !69, !128, !132, !136, !139, !142, !149, !152, !63, !119, !167, !171, !175, !121, !179, !183, !67, !186, !189, !192, !99, !194, !197, !193}
!59 = !DISubprogram(name: "dcgettext", scope: !60, file: !60, line: 51, type: !61, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!60 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !65, !65, !67}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{}
!69 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!67, !65, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !98, !100, !102, !106, !109, !111, !114, !117, !118, !120, !123, !124}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !67, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !73, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !97)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !97)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !73, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !40)
!122 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DISubprogram(name: "set_program_name", scope: !129, file: !129, line: 37, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!129 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !65}
!132 = !DISubprogram(name: "setlocale", scope: !133, file: !133, line: 122, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!133 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!63, !67, !65}
!136 = !DISubprogram(name: "bindtextdomain", scope: !60, file: !60, line: 86, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!137 = !DISubroutineType(types: !138)
!138 = !{!63, !65, !65}
!139 = !DISubprogram(name: "textdomain", scope: !60, file: !60, line: 82, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!140 = !DISubroutineType(types: !141)
!141 = !{!63, !65}
!142 = !DISubprogram(name: "atexit", scope: !143, file: !143, line: 595, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!143 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!67, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DISubprogram(name: "setvbuf", scope: !70, file: !70, line: 308, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!150 = !DISubroutineType(types: !151)
!151 = !{!67, !73, !63, !67, !40}
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 66, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!153 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!67, !67, !156, !65, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 50, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 52, baseType: !65, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 55, baseType: !67, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 57, baseType: !67, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 69, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !73, !65, !65, !65, null}
!171 = !DISubprogram(name: "error", scope: !172, file: !172, line: 52, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!172 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{null, !67, !67, !65, null}
!175 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!176 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !DISubroutineType(types: !178)
!178 = !{!67, !73}
!179 = !DISubprogram(name: "fopen_safer", scope: !180, file: !180, line: 23, type: !181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!180 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !DISubroutineType(types: !182)
!182 = !{!73, !65, !65}
!183 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!184 = !DISubroutineType(types: !185)
!185 = !{!63, !67, !5, !65}
!186 = !DISubprogram(name: "free", scope: !143, file: !143, line: 565, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !119}
!189 = !DISubprogram(name: "dcngettext", scope: !60, file: !60, line: 73, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!190 = !DISubroutineType(types: !191)
!191 = !{!63, !65, !65, !65, !40, !67}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !DISubprogram(name: "fadvise", scope: !50, file: !50, line: 72, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !73, !49}
!197 = !DISubprogram(name: "sha256_stream", scope: !198, file: !198, line: 102, type: !199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!198 = !DIFile(filename: "./lib/sha256.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{!67, !73, !119}
!201 = !{!202, !205, !207, !0, !209, !211, !213, !215, !217, !219, !221, !276}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !204, isLocal: true, isDefinition: true)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !121, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !121, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !204, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !204, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !204, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !204, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !204, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !193, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "bin2hex", scope: !223, file: !3, line: 730, type: !273, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !224, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !65}
!226 = !{!227, !228, !232, !233, !234, !235, !236, !237, !238, !242, !243, !244, !245, !246, !247, !249, !250, !251, !255, !258, !259, !260, !264, !265, !271}
!227 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !223, file: !3, line: 652, type: !65)
!228 = !DILocalVariable(name: "checkfile_stream", scope: !223, file: !3, line: 654, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !74)
!231 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!232 = !DILocalVariable(name: "n_misformatted_lines", scope: !223, file: !3, line: 655, type: !41)
!233 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !223, file: !3, line: 656, type: !41)
!234 = !DILocalVariable(name: "n_mismatched_checksums", scope: !223, file: !3, line: 657, type: !41)
!235 = !DILocalVariable(name: "n_open_or_read_failures", scope: !223, file: !3, line: 658, type: !41)
!236 = !DILocalVariable(name: "properly_formatted_lines", scope: !223, file: !3, line: 659, type: !204)
!237 = !DILocalVariable(name: "matched_checksums", scope: !223, file: !3, line: 660, type: !204)
!238 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !223, file: !3, line: 661, type: !239)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 288, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 36)
!242 = !DILocalVariable(name: "bin_buffer", scope: !223, file: !3, line: 663, type: !192)
!243 = !DILocalVariable(name: "line_number", scope: !223, file: !3, line: 664, type: !41)
!244 = !DILocalVariable(name: "line", scope: !223, file: !3, line: 665, type: !63)
!245 = !DILocalVariable(name: "line_chars_allocated", scope: !223, file: !3, line: 666, type: !121)
!246 = !DILocalVariable(name: "is_stdin", scope: !223, file: !3, line: 667, type: !204)
!247 = !DILocalVariable(name: "filename", scope: !248, file: !3, line: 690, type: !63)
!248 = distinct !DILexicalBlock(scope: !223, file: !3, line: 689, column: 5)
!249 = !DILocalVariable(name: "binary", scope: !248, file: !3, line: 691, type: !67)
!250 = !DILocalVariable(name: "hex_digest", scope: !248, file: !3, line: 692, type: !192)
!251 = !DILocalVariable(name: "line_length", scope: !248, file: !3, line: 693, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !253, line: 108, baseType: !254)
!253 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !44, line: 193, baseType: !97)
!255 = !DILocalVariable(name: "ok", scope: !256, file: !3, line: 734, type: !204)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 729, column: 9)
!257 = distinct !DILexicalBlock(scope: !248, file: !3, line: 712, column: 11)
!258 = !DILocalVariable(name: "missing", scope: !256, file: !3, line: 735, type: !204)
!259 = !DILocalVariable(name: "needs_escape", scope: !256, file: !3, line: 738, type: !204)
!260 = !DILocalVariable(name: "digest_bin_bytes", scope: !261, file: !3, line: 762, type: !121)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 761, column: 13)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 755, column: 20)
!263 = distinct !DILexicalBlock(scope: !256, file: !3, line: 744, column: 15)
!264 = !DILocalVariable(name: "cnt", scope: !261, file: !3, line: 763, type: !121)
!265 = !DILocalVariable(name: "__res", scope: !266, file: !3, line: 769, type: !67)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 769, column: 23)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 769, column: 23)
!268 = distinct !DILexicalBlock(scope: !269, file: !3, line: 768, column: 17)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 767, column: 15)
!270 = distinct !DILexicalBlock(scope: !261, file: !3, line: 767, column: 15)
!271 = !DILocalVariable(name: "__res", scope: !272, file: !3, line: 771, type: !67)
!272 = distinct !DILexicalBlock(scope: !267, file: !3, line: 771, column: 27)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 16)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !67, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 3328, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 13)
!281 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!282 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!283 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!284 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!285 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!286 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!287 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 66, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!288 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 64, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!289 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "Version", scope: !292, file: !293, line: 2, type: !65, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !294, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = !{!290}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 46, type: !65, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !299, globals: !337, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!300, !59, !336, !171}
!300 = !DISubprogram(name: "close_stream", scope: !301, file: !301, line: 2, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!301 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !DISubroutineType(types: !303)
!303 = !{!67, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !305, file: !75, line: 51, baseType: !67, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !305, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !305, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !305, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !305, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !305, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !305, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !305, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !305, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !305, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !305, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !305, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !305, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !305, file: !75, line: 70, baseType: !304, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !305, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !305, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !305, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !305, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !305, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !305, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !305, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !305, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !305, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !305, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !305, file: !75, line: 93, baseType: !304, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !305, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !305, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !305, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !305, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!336 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!337 = !{!295, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 56, type: !204, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "fillbuf", scope: !342, file: !343, line: 54, type: !385, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, retainedTypes: !351, globals: !378, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/sha256.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !{!345, !348}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 33, baseType: !7, size: 32, elements: !346)
!346 = !{!347}
!347 = !DIEnumerator(name: "SHA256_DIGEST_SIZE", value: 32, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 32, baseType: !7, size: 32, elements: !349)
!349 = !{!350}
!350 = !DIEnumerator(name: "SHA224_DIGEST_SIZE", value: 28, isUnsigned: true)
!351 = !{!352, !63, !376, !65, !377, !186}
!352 = !DISubprogram(name: "sha256_process_bytes", scope: !198, file: !198, line: 66, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355, !40, !357}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sha256_ctx", file: !198, line: 42, size: 1408, elements: !359)
!359 = !{!360, !367, !371, !372}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !358, file: !198, line: 44, baseType: !361, size: 256)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 256, elements: !365)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !363, line: 26, baseType: !364)
!363 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !44, line: 42, baseType: !7)
!365 = !{!366}
!366 = !DISubrange(count: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !358, file: !198, line: 46, baseType: !368, size: 64, offset: 256)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 64, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 2)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !358, file: !198, line: 47, baseType: !121, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !358, file: !198, line: 48, baseType: !373, size: 1024, offset: 384)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 1024, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 32)
!376 = !DISubprogram(name: "sha256_process_block", scope: !198, file: !198, line: 59, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !42, line: 90, baseType: !40)
!378 = !{!340, !379}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "sha256_round_constants", scope: !342, file: !343, line: 381, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 2048, elements: !383)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!383 = !{!384}
!384 = !DISubrange(count: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 512, elements: !383)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "exit_failure", scope: !389, file: !390, line: 24, type: !392, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!391 = !{!387}
!392 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "program_name", scope: !395, file: !396, line: 33, type: !65, isLocal: false, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !397, globals: !433, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!397 = !{!119, !398, !63}
!398 = !DISubprogram(name: "fputs", scope: !70, file: !70, line: 626, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!399 = !DISubroutineType(types: !400)
!400 = !{!67, !65, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !402, file: !75, line: 51, baseType: !67, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !402, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !402, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !402, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !402, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !402, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !402, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !402, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !402, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !402, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !402, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !402, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !402, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !402, file: !75, line: 70, baseType: !401, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !402, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !402, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !402, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !402, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !402, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !402, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !402, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !402, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !402, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !402, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !402, file: !75, line: 93, baseType: !401, size: 64, offset: 1344)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !402, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !402, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !402, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !402, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!433 = !{!393}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !436, file: !437, line: 85, type: !535, isLocal: false, isDefinition: true)
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !438, retainedTypes: !444, globals: !508, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!438 = !{!5, !439, !20}
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!442 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!443 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!444 = !{!445, !449, !186, !463, !67, !99, !466, !121, !483, !487, !59, !493, !497, !63, !501, !504, !505}
!445 = !DISubprogram(name: "xmemdup", scope: !446, file: !446, line: 62, type: !447, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!446 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!447 = !DISubroutineType(types: !448)
!448 = !{!119, !355, !40}
!449 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!450 = !DISubroutineType(types: !451)
!451 = !{!63, !65, !40, !452, !453}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !437, line: 65, size: 448, elements: !456)
!456 = !{!457, !458, !459, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !455, file: !437, line: 68, baseType: !5, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !437, line: 71, baseType: !67, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !455, file: !437, line: 75, baseType: !460, size: 256, offset: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !365)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !455, file: !437, line: 78, baseType: !65, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !455, file: !437, line: 81, baseType: !65, size: 64, offset: 384)
!463 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!464 = !DISubroutineType(types: !465)
!465 = !{!63, !67, !65, !65, !65, !40}
!466 = !DISubprogram(name: "rpl_mbrtowc", scope: !467, file: !467, line: 717, type: !468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!467 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!468 = !DISubroutineType(types: !469)
!469 = !{!40, !165, !65, !40, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 13, size: 64, elements: !473)
!472 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !471, file: !472, line: 15, baseType: !67, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !471, file: !472, line: 20, baseType: !476, size: 32, offset: 32)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 16, size: 32, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !476, file: !472, line: 18, baseType: !7, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !476, file: !472, line: 19, baseType: !480, size: 32)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 4)
!483 = !DISubprogram(name: "iswprint", scope: !484, file: !484, line: 120, type: !485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!484 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!485 = !DISubroutineType(types: !486)
!486 = !{!67, !7}
!487 = !DISubprogram(name: "mbsinit", scope: !488, file: !488, line: 292, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!488 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!489 = !DISubroutineType(types: !490)
!490 = !{!67, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!493 = !DISubprogram(name: "locale_charset", scope: !494, file: !494, line: 35, type: !495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!494 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !DISubroutineType(types: !496)
!496 = !{!65}
!497 = !DISubprogram(name: "c_strcasecmp", scope: !498, file: !498, line: 42, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!498 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !DISubroutineType(types: !500)
!500 = !{!67, !65, !65}
!501 = !DISubprogram(name: "xmalloc", scope: !446, file: !446, line: 53, type: !502, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!502 = !DISubroutineType(types: !503)
!503 = !{!119, !40}
!504 = !DISubprogram(name: "xalloc_die", scope: !446, file: !446, line: 51, type: !147, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !68)
!505 = !DISubprogram(name: "xrealloc", scope: !446, file: !446, line: 59, type: !506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!506 = !DISubroutineType(types: !507)
!507 = !{!119, !119, !40}
!508 = !{!434, !509, !515, !517, !519, !524, !531, !533}
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !436, file: !437, line: 101, type: !511, isLocal: false, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 320, elements: !513)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!513 = !{!514}
!514 = !DISubrange(count: 10)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !436, file: !437, line: 1052, type: !455, isLocal: false, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !436, file: !437, line: 116, type: !455, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "slot0", scope: !436, file: !437, line: 842, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 256)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "slotvec", scope: !436, file: !437, line: 845, type: !526, isLocal: true, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !437, line: 834, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !527, file: !437, line: 836, baseType: !121, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !527, file: !437, line: 837, baseType: !63, size: 64, offset: 64)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "nslots", scope: !436, file: !437, line: 843, type: !67, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "slotvec0", scope: !436, file: !437, line: 844, type: !527, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 704, elements: !537)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!537 = !{!538}
!538 = !DISubrange(count: 11)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !541, file: !542, line: 26, type: !544, isLocal: false, isDefinition: true)
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !543, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!543 = !{!539}
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 376, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 47)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !549, file: !550, line: 507, type: !67, isLocal: true, isDefinition: true)
!549 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !550, file: !550, line: 488, type: !551, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !553, retainedNodes: !564)
!550 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !DISubroutineType(types: !552)
!552 = !{!67, !67, !67}
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !554, globals: !563, splitDebugInlining: false, nameTableKind: None)
!554 = !{!555, !559}
!555 = !DISubprogram(name: "fcntl", scope: !556, file: !556, line: 176, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!556 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!557 = !DISubroutineType(types: !558)
!558 = !{!67, !67, !67, null}
!559 = !DISubprogram(name: "close", scope: !560, file: !560, line: 353, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!560 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!561 = !DISubroutineType(types: !562)
!562 = !{!67, !67}
!563 = !{!547}
!564 = !{!565, !566, !567, !568, !571}
!565 = !DILocalVariable(name: "fd", arg: 1, scope: !549, file: !550, line: 488, type: !67)
!566 = !DILocalVariable(name: "target", arg: 2, scope: !549, file: !550, line: 488, type: !67)
!567 = !DILocalVariable(name: "result", scope: !549, file: !550, line: 490, type: !67)
!568 = !DILocalVariable(name: "flags", scope: !569, file: !550, line: 531, type: !67)
!569 = distinct !DILexicalBlock(scope: !570, file: !550, line: 530, column: 5)
!570 = distinct !DILexicalBlock(scope: !549, file: !550, line: 529, column: 7)
!571 = !DILocalVariable(name: "saved_errno", scope: !572, file: !550, line: 534, type: !67)
!572 = distinct !DILexicalBlock(scope: !573, file: !550, line: 533, column: 9)
!573 = distinct !DILexicalBlock(scope: !569, file: !550, line: 532, column: 11)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !576, retainedTypes: !577, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !{!49}
!577 = !{!578, !581}
!578 = !DISubprogram(name: "posix_fadvise", scope: !556, file: !556, line: 288, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!579 = !DISubroutineType(types: !580)
!580 = !{!67, !67, !97, !97, !67}
!581 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!582 = !DISubroutineType(types: !583)
!583 = !{!67, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !585, file: !75, line: 51, baseType: !67, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !585, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !585, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !585, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !585, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !585, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !585, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !585, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !585, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !585, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !585, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !585, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !585, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !585, file: !75, line: 70, baseType: !584, size: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !585, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !585, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !585, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !585, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !585, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !585, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !585, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !585, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !585, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !585, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !585, file: !75, line: 93, baseType: !584, size: 64, offset: 1344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !585, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !585, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !585, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !585, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !618, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!618 = !{!619, !654, !656, !657, !559}
!619 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!620 = !DISubroutineType(types: !621)
!621 = !{!67, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !623, file: !75, line: 51, baseType: !67, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !623, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !623, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !623, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !623, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !623, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !623, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !623, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !623, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !623, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !623, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !623, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !623, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !623, file: !75, line: 70, baseType: !622, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !623, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !623, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !623, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !623, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !623, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !623, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !623, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !623, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !623, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !623, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !623, file: !75, line: 93, baseType: !622, size: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !623, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !623, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !623, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !623, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!654 = !DISubprogram(name: "dup_safer", scope: !655, file: !655, line: 20, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!655 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!657 = !DISubprogram(name: "fdopen", scope: !70, file: !70, line: 279, type: !658, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!658 = !DISubroutineType(types: !659)
!659 = !{!622, !67, !65}
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !662, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!662 = !{!663}
!663 = !DISubprogram(name: "rpl_fcntl", scope: !664, file: !664, line: 588, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!664 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !667, retainedTypes: !671, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!667 = !{!668}
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !666, line: 40, baseType: !7, size: 32, elements: !669)
!669 = !{!670}
!670 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!671 = !{!59, !672, !119}
!672 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!673 = !DISubroutineType(types: !674)
!674 = !{!67, !65, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !676, file: !75, line: 51, baseType: !67, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !676, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !676, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !676, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !676, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !676, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !676, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !676, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !676, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !676, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !676, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !676, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !676, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !676, file: !75, line: 70, baseType: !675, size: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !676, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !676, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !676, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !676, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !676, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !676, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !676, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !676, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !676, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !676, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !676, file: !75, line: 93, baseType: !675, size: 64, offset: 1344)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !676, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !676, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !676, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !676, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !709, retainedTypes: !722, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!709 = !{!710}
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !711, file: !446, line: 186, baseType: !7, size: 32, elements: !720)
!711 = distinct !DISubprogram(name: "x2nrealloc", scope: !446, file: !446, line: 174, type: !712, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !707, retainedNodes: !715)
!712 = !DISubroutineType(types: !713)
!713 = !{!119, !119, !714, !121}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!715 = !{!716, !717, !718, !719}
!716 = !DILocalVariable(name: "p", arg: 1, scope: !711, file: !446, line: 174, type: !119)
!717 = !DILocalVariable(name: "pn", arg: 2, scope: !711, file: !446, line: 174, type: !714)
!718 = !DILocalVariable(name: "s", arg: 3, scope: !711, file: !446, line: 174, type: !121)
!719 = !DILocalVariable(name: "n", scope: !711, file: !446, line: 176, type: !121)
!720 = !{!721}
!721 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!722 = !{!121, !504, !501, !505, !63, !186, !119, !723, !726}
!723 = !DISubprogram(name: "xcalloc", scope: !446, file: !446, line: 57, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!724 = !DISubroutineType(types: !725)
!725 = !{!119, !40, !40}
!726 = !DISubprogram(name: "rpl_calloc", scope: !727, file: !727, line: 688, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!727 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !730, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!59, !171}
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !733, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!733 = !{!119}
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !736, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!736 = !{!737, !772, !773, !776}
!737 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!738 = !DISubroutineType(types: !739)
!739 = !{!67, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !741, file: !75, line: 51, baseType: !67, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !741, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !741, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !741, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !741, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !741, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !741, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !741, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !741, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !741, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !741, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !741, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !741, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !741, file: !75, line: 70, baseType: !740, size: 64, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !741, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !741, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !741, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !741, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !741, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !741, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !741, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !741, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !741, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !741, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !741, file: !75, line: 93, baseType: !740, size: 64, offset: 1344)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !741, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !741, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !741, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !741, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!772 = !DISubprogram(name: "fclose", scope: !70, file: !70, line: 213, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!773 = !DISubprogram(name: "lseek", scope: !560, file: !560, line: 334, type: !774, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!774 = !DISubroutineType(types: !775)
!775 = !{!97, !67, !97, !67}
!776 = !DISubprogram(name: "rpl_fflush", scope: !176, file: !176, line: 718, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !779, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!779 = !{!119, !780, !815}
!780 = !DISubprogram(name: "fflush", scope: !70, file: !70, line: 218, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!781 = !DISubroutineType(types: !782)
!782 = !{!67, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !784, file: !75, line: 51, baseType: !67, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !784, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !784, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !784, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !784, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !784, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !784, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !784, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !784, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !784, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !784, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !784, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !784, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !784, file: !75, line: 70, baseType: !783, size: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !784, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !784, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !784, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !784, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !784, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !784, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !784, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !784, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !784, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !784, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !784, file: !75, line: 93, baseType: !783, size: 64, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !784, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !784, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !784, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !784, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!815 = !DISubprogram(name: "rpl_fseeko", scope: !176, file: !176, line: 1034, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!816 = !DISubroutineType(types: !817)
!817 = !{!67, !783, !97, !67}
!818 = distinct !DICompileUnit(language: DW_LANG_C99, file: !819, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!819 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!820 = !{!119, !821, !773, !856}
!821 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !822, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!822 = !DISubroutineType(types: !823)
!823 = !{!67, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !825, file: !75, line: 51, baseType: !67, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !825, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !825, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !825, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !825, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !825, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !825, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !825, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !825, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !825, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !825, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !825, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !825, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !825, file: !75, line: 70, baseType: !824, size: 64, offset: 832)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !825, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !825, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !825, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !825, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !825, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !825, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !825, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !825, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !825, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !825, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !825, file: !75, line: 93, baseType: !824, size: 64, offset: 1344)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !825, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !825, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !825, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !825, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!856 = !DISubprogram(name: "fseeko", scope: !70, file: !70, line: 707, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!857 = !DISubroutineType(types: !858)
!858 = !{!67, !824, !97, !67}
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!861 = !{!862, !121, !874}
!862 = !DISubprogram(name: "mbrtowc", scope: !488, file: !488, line: 296, type: !863, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!863 = !DISubroutineType(types: !864)
!864 = !{!40, !165, !65, !40, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 13, size: 64, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !866, file: !472, line: 15, baseType: !67, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !866, file: !472, line: 20, baseType: !870, size: 32, offset: 32)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !866, file: !472, line: 16, size: 32, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !870, file: !472, line: 18, baseType: !7, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !870, file: !472, line: 19, baseType: !480, size: 32)
!874 = !DISubprogram(name: "hard_locale", scope: !875, file: !875, line: 26, type: !876, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!875 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!876 = !DISubroutineType(types: !877)
!877 = !{!204, !67}
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !880, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!880 = !{!881}
!881 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!882 = !DISubroutineType(types: !883)
!883 = !{!67, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !885, file: !75, line: 51, baseType: !67, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !885, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !885, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !885, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !885, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !885, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !885, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !885, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !885, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !885, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !885, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !885, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !885, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !885, file: !75, line: 70, baseType: !884, size: 64, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !885, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !885, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !885, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !885, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !885, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !885, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !885, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !885, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !885, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !885, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !885, file: !75, line: 93, baseType: !884, size: 64, offset: 1344)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !885, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !885, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !885, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !885, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !918, splitDebugInlining: false, nameTableKind: None)
!917 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!918 = !{!919}
!919 = !DISubprogram(name: "setlocale_null_r", scope: !920, file: !920, line: 64, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!920 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!921 = !DISubroutineType(types: !922)
!922 = !{!67, !67, !63, !40}
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !925, retainedTypes: !1312, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!925 = !{!926}
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !927, line: 41, baseType: !7, size: 32, elements: !928)
!927 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
