source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.sha512_ctx = type { [8 x i64], [2 x i64], i64, [32 x i64] }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"SHA512\00", align 1
@.str.36 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!3 = !DIFile(filename: "src/md5sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !35, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !37, file: !36, line: 187, baseType: !7, size: 32, elements: !47)
!36 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = distinct !DISubprogram(name: "select_plural", scope: !36, file: !36, line: 183, type: !38, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !44, line: 73, baseType: !40)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !{!46}
!46 = !DILocalVariable(name: "n", arg: 1, scope: !37, file: !36, line: 183, type: !41)
!47 = !{!48}
!48 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 45, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!58 = !{!59, !69, !128, !132, !136, !139, !142, !149, !152, !63, !119, !167, !171, !175, !121, !179, !183, !67, !186, !189, !192, !99, !194, !197, !193}
!59 = !DISubprogram(name: "dcgettext", scope: !60, file: !60, line: 51, type: !61, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!60 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !65, !65, !67}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{}
!69 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !71, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!67, !65, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !98, !100, !102, !106, !109, !111, !114, !117, !118, !120, !123, !124}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !67, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !73, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !97)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !97)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !73, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !40)
!122 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DISubprogram(name: "set_program_name", scope: !129, file: !129, line: 37, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!129 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !65}
!132 = !DISubprogram(name: "setlocale", scope: !133, file: !133, line: 122, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!133 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!63, !67, !65}
!136 = !DISubprogram(name: "bindtextdomain", scope: !60, file: !60, line: 86, type: !137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!137 = !DISubroutineType(types: !138)
!138 = !{!63, !65, !65}
!139 = !DISubprogram(name: "textdomain", scope: !60, file: !60, line: 82, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!140 = !DISubroutineType(types: !141)
!141 = !{!63, !65}
!142 = !DISubprogram(name: "atexit", scope: !143, file: !143, line: 595, type: !144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!143 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!67, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DISubprogram(name: "setvbuf", scope: !70, file: !70, line: 308, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!150 = !DISubroutineType(types: !151)
!151 = !{!67, !73, !63, !67, !40}
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 66, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!153 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!67, !67, !156, !65, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 50, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 52, baseType: !65, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 55, baseType: !67, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 57, baseType: !67, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 69, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !73, !65, !65, !65, null}
!171 = !DISubprogram(name: "error", scope: !172, file: !172, line: 52, type: !173, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!172 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{null, !67, !67, !65, null}
!175 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!176 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !DISubroutineType(types: !178)
!178 = !{!67, !73}
!179 = !DISubprogram(name: "fopen_safer", scope: !180, file: !180, line: 23, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!180 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !DISubroutineType(types: !182)
!182 = !{!73, !65, !65}
!183 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!184 = !DISubroutineType(types: !185)
!185 = !{!63, !67, !5, !65}
!186 = !DISubprogram(name: "free", scope: !143, file: !143, line: 565, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !119}
!189 = !DISubprogram(name: "dcngettext", scope: !60, file: !60, line: 73, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!190 = !DISubroutineType(types: !191)
!191 = !{!63, !65, !65, !65, !40, !67}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !DISubprogram(name: "fadvise", scope: !50, file: !50, line: 72, type: !195, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !73, !49}
!197 = !DISubprogram(name: "sha512_stream", scope: !198, file: !198, line: 105, type: !199, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!198 = !DIFile(filename: "./lib/sha512.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{!67, !73, !119}
!201 = !{!202, !205, !207, !0, !209, !211, !213, !215, !217, !219, !221, !276}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !204, isLocal: true, isDefinition: true)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !121, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !121, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !204, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !204, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !204, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !204, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !204, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !193, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "bin2hex", scope: !223, file: !3, line: 730, type: !273, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !224, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !65}
!226 = !{!227, !228, !232, !233, !234, !235, !236, !237, !238, !242, !243, !244, !245, !246, !247, !249, !250, !251, !255, !258, !259, !260, !264, !265, !271}
!227 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !223, file: !3, line: 652, type: !65)
!228 = !DILocalVariable(name: "checkfile_stream", scope: !223, file: !3, line: 654, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !74)
!231 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!232 = !DILocalVariable(name: "n_misformatted_lines", scope: !223, file: !3, line: 655, type: !41)
!233 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !223, file: !3, line: 656, type: !41)
!234 = !DILocalVariable(name: "n_mismatched_checksums", scope: !223, file: !3, line: 657, type: !41)
!235 = !DILocalVariable(name: "n_open_or_read_failures", scope: !223, file: !3, line: 658, type: !41)
!236 = !DILocalVariable(name: "properly_formatted_lines", scope: !223, file: !3, line: 659, type: !204)
!237 = !DILocalVariable(name: "matched_checksums", scope: !223, file: !3, line: 660, type: !204)
!238 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !223, file: !3, line: 661, type: !239)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 576, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 72)
!242 = !DILocalVariable(name: "bin_buffer", scope: !223, file: !3, line: 663, type: !192)
!243 = !DILocalVariable(name: "line_number", scope: !223, file: !3, line: 664, type: !41)
!244 = !DILocalVariable(name: "line", scope: !223, file: !3, line: 665, type: !63)
!245 = !DILocalVariable(name: "line_chars_allocated", scope: !223, file: !3, line: 666, type: !121)
!246 = !DILocalVariable(name: "is_stdin", scope: !223, file: !3, line: 667, type: !204)
!247 = !DILocalVariable(name: "filename", scope: !248, file: !3, line: 690, type: !63)
!248 = distinct !DILexicalBlock(scope: !223, file: !3, line: 689, column: 5)
!249 = !DILocalVariable(name: "binary", scope: !248, file: !3, line: 691, type: !67)
!250 = !DILocalVariable(name: "hex_digest", scope: !248, file: !3, line: 692, type: !192)
!251 = !DILocalVariable(name: "line_length", scope: !248, file: !3, line: 693, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !253, line: 108, baseType: !254)
!253 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !44, line: 193, baseType: !97)
!255 = !DILocalVariable(name: "ok", scope: !256, file: !3, line: 734, type: !204)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 729, column: 9)
!257 = distinct !DILexicalBlock(scope: !248, file: !3, line: 712, column: 11)
!258 = !DILocalVariable(name: "missing", scope: !256, file: !3, line: 735, type: !204)
!259 = !DILocalVariable(name: "needs_escape", scope: !256, file: !3, line: 738, type: !204)
!260 = !DILocalVariable(name: "digest_bin_bytes", scope: !261, file: !3, line: 762, type: !121)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 761, column: 13)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 755, column: 20)
!263 = distinct !DILexicalBlock(scope: !256, file: !3, line: 744, column: 15)
!264 = !DILocalVariable(name: "cnt", scope: !261, file: !3, line: 763, type: !121)
!265 = !DILocalVariable(name: "__res", scope: !266, file: !3, line: 769, type: !67)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 769, column: 23)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 769, column: 23)
!268 = distinct !DILexicalBlock(scope: !269, file: !3, line: 768, column: 17)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 767, column: 15)
!270 = distinct !DILexicalBlock(scope: !261, file: !3, line: 767, column: 15)
!271 = !DILocalVariable(name: "__res", scope: !272, file: !3, line: 771, type: !67)
!272 = distinct !DILexicalBlock(scope: !267, file: !3, line: 771, column: 27)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 16)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !67, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 3328, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 13)
!281 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!282 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!283 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!284 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!285 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!286 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!287 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 130, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!288 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 128, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!289 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "Version", scope: !292, file: !293, line: 2, type: !65, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, globals: !294, nameTableKind: None)
!293 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = !{!290}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 46, type: !65, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !299, globals: !337, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!300, !59, !336, !171}
!300 = !DISubprogram(name: "close_stream", scope: !301, file: !301, line: 2, type: !302, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!301 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !DISubroutineType(types: !303)
!303 = !{!67, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !305, file: !75, line: 51, baseType: !67, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !305, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !305, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !305, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !305, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !305, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !305, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !305, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !305, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !305, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !305, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !305, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !305, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !305, file: !75, line: 70, baseType: !304, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !305, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !305, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !305, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !305, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !305, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !305, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !305, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !305, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !305, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !305, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !305, file: !75, line: 93, baseType: !304, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !305, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !305, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !305, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !305, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!336 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!337 = !{!295, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 56, type: !204, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "fillbuf", scope: !342, file: !343, line: 54, type: !387, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !344, retainedTypes: !351, globals: !380, nameTableKind: None)
!343 = !DIFile(filename: "lib/sha512.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !{!345, !348}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 33, baseType: !7, size: 32, elements: !346)
!346 = !{!347}
!347 = !DIEnumerator(name: "SHA512_DIGEST_SIZE", value: 64, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 32, baseType: !7, size: 32, elements: !349)
!349 = !{!350}
!350 = !DIEnumerator(name: "SHA384_DIGEST_SIZE", value: 48, isUnsigned: true)
!351 = !{!352, !357, !63, !378, !65, !379, !186}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !353, line: 37, baseType: !354)
!353 = !DIFile(filename: "./lib/u64.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !355, line: 27, baseType: !356)
!355 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !44, line: 45, baseType: !40)
!357 = !DISubprogram(name: "sha512_process_bytes", scope: !198, file: !198, line: 66, type: !358, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !360, !40, !362}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sha512_ctx", file: !198, line: 42, size: 2752, elements: !364)
!364 = !{!365, !369, !373, !374}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !363, file: !198, line: 44, baseType: !366, size: 512)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 512, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !363, file: !198, line: 46, baseType: !370, size: 128, offset: 512)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 128, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 2)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !363, file: !198, line: 47, baseType: !121, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !363, file: !198, line: 48, baseType: !375, size: 2048, offset: 704)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 2048, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 32)
!378 = !DISubprogram(name: "sha512_process_block", scope: !198, file: !198, line: 59, type: !358, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !42, line: 90, baseType: !40)
!380 = !{!340, !381}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "sha512_round_constants", scope: !342, file: !343, line: 382, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 5120, elements: !385)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!385 = !{!386}
!386 = !DISubrange(count: 80)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 1024, elements: !389)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!389 = !{!390}
!390 = !DISubrange(count: 128)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "exit_failure", scope: !393, file: !394, line: 24, type: !396, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, globals: !395, nameTableKind: None)
!394 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!395 = !{!391}
!396 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "program_name", scope: !399, file: !400, line: 33, type: !65, isDefinition: true)
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !401, globals: !437, nameTableKind: None)
!400 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!401 = !{!119, !402, !63}
!402 = !DISubprogram(name: "fputs", scope: !70, file: !70, line: 626, type: !403, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!403 = !DISubroutineType(types: !404)
!404 = !{!67, !65, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !406, file: !75, line: 51, baseType: !67, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !406, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !406, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !406, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !406, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !406, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !406, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !406, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !406, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !406, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !406, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !406, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !406, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !406, file: !75, line: 70, baseType: !405, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !406, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !406, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !406, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !406, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !406, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !406, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !406, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !406, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !406, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !406, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !406, file: !75, line: 93, baseType: !405, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !406, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !406, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !406, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !406, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!437 = !{!397}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !440, file: !441, line: 85, type: !539, isDefinition: true)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !442, retainedTypes: !448, globals: !512, nameTableKind: None)
!441 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!5, !443, !20}
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!446 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!447 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!448 = !{!449, !453, !186, !467, !67, !99, !470, !121, !487, !491, !59, !497, !501, !63, !505, !508, !509}
!449 = !DISubprogram(name: "xmemdup", scope: !450, file: !450, line: 62, type: !451, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!450 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!451 = !DISubroutineType(types: !452)
!452 = !{!119, !360, !40}
!453 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !454, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!454 = !DISubroutineType(types: !455)
!455 = !{!63, !65, !40, !456, !457}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !441, line: 65, size: 448, elements: !460)
!460 = !{!461, !462, !463, !465, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !459, file: !441, line: 68, baseType: !5, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !459, file: !441, line: 71, baseType: !67, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !459, file: !441, line: 75, baseType: !464, size: 256, offset: 64)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !367)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !459, file: !441, line: 78, baseType: !65, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !459, file: !441, line: 81, baseType: !65, size: 64, offset: 384)
!467 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !468, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!468 = !DISubroutineType(types: !469)
!469 = !{!63, !67, !65, !65, !65, !40}
!470 = !DISubprogram(name: "rpl_mbrtowc", scope: !471, file: !471, line: 717, type: !472, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!471 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!472 = !DISubroutineType(types: !473)
!473 = !{!40, !165, !65, !40, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 13, size: 64, elements: !477)
!476 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !475, file: !476, line: 15, baseType: !67, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !475, file: !476, line: 20, baseType: !480, size: 32, offset: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !475, file: !476, line: 16, size: 32, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !480, file: !476, line: 18, baseType: !7, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !480, file: !476, line: 19, baseType: !484, size: 32)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 4)
!487 = !DISubprogram(name: "iswprint", scope: !488, file: !488, line: 120, type: !489, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!488 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!489 = !DISubroutineType(types: !490)
!490 = !{!67, !7}
!491 = !DISubprogram(name: "mbsinit", scope: !492, file: !492, line: 292, type: !493, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!492 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!493 = !DISubroutineType(types: !494)
!494 = !{!67, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!497 = !DISubprogram(name: "locale_charset", scope: !498, file: !498, line: 35, type: !499, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!498 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !DISubroutineType(types: !500)
!500 = !{!65}
!501 = !DISubprogram(name: "c_strcasecmp", scope: !502, file: !502, line: 42, type: !503, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!502 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !DISubroutineType(types: !504)
!504 = !{!67, !65, !65}
!505 = !DISubprogram(name: "xmalloc", scope: !450, file: !450, line: 53, type: !506, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!506 = !DISubroutineType(types: !507)
!507 = !{!119, !40}
!508 = !DISubprogram(name: "xalloc_die", scope: !450, file: !450, line: 51, type: !147, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !68)
!509 = !DISubprogram(name: "xrealloc", scope: !450, file: !450, line: 59, type: !510, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!510 = !DISubroutineType(types: !511)
!511 = !{!119, !119, !40}
!512 = !{!438, !513, !519, !521, !523, !528, !535, !537}
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !440, file: !441, line: 101, type: !515, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 320, elements: !517)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!517 = !{!518}
!518 = !DISubrange(count: 10)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !440, file: !441, line: 1052, type: !459, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !440, file: !441, line: 116, type: !459, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "slot0", scope: !440, file: !441, line: 842, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 256)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "slotvec", scope: !440, file: !441, line: 845, type: !530, isLocal: true, isDefinition: true)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !441, line: 834, size: 128, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !531, file: !441, line: 836, baseType: !121, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !531, file: !441, line: 837, baseType: !63, size: 64, offset: 64)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "nslots", scope: !440, file: !441, line: 843, type: !67, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "slotvec0", scope: !440, file: !441, line: 844, type: !531, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 704, elements: !541)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!541 = !{!542}
!542 = !DISubrange(count: 11)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !545, file: !546, line: 26, type: !548, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, globals: !547, nameTableKind: None)
!546 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = !{!543}
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 376, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 47)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !553, file: !554, line: 507, type: !67, isLocal: true, isDefinition: true)
!553 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !554, file: !554, line: 488, type: !555, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !557, retainedNodes: !568)
!554 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = !DISubroutineType(types: !556)
!556 = !{!67, !67, !67}
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !558, globals: !567, nameTableKind: None)
!558 = !{!559, !563}
!559 = !DISubprogram(name: "fcntl", scope: !560, file: !560, line: 176, type: !561, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!560 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!561 = !DISubroutineType(types: !562)
!562 = !{!67, !67, !67, null}
!563 = !DISubprogram(name: "close", scope: !564, file: !564, line: 353, type: !565, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!564 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!565 = !DISubroutineType(types: !566)
!566 = !{!67, !67}
!567 = !{!551}
!568 = !{!569, !570, !571, !572, !575}
!569 = !DILocalVariable(name: "fd", arg: 1, scope: !553, file: !554, line: 488, type: !67)
!570 = !DILocalVariable(name: "target", arg: 2, scope: !553, file: !554, line: 488, type: !67)
!571 = !DILocalVariable(name: "result", scope: !553, file: !554, line: 490, type: !67)
!572 = !DILocalVariable(name: "flags", scope: !573, file: !554, line: 531, type: !67)
!573 = distinct !DILexicalBlock(scope: !574, file: !554, line: 530, column: 5)
!574 = distinct !DILexicalBlock(scope: !553, file: !554, line: 529, column: 7)
!575 = !DILocalVariable(name: "saved_errno", scope: !576, file: !554, line: 534, type: !67)
!576 = distinct !DILexicalBlock(scope: !577, file: !554, line: 533, column: 9)
!577 = distinct !DILexicalBlock(scope: !573, file: !554, line: 532, column: 11)
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !580, retainedTypes: !581, nameTableKind: None)
!579 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!580 = !{!49}
!581 = !{!582, !585}
!582 = !DISubprogram(name: "posix_fadvise", scope: !560, file: !560, line: 288, type: !583, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!583 = !DISubroutineType(types: !584)
!584 = !{!67, !67, !97, !97, !67}
!585 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !586, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!586 = !DISubroutineType(types: !587)
!587 = !{!67, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !589, file: !75, line: 51, baseType: !67, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !589, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !589, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !589, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !589, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !589, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !589, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !589, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !589, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !589, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !589, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !589, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !589, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !589, file: !75, line: 70, baseType: !588, size: 64, offset: 832)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !589, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !589, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !589, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !589, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !589, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !589, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !589, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !589, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !589, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !589, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !589, file: !75, line: 93, baseType: !588, size: 64, offset: 1344)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !589, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !589, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !589, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !589, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !622, nameTableKind: None)
!621 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!622 = !{!623, !658, !660, !661, !563}
!623 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !624, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!624 = !DISubroutineType(types: !625)
!625 = !{!67, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !627, file: !75, line: 51, baseType: !67, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !627, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !627, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !627, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !627, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !627, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !627, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !627, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !627, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !627, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !627, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !627, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !627, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !627, file: !75, line: 70, baseType: !626, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !627, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !627, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !627, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !627, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !627, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !627, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !627, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !627, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !627, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !627, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !627, file: !75, line: 93, baseType: !626, size: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !627, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !627, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !627, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !627, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!658 = !DISubprogram(name: "dup_safer", scope: !659, file: !659, line: 20, type: !565, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!659 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!660 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !624, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!661 = !DISubprogram(name: "fdopen", scope: !70, file: !70, line: 279, type: !662, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!662 = !DISubroutineType(types: !663)
!663 = !{!626, !67, !65}
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !666, nameTableKind: None)
!665 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!666 = !{!667}
!667 = !DISubprogram(name: "rpl_fcntl", scope: !668, file: !668, line: 588, type: !561, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!668 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !671, retainedTypes: !675, nameTableKind: None)
!670 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!671 = !{!672}
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 40, baseType: !7, size: 32, elements: !673)
!673 = !{!674}
!674 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!675 = !{!59, !676, !119}
!676 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !677, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!677 = !DISubroutineType(types: !678)
!678 = !{!67, !65, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !680, file: !75, line: 51, baseType: !67, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !680, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !680, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !680, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !680, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !680, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !680, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !680, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !680, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !680, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !680, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !680, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !680, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !680, file: !75, line: 70, baseType: !679, size: 64, offset: 832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !680, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !680, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !680, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !680, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !680, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !680, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !680, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !680, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !680, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !680, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !680, file: !75, line: 93, baseType: !679, size: 64, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !680, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !680, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !680, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !680, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !713, retainedTypes: !726, nameTableKind: None)
!712 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!713 = !{!714}
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !715, file: !450, line: 186, baseType: !7, size: 32, elements: !724)
!715 = distinct !DISubprogram(name: "x2nrealloc", scope: !450, file: !450, line: 174, type: !716, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !711, retainedNodes: !719)
!716 = !DISubroutineType(types: !717)
!717 = !{!119, !119, !718, !121}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!719 = !{!720, !721, !722, !723}
!720 = !DILocalVariable(name: "p", arg: 1, scope: !715, file: !450, line: 174, type: !119)
!721 = !DILocalVariable(name: "pn", arg: 2, scope: !715, file: !450, line: 174, type: !718)
!722 = !DILocalVariable(name: "s", arg: 3, scope: !715, file: !450, line: 174, type: !121)
!723 = !DILocalVariable(name: "n", scope: !715, file: !450, line: 176, type: !121)
!724 = !{!725}
!725 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!726 = !{!121, !508, !505, !509, !63, !186, !119, !727, !730}
!727 = !DISubprogram(name: "xcalloc", scope: !450, file: !450, line: 57, type: !728, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!728 = !DISubroutineType(types: !729)
!729 = !{!119, !40, !40}
!730 = !DISubprogram(name: "rpl_calloc", scope: !731, file: !731, line: 688, type: !728, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!731 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !734, nameTableKind: None)
!733 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!734 = !{!59, !171}
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !737, nameTableKind: None)
!736 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!737 = !{!119}
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !740, nameTableKind: None)
!739 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!740 = !{!741, !776, !777, !780}
!741 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !742, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!742 = !DISubroutineType(types: !743)
!743 = !{!67, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !745, file: !75, line: 51, baseType: !67, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !745, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !745, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !745, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !745, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !745, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !745, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !745, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !745, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !745, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !745, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !745, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !745, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !745, file: !75, line: 70, baseType: !744, size: 64, offset: 832)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !745, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !745, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !745, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !745, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !745, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !745, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !745, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !745, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !745, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !745, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !745, file: !75, line: 93, baseType: !744, size: 64, offset: 1344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !745, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !745, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !745, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !745, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!776 = !DISubprogram(name: "fclose", scope: !70, file: !70, line: 213, type: !742, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!777 = !DISubprogram(name: "lseek", scope: !564, file: !564, line: 334, type: !778, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!778 = !DISubroutineType(types: !779)
!779 = !{!97, !67, !97, !67}
!780 = !DISubprogram(name: "rpl_fflush", scope: !176, file: !176, line: 718, type: !742, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!781 = distinct !DICompileUnit(language: DW_LANG_C99, file: !782, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !783, nameTableKind: None)
!782 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!783 = !{!119, !784, !819}
!784 = !DISubprogram(name: "fflush", scope: !70, file: !70, line: 218, type: !785, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!785 = !DISubroutineType(types: !786)
!786 = !{!67, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !788, file: !75, line: 51, baseType: !67, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !788, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !788, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !788, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !788, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !788, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !788, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !788, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !788, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !788, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !788, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !788, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !788, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !788, file: !75, line: 70, baseType: !787, size: 64, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !788, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !788, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !788, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !788, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !788, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !788, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !788, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !788, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !788, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !788, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !788, file: !75, line: 93, baseType: !787, size: 64, offset: 1344)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !788, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !788, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !788, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !788, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!819 = !DISubprogram(name: "rpl_fseeko", scope: !176, file: !176, line: 1034, type: !820, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!820 = !DISubroutineType(types: !821)
!821 = !{!67, !787, !97, !67}
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !824, nameTableKind: None)
!823 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!824 = !{!119, !825, !777, !860}
!825 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !826, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!826 = !DISubroutineType(types: !827)
!827 = !{!67, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !829, file: !75, line: 51, baseType: !67, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !829, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !829, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !829, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !829, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !829, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !829, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !829, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !829, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !829, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !829, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !829, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !829, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !829, file: !75, line: 70, baseType: !828, size: 64, offset: 832)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !829, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !829, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !829, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !829, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !829, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !829, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !829, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !829, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !829, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !829, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !829, file: !75, line: 93, baseType: !828, size: 64, offset: 1344)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !829, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !829, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !829, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !829, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!860 = !DISubprogram(name: "fseeko", scope: !70, file: !70, line: 707, type: !861, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!861 = !DISubroutineType(types: !862)
!862 = !{!67, !828, !97, !67}
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !865, nameTableKind: None)
!864 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!865 = !{!866, !121, !878}
!866 = !DISubprogram(name: "mbrtowc", scope: !492, file: !492, line: 296, type: !867, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!867 = !DISubroutineType(types: !868)
!868 = !{!40, !165, !65, !40, !869}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 13, size: 64, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !870, file: !476, line: 15, baseType: !67, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !870, file: !476, line: 20, baseType: !874, size: 32, offset: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !870, file: !476, line: 16, size: 32, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !874, file: !476, line: 18, baseType: !7, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !874, file: !476, line: 19, baseType: !484, size: 32)
!878 = !DISubprogram(name: "hard_locale", scope: !879, file: !879, line: 26, type: !880, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!879 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!880 = !DISubroutineType(types: !881)
!881 = !{!204, !67}
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !884, nameTableKind: None)
!883 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = !{!885}
!885 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !886, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!886 = !DISubroutineType(types: !887)
!887 = !{!67, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !889, file: !75, line: 51, baseType: !67, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !889, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !889, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !889, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !889, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !889, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !889, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !889, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !889, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !889, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !889, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !889, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !889, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !889, file: !75, line: 70, baseType: !888, size: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !889, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !889, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !889, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !889, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !889, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !889, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !889, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !889, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !889, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !889, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !889, file: !75, line: 93, baseType: !888, size: 64, offset: 1344)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !889, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !889, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !889, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !889, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !68, retainedTypes: !922, nameTableKind: None)
!921 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!922 = !{!923}
!923 = !DISubprogram(name: "setlocale_null_r", scope: !924, file: !924, line: 64, type: !925, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!924 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!925 = !DISubroutineType(types: !926)
!926 = !{!67, !67, !63, !40}
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !929, retainedTypes: !1316, nameTableKind: None)
!928 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!929 = !{!930}
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 41, baseType: !7, size: 32, elements: !932)
!931 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
