source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Options = type { i8, i64, i64, i32, i8, i8, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.mtop = type { i16, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.randint_source = type { %struct.randread_source*, i64, i64 }
%struct.randread_source = type { %struct._IO_FILE*, void (i8*)*, i8*, %union.anon.18 }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 148, type: !302, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !276, nameTableKind: None)
!3 = !DIFile(filename: "src/shred.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !9, !15, !29, !32, !35, !48}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 100, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8}
!8 = !DIEnumerator(name: "DEFAULT_PASSES", value: 3, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "remove_method", file: !3, line: 112, baseType: !6, size: 32, elements: !10)
!10 = !{!11, !12, !13, !14}
!11 = !DIEnumerator(name: "remove_none", value: 0, isUnsigned: true)
!12 = !DIEnumerator(name: "remove_unlink", value: 1, isUnsigned: true)
!13 = !DIEnumerator(name: "remove_wipe", value: 2, isUnsigned: true)
!14 = !DIEnumerator(name: "remove_wipesync", value: 3, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !16, line: 32, baseType: !6, size: 32, elements: !17)
!16 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!18 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!25 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!26 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!28 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 104, baseType: !6, size: 32, elements: !30)
!30 = !{!31}
!31 = !DIEnumerator(name: "VERBOSE_UPDATE", value: 5, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 109, baseType: !6, size: 32, elements: !33)
!33 = !{!34}
!34 = !DIEnumerator(name: "SECTOR_MASK", value: 511, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 43, baseType: !6, size: 32, elements: !37)
!36 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!38 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!44 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!45 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!46 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!47 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 108, baseType: !6, size: 32, elements: !49)
!49 = !{!50}
!50 = !DIEnumerator(name: "SECTOR_SIZE", value: 512, isUnsigned: true)
!51 = !{!52, !62, !123, !127, !131, !134, !137, !144, !159, !163, !113, !167, !169, !170, !56, !173, !177, !183, !186, !188, !191, !194, !198, !115, !202, !205, !213, !216, !217, !220, !223, !226, !231, !234, !237, !241, !244, !247, !251, !252, !253, !254, !258, !262, !263, !265, !266, !269, !273}
!52 = !DISubprogram(name: "dcgettext", scope: !53, file: !53, line: 51, type: !54, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!53 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !58, !58, !60}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !{}
!62 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 662, type: !64, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!63 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!64 = !DISubroutineType(types: !65)
!65 = !{!60, !58, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !69)
!68 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !85, !86, !87, !88, !92, !94, !96, !100, !103, !105, !108, !111, !112, !114, !118, !119}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 51, baseType: !60, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 36, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 70, baseType: !66, size: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !91)
!90 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!91 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!93 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 43, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !91)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !67, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !68, line: 37, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !67, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !68, line: 38, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !67, file: !68, line: 93, baseType: !66, size: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !67, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DISubprogram(name: "set_program_name", scope: !124, file: !124, line: 37, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!124 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!125 = !DISubroutineType(types: !126)
!126 = !{null, !58}
!127 = !DISubprogram(name: "setlocale", scope: !128, file: !128, line: 122, type: !129, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!128 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!56, !60, !58}
!131 = !DISubprogram(name: "bindtextdomain", scope: !53, file: !53, line: 86, type: !132, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!132 = !DISubroutineType(types: !133)
!133 = !{!56, !58, !58}
!134 = !DISubprogram(name: "textdomain", scope: !53, file: !53, line: 82, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!135 = !DISubroutineType(types: !136)
!136 = !{!56, !58}
!137 = !DISubprogram(name: "atexit", scope: !138, file: !138, line: 595, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!138 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!139 = !DISubroutineType(types: !140)
!140 = !{!60, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{null}
!144 = !DISubprogram(name: "getopt_long", scope: !145, file: !145, line: 66, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!145 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!146 = !DISubroutineType(types: !147)
!147 = !{!60, !60, !148, !58, !150, !157}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !145, line: 50, size: 256, elements: !153)
!153 = !{!154, !155, !156, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !145, line: 52, baseType: !58, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !152, file: !145, line: 55, baseType: !60, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !145, line: 56, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !152, file: !145, line: 57, baseType: !60, size: 32, offset: 192)
!159 = !DISubprogram(name: "xdectoumax", scope: !160, file: !160, line: 31, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!160 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!117, !58, !117, !117, !58, !58, !60}
!163 = !DISubprogram(name: "error", scope: !164, file: !164, line: 52, type: !165, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!164 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubroutineType(types: !166)
!166 = !{null, !60, !60, !58, null}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !63, line: 63, baseType: !89)
!170 = !DISubprogram(name: "xnumtoumax", scope: !160, file: !160, line: 34, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!171 = !DISubroutineType(types: !172)
!172 = !{!117, !58, !60, !117, !117, !58, !58, !60}
!173 = !DISubprogram(name: "version_etc", scope: !174, file: !174, line: 69, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!174 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!175 = !DISubroutineType(types: !176)
!176 = !{null, !66, !58, !58, !58, null}
!177 = !DISubprogram(name: "randint_all_new", scope: !178, file: !178, line: 36, type: !179, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!178 = !DIFile(filename: "./lib/randint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !58, !117}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !178, line: 33, flags: DIFlagFwdDecl)
!183 = !DISubprogram(name: "quotearg_n_style_colon", scope: !16, file: !16, line: 397, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!184 = !DISubroutineType(types: !185)
!185 = !{!56, !60, !15, !58}
!186 = !DISubprogram(name: "xstrdup", scope: !187, file: !187, line: 64, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!187 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubprogram(name: "free", scope: !138, file: !138, line: 565, type: !189, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !113}
!191 = !DISubprogram(name: "randint_all_free", scope: !178, file: !178, line: 50, type: !192, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!192 = !DISubroutineType(types: !193)
!193 = !{!60, !181}
!194 = !DISubprogram(name: "rpl_fcntl", scope: !195, file: !195, line: 588, type: !196, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!195 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !DISubroutineType(types: !197)
!197 = !{!60, !60, !60, null}
!198 = !DISubprogram(name: "isatty", scope: !199, file: !199, line: 779, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!199 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!200 = !DISubroutineType(types: !201)
!201 = !{!60, !60}
!202 = !DISubprogram(name: "lseek", scope: !199, file: !199, line: 334, type: !203, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!203 = !DISubroutineType(types: !204)
!204 = !{!91, !60, !91, !60}
!205 = !DISubprogram(name: "randint_get_source", scope: !178, file: !178, line: 37, type: !206, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !211}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "randread_source", file: !210, line: 25, flags: DIFlagFwdDecl)
!210 = !DIFile(filename: "./lib/randread.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!213 = !DISubprogram(name: "ftruncate", scope: !199, file: !199, line: 1014, type: !214, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!214 = !DISubroutineType(types: !215)
!215 = !{!60, !60, !91}
!216 = !DISubprogram(name: "xalloc_die", scope: !187, file: !187, line: 51, type: !142, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !61)
!217 = !DISubprogram(name: "xmalloc", scope: !187, file: !187, line: 53, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!218 = !DISubroutineType(types: !219)
!219 = !{!113, !117}
!220 = !DISubprogram(name: "randint_genmax", scope: !178, file: !178, line: 39, type: !221, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!221 = !DISubroutineType(types: !222)
!222 = !{!117, !181, !117}
!223 = !DISubprogram(name: "getpagesize", scope: !199, file: !199, line: 976, type: !224, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!224 = !DISubroutineType(types: !225)
!225 = !{!60}
!226 = !DISubprogram(name: "time", scope: !227, file: !227, line: 75, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!227 = !DIFile(filename: "/usr/include/time.h", directory: "")
!228 = !DISubroutineType(types: !229)
!229 = !{!91, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!231 = !DISubprogram(name: "randread", scope: !210, file: !210, line: 28, type: !232, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !208, !113, !117}
!234 = !DISubprogram(name: "write", scope: !199, file: !199, line: 366, type: !235, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!235 = !DISubroutineType(types: !236)
!236 = !{!91, !60, !167, !117}
!237 = !DISubprogram(name: "umaxtostr", scope: !238, file: !238, line: 46, type: !239, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!238 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!239 = !DISubroutineType(types: !240)
!240 = !{!56, !117, !56}
!241 = !DISubprogram(name: "human_readable", scope: !36, file: !36, line: 79, type: !242, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!242 = !DISubroutineType(types: !243)
!243 = !{!56, !117, !56, !60, !117, !117}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !245, line: 102, baseType: !246)
!245 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !90, line: 73, baseType: !117)
!247 = !DISubprogram(name: "ioctl", scope: !248, file: !248, line: 41, type: !249, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!248 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!249 = !DISubroutineType(types: !250)
!250 = !{!60, !60, !117, null}
!251 = !DISubprogram(name: "fdatasync", scope: !199, file: !199, line: 1115, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!252 = !DISubprogram(name: "fsync", scope: !199, file: !199, line: 954, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!253 = !DISubprogram(name: "sync", scope: !199, file: !199, line: 970, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!254 = !DISubprogram(name: "open_safer", scope: !255, file: !255, line: 22, type: !256, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!255 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !DISubroutineType(types: !257)
!257 = !{!60, !58, !60, null}
!258 = !DISubprogram(name: "chmod", scope: !259, file: !259, line: 280, type: !260, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!259 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!260 = !DISubroutineType(types: !261)
!261 = !{!60, !58, !6}
!262 = !DISubprogram(name: "close", scope: !199, file: !199, line: 353, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!263 = !DISubprogram(name: "last_component", scope: !264, file: !264, line: 46, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!264 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !DISubprogram(name: "dir_name", scope: !264, file: !264, line: 40, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!266 = !DISubprogram(name: "base_len", scope: !264, file: !264, line: 44, type: !267, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!267 = !DISubroutineType(types: !268)
!268 = !{!117, !58}
!269 = !DISubprogram(name: "renameatu", scope: !270, file: !270, line: 28, type: !271, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!270 = !DIFile(filename: "./lib/renameatu.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!271 = !DISubroutineType(types: !272)
!272 = !{!60, !60, !58, !60, !58, !6}
!273 = !DISubprogram(name: "unlink", scope: !199, file: !199, line: 825, type: !274, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!274 = !DISubroutineType(types: !275)
!275 = !{!60, !58}
!276 = !{!277, !0, !279, !285, !291, !297}
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "randint_source", scope: !2, file: !3, line: 1157, type: !181, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "remove_methods", scope: !2, file: !3, line: 125, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 96, elements: !283)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!283 = !{!284}
!284 = !DISubrange(count: 3)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "remove_args", scope: !2, file: !3, line: 120, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 256, elements: !289)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!289 = !{!290}
!290 = !DISubrange(count: 4)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "patterns", scope: !2, file: !3, line: 683, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1760, elements: !295)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!295 = !{!296}
!296 = !DISubrange(count: 55)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "nameset", scope: !2, file: !3, line: 985, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 520, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 65)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 2816, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 11)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "Version", scope: !307, file: !308, line: 2, type: !58, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, globals: !309, nameTableKind: None)
!308 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!309 = !{!305}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !312, file: !313, line: 67, type: !364, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !314, retainedTypes: !315, globals: !363, nameTableKind: None)
!313 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!314 = !{!15}
!315 = !{!113, !58, !52, !316, !317, !163, !321, !356, !359, !362}
!316 = !DISubprogram(name: "quotearg_n_style", scope: !16, file: !16, line: 368, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!317 = !DISubprogram(name: "quote_n", scope: !318, file: !318, line: 40, type: !319, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!318 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !DISubroutineType(types: !320)
!320 = !{!58, !60, !58}
!321 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 662, type: !322, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!322 = !DISubroutineType(types: !323)
!323 = !{!60, !58, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !325, file: !68, line: 51, baseType: !60, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !325, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !325, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !325, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !325, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !325, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !325, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !325, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !325, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !325, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !325, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !325, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !325, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !325, file: !68, line: 70, baseType: !324, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !325, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !325, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !325, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !325, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !325, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !325, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !325, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !325, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !325, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !325, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !325, file: !68, line: 93, baseType: !324, size: 64, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !325, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !325, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !325, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !325, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!356 = !DISubprogram(name: "quote", scope: !318, file: !318, line: 44, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!357 = !DISubroutineType(types: !358)
!358 = !{!58, !58}
!359 = !DISubprogram(name: "usage", scope: !313, file: !313, line: 56, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !60}
!362 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!363 = !{!310}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !365, line: 61, baseType: !141)
!365 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "file_name", scope: !368, file: !369, line: 46, type: !58, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !370, globals: !408, nameTableKind: None)
!369 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{!371, !52, !407, !163}
!371 = !DISubprogram(name: "close_stream", scope: !372, file: !372, line: 2, type: !373, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!372 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !DISubroutineType(types: !374)
!374 = !{!60, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !376, file: !68, line: 51, baseType: !60, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !376, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !376, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !376, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !376, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !376, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !376, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !376, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !376, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !376, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !376, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !376, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !376, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !376, file: !68, line: 70, baseType: !375, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !376, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !376, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !376, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !376, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !376, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !376, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !376, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !376, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !376, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !376, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !376, file: !68, line: 93, baseType: !375, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !376, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !376, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !376, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !376, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!407 = !DISubprogram(name: "quotearg_colon", scope: !16, file: !16, line: 391, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!408 = !{!366, !409}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !368, file: !369, line: 56, type: !411, isLocal: true, isDefinition: true)
!411 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "exit_failure", scope: !414, file: !415, line: 24, type: !417, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, globals: !416, nameTableKind: None)
!415 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !{!412}
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "power_letter", scope: !420, file: !421, line: 36, type: !481, isLocal: true, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !431, globals: !472, nameTableKind: None)
!421 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!422 = !{!35, !423}
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !424, line: 25, baseType: !6, size: 32, elements: !425)
!424 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = !{!426, !427, !428, !429, !430}
!426 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!427 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!428 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!429 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!430 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!431 = !{!432, !462, !167, !463, !467}
!432 = !DISubprogram(name: "localeconv", scope: !128, file: !128, line: 125, type: !433, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!433 = !DISubroutineType(types: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !128, line: 51, size: 768, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !436, file: !128, line: 55, baseType: !56, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !436, file: !128, line: 56, baseType: !56, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !436, file: !128, line: 62, baseType: !56, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !436, file: !128, line: 68, baseType: !56, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !436, file: !128, line: 69, baseType: !56, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !436, file: !128, line: 70, baseType: !56, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !436, file: !128, line: 71, baseType: !56, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !436, file: !128, line: 72, baseType: !56, size: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !436, file: !128, line: 73, baseType: !56, size: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !436, file: !128, line: 74, baseType: !56, size: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !436, file: !128, line: 75, baseType: !57, size: 8, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !436, file: !128, line: 76, baseType: !57, size: 8, offset: 648)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !436, file: !128, line: 78, baseType: !57, size: 8, offset: 656)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !436, file: !128, line: 80, baseType: !57, size: 8, offset: 664)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !436, file: !128, line: 82, baseType: !57, size: 8, offset: 672)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !436, file: !128, line: 84, baseType: !57, size: 8, offset: 680)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !436, file: !128, line: 91, baseType: !57, size: 8, offset: 688)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !436, file: !128, line: 92, baseType: !57, size: 8, offset: 696)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !436, file: !128, line: 95, baseType: !57, size: 8, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !436, file: !128, line: 97, baseType: !57, size: 8, offset: 712)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !436, file: !128, line: 99, baseType: !57, size: 8, offset: 720)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !436, file: !128, line: 101, baseType: !57, size: 8, offset: 728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !436, file: !128, line: 108, baseType: !57, size: 8, offset: 736)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !436, file: !128, line: 109, baseType: !57, size: 8, offset: 744)
!462 = !DISubprogram(name: "getenv", scope: !138, file: !138, line: 634, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!463 = !DISubprogram(name: "argmatch", scope: !365, file: !365, line: 52, type: !464, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!464 = !DISubroutineType(types: !465)
!465 = !{!91, !58, !466, !167, !117}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!467 = !DISubprogram(name: "xstrtoumax", scope: !424, file: !424, line: 48, type: !468, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!468 = !DISubroutineType(types: !469)
!469 = !{!423, !58, !470, !60, !471, !58}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!472 = !{!418, !473, !476}
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "block_size_args", scope: !420, file: !421, line: 398, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 192, elements: !283)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !420, file: !421, line: 399, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 64, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 2)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 72, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 9)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "program_name", scope: !486, file: !487, line: 33, type: !58, isDefinition: true)
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !488, globals: !524, nameTableKind: None)
!487 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !{!113, !489, !56}
!489 = !DISubprogram(name: "fputs", scope: !63, file: !63, line: 626, type: !490, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!490 = !DISubroutineType(types: !491)
!491 = !{!60, !58, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !493, file: !68, line: 51, baseType: !60, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !493, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !493, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !493, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !493, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !493, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !493, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !493, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !493, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !493, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !493, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !493, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !493, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !493, file: !68, line: 70, baseType: !492, size: 64, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !493, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !493, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !493, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !493, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !493, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !493, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !493, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !493, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !493, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !493, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !493, file: !68, line: 93, baseType: !492, size: 64, offset: 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !493, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !493, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !493, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !493, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!524 = !{!484}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !527, file: !528, line: 85, type: !635, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !529, retainedTypes: !550, globals: !608, nameTableKind: None)
!528 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = !{!15, !530, !535}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !16, line: 242, baseType: !6, size: 32, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!533 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!534 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !536, line: 46, baseType: !6, size: 32, elements: !537)
!536 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!538 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!539 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!540 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!541 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!542 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!543 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!544 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!545 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!546 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!547 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!548 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!549 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!550 = !{!551, !554, !188, !569, !60, !93, !572, !115, !587, !591, !52, !597, !601, !56, !217, !216, !605}
!551 = !DISubprogram(name: "xmemdup", scope: !187, file: !187, line: 62, type: !552, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!552 = !DISubroutineType(types: !553)
!553 = !{!113, !167, !117}
!554 = !DISubprogram(name: "quotearg_alloc_mem", scope: !16, file: !16, line: 342, type: !555, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!555 = !DISubroutineType(types: !556)
!556 = !{!56, !58, !117, !471, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !528, line: 65, size: 448, elements: !560)
!560 = !{!561, !562, !563, !567, !568}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !559, file: !528, line: 68, baseType: !15, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !559, file: !528, line: 71, baseType: !60, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !559, file: !528, line: 75, baseType: !564, size: 256, offset: 64)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 8)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !559, file: !528, line: 78, baseType: !58, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !559, file: !528, line: 81, baseType: !58, size: 64, offset: 384)
!569 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !16, file: !16, line: 408, type: !570, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!570 = !DISubroutineType(types: !571)
!571 = !{!56, !60, !58, !58, !58, !117}
!572 = !DISubprogram(name: "rpl_mbrtowc", scope: !573, file: !573, line: 717, type: !574, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!573 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !DISubroutineType(types: !575)
!575 = !{!117, !157, !58, !117, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 13, size: 64, elements: !579)
!578 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !577, file: !578, line: 15, baseType: !60, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !577, file: !578, line: 20, baseType: !582, size: 32, offset: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !578, line: 16, size: 32, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !582, file: !578, line: 18, baseType: !6, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !582, file: !578, line: 19, baseType: !586, size: 32)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32, elements: !289)
!587 = !DISubprogram(name: "iswprint", scope: !588, file: !588, line: 120, type: !589, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!588 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!589 = !DISubroutineType(types: !590)
!590 = !{!60, !6}
!591 = !DISubprogram(name: "mbsinit", scope: !592, file: !592, line: 292, type: !593, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!592 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!593 = !DISubroutineType(types: !594)
!594 = !{!60, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!597 = !DISubprogram(name: "locale_charset", scope: !598, file: !598, line: 35, type: !599, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!598 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!599 = !DISubroutineType(types: !600)
!600 = !{!58}
!601 = !DISubprogram(name: "c_strcasecmp", scope: !602, file: !602, line: 42, type: !603, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!602 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!603 = !DISubroutineType(types: !604)
!604 = !{!60, !58, !58}
!605 = !DISubprogram(name: "xrealloc", scope: !187, file: !187, line: 59, type: !606, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!606 = !DISubroutineType(types: !607)
!607 = !{!113, !113, !117}
!608 = !{!525, !609, !615, !617, !619, !624, !631, !633}
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !527, file: !528, line: 101, type: !611, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 320, elements: !613)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!613 = !{!614}
!614 = !DISubrange(count: 10)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !527, file: !528, line: 1052, type: !559, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !527, file: !528, line: 116, type: !559, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "slot0", scope: !527, file: !528, line: 842, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 256)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "slotvec", scope: !527, file: !528, line: 845, type: !626, isLocal: true, isDefinition: true)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !528, line: 834, size: 128, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !627, file: !528, line: 836, baseType: !115, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !627, file: !528, line: 837, baseType: !56, size: 64, offset: 64)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "nslots", scope: !527, file: !528, line: 843, type: !60, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "slotvec0", scope: !527, file: !528, line: 844, type: !627, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 704, elements: !303)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !638, file: !639, line: 26, type: !641, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, globals: !640, nameTableKind: None)
!639 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!640 = !{!636}
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 47)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !646, file: !647, line: 507, type: !60, isLocal: true, isDefinition: true)
!646 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !647, file: !647, line: 488, type: !648, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !655)
!647 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!648 = !DISubroutineType(types: !649)
!649 = !{!60, !60, !60}
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !651, globals: !654, nameTableKind: None)
!651 = !{!652, !262}
!652 = !DISubprogram(name: "fcntl", scope: !653, file: !653, line: 176, type: !196, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!653 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!654 = !{!644}
!655 = !{!656, !657, !658, !659, !662}
!656 = !DILocalVariable(name: "fd", arg: 1, scope: !646, file: !647, line: 488, type: !60)
!657 = !DILocalVariable(name: "target", arg: 2, scope: !646, file: !647, line: 488, type: !60)
!658 = !DILocalVariable(name: "result", scope: !646, file: !647, line: 490, type: !60)
!659 = !DILocalVariable(name: "flags", scope: !660, file: !647, line: 531, type: !60)
!660 = distinct !DILexicalBlock(scope: !661, file: !647, line: 530, column: 5)
!661 = distinct !DILexicalBlock(scope: !646, file: !647, line: 529, column: 7)
!662 = !DILocalVariable(name: "saved_errno", scope: !663, file: !647, line: 534, type: !60)
!663 = distinct !DILexicalBlock(scope: !664, file: !647, line: 533, column: 9)
!664 = distinct !DILexicalBlock(scope: !660, file: !647, line: 532, column: 11)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !667, nameTableKind: None)
!666 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!667 = !{!668, !216}
!668 = !DISubprogram(name: "mdir_name", scope: !264, file: !264, line: 43, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !671, nameTableKind: None)
!670 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!671 = !{!263}
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !674, nameTableKind: None)
!673 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = !{!56}
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !677, nameTableKind: None)
!676 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!677 = !{!678, !679}
!678 = !DISubprogram(name: "open", scope: !653, file: !653, line: 196, type: !256, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!679 = !DISubprogram(name: "fd_safer", scope: !680, file: !680, line: 21, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!680 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !683, nameTableKind: None)
!682 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!683 = !{!244}
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !686, nameTableKind: None)
!685 = !DIFile(filename: "lib/randint.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!686 = !{!217, !687, !231, !188, !690}
!687 = !DISubprogram(name: "randread_new", scope: !210, file: !210, line: 27, type: !688, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!688 = !DISubroutineType(types: !689)
!689 = !{!208, !58, !117}
!690 = !DISubprogram(name: "randread_free", scope: !210, file: !210, line: 31, type: !691, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!691 = !DISubroutineType(types: !692)
!692 = !{!60, !208}
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !695, nameTableKind: None)
!694 = !DIFile(filename: "lib/randread.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !{!696, !732, !735, !188, !751, !217, !52, !356, !163, !678, !262, !113, !755, !767, !768, !769, !772, !115, !773}
!696 = !DISubprogram(name: "fopen_safer", scope: !697, file: !697, line: 23, type: !698, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!697 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !58, !58}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !701, file: !68, line: 51, baseType: !60, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !701, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !701, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !701, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !701, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !701, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !701, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !701, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !701, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !701, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !701, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !701, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !701, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !701, file: !68, line: 70, baseType: !700, size: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !701, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !701, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !701, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !701, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !701, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !701, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !701, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !701, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !701, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !701, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !701, file: !68, line: 93, baseType: !700, size: 64, offset: 1344)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !701, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !701, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !701, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !701, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!732 = !DISubprogram(name: "setvbuf", scope: !63, file: !63, line: 308, type: !733, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!733 = !DISubroutineType(types: !734)
!734 = !{!60, !700, !56, !60, !117}
!735 = !DISubprogram(name: "isaac_seed", scope: !736, file: !736, line: 62, type: !737, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!736 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!737 = !DISubroutineType(types: !738)
!738 = !{null, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !736, line: 56, size: 16576, elements: !741)
!741 = !{!742, !748, !749, !750}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !740, file: !736, line: 58, baseType: !743, size: 16384)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 16384, elements: !622)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !736, line: 44, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !245, line: 52, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !90, line: 59, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !90, line: 45, baseType: !117)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !740, file: !736, line: 59, baseType: !744, size: 64, offset: 16384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !740, file: !736, line: 59, baseType: !744, size: 64, offset: 16448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !740, file: !736, line: 59, baseType: !744, size: 64, offset: 16512)
!751 = !DISubprogram(name: "rpl_fclose", scope: !752, file: !752, line: 672, type: !753, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!752 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!753 = !DISubroutineType(types: !754)
!754 = !{!60, !700}
!755 = !DISubprogram(name: "gettimeofday", scope: !756, file: !756, line: 66, type: !757, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!756 = !DIFile(filename: "/usr/include/sys/time.h", directory: "")
!757 = !DISubroutineType(types: !758)
!758 = !{!60, !759, !113}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !761, line: 8, size: 128, elements: !762)
!761 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "")
!762 = !{!763, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !760, file: !761, line: 10, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 160, baseType: !91)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !760, file: !761, line: 11, baseType: !766, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !90, line: 162, baseType: !91)
!767 = !DISubprogram(name: "getpid", scope: !199, file: !199, line: 628, type: !224, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!768 = !DISubprogram(name: "getppid", scope: !199, file: !199, line: 631, type: !224, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!769 = !DISubprogram(name: "getuid", scope: !199, file: !199, line: 675, type: !770, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!770 = !DISubroutineType(types: !771)
!771 = !{!6}
!772 = !DISubprogram(name: "getgid", scope: !199, file: !199, line: 681, type: !770, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!773 = !DISubprogram(name: "isaac_refill", scope: !736, file: !736, line: 63, type: !774, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !739, !471}
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !778, retainedTypes: !826, nameTableKind: None)
!777 = !DIFile(filename: "lib/rand-isaac.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!778 = !{!779}
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !780, file: !777, line: 100, baseType: !6, size: 32, elements: !824)
!780 = distinct !DISubprogram(name: "isaac_refill", scope: !777, file: !777, line: 90, type: !781, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !776, retainedNodes: !791)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !783, !790}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !736, line: 56, size: 16576, elements: !785)
!785 = !{!786, !787, !788, !789}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !784, file: !736, line: 58, baseType: !743, size: 16384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !784, file: !736, line: 59, baseType: !744, size: 64, offset: 16384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !784, file: !736, line: 59, baseType: !744, size: 64, offset: 16448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !784, file: !736, line: 59, baseType: !744, size: 64, offset: 16512)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !801, !802, !804, !805, !807, !808, !810, !811, !814, !815, !817, !818, !820, !821, !823}
!792 = !DILocalVariable(name: "s", arg: 1, scope: !780, file: !777, line: 90, type: !783)
!793 = !DILocalVariable(name: "result", arg: 2, scope: !780, file: !777, line: 90, type: !790)
!794 = !DILocalVariable(name: "a", scope: !780, file: !777, line: 93, type: !744)
!795 = !DILocalVariable(name: "b", scope: !780, file: !777, line: 94, type: !744)
!796 = !DILocalVariable(name: "m", scope: !780, file: !777, line: 97, type: !790)
!797 = !DILocalVariable(name: "r", scope: !780, file: !777, line: 98, type: !790)
!798 = !DILocalVariable(name: "x", scope: !799, file: !777, line: 118, type: !744)
!799 = distinct !DILexicalBlock(scope: !800, file: !777, line: 118, column: 7)
!800 = distinct !DILexicalBlock(scope: !780, file: !777, line: 117, column: 5)
!801 = !DILocalVariable(name: "y", scope: !799, file: !777, line: 118, type: !744)
!802 = !DILocalVariable(name: "x", scope: !803, file: !777, line: 119, type: !744)
!803 = distinct !DILexicalBlock(scope: !800, file: !777, line: 119, column: 7)
!804 = !DILocalVariable(name: "y", scope: !803, file: !777, line: 119, type: !744)
!805 = !DILocalVariable(name: "x", scope: !806, file: !777, line: 120, type: !744)
!806 = distinct !DILexicalBlock(scope: !800, file: !777, line: 120, column: 7)
!807 = !DILocalVariable(name: "y", scope: !806, file: !777, line: 120, type: !744)
!808 = !DILocalVariable(name: "x", scope: !809, file: !777, line: 121, type: !744)
!809 = distinct !DILexicalBlock(scope: !800, file: !777, line: 121, column: 7)
!810 = !DILocalVariable(name: "y", scope: !809, file: !777, line: 121, type: !744)
!811 = !DILocalVariable(name: "x", scope: !812, file: !777, line: 128, type: !744)
!812 = distinct !DILexicalBlock(scope: !813, file: !777, line: 128, column: 7)
!813 = distinct !DILexicalBlock(scope: !780, file: !777, line: 127, column: 5)
!814 = !DILocalVariable(name: "y", scope: !812, file: !777, line: 128, type: !744)
!815 = !DILocalVariable(name: "x", scope: !816, file: !777, line: 129, type: !744)
!816 = distinct !DILexicalBlock(scope: !813, file: !777, line: 129, column: 7)
!817 = !DILocalVariable(name: "y", scope: !816, file: !777, line: 129, type: !744)
!818 = !DILocalVariable(name: "x", scope: !819, file: !777, line: 130, type: !744)
!819 = distinct !DILexicalBlock(scope: !813, file: !777, line: 130, column: 7)
!820 = !DILocalVariable(name: "y", scope: !819, file: !777, line: 130, type: !744)
!821 = !DILocalVariable(name: "x", scope: !822, file: !777, line: 131, type: !744)
!822 = distinct !DILexicalBlock(scope: !813, file: !777, line: 131, column: 7)
!823 = !DILocalVariable(name: "y", scope: !822, file: !777, line: 131, type: !744)
!824 = !{!825}
!825 = !DIEnumerator(name: "HALF", value: 128, isUnsigned: true)
!826 = !{!744}
!827 = distinct !DICompileUnit(language: DW_LANG_C99, file: !828, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !829, nameTableKind: None)
!828 = !DIFile(filename: "lib/renameatu.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!829 = !{!830, !56, !831, !188}
!830 = !DISubprogram(name: "renameat2", scope: !63, file: !63, line: 164, type: !271, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!831 = !DISubprogram(name: "renameat", scope: !63, file: !63, line: 152, type: !832, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!832 = !DISubroutineType(types: !833)
!833 = !{!60, !60, !58, !60, !58}
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !836, nameTableKind: None)
!835 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!836 = !{!837, !262}
!837 = !DISubprogram(name: "dup_safer", scope: !680, file: !680, line: 20, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !840, retainedTypes: !844, nameTableKind: None)
!839 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!840 = !{!841}
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 40, baseType: !6, size: 32, elements: !842)
!842 = !{!843}
!843 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!844 = !{!52, !845, !113}
!845 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 662, type: !846, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!846 = !DISubroutineType(types: !847)
!847 = !{!60, !58, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !849, file: !68, line: 51, baseType: !60, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !849, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !849, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !849, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !849, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !849, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !849, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !849, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !849, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !849, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !849, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !849, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !849, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !849, file: !68, line: 70, baseType: !848, size: 64, offset: 832)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !849, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !849, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !849, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !849, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !849, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !849, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !849, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !849, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !849, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !849, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !849, file: !68, line: 93, baseType: !848, size: 64, offset: 1344)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !849, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !849, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !849, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !849, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !882, retainedTypes: !895, nameTableKind: None)
!881 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!882 = !{!883}
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !884, file: !187, line: 186, baseType: !6, size: 32, elements: !893)
!884 = distinct !DISubprogram(name: "x2nrealloc", scope: !187, file: !187, line: 174, type: !885, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !880, retainedNodes: !888)
!885 = !DISubroutineType(types: !886)
!886 = !{!113, !113, !887, !115}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!888 = !{!889, !890, !891, !892}
!889 = !DILocalVariable(name: "p", arg: 1, scope: !884, file: !187, line: 174, type: !113)
!890 = !DILocalVariable(name: "pn", arg: 2, scope: !884, file: !187, line: 174, type: !887)
!891 = !DILocalVariable(name: "s", arg: 3, scope: !884, file: !187, line: 174, type: !115)
!892 = !DILocalVariable(name: "n", scope: !884, file: !187, line: 176, type: !115)
!893 = !{!894}
!894 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!895 = !{!115, !216, !217, !605, !56, !188, !113, !896, !899}
!896 = !DISubprogram(name: "xcalloc", scope: !187, file: !187, line: 57, type: !897, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!897 = !DISubroutineType(types: !898)
!898 = !{!113, !117, !117}
!899 = !DISubprogram(name: "rpl_calloc", scope: !900, file: !900, line: 688, type: !897, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!900 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !903, nameTableKind: None)
!902 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!903 = !{!52, !163}
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !906, retainedTypes: !907, nameTableKind: None)
!905 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!906 = !{!423}
!907 = !{!467, !356, !163}
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !910, retainedTypes: !911, nameTableKind: None)
!909 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!910 = !{!423, !535}
!911 = !{!60, !93}
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !914, nameTableKind: None)
!913 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!914 = !{!113}
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !917, nameTableKind: None)
!916 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!917 = !{!918, !953, !202, !954}
!918 = !DISubprogram(name: "fileno", scope: !63, file: !63, line: 786, type: !919, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!919 = !DISubroutineType(types: !920)
!920 = !{!60, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !922, file: !68, line: 51, baseType: !60, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !922, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !922, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !922, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !922, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !922, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !922, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !922, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !922, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !922, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !922, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !922, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !922, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !922, file: !68, line: 70, baseType: !921, size: 64, offset: 832)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !922, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !922, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !922, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !922, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !922, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !922, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !922, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !922, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !922, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !922, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !922, file: !68, line: 93, baseType: !921, size: 64, offset: 1344)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !922, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !922, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !922, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !922, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!953 = !DISubprogram(name: "fclose", scope: !63, file: !63, line: 213, type: !919, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!954 = !DISubprogram(name: "rpl_fflush", scope: !752, file: !752, line: 718, type: !919, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !61, retainedTypes: !957, nameTableKind: None)
!956 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!957 = !{!113, !958, !993}
!958 = !DISubprogram(name: "fflush", scope: !63, file: !63, line: 218, type: !959, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!959 = !DISubroutineType(types: !960)
!960 = !{!60, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992}
