source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%struct.linebuffer = type { i64, i64, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.randint_source = type { %struct.randread_source*, i64, i64 }
%struct.randread_source = type { %struct._IO_FILE*, void (i8*)*, i8*, %union.anon.27 }
%struct.slotvec = type { i64, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 101, type: !59, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !58, nameTableKind: None)
!3 = !DIFile(filename: "src/shuf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !14, !28, !37, !40}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 25, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !15, line: 32, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 45, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 52, baseType: !7, size: 32, elements: !38)
!38 = !{!39}
!39 = !DIEnumerator(name: "RESERVOIR_MIN_INPUT", value: 8388608, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 44, baseType: !7, size: 32, elements: !41)
!41 = !{!42}
!42 = !DIEnumerator(name: "RESERVOIR_LINES_INCREMENT", value: 1024, isUnsigned: true)
!43 = !{!44, !46, !47, !52, !55, !57}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !48, line: 85, baseType: !49)
!48 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !51)
!50 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!51 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!0}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2560, elements: !70)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !62, line: 50, size: 256, elements: !63)
!62 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!63 = !{!64, !65, !67, !69}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !62, line: 52, baseType: !55, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !61, file: !62, line: 55, baseType: !66, size: 32, offset: 64)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !61, file: !62, line: 56, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !61, file: !62, line: 57, baseType: !66, size: 32, offset: 192)
!70 = !{!71}
!71 = !DISubrange(count: 10)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "Version", scope: !74, file: !75, line: 2, type: !55, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, globals: !77, nameTableKind: None)
!75 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{}
!77 = !{!72}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "file_name", scope: !80, file: !81, line: 46, type: !55, isLocal: true, isDefinition: true)
!80 = distinct !DICompileUnit(language: DW_LANG_C99, file: !81, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, globals: !82, nameTableKind: None)
!81 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!82 = !{!78, !83}
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !80, file: !81, line: 56, type: !85, isLocal: true, isDefinition: true)
!85 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "exit_failure", scope: !88, file: !89, line: 24, type: !91, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, globals: !90, nameTableKind: None)
!89 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!90 = !{!86}
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !66)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "program_name", scope: !94, file: !95, line: 33, type: !55, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !96, globals: !97, nameTableKind: None)
!95 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!96 = !{!46, !44}
!97 = !{!92}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !100, file: !101, line: 85, type: !160, isDefinition: true)
!100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !101, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !102, retainedTypes: !123, globals: !125, nameTableKind: None)
!101 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!102 = !{!14, !103, !108}
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 242, baseType: !7, size: 32, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 46, baseType: !7, size: 32, elements: !110)
!109 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!111 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!112 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!116 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!117 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!119 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!122 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!123 = !{!66, !124, !52, !44}
!124 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!125 = !{!98, !126, !130, !142, !144, !149, !156, !158}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !100, file: !101, line: 101, type: !128, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !70)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !100, file: !101, line: 1052, type: !132, isDefinition: true)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !101, line: 65, size: 448, elements: !133)
!133 = !{!134, !135, !136, !140, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !132, file: !101, line: 68, baseType: !14, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !101, line: 71, baseType: !66, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !132, file: !101, line: 75, baseType: !137, size: 256, offset: 64)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !132, file: !101, line: 78, baseType: !55, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !132, file: !101, line: 81, baseType: !55, size: 64, offset: 384)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !100, file: !101, line: 116, type: !132, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "slot0", scope: !100, file: !101, line: 842, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 256)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "slotvec", scope: !100, file: !101, line: 845, type: !151, isLocal: true, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !101, line: 834, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !101, line: 836, baseType: !52, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !152, file: !101, line: 837, baseType: !44, size: 64, offset: 64)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "nslots", scope: !100, file: !101, line: 843, type: !66, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "slotvec0", scope: !100, file: !101, line: 844, type: !152, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 704, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!162 = !{!163}
!163 = !DISubrange(count: 11)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !166, file: !167, line: 26, type: !169, isDefinition: true)
!166 = distinct !DICompileUnit(language: DW_LANG_C99, file: !167, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, globals: !168, nameTableKind: None)
!167 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!168 = !{!164}
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 47)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "default_tuning", scope: !174, file: !175, line: 130, type: !178, isLocal: true, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !176, globals: !177, nameTableKind: None)
!175 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !{!54, !46, !52}
!177 = !{!172}
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !180, line: 65, baseType: !181)
!180 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !180, line: 53, size: 160, elements: !182)
!182 = !{!183, !185, !186, !187, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !181, file: !180, line: 58, baseType: !184, size: 32)
!184 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !181, file: !180, line: 59, baseType: !184, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !181, file: !180, line: 60, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !181, file: !180, line: 61, baseType: !184, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !181, file: !180, line: 62, baseType: !85, size: 8, offset: 128)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !191, file: !192, line: 507, type: !66, isLocal: true, isDefinition: true)
!191 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !192, file: !192, line: 488, type: !193, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !195, retainedNodes: !197)
!192 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = !DISubroutineType(types: !194)
!194 = !{!66, !66, !66}
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, globals: !196, nameTableKind: None)
!196 = !{!189}
!197 = !{!198, !199, !200, !201, !204}
!198 = !DILocalVariable(name: "fd", arg: 1, scope: !191, file: !192, line: 488, type: !66)
!199 = !DILocalVariable(name: "target", arg: 2, scope: !191, file: !192, line: 488, type: !66)
!200 = !DILocalVariable(name: "result", scope: !191, file: !192, line: 490, type: !66)
!201 = !DILocalVariable(name: "flags", scope: !202, file: !192, line: 531, type: !66)
!202 = distinct !DILexicalBlock(scope: !203, file: !192, line: 530, column: 5)
!203 = distinct !DILexicalBlock(scope: !191, file: !192, line: 529, column: 7)
!204 = !DILocalVariable(name: "saved_errno", scope: !205, file: !192, line: 534, type: !66)
!205 = distinct !DILexicalBlock(scope: !206, file: !192, line: 533, column: 9)
!206 = distinct !DILexicalBlock(scope: !202, file: !192, line: 532, column: 11)
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !209, nameTableKind: None)
!208 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !{!28}
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!211 = !DIFile(filename: "lib/freopen-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !214, nameTableKind: None)
!213 = !DIFile(filename: "lib/linebuffer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!217 = !DIFile(filename: "lib/randint.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !220, nameTableKind: None)
!219 = !DIFile(filename: "lib/randperm.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !{!46, !52}
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !220, nameTableKind: None)
!222 = !DIFile(filename: "lib/randread.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !225, retainedTypes: !280, nameTableKind: None)
!224 = !DIFile(filename: "lib/rand-isaac.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !{!226}
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !227, file: !224, line: 100, baseType: !7, size: 32, elements: !278)
!227 = distinct !DISubprogram(name: "isaac_refill", scope: !224, file: !224, line: 90, type: !228, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !223, retainedNodes: !245)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230, !244}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !232, line: 56, size: 16576, elements: !233)
!232 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!233 = !{!234, !241, !242, !243}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !231, file: !232, line: 58, baseType: !235, size: 16384)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 16384, elements: !147)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !232, line: 44, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !238, line: 52, baseType: !239)
!238 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !50, line: 59, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !50, line: 45, baseType: !54)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !231, file: !232, line: 59, baseType: !236, size: 64, offset: 16384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !231, file: !232, line: 59, baseType: !236, size: 64, offset: 16448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !231, file: !232, line: 59, baseType: !236, size: 64, offset: 16512)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !255, !256, !258, !259, !261, !262, !264, !265, !268, !269, !271, !272, !274, !275, !277}
!246 = !DILocalVariable(name: "s", arg: 1, scope: !227, file: !224, line: 90, type: !230)
!247 = !DILocalVariable(name: "result", arg: 2, scope: !227, file: !224, line: 90, type: !244)
!248 = !DILocalVariable(name: "a", scope: !227, file: !224, line: 93, type: !236)
!249 = !DILocalVariable(name: "b", scope: !227, file: !224, line: 94, type: !236)
!250 = !DILocalVariable(name: "m", scope: !227, file: !224, line: 97, type: !244)
!251 = !DILocalVariable(name: "r", scope: !227, file: !224, line: 98, type: !244)
!252 = !DILocalVariable(name: "x", scope: !253, file: !224, line: 118, type: !236)
!253 = distinct !DILexicalBlock(scope: !254, file: !224, line: 118, column: 7)
!254 = distinct !DILexicalBlock(scope: !227, file: !224, line: 117, column: 5)
!255 = !DILocalVariable(name: "y", scope: !253, file: !224, line: 118, type: !236)
!256 = !DILocalVariable(name: "x", scope: !257, file: !224, line: 119, type: !236)
!257 = distinct !DILexicalBlock(scope: !254, file: !224, line: 119, column: 7)
!258 = !DILocalVariable(name: "y", scope: !257, file: !224, line: 119, type: !236)
!259 = !DILocalVariable(name: "x", scope: !260, file: !224, line: 120, type: !236)
!260 = distinct !DILexicalBlock(scope: !254, file: !224, line: 120, column: 7)
!261 = !DILocalVariable(name: "y", scope: !260, file: !224, line: 120, type: !236)
!262 = !DILocalVariable(name: "x", scope: !263, file: !224, line: 121, type: !236)
!263 = distinct !DILexicalBlock(scope: !254, file: !224, line: 121, column: 7)
!264 = !DILocalVariable(name: "y", scope: !263, file: !224, line: 121, type: !236)
!265 = !DILocalVariable(name: "x", scope: !266, file: !224, line: 128, type: !236)
!266 = distinct !DILexicalBlock(scope: !267, file: !224, line: 128, column: 7)
!267 = distinct !DILexicalBlock(scope: !227, file: !224, line: 127, column: 5)
!268 = !DILocalVariable(name: "y", scope: !266, file: !224, line: 128, type: !236)
!269 = !DILocalVariable(name: "x", scope: !270, file: !224, line: 129, type: !236)
!270 = distinct !DILexicalBlock(scope: !267, file: !224, line: 129, column: 7)
!271 = !DILocalVariable(name: "y", scope: !270, file: !224, line: 129, type: !236)
!272 = !DILocalVariable(name: "x", scope: !273, file: !224, line: 130, type: !236)
!273 = distinct !DILexicalBlock(scope: !267, file: !224, line: 130, column: 7)
!274 = !DILocalVariable(name: "y", scope: !273, file: !224, line: 130, type: !236)
!275 = !DILocalVariable(name: "x", scope: !276, file: !224, line: 131, type: !236)
!276 = distinct !DILexicalBlock(scope: !267, file: !224, line: 131, column: 7)
!277 = !DILocalVariable(name: "y", scope: !276, file: !224, line: 131, type: !236)
!278 = !{!279}
!279 = !DIEnumerator(name: "HALF", value: 128, isUnsigned: true)
!280 = !{!236}
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !283, nameTableKind: None)
!282 = !DIFile(filename: "lib/read-file.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!283 = !{!46}
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !286, retainedTypes: !283, nameTableKind: None)
!285 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!286 = !{!287}
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 40, baseType: !7, size: 32, elements: !288)
!288 = !{!289}
!289 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !292, retainedTypes: !306, nameTableKind: None)
!291 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !295, file: !294, line: 186, baseType: !7, size: 32, elements: !304)
!294 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!295 = distinct !DISubprogram(name: "x2nrealloc", scope: !294, file: !294, line: 174, type: !296, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !290, retainedNodes: !299)
!296 = !DISubroutineType(types: !297)
!297 = !{!46, !46, !298, !52}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!299 = !{!300, !301, !302, !303}
!300 = !DILocalVariable(name: "p", arg: 1, scope: !295, file: !294, line: 174, type: !46)
!301 = !DILocalVariable(name: "pn", arg: 2, scope: !295, file: !294, line: 174, type: !298)
!302 = !DILocalVariable(name: "s", arg: 3, scope: !295, file: !294, line: 174, type: !52)
!303 = !DILocalVariable(name: "n", scope: !295, file: !294, line: 176, type: !52)
!304 = !{!305}
!305 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!306 = !{!52, !44, !46}
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!308 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !311, nameTableKind: None)
!310 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!311 = !{!5}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !314, retainedTypes: !315, nameTableKind: None)
!313 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!314 = !{!5, !108}
!315 = !{!66, !124}
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !283, nameTableKind: None)
!317 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!319 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !283, nameTableKind: None)
!321 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !283, nameTableKind: None)
!323 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !326, nameTableKind: None)
!325 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!326 = !{!52}
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!328 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!330 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!332 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !335, retainedTypes: !283, nameTableKind: None)
!334 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!335 = !{!336}
!336 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !337, line: 41, baseType: !7, size: 32, elements: !338)
!337 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!339 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!340 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!341 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!342 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!343 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!344 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!345 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!346 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!347 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!348 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!349 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!350 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!351 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!352 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!353 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!354 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!355 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!356 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!357 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!358 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!359 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!360 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!361 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!362 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!363 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!364 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!365 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!366 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!367 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!368 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!369 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!370 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!371 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!372 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!373 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!374 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!375 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!376 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!377 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!378 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!379 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!380 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!381 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!382 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!383 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!384 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!385 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!386 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!387 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!388 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!447 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!450 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!451 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!452 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!453 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!454 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!455 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!456 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!457 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!458 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!459 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!460 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!461 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!534 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!607 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!608 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!609 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!610 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!611 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!612 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!613 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!614 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!615 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!616 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!617 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!618 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!619 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!620 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!621 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!623 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!624 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!625 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!626 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!627 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!628 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!654 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!655 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!656 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!657 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!658 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!663 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!664 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!665 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!666 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, retainedTypes: !283, nameTableKind: None)
!723 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !76, nameTableKind: None)
!725 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!726 = !{!"clang version 12.0.1"}
!727 = !{i32 7, !"Dwarf Version", i32 4}
!728 = !{i32 2, !"Debug Info Version", i32 3}
!729 = !{i32 1, !"wchar_size", i32 4}
!730 = !{i32 7, !"PIC Level", i32 2}
!731 = !{i32 7, !"PIE Level", i32 2}
!732 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 56, type: !733, scopeLine: 57, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !66}
!735 = !{!736}
!736 = !DILocalVariable(name: "status", arg: 1, scope: !732, file: !3, line: 56, type: !66)
!737 = !DILocation(scope: !732)
!738 = !DILocation(line: 58, column: 14, scope: !739)
!739 = distinct !DILexicalBlock(scope: !732, file: !3, line: 58, column: 7)
!740 = !DILocation(line: 58, column: 7, scope: !732)
!741 = !DILocation(line: 59, column: 5, scope: !742)
!742 = distinct !DILexicalBlock(scope: !739, file: !3, line: 59, column: 5)
!743 = !{!744, !744, i64 0}
!744 = !{!"any pointer", !745, i64 0}
!745 = !{!"omnipotent char", !746, i64 0}
!746 = !{!"Simple C/C++ TBAA"}
!747 = !DILocation(line: 62, column: 7, scope: !748)
!748 = distinct !DILexicalBlock(scope: !739, file: !3, line: 61, column: 5)
!749 = !DILocation(line: 68, column: 7, scope: !748)
!750 = !DILocation(line: 583, column: 3, scope: !751, inlinedAt: !755)
!751 = distinct !DISubprogram(name: "emit_stdin_note", scope: !752, file: !752, line: 581, type: !753, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !76)
!752 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!753 = !DISubroutineType(types: !754)
!754 = !{null}
!755 = distinct !DILocation(line: 72, column: 7, scope: !748)
!756 = !DILocation(line: 590, column: 3, scope: !757, inlinedAt: !758)
!757 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !752, file: !752, line: 588, type: !753, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !76)
!758 = distinct !DILocation(line: 73, column: 7, scope: !748)
!759 = !DILocation(line: 75, column: 7, scope: !748)
!760 = !DILocation(line: 83, column: 7, scope: !748)
!761 = !DILocation(line: 86, column: 7, scope: !748)
!762 = !DILocation(line: 87, column: 7, scope: !748)
!763 = !DILocalVariable(name: "program", arg: 1, scope: !764, file: !752, line: 634, type: !55)
!764 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !752, file: !752, line: 634, type: !765, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !55}
!767 = !{!763, !768, !777, !778, !780}
!768 = !DILocalVariable(name: "infomap", scope: !764, file: !752, line: 636, type: !769)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 896, elements: !775)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !764, file: !752, line: 636, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !771, file: !752, line: 636, baseType: !55, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !771, file: !752, line: 636, baseType: !55, size: 64, offset: 64)
!775 = !{!776}
!776 = !DISubrange(count: 7)
!777 = !DILocalVariable(name: "node", scope: !764, file: !752, line: 646, type: !55)
!778 = !DILocalVariable(name: "map_prog", scope: !764, file: !752, line: 647, type: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!780 = !DILocalVariable(name: "lc_messages", scope: !764, file: !752, line: 659, type: !55)
!781 = !DILocation(scope: !764, inlinedAt: !782)
!782 = distinct !DILocation(line: 88, column: 7, scope: !748)
!783 = !DILocation(line: 636, column: 3, scope: !764, inlinedAt: !782)
!784 = !DILocation(line: 636, column: 67, scope: !764, inlinedAt: !782)
!785 = !DILocation(line: 647, column: 36, scope: !764, inlinedAt: !782)
!786 = !DILocation(line: 649, column: 3, scope: !764, inlinedAt: !782)
!787 = !DILocation(line: 649, column: 33, scope: !764, inlinedAt: !782)
!788 = !DILocation(line: 650, column: 13, scope: !764, inlinedAt: !782)
!789 = !DILocation(line: 649, column: 20, scope: !764, inlinedAt: !782)
!790 = !{!791, !744, i64 0}
!791 = !{!"infomap", !744, i64 0, !744, i64 8}
!792 = !DILocation(line: 649, column: 10, scope: !764, inlinedAt: !782)
!793 = !DILocation(line: 649, column: 28, scope: !764, inlinedAt: !782)
!794 = distinct !{!794, !786, !788, !795}
!795 = !{!"llvm.loop.mustprogress"}
!796 = !DILocation(line: 652, column: 17, scope: !797, inlinedAt: !782)
!797 = distinct !DILexicalBlock(scope: !764, file: !752, line: 652, column: 7)
!798 = !{!791, !744, i64 8}
!799 = !DILocation(line: 652, column: 7, scope: !797, inlinedAt: !782)
!800 = !DILocation(line: 652, column: 7, scope: !764, inlinedAt: !782)
!801 = !DILocation(line: 655, column: 3, scope: !764, inlinedAt: !782)
!802 = !DILocation(line: 659, column: 29, scope: !764, inlinedAt: !782)
!803 = !DILocation(line: 660, column: 7, scope: !804, inlinedAt: !782)
!804 = distinct !DILexicalBlock(scope: !764, file: !752, line: 660, column: 7)
!805 = !DILocation(line: 660, column: 19, scope: !804, inlinedAt: !782)
!806 = !DILocation(line: 660, column: 22, scope: !804, inlinedAt: !782)
!807 = !DILocation(line: 660, column: 7, scope: !764, inlinedAt: !782)
!808 = !DILocation(line: 666, column: 7, scope: !809, inlinedAt: !782)
!809 = distinct !DILexicalBlock(scope: !804, file: !752, line: 661, column: 5)
!810 = !DILocation(line: 668, column: 5, scope: !809, inlinedAt: !782)
!811 = !DILocation(line: 669, column: 3, scope: !764, inlinedAt: !782)
!812 = !DILocation(line: 671, column: 3, scope: !764, inlinedAt: !782)
!813 = !DILocation(line: 673, column: 1, scope: !764, inlinedAt: !782)
!814 = !DILocation(line: 91, column: 3, scope: !732)
!815 = !DISubprogram(name: "dcgettext", scope: !816, file: !816, line: 51, type: !817, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!816 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!817 = !DISubroutineType(types: !818)
!818 = !{!44, !55, !55, !66}
!819 = !DISubprogram(name: "fputs_unlocked", scope: !820, file: !820, line: 667, type: !821, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!820 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!821 = !DISubroutineType(types: !822)
!822 = !{!66, !55, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !825, line: 49, size: 1728, elements: !826)
!825 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !842, !843, !844, !845, !846, !847, !849, !853, !856, !858, !861, !864, !865, !866, !867, !868}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !824, file: !825, line: 51, baseType: !66, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !824, file: !825, line: 54, baseType: !44, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !824, file: !825, line: 55, baseType: !44, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !824, file: !825, line: 56, baseType: !44, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !824, file: !825, line: 57, baseType: !44, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !824, file: !825, line: 58, baseType: !44, size: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !824, file: !825, line: 59, baseType: !44, size: 64, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !824, file: !825, line: 60, baseType: !44, size: 64, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !824, file: !825, line: 61, baseType: !44, size: 64, offset: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !824, file: !825, line: 64, baseType: !44, size: 64, offset: 576)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !824, file: !825, line: 65, baseType: !44, size: 64, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !824, file: !825, line: 66, baseType: !44, size: 64, offset: 704)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !824, file: !825, line: 68, baseType: !840, size: 64, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !825, line: 36, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !824, file: !825, line: 70, baseType: !823, size: 64, offset: 832)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !824, file: !825, line: 72, baseType: !66, size: 32, offset: 896)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !824, file: !825, line: 73, baseType: !66, size: 32, offset: 928)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !824, file: !825, line: 74, baseType: !49, size: 64, offset: 960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !824, file: !825, line: 77, baseType: !124, size: 16, offset: 1024)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !824, file: !825, line: 78, baseType: !848, size: 8, offset: 1040)
!848 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !824, file: !825, line: 79, baseType: !850, size: 8, offset: 1048)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 1)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !824, file: !825, line: 81, baseType: !854, size: 64, offset: 1088)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !825, line: 43, baseType: null)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !824, file: !825, line: 89, baseType: !857, size: 64, offset: 1152)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !51)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !824, file: !825, line: 91, baseType: !859, size: 64, offset: 1216)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !825, line: 37, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !824, file: !825, line: 92, baseType: !862, size: 64, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !825, line: 38, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !824, file: !825, line: 93, baseType: !823, size: 64, offset: 1344)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !824, file: !825, line: 94, baseType: !46, size: 64, offset: 1408)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !824, file: !825, line: 95, baseType: !52, size: 64, offset: 1472)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !824, file: !825, line: 96, baseType: !66, size: 32, offset: 1536)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !824, file: !825, line: 98, baseType: !869, size: 160, offset: 1568)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 20)
!872 = !DISubprogram(name: "setlocale", scope: !873, file: !873, line: 122, type: !874, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!873 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!874 = !DISubroutineType(types: !875)
!875 = !{!44, !66, !55}
!876 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 372, type: !877, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !880)
!877 = !DISubroutineType(types: !878)
!878 = !{!66, !66, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !907, !911, !912, !913, !916, !917, !918, !922, !924}
!881 = !DILocalVariable(name: "argc", arg: 1, scope: !876, file: !3, line: 372, type: !66)
!882 = !DILocalVariable(name: "argv", arg: 2, scope: !876, file: !3, line: 372, type: !879)
!883 = !DILocalVariable(name: "echo", scope: !876, file: !3, line: 374, type: !85)
!884 = !DILocalVariable(name: "input_range", scope: !876, file: !3, line: 375, type: !85)
!885 = !DILocalVariable(name: "lo_input", scope: !876, file: !3, line: 376, type: !52)
!886 = !DILocalVariable(name: "hi_input", scope: !876, file: !3, line: 377, type: !52)
!887 = !DILocalVariable(name: "head_lines", scope: !876, file: !3, line: 378, type: !52)
!888 = !DILocalVariable(name: "outfile", scope: !876, file: !3, line: 379, type: !55)
!889 = !DILocalVariable(name: "random_source", scope: !876, file: !3, line: 380, type: !44)
!890 = !DILocalVariable(name: "eolbyte", scope: !876, file: !3, line: 381, type: !45)
!891 = !DILocalVariable(name: "input_lines", scope: !876, file: !3, line: 382, type: !879)
!892 = !DILocalVariable(name: "use_reservoir_sampling", scope: !876, file: !3, line: 383, type: !85)
!893 = !DILocalVariable(name: "repeat", scope: !876, file: !3, line: 384, type: !85)
!894 = !DILocalVariable(name: "optc", scope: !876, file: !3, line: 386, type: !66)
!895 = !DILocalVariable(name: "n_operands", scope: !876, file: !3, line: 387, type: !66)
!896 = !DILocalVariable(name: "operand", scope: !876, file: !3, line: 388, type: !879)
!897 = !DILocalVariable(name: "n_lines", scope: !876, file: !3, line: 389, type: !52)
!898 = !DILocalVariable(name: "line", scope: !876, file: !3, line: 390, type: !879)
!899 = !DILocalVariable(name: "reservoir", scope: !876, file: !3, line: 391, type: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !902, line: 26, size: 192, elements: !903)
!902 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !901, file: !902, line: 28, baseType: !52, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !901, file: !902, line: 29, baseType: !52, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !901, file: !902, line: 30, baseType: !44, size: 64, offset: 128)
!907 = !DILocalVariable(name: "randint_source", scope: !876, file: !3, line: 392, type: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !910, line: 33, flags: DIFlagFwdDecl)
!910 = !DIFile(filename: "./lib/randint.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!911 = !DILocalVariable(name: "permutation", scope: !876, file: !3, line: 393, type: !298)
!912 = !DILocalVariable(name: "i", scope: !876, file: !3, line: 394, type: !66)
!913 = !DILocalVariable(name: "p", scope: !914, file: !3, line: 413, type: !44)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 412, column: 9)
!915 = distinct !DILexicalBlock(scope: !876, file: !3, line: 406, column: 7)
!916 = !DILocalVariable(name: "hi_optarg", scope: !914, file: !3, line: 414, type: !55)
!917 = !DILocalVariable(name: "invalid", scope: !914, file: !3, line: 415, type: !85)
!918 = !DILocalVariable(name: "argval", scope: !919, file: !3, line: 443, type: !920)
!919 = distinct !DILexicalBlock(scope: !915, file: !3, line: 442, column: 9)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !238, line: 102, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !50, line: 73, baseType: !54)
!922 = !DILocalVariable(name: "e", scope: !919, file: !3, line: 444, type: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !6, line: 38, baseType: !5)
!924 = !DILocalVariable(name: "ahead_lines", scope: !876, file: !3, line: 537, type: !52)
!925 = !DILocation(scope: !876)
!926 = !DILocation(line: 397, column: 21, scope: !876)
!927 = !DILocation(line: 397, column: 3, scope: !876)
!928 = !DILocation(line: 398, column: 3, scope: !876)
!929 = !DILocation(line: 399, column: 3, scope: !876)
!930 = !DILocation(line: 400, column: 3, scope: !876)
!931 = !DILocation(line: 402, column: 3, scope: !876)
!932 = !DILocation(line: 404, column: 3, scope: !876)
!933 = !DILocation(line: 379, column: 15, scope: !876)
!934 = !DILocation(line: 380, column: 9, scope: !876)
!935 = !DILocation(line: 384, column: 8, scope: !876)
!936 = !DILocation(line: 378, column: 10, scope: !876)
!937 = !DILocation(line: 377, column: 10, scope: !876)
!938 = !DILocation(line: 376, column: 10, scope: !876)
!939 = !DILocation(line: 375, column: 8, scope: !876)
!940 = !DILocation(line: 374, column: 8, scope: !876)
!941 = !DILocation(line: 404, column: 18, scope: !876)
!942 = !DILocation(line: 413, column: 29, scope: !914)
!943 = !DILocation(line: 413, column: 21, scope: !914)
!944 = !DILocation(scope: !914)
!945 = !DILocation(line: 415, column: 26, scope: !914)
!946 = !DILocation(line: 417, column: 15, scope: !947)
!947 = distinct !DILexicalBlock(scope: !914, file: !3, line: 417, column: 15)
!948 = !DILocation(line: 417, column: 15, scope: !914)
!949 = !DILocation(line: 418, column: 13, scope: !947)
!950 = !DILocation(line: 421, column: 15, scope: !914)
!951 = !DILocation(line: 423, column: 18, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !3, line: 422, column: 13)
!953 = distinct !DILexicalBlock(scope: !914, file: !3, line: 421, column: 15)
!954 = !{!745, !745, i64 0}
!955 = !DILocation(line: 424, column: 38, scope: !952)
!956 = !DILocation(line: 425, column: 38, scope: !952)
!957 = !DILocation(line: 424, column: 26, scope: !952)
!958 = !DILocation(line: 426, column: 18, scope: !952)
!959 = !DILocation(line: 427, column: 29, scope: !952)
!960 = !DILocation(line: 428, column: 13, scope: !952)
!961 = !DILocation(line: 431, column: 34, scope: !914)
!962 = !DILocation(line: 430, column: 22, scope: !914)
!963 = !DILocation(line: 433, column: 30, scope: !914)
!964 = !DILocation(line: 434, column: 33, scope: !914)
!965 = !DILocation(line: 434, column: 58, scope: !914)
!966 = !DILocation(line: 434, column: 46, scope: !914)
!967 = !DILocation(line: 434, column: 19, scope: !914)
!968 = !DILocation(line: 435, column: 15, scope: !914)
!969 = !DILocation(line: 436, column: 13, scope: !970)
!970 = distinct !DILexicalBlock(scope: !914, file: !3, line: 435, column: 15)
!971 = !{!972, !972, i64 0}
!972 = !{!"int", !745, i64 0}
!973 = !DILocation(line: 443, column: 11, scope: !919)
!974 = !DILocation(line: 444, column: 40, scope: !919)
!975 = !DILocation(scope: !919)
!976 = !DILocation(line: 444, column: 28, scope: !919)
!977 = !DILocation(line: 446, column: 15, scope: !919)
!978 = !DILocation(line: 447, column: 26, scope: !979)
!979 = distinct !DILexicalBlock(scope: !919, file: !3, line: 446, column: 15)
!980 = !{!981, !981, i64 0}
!981 = !{!"long", !745, i64 0}
!982 = !DILocation(line: 447, column: 13, scope: !979)
!983 = !DILocation(line: 449, column: 13, scope: !984)
!984 = distinct !DILexicalBlock(scope: !979, file: !3, line: 448, column: 20)
!985 = !DILocation(line: 451, column: 9, scope: !915)
!986 = !DILocation(line: 452, column: 9, scope: !915)
!987 = !DILocation(line: 455, column: 13, scope: !988)
!988 = distinct !DILexicalBlock(scope: !915, file: !3, line: 455, column: 13)
!989 = !DILocation(scope: !915)
!990 = !DILocation(line: 455, column: 21, scope: !988)
!991 = !DILocation(line: 455, column: 25, scope: !988)
!992 = !DILocation(line: 455, column: 13, scope: !915)
!993 = !DILocation(line: 456, column: 11, scope: !988)
!994 = !DILocation(line: 461, column: 13, scope: !995)
!995 = distinct !DILexicalBlock(scope: !915, file: !3, line: 461, column: 13)
!996 = !DILocation(line: 461, column: 27, scope: !995)
!997 = distinct !{!997, !932, !998, !795}
!998 = !DILocation(line: 478, column: 7, scope: !876)
!999 = !DILocation(line: 461, column: 31, scope: !995)
!1000 = !DILocation(line: 461, column: 13, scope: !915)
!1001 = !DILocation(line: 462, column: 11, scope: !995)
!1002 = !DILocation(line: 468, column: 9, scope: !915)
!1003 = !DILocation(line: 472, column: 9, scope: !915)
!1004 = !DILocation(line: 474, column: 7, scope: !915)
!1005 = !DILocation(line: 475, column: 7, scope: !915)
!1006 = !DILocation(line: 477, column: 9, scope: !915)
!1007 = !DILocation(line: 480, column: 23, scope: !876)
!1008 = !DILocation(line: 480, column: 21, scope: !876)
!1009 = !DILocation(line: 481, column: 18, scope: !876)
!1010 = !DILocation(line: 484, column: 7, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !876, file: !3, line: 484, column: 7)
!1012 = !DILocation(line: 484, column: 12, scope: !1011)
!1013 = !DILocation(line: 486, column: 20, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 485, column: 5)
!1015 = !DILocation(line: 486, column: 7, scope: !1014)
!1016 = !DILocation(line: 487, column: 7, scope: !1014)
!1017 = !DILocation(line: 489, column: 7, scope: !876)
!1018 = !DILocation(line: 489, column: 23, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !876, file: !3, line: 489, column: 7)
!1020 = !DILocation(line: 489, column: 7, scope: !1019)
!1021 = !DILocation(line: 489, column: 44, scope: !1019)
!1022 = !DILocation(line: 491, column: 20, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 490, column: 5)
!1024 = !DILocation(line: 491, column: 58, scope: !1023)
!1025 = !DILocation(line: 491, column: 50, scope: !1023)
!1026 = !DILocation(line: 491, column: 43, scope: !1023)
!1027 = !DILocation(line: 491, column: 7, scope: !1023)
!1028 = !DILocation(line: 492, column: 7, scope: !1023)
!1029 = !DILocation(line: 496, column: 18, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !876, file: !3, line: 496, column: 7)
!1031 = !DILocation(line: 496, column: 7, scope: !876)
!1032 = !DILocation(line: 501, column: 12, scope: !1030)
!1033 = !DILocalVariable(name: "operand", arg: 1, scope: !1034, file: !3, line: 116, type: !879)
!1034 = distinct !DISubprogram(name: "input_from_argv", scope: !3, file: !3, line: 116, type: !1035, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !879, !66, !45}
!1037 = !{!1033, !1038, !1039, !1040, !1041, !1042, !1043}
!1038 = !DILocalVariable(name: "n_operands", arg: 2, scope: !1034, file: !3, line: 116, type: !66)
!1039 = !DILocalVariable(name: "eolbyte", arg: 3, scope: !1034, file: !3, line: 116, type: !45)
!1040 = !DILocalVariable(name: "p", scope: !1034, file: !3, line: 118, type: !44)
!1041 = !DILocalVariable(name: "size", scope: !1034, file: !3, line: 119, type: !52)
!1042 = !DILocalVariable(name: "i", scope: !1034, file: !3, line: 120, type: !66)
!1043 = !DILocalVariable(name: "p1", scope: !1044, file: !3, line: 128, type: !44)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 127, column: 5)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 126, column: 3)
!1046 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 126, column: 3)
!1047 = !DILocation(scope: !1034, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 503, column: 7, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 502, column: 5)
!1050 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 501, column: 12)
!1051 = !DILocation(line: 119, column: 17, scope: !1034, inlinedAt: !1048)
!1052 = !DILocation(line: 122, column: 17, scope: !1053, inlinedAt: !1048)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 122, column: 3)
!1054 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 122, column: 3)
!1055 = !DILocation(line: 122, column: 3, scope: !1054, inlinedAt: !1048)
!1056 = !DILocation(line: 124, column: 7, scope: !1034, inlinedAt: !1048)
!1057 = !DILocation(line: 126, column: 3, scope: !1046, inlinedAt: !1048)
!1058 = !DILocation(line: 123, column: 21, scope: !1053, inlinedAt: !1048)
!1059 = !DILocation(line: 123, column: 13, scope: !1053, inlinedAt: !1048)
!1060 = !DILocation(line: 123, column: 10, scope: !1053, inlinedAt: !1048)
!1061 = !DILocation(line: 122, column: 32, scope: !1053, inlinedAt: !1048)
!1062 = distinct !{!1062, !1055, !1063, !795}
!1063 = !DILocation(line: 123, column: 31, scope: !1054, inlinedAt: !1048)
!1064 = !DILocation(line: 128, column: 29, scope: !1044, inlinedAt: !1048)
!1065 = !DILocalVariable(name: "__dest", arg: 1, scope: !1066, file: !1067, line: 84, type: !1070)
!1066 = distinct !DISubprogram(name: "stpcpy", scope: !1067, file: !1067, line: 84, type: !1068, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1072)
!1067 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "")
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!44, !1070, !1071}
!1070 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !44)
!1071 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !55)
!1072 = !{!1065, !1073}
!1073 = !DILocalVariable(name: "__src", arg: 2, scope: !1066, file: !1067, line: 84, type: !1071)
!1074 = !DILocation(scope: !1066, inlinedAt: !1075)
!1075 = distinct !DILocation(line: 128, column: 18, scope: !1044, inlinedAt: !1048)
!1076 = !DILocation(line: 86, column: 10, scope: !1066, inlinedAt: !1075)
!1077 = !DILocation(scope: !1044, inlinedAt: !1048)
!1078 = !DILocation(line: 129, column: 18, scope: !1044, inlinedAt: !1048)
!1079 = !DILocation(line: 131, column: 9, scope: !1044, inlinedAt: !1048)
!1080 = !DILocation(line: 131, column: 12, scope: !1044, inlinedAt: !1048)
!1081 = !DILocation(line: 126, column: 32, scope: !1045, inlinedAt: !1048)
!1082 = !DILocation(line: 126, column: 17, scope: !1045, inlinedAt: !1048)
!1083 = distinct !{!1083, !1057, !1084, !795}
!1084 = !DILocation(line: 132, column: 5, scope: !1046, inlinedAt: !1048)
!1085 = !DILocation(line: 134, column: 3, scope: !1034, inlinedAt: !1048)
!1086 = !DILocation(line: 134, column: 23, scope: !1034, inlinedAt: !1048)
!1087 = !DILocation(line: 506, column: 5, scope: !1049)
!1088 = !DILocation(line: 507, column: 12, scope: !1050)
!1089 = !DILocation(line: 509, column: 26, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 508, column: 5)
!1091 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 507, column: 12)
!1092 = !DILocation(line: 509, column: 37, scope: !1090)
!1093 = !DILocation(line: 511, column: 5, scope: !1090)
!1094 = !DILocation(line: 515, column: 22, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 515, column: 11)
!1096 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 513, column: 5)
!1097 = !DILocation(line: 516, column: 11, scope: !1095)
!1098 = !DILocation(line: 516, column: 17, scope: !1095)
!1099 = !DILocation(line: 517, column: 17, scope: !1095)
!1100 = !DILocation(line: 517, column: 46, scope: !1095)
!1101 = !DILocation(line: 517, column: 20, scope: !1095)
!1102 = !DILocation(line: 515, column: 11, scope: !1096)
!1103 = !DILocation(line: 518, column: 9, scope: !1095)
!1104 = !DILocation(line: 520, column: 16, scope: !1096)
!1105 = !DILocation(line: 520, column: 7, scope: !1096)
!1106 = !DILocation(line: 522, column: 11, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 522, column: 11)
!1108 = !DILocation(line: 522, column: 18, scope: !1107)
!1109 = !DILocation(line: 154, column: 3, scope: !1110, inlinedAt: !1153)
!1110 = distinct !DISubprogram(name: "input_size", scope: !3, file: !3, line: 150, type: !1111, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1113)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!47}
!1113 = !{!1114, !1115, !1152}
!1114 = !DILocalVariable(name: "file_size", scope: !1110, file: !3, line: 152, type: !47)
!1115 = !DILocalVariable(name: "stat_buf", scope: !1110, file: !3, line: 154, type: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1117, line: 26, size: 1152, elements: !1118)
!1117 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!1118 = !{!1119, !1121, !1123, !1125, !1127, !1129, !1131, !1132, !1133, !1134, !1136, !1138, !1146, !1147, !1148}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1116, file: !1117, line: 28, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !50, line: 145, baseType: !54)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1116, file: !1117, line: 33, baseType: !1122, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !50, line: 148, baseType: !54)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1116, file: !1117, line: 41, baseType: !1124, size: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !50, line: 151, baseType: !54)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1116, file: !1117, line: 42, baseType: !1126, size: 32, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !50, line: 150, baseType: !7)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1116, file: !1117, line: 44, baseType: !1128, size: 32, offset: 224)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !50, line: 146, baseType: !7)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1116, file: !1117, line: 45, baseType: !1130, size: 32, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !50, line: 147, baseType: !7)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1116, file: !1117, line: 47, baseType: !66, size: 32, offset: 288)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1116, file: !1117, line: 49, baseType: !1120, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1116, file: !1117, line: 54, baseType: !49, size: 64, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1116, file: !1117, line: 58, baseType: !1135, size: 64, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !50, line: 175, baseType: !51)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1116, file: !1117, line: 60, baseType: !1137, size: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !50, line: 180, baseType: !51)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1116, file: !1117, line: 71, baseType: !1139, size: 128, offset: 576)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1140, line: 10, size: 128, elements: !1141)
!1140 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!1141 = !{!1142, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1139, file: !1140, line: 12, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !50, line: 160, baseType: !51)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1139, file: !1140, line: 16, baseType: !1145, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !50, line: 197, baseType: !51)
