source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%struct.linebuffer = type { i64, i64, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.randint_source = type { %struct.randread_source*, i64, i64 }
%struct.randread_source = type { %struct._IO_FILE*, void (i8*)*, i8*, %union.anon.27 }
%struct.slotvec = type { i64, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 101, type: !244, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !243, nameTableKind: None)
!3 = !DIFile(filename: "src/shuf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !14, !28, !37, !40}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 25, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !15, line: 32, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 45, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 52, baseType: !7, size: 32, elements: !38)
!38 = !{!39}
!39 = !DIEnumerator(name: "RESERVOIR_MIN_INPUT", value: 8388608, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 44, baseType: !7, size: 32, elements: !41)
!41 = !{!42}
!42 = !DIEnumerator(name: "RESERVOIR_LINES_INCREMENT", value: 1024, isUnsigned: true)
!43 = !{!44, !54, !115, !119, !123, !126, !129, !136, !151, !155, !159, !163, !48, !105, !168, !172, !176, !179, !182, !186, !192, !196, !199, !203, !205, !209, !107, !213, !214, !217, !227, !230, !231, !234, !50, !237, !242}
!44 = !DISubprogram(name: "dcgettext", scope: !45, file: !45, line: 51, type: !46, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!45 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !50, !50, !52}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !{}
!54 = !DISubprogram(name: "fputs_unlocked", scope: !55, file: !55, line: 662, type: !56, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!55 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!56 = !DISubroutineType(types: !57)
!57 = !{!52, !50, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !61)
!60 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !77, !78, !79, !80, !84, !86, !88, !92, !95, !97, !100, !103, !104, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 51, baseType: !52, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 36, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 70, baseType: !58, size: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !82, line: 152, baseType: !83)
!82 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!83 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 43, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !82, line: 153, baseType: !83)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !59, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !60, line: 37, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !59, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !60, line: 38, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !59, file: !60, line: 93, baseType: !58, size: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !59, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 160, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DISubprogram(name: "set_program_name", scope: !116, file: !116, line: 37, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!116 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!117 = !DISubroutineType(types: !118)
!118 = !{null, !50}
!119 = !DISubprogram(name: "setlocale", scope: !120, file: !120, line: 122, type: !121, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!120 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!121 = !DISubroutineType(types: !122)
!122 = !{!48, !52, !50}
!123 = !DISubprogram(name: "bindtextdomain", scope: !45, file: !45, line: 86, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!124 = !DISubroutineType(types: !125)
!125 = !{!48, !50, !50}
!126 = !DISubprogram(name: "textdomain", scope: !45, file: !45, line: 82, type: !127, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!127 = !DISubroutineType(types: !128)
!128 = !{!48, !50}
!129 = !DISubprogram(name: "atexit", scope: !130, file: !130, line: 595, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!130 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!131 = !DISubroutineType(types: !132)
!132 = !{!52, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DISubprogram(name: "getopt_long", scope: !137, file: !137, line: 66, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!137 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!138 = !DISubroutineType(types: !139)
!139 = !{!52, !52, !140, !50, !142, !149}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !137, line: 50, size: 256, elements: !145)
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !137, line: 52, baseType: !50, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !144, file: !137, line: 55, baseType: !52, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !144, file: !137, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !144, file: !137, line: 57, baseType: !52, size: 32, offset: 192)
!151 = !DISubprogram(name: "error", scope: !152, file: !152, line: 52, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!152 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !52, !52, !50, null}
!155 = !DISubprogram(name: "xdectoumax", scope: !156, file: !156, line: 31, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!156 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !DISubroutineType(types: !158)
!158 = !{!109, !50, !109, !109, !50, !50, !52}
!159 = !DISubprogram(name: "quote", scope: !160, file: !160, line: 44, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!160 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!50, !50}
!163 = !DISubprogram(name: "xstrtoumax", scope: !6, file: !6, line: 48, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!164 = !DISubroutineType(types: !165)
!165 = !{!5, !50, !166, !52, !167, !50}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!168 = !DISubprogram(name: "version_etc", scope: !169, file: !169, line: 69, type: !170, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!169 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !DISubroutineType(types: !171)
!171 = !{null, !58, !50, !50, !50, null}
!172 = !DISubprogram(name: "freopen_safer", scope: !173, file: !173, line: 27, type: !174, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!173 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!174 = !DISubroutineType(types: !175)
!175 = !{!58, !50, !50, !58}
!176 = !DISubprogram(name: "quotearg_n_style_colon", scope: !15, file: !15, line: 397, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!177 = !DISubroutineType(types: !178)
!178 = !{!48, !52, !14, !50}
!179 = !DISubprogram(name: "fadvise", scope: !29, file: !29, line: 72, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !58, !28}
!182 = !DISubprogram(name: "randperm_bound", scope: !183, file: !183, line: 3, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!183 = !DIFile(filename: "./lib/randperm.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!109, !109, !109}
!186 = !DISubprogram(name: "randint_all_new", scope: !187, file: !187, line: 36, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!187 = !DIFile(filename: "./lib/randint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !50, !109}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !187, line: 33, flags: DIFlagFwdDecl)
!192 = !DISubprogram(name: "rpl_fclose", scope: !193, file: !193, line: 672, type: !194, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!193 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!194 = !DISubroutineType(types: !195)
!195 = !{!52, !58}
!196 = !DISubprogram(name: "randperm_new", scope: !183, file: !183, line: 4, type: !197, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!197 = !DISubroutineType(types: !198)
!198 = !{!167, !190, !109, !109}
!199 = !DISubprogram(name: "xmalloc", scope: !200, file: !200, line: 53, type: !201, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!200 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !DISubroutineType(types: !202)
!202 = !{!105, !109}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !204, line: 85, baseType: !81)
!204 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!205 = !DISubprogram(name: "lseek", scope: !206, file: !206, line: 334, type: !207, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!206 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!207 = !DISubroutineType(types: !208)
!208 = !{!83, !52, !83, !52}
!209 = !DISubprogram(name: "fread_file", scope: !210, file: !210, line: 27, type: !211, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!210 = !DIFile(filename: "./lib/read-file.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!211 = !DISubroutineType(types: !212)
!212 = !{!48, !58, !167}
!213 = !DISubprogram(name: "xalloc_die", scope: !200, file: !200, line: 51, type: !134, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !53)
!214 = !DISubprogram(name: "xcalloc", scope: !200, file: !200, line: 57, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!215 = !DISubroutineType(types: !216)
!216 = !{!105, !109, !109}
!217 = !DISubprogram(name: "readlinebuffer_delim", scope: !218, file: !218, line: 41, type: !219, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!218 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !221, !58, !49}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !218, line: 26, size: 192, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !222, file: !218, line: 28, baseType: !107, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !222, file: !218, line: 29, baseType: !107, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !222, file: !218, line: 30, baseType: !48, size: 64, offset: 128)
!227 = !DISubprogram(name: "initbuffer", scope: !218, file: !218, line: 34, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !221}
!230 = !DISubprogram(name: "freebuffer", scope: !218, file: !218, line: 51, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!231 = !DISubprogram(name: "xrealloc", scope: !200, file: !200, line: 59, type: !232, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!232 = !DISubroutineType(types: !233)
!233 = !{!105, !105, !109}
!234 = !DISubprogram(name: "randint_genmax", scope: !187, file: !187, line: 39, type: !235, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!235 = !DISubroutineType(types: !236)
!236 = !{!109, !190, !109}
!237 = !DISubprogram(name: "fwrite_unlocked", scope: !55, file: !55, line: 675, type: !238, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!238 = !DISubroutineType(types: !239)
!239 = !{!109, !240, !109, !109, !58}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!242 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!243 = !{!0}
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 2560, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 10)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "Version", scope: !249, file: !250, line: 2, type: !50, isDefinition: true)
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, globals: !251, nameTableKind: None)
!250 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !{!247}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "file_name", scope: !254, file: !255, line: 46, type: !50, isLocal: true, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !256, globals: !294, nameTableKind: None)
!255 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !{!257, !44, !293, !151}
!257 = !DISubprogram(name: "close_stream", scope: !258, file: !258, line: 2, type: !259, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!258 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = !DISubroutineType(types: !260)
!260 = !{!52, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !262, file: !60, line: 51, baseType: !52, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !262, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !262, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !262, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !262, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !262, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !262, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !262, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !262, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !262, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !262, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !262, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !262, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !262, file: !60, line: 70, baseType: !261, size: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !262, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !262, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !262, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !262, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !262, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !262, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !262, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !262, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !262, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !262, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !262, file: !60, line: 93, baseType: !261, size: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !262, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !262, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !262, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !262, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!293 = !DISubprogram(name: "quotearg_colon", scope: !15, file: !15, line: 391, type: !127, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!294 = !{!252, !295}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !254, file: !255, line: 56, type: !297, isLocal: true, isDefinition: true)
!297 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "exit_failure", scope: !300, file: !301, line: 24, type: !303, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, globals: !302, nameTableKind: None)
!301 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !{!298}
!303 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "program_name", scope: !306, file: !307, line: 33, type: !50, isDefinition: true)
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !308, globals: !344, nameTableKind: None)
!307 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!308 = !{!105, !309, !48}
!309 = !DISubprogram(name: "fputs", scope: !55, file: !55, line: 626, type: !310, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!310 = !DISubroutineType(types: !311)
!311 = !{!52, !50, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !313, file: !60, line: 51, baseType: !52, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !313, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !313, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !313, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !313, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !313, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !313, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !313, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !313, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !313, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !313, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !313, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !313, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !313, file: !60, line: 70, baseType: !312, size: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !313, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !313, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !313, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !313, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !313, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !313, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !313, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !313, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !313, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !313, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !313, file: !60, line: 93, baseType: !312, size: 64, offset: 1344)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !313, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !313, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !313, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !313, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!344 = !{!304}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !347, file: !348, line: 85, type: !455, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !349, retainedTypes: !370, globals: !430, nameTableKind: None)
!348 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !{!14, !350, !355}
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 242, baseType: !7, size: 32, elements: !351)
!351 = !{!352, !353, !354}
!352 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!353 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!354 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !356, line: 46, baseType: !7, size: 32, elements: !357)
!356 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!358 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!359 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!360 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!361 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!362 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!363 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!364 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!365 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!366 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!368 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!369 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!370 = !{!371, !374, !389, !392, !52, !85, !395, !107, !412, !416, !44, !422, !426, !48, !199, !213, !231}
!371 = !DISubprogram(name: "xmemdup", scope: !200, file: !200, line: 62, type: !372, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!372 = !DISubroutineType(types: !373)
!373 = !{!105, !240, !109}
!374 = !DISubprogram(name: "quotearg_alloc_mem", scope: !15, file: !15, line: 342, type: !375, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!375 = !DISubroutineType(types: !376)
!376 = !{!48, !50, !109, !167, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !348, line: 65, size: 448, elements: !380)
!380 = !{!381, !382, !383, !387, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !379, file: !348, line: 68, baseType: !14, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !348, line: 71, baseType: !52, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !379, file: !348, line: 75, baseType: !384, size: 256, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !379, file: !348, line: 78, baseType: !50, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !379, file: !348, line: 81, baseType: !50, size: 64, offset: 384)
!389 = !DISubprogram(name: "free", scope: !130, file: !130, line: 565, type: !390, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !105}
!392 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !15, file: !15, line: 408, type: !393, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!393 = !DISubroutineType(types: !394)
!394 = !{!48, !52, !50, !50, !50, !109}
!395 = !DISubprogram(name: "rpl_mbrtowc", scope: !396, file: !396, line: 717, type: !397, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!396 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!397 = !DISubroutineType(types: !398)
!398 = !{!109, !149, !50, !109, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !401, line: 13, size: 64, elements: !402)
!401 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !400, file: !401, line: 15, baseType: !52, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !400, file: !401, line: 20, baseType: !405, size: 32, offset: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !401, line: 16, size: 32, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !405, file: !401, line: 18, baseType: !7, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !405, file: !401, line: 19, baseType: !409, size: 32)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 32, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 4)
!412 = !DISubprogram(name: "iswprint", scope: !413, file: !413, line: 120, type: !414, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!413 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!414 = !DISubroutineType(types: !415)
!415 = !{!52, !7}
!416 = !DISubprogram(name: "mbsinit", scope: !417, file: !417, line: 292, type: !418, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!417 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!418 = !DISubroutineType(types: !419)
!419 = !{!52, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!422 = !DISubprogram(name: "locale_charset", scope: !423, file: !423, line: 35, type: !424, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!423 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!424 = !DISubroutineType(types: !425)
!425 = !{!50}
!426 = !DISubprogram(name: "c_strcasecmp", scope: !427, file: !427, line: 42, type: !428, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!427 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!428 = !DISubroutineType(types: !429)
!429 = !{!52, !50, !50}
!430 = !{!345, !431, !435, !437, !439, !444, !451, !453}
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !347, file: !348, line: 101, type: !433, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 320, elements: !245)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !347, file: !348, line: 1052, type: !379, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !347, file: !348, line: 116, type: !379, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "slot0", scope: !347, file: !348, line: 842, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 2048, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 256)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "slotvec", scope: !347, file: !348, line: 845, type: !446, isLocal: true, isDefinition: true)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !348, line: 834, size: 128, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !348, line: 836, baseType: !107, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !447, file: !348, line: 837, baseType: !48, size: 64, offset: 64)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "nslots", scope: !347, file: !348, line: 843, type: !52, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "slotvec0", scope: !347, file: !348, line: 844, type: !447, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 704, elements: !457)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!457 = !{!458}
!458 = !DISubrange(count: 11)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !461, file: !462, line: 26, type: !464, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, globals: !463, nameTableKind: None)
!462 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = !{!459}
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 376, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 47)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "default_tuning", scope: !469, file: !470, line: 130, type: !475, isLocal: true, isDefinition: true)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !471, globals: !474, nameTableKind: None)
!470 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!471 = !{!109, !105, !472, !389, !107}
!472 = !DISubprogram(name: "rpl_calloc", scope: !473, file: !473, line: 688, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!473 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!474 = !{!467}
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !477, line: 65, baseType: !478)
!477 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !477, line: 53, size: 160, elements: !479)
!479 = !{!480, !482, !483, !484, !485}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !478, file: !477, line: 58, baseType: !481, size: 32)
!481 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !478, file: !477, line: 59, baseType: !481, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !478, file: !477, line: 60, baseType: !481, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !478, file: !477, line: 61, baseType: !481, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !478, file: !477, line: 62, baseType: !297, size: 8, offset: 128)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !488, file: !489, line: 507, type: !52, isLocal: true, isDefinition: true)
!488 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !489, file: !489, line: 488, type: !490, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !492, retainedNodes: !502)
!489 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = !DISubroutineType(types: !491)
!491 = !{!52, !52, !52}
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !493, globals: !501, nameTableKind: None)
!493 = !{!494, !498}
!494 = !DISubprogram(name: "fcntl", scope: !495, file: !495, line: 176, type: !496, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!495 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!496 = !DISubroutineType(types: !497)
!497 = !{!52, !52, !52, null}
!498 = !DISubprogram(name: "close", scope: !206, file: !206, line: 353, type: !499, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!499 = !DISubroutineType(types: !500)
!500 = !{!52, !52}
!501 = !{!486}
!502 = !{!503, !504, !505, !506, !509}
!503 = !DILocalVariable(name: "fd", arg: 1, scope: !488, file: !489, line: 488, type: !52)
!504 = !DILocalVariable(name: "target", arg: 2, scope: !488, file: !489, line: 488, type: !52)
!505 = !DILocalVariable(name: "result", scope: !488, file: !489, line: 490, type: !52)
!506 = !DILocalVariable(name: "flags", scope: !507, file: !489, line: 531, type: !52)
!507 = distinct !DILexicalBlock(scope: !508, file: !489, line: 530, column: 5)
!508 = distinct !DILexicalBlock(scope: !488, file: !489, line: 529, column: 7)
!509 = !DILocalVariable(name: "saved_errno", scope: !510, file: !489, line: 534, type: !52)
!510 = distinct !DILexicalBlock(scope: !511, file: !489, line: 533, column: 9)
!511 = distinct !DILexicalBlock(scope: !507, file: !489, line: 532, column: 11)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !514, retainedTypes: !515, nameTableKind: None)
!513 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!514 = !{!28}
!515 = !{!516, !519}
!516 = !DISubprogram(name: "posix_fadvise", scope: !495, file: !495, line: 288, type: !517, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!517 = !DISubroutineType(types: !518)
!518 = !{!52, !52, !83, !83, !52}
!519 = !DISubprogram(name: "fileno", scope: !55, file: !55, line: 786, type: !520, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!520 = !DISubroutineType(types: !521)
!521 = !{!52, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !523, file: !60, line: 51, baseType: !52, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !523, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !523, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !523, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !523, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !523, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !523, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !523, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !523, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !523, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !523, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !523, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !523, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !523, file: !60, line: 70, baseType: !522, size: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !523, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !523, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !523, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !523, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !523, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !523, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !523, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !523, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !523, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !523, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !523, file: !60, line: 93, baseType: !522, size: 64, offset: 1344)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !523, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !523, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !523, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !523, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !556, nameTableKind: None)
!555 = !DIFile(filename: "lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!556 = !{!557, !592, !593, !498, !596}
!557 = !DISubprogram(name: "fileno", scope: !55, file: !55, line: 786, type: !558, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!558 = !DISubroutineType(types: !559)
!559 = !{!52, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !561, file: !60, line: 51, baseType: !52, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !561, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !561, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !561, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !561, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !561, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !561, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !561, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !561, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !561, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !561, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !561, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !561, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !561, file: !60, line: 70, baseType: !560, size: 64, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !561, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !561, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !561, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !561, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !561, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !561, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !561, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !561, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !561, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !561, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !561, file: !60, line: 93, baseType: !560, size: 64, offset: 1344)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !561, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !561, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !561, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !561, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!592 = !DISubprogram(name: "dup2", scope: !206, file: !206, line: 534, type: !490, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!593 = !DISubprogram(name: "freopen", scope: !55, file: !55, line: 252, type: !594, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!594 = !DISubroutineType(types: !595)
!595 = !{!560, !50, !50, !560}
!596 = !DISubprogram(name: "open", scope: !495, file: !495, line: 196, type: !597, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!597 = !DISubroutineType(types: !598)
!598 = !{!52, !50, !52, null}
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !601, nameTableKind: None)
!600 = !DIFile(filename: "lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!601 = !{!602, !643, !389, !646}
!602 = !DISubprogram(name: "readlinebuffer_delim", scope: !218, file: !218, line: 41, type: !603, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !605, !611, !49}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !218, line: 26, size: 192, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !218, line: 28, baseType: !107, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !606, file: !218, line: 29, baseType: !107, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !606, file: !218, line: 30, baseType: !48, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !612, file: !60, line: 51, baseType: !52, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !612, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !612, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !612, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !612, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !612, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !612, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !612, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !612, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !612, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !612, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !612, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !612, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !612, file: !60, line: 70, baseType: !611, size: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !612, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !612, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !612, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !612, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !612, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !612, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !612, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !612, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !612, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !612, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !612, file: !60, line: 93, baseType: !611, size: 64, offset: 1344)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !612, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !612, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !612, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !612, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!643 = !DISubprogram(name: "x2realloc", scope: !200, file: !200, line: 61, type: !644, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!644 = !DISubroutineType(types: !645)
!645 = !{!105, !105, !167}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !649, nameTableKind: None)
!648 = !DIFile(filename: "lib/randint.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!649 = !{!199, !650, !656, !389, !659}
!650 = !DISubprogram(name: "randread_new", scope: !651, file: !651, line: 27, type: !652, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!651 = !DIFile(filename: "./lib/randread.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!652 = !DISubroutineType(types: !653)
!653 = !{!654, !50, !109}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "randread_source", file: !651, line: 25, flags: DIFlagFwdDecl)
!656 = !DISubprogram(name: "randread", scope: !651, file: !651, line: 28, type: !657, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !654, !105, !109}
!659 = !DISubprogram(name: "randread_free", scope: !651, file: !651, line: 31, type: !660, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!660 = !DISubroutineType(types: !661)
!661 = !{!52, !654}
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !664, nameTableKind: None)
!663 = !DIFile(filename: "lib/randperm.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!664 = !{!199, !105, !213, !234, !665, !107, !686, !689, !690, !231}
!665 = !DISubprogram(name: "hash_initialize", scope: !477, file: !477, line: 89, type: !666, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!666 = !DISubroutineType(types: !667)
!667 = !{!668, !109, !670, !679, !682, !685}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !477, line: 67, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !477, line: 53, size: 160, elements: !673)
!673 = !{!674, !675, !676, !677, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !672, file: !477, line: 58, baseType: !481, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !672, file: !477, line: 59, baseType: !481, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !672, file: !477, line: 60, baseType: !481, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !672, file: !477, line: 61, baseType: !481, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !672, file: !477, line: 62, baseType: !297, size: 8, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!109, !240, !109}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!297, !240, !240}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!686 = !DISubprogram(name: "hash_delete", scope: !477, file: !477, line: 104, type: !687, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!687 = !DISubroutineType(types: !688)
!688 = !{!105, !668, !240}
!689 = !DISubprogram(name: "hash_insert", scope: !477, file: !477, line: 100, type: !687, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!690 = !DISubprogram(name: "hash_free", scope: !477, file: !477, line: 96, type: !691, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !668}
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !695, nameTableKind: None)
!694 = !DIFile(filename: "lib/randread.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !{!696, !731, !734, !389, !751, !199, !44, !159, !151, !596, !498, !105, !754, !766, !769, !770, !773, !107, !774}
!696 = !DISubprogram(name: "fopen_safer", scope: !173, file: !173, line: 23, type: !697, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!697 = !DISubroutineType(types: !698)
!698 = !{!699, !50, !50}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !700, file: !60, line: 51, baseType: !52, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !700, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !700, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !700, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !700, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !700, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !700, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !700, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !700, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !700, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !700, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !700, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !700, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !700, file: !60, line: 70, baseType: !699, size: 64, offset: 832)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !700, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !700, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !700, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !700, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !700, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !700, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !700, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !700, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !700, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !700, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !700, file: !60, line: 93, baseType: !699, size: 64, offset: 1344)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !700, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !700, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !700, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !700, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!731 = !DISubprogram(name: "setvbuf", scope: !55, file: !55, line: 308, type: !732, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!732 = !DISubroutineType(types: !733)
!733 = !{!52, !699, !48, !52, !109}
!734 = !DISubprogram(name: "isaac_seed", scope: !735, file: !735, line: 62, type: !736, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!735 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!736 = !DISubroutineType(types: !737)
!737 = !{null, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !735, line: 56, size: 16576, elements: !740)
!740 = !{!741, !748, !749, !750}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !739, file: !735, line: 58, baseType: !742, size: 16384)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 16384, elements: !442)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !735, line: 44, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !745, line: 52, baseType: !746)
!745 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !82, line: 59, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !82, line: 45, baseType: !109)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !739, file: !735, line: 59, baseType: !743, size: 64, offset: 16384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !739, file: !735, line: 59, baseType: !743, size: 64, offset: 16448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !739, file: !735, line: 59, baseType: !743, size: 64, offset: 16512)
!751 = !DISubprogram(name: "rpl_fclose", scope: !193, file: !193, line: 672, type: !752, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!752 = !DISubroutineType(types: !753)
!753 = !{!52, !699}
!754 = !DISubprogram(name: "gettimeofday", scope: !755, file: !755, line: 66, type: !756, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!755 = !DIFile(filename: "/usr/include/sys/time.h", directory: "")
!756 = !DISubroutineType(types: !757)
!757 = !{!52, !758, !105}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !760, line: 8, size: 128, elements: !761)
!760 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "")
!761 = !{!762, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !759, file: !760, line: 10, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !82, line: 160, baseType: !83)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !759, file: !760, line: 11, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !82, line: 162, baseType: !83)
!766 = !DISubprogram(name: "getpid", scope: !206, file: !206, line: 628, type: !767, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!767 = !DISubroutineType(types: !768)
!768 = !{!52}
!769 = !DISubprogram(name: "getppid", scope: !206, file: !206, line: 631, type: !767, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!770 = !DISubprogram(name: "getuid", scope: !206, file: !206, line: 675, type: !771, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!771 = !DISubroutineType(types: !772)
!772 = !{!7}
!773 = !DISubprogram(name: "getgid", scope: !206, file: !206, line: 681, type: !771, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!774 = !DISubprogram(name: "isaac_refill", scope: !735, file: !735, line: 63, type: !775, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !738, !167}
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !779, retainedTypes: !827, nameTableKind: None)
!778 = !DIFile(filename: "lib/rand-isaac.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!779 = !{!780}
!780 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !781, file: !778, line: 100, baseType: !7, size: 32, elements: !825)
!781 = distinct !DISubprogram(name: "isaac_refill", scope: !778, file: !778, line: 90, type: !782, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !777, retainedNodes: !792)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !784, !791}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !735, line: 56, size: 16576, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !785, file: !735, line: 58, baseType: !742, size: 16384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !785, file: !735, line: 59, baseType: !743, size: 64, offset: 16384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !785, file: !735, line: 59, baseType: !743, size: 64, offset: 16448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !785, file: !735, line: 59, baseType: !743, size: 64, offset: 16512)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!792 = !{!793, !794, !795, !796, !797, !798, !799, !802, !803, !805, !806, !808, !809, !811, !812, !815, !816, !818, !819, !821, !822, !824}
!793 = !DILocalVariable(name: "s", arg: 1, scope: !781, file: !778, line: 90, type: !784)
!794 = !DILocalVariable(name: "result", arg: 2, scope: !781, file: !778, line: 90, type: !791)
!795 = !DILocalVariable(name: "a", scope: !781, file: !778, line: 93, type: !743)
!796 = !DILocalVariable(name: "b", scope: !781, file: !778, line: 94, type: !743)
!797 = !DILocalVariable(name: "m", scope: !781, file: !778, line: 97, type: !791)
!798 = !DILocalVariable(name: "r", scope: !781, file: !778, line: 98, type: !791)
!799 = !DILocalVariable(name: "x", scope: !800, file: !778, line: 118, type: !743)
!800 = distinct !DILexicalBlock(scope: !801, file: !778, line: 118, column: 7)
!801 = distinct !DILexicalBlock(scope: !781, file: !778, line: 117, column: 5)
!802 = !DILocalVariable(name: "y", scope: !800, file: !778, line: 118, type: !743)
!803 = !DILocalVariable(name: "x", scope: !804, file: !778, line: 119, type: !743)
!804 = distinct !DILexicalBlock(scope: !801, file: !778, line: 119, column: 7)
!805 = !DILocalVariable(name: "y", scope: !804, file: !778, line: 119, type: !743)
!806 = !DILocalVariable(name: "x", scope: !807, file: !778, line: 120, type: !743)
!807 = distinct !DILexicalBlock(scope: !801, file: !778, line: 120, column: 7)
!808 = !DILocalVariable(name: "y", scope: !807, file: !778, line: 120, type: !743)
!809 = !DILocalVariable(name: "x", scope: !810, file: !778, line: 121, type: !743)
!810 = distinct !DILexicalBlock(scope: !801, file: !778, line: 121, column: 7)
!811 = !DILocalVariable(name: "y", scope: !810, file: !778, line: 121, type: !743)
!812 = !DILocalVariable(name: "x", scope: !813, file: !778, line: 128, type: !743)
!813 = distinct !DILexicalBlock(scope: !814, file: !778, line: 128, column: 7)
!814 = distinct !DILexicalBlock(scope: !781, file: !778, line: 127, column: 5)
!815 = !DILocalVariable(name: "y", scope: !813, file: !778, line: 128, type: !743)
!816 = !DILocalVariable(name: "x", scope: !817, file: !778, line: 129, type: !743)
!817 = distinct !DILexicalBlock(scope: !814, file: !778, line: 129, column: 7)
!818 = !DILocalVariable(name: "y", scope: !817, file: !778, line: 129, type: !743)
!819 = !DILocalVariable(name: "x", scope: !820, file: !778, line: 130, type: !743)
!820 = distinct !DILexicalBlock(scope: !814, file: !778, line: 130, column: 7)
!821 = !DILocalVariable(name: "y", scope: !820, file: !778, line: 130, type: !743)
!822 = !DILocalVariable(name: "x", scope: !823, file: !778, line: 131, type: !743)
!823 = distinct !DILexicalBlock(scope: !814, file: !778, line: 131, column: 7)
!824 = !DILocalVariable(name: "y", scope: !823, file: !778, line: 131, type: !743)
!825 = !{!826}
!826 = !DIEnumerator(name: "HALF", value: 128, isUnsigned: true)
!827 = !{!743}
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !830, nameTableKind: None)
!829 = !DIFile(filename: "lib/read-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!830 = !{!831, !866, !869, !105, !389, !870}
!831 = !DISubprogram(name: "fileno", scope: !55, file: !55, line: 786, type: !832, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!832 = !DISubroutineType(types: !833)
!833 = !{!52, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !835, file: !60, line: 51, baseType: !52, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !835, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !835, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !835, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !835, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !835, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !835, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !835, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !835, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !835, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !835, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !835, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !835, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !835, file: !60, line: 70, baseType: !834, size: 64, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !835, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !835, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !835, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !835, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !835, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !835, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !835, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !835, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !835, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !835, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !835, file: !60, line: 93, baseType: !834, size: 64, offset: 1344)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !835, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !835, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !835, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !835, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!866 = !DISubprogram(name: "ftello", scope: !55, file: !55, line: 712, type: !867, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!867 = !DISubroutineType(types: !868)
!868 = !{!83, !834}
!869 = !DISubprogram(name: "ferror", scope: !55, file: !55, line: 761, type: !832, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!870 = !DISubprogram(name: "rpl_fclose", scope: !193, file: !193, line: 672, type: !832, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !873, retainedTypes: !877, nameTableKind: None)
!872 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!873 = !{!874}
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !872, line: 40, baseType: !7, size: 32, elements: !875)
!875 = !{!876}
!876 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!877 = !{!44, !878, !105}
!878 = !DISubprogram(name: "fputs_unlocked", scope: !55, file: !55, line: 662, type: !879, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!879 = !DISubroutineType(types: !880)
!880 = !{!52, !50, !881}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !882, file: !60, line: 51, baseType: !52, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !882, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !882, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !882, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !882, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !882, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !882, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !882, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !882, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !882, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !882, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !882, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !882, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !882, file: !60, line: 70, baseType: !881, size: 64, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !882, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !882, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !882, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !882, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !882, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !882, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !882, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !882, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !882, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !882, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !882, file: !60, line: 93, baseType: !881, size: 64, offset: 1344)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !882, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !882, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !882, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !882, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !915, retainedTypes: !928, nameTableKind: None)
!914 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!915 = !{!916}
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !917, file: !200, line: 186, baseType: !7, size: 32, elements: !926)
!917 = distinct !DISubprogram(name: "x2nrealloc", scope: !200, file: !200, line: 174, type: !918, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !913, retainedNodes: !921)
!918 = !DISubroutineType(types: !919)
!919 = !{!105, !105, !920, !107}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!921 = !{!922, !923, !924, !925}
!922 = !DILocalVariable(name: "p", arg: 1, scope: !917, file: !200, line: 174, type: !105)
!923 = !DILocalVariable(name: "pn", arg: 2, scope: !917, file: !200, line: 174, type: !920)
!924 = !DILocalVariable(name: "s", arg: 3, scope: !917, file: !200, line: 174, type: !107)
!925 = !DILocalVariable(name: "n", scope: !917, file: !200, line: 176, type: !107)
!926 = !{!927}
!927 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!928 = !{!107, !213, !199, !231, !48, !389, !105, !214, !472}
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !931, nameTableKind: None)
!930 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!931 = !{!44, !151}
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !934, retainedTypes: !935, nameTableKind: None)
!933 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!934 = !{!5}
!935 = !{!163, !159, !151}
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !938, retainedTypes: !939, nameTableKind: None)
!937 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!938 = !{!5, !355}
!939 = !{!52, !85}
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !942, nameTableKind: None)
!941 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!942 = !{!105}
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !945, nameTableKind: None)
!944 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!945 = !{!946, !981, !205, !982}
!946 = !DISubprogram(name: "fileno", scope: !55, file: !55, line: 786, type: !947, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!947 = !DISubroutineType(types: !948)
!948 = !{!52, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
