; ModuleID = 'coreutils-8.32/src/sort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.month = type { i8*, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.keyfield = type { i64, i64, i64, i64, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.keyfield* }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.line = type { i8*, i64, i8*, i8* }
%struct.tempnode = type { %struct.tempnode*, i32, i8, [0 x i8] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.rlimit, %struct.rlimit, %struct.rlimit, [3 x i64] }
%struct.rlimit = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !2, file: !3, line: 161, type: !35, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !907, globals: !1340, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/sort.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !10, !393, !398, !401, !415, !421, !424, !439, !825, !833, !855, !867, !876, !888, !893, !897, !900, !904}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 120, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "SORT_OUT_OF_ORDER", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "SORT_FAILURE", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !11, file: !3, line: 4273, baseType: !6, size: 32, elements: !391)
!11 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 4195, type: !12, scopeLine: 4196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !18)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !14, !15}
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !{!19, !20, !21, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !127, !128, !129, !160, !162, !272, !274, !279, !286, !291, !293, !296, !353, !357, !363, !366, !384, !386, !390}
!19 = !DILocalVariable(name: "argc", arg: 1, scope: !11, file: !3, line: 4195, type: !14)
!20 = !DILocalVariable(name: "argv", arg: 2, scope: !11, file: !3, line: 4195, type: !15)
!21 = !DILocalVariable(name: "key", scope: !11, file: !3, line: 4197, type: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !3, line: 200, size: 576, elements: !24)
!24 = !{!25, !29, !30, !31, !32, !36, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !23, file: !3, line: 202, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !27, line: 46, baseType: !28)
!27 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!28 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !23, file: !3, line: 203, baseType: !26, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !23, file: !3, line: 204, baseType: !26, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !23, file: !3, line: 205, baseType: !26, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !23, file: !3, line: 206, baseType: !33, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !23, file: !3, line: 207, baseType: !37, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !23, file: !3, line: 208, baseType: !35, size: 8, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !23, file: !3, line: 209, baseType: !35, size: 8, offset: 392)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !23, file: !3, line: 210, baseType: !35, size: 8, offset: 400)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !23, file: !3, line: 213, baseType: !35, size: 8, offset: 408)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !23, file: !3, line: 214, baseType: !35, size: 8, offset: 416)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !23, file: !3, line: 216, baseType: !35, size: 8, offset: 424)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !23, file: !3, line: 218, baseType: !35, size: 8, offset: 432)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !23, file: !3, line: 219, baseType: !35, size: 8, offset: 440)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !23, file: !3, line: 220, baseType: !35, size: 8, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !23, file: !3, line: 221, baseType: !35, size: 8, offset: 456)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !3, line: 222, baseType: !22, size: 64, offset: 512)
!50 = !DILocalVariable(name: "key_buf", scope: !11, file: !3, line: 4198, type: !23)
!51 = !DILocalVariable(name: "gkey", scope: !11, file: !3, line: 4199, type: !23)
!52 = !DILocalVariable(name: "gkey_only", scope: !11, file: !3, line: 4200, type: !35)
!53 = !DILocalVariable(name: "s", scope: !11, file: !3, line: 4201, type: !37)
!54 = !DILocalVariable(name: "c", scope: !11, file: !3, line: 4202, type: !14)
!55 = !DILocalVariable(name: "checkonly", scope: !11, file: !3, line: 4203, type: !17)
!56 = !DILocalVariable(name: "mergeonly", scope: !11, file: !3, line: 4204, type: !35)
!57 = !DILocalVariable(name: "random_source", scope: !11, file: !3, line: 4205, type: !16)
!58 = !DILocalVariable(name: "need_random", scope: !11, file: !3, line: 4206, type: !35)
!59 = !DILocalVariable(name: "nthreads", scope: !11, file: !3, line: 4207, type: !26)
!60 = !DILocalVariable(name: "nfiles", scope: !11, file: !3, line: 4208, type: !26)
!61 = !DILocalVariable(name: "posixly_correct", scope: !11, file: !3, line: 4209, type: !35)
!62 = !DILocalVariable(name: "posix_ver", scope: !11, file: !3, line: 4210, type: !14)
!63 = !DILocalVariable(name: "traditional_usage", scope: !11, file: !3, line: 4211, type: !35)
!64 = !DILocalVariable(name: "files", scope: !11, file: !3, line: 4212, type: !15)
!65 = !DILocalVariable(name: "files_from", scope: !11, file: !3, line: 4213, type: !16)
!66 = !DILocalVariable(name: "tok", scope: !11, file: !3, line: 4214, type: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !68, line: 28, size: 2304, elements: !69)
!68 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!69 = !{!70, !71, !72, !74, !125, !126}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !67, file: !68, line: 30, baseType: !26, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !67, file: !68, line: 31, baseType: !15, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !67, file: !68, line: 32, baseType: !73, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !67, file: !68, line: 33, baseType: !75, size: 704, offset: 192)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !76, line: 174, size: 704, elements: !77)
!76 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!77 = !{!78, !79, !89, !90, !91, !92, !98, !99, !110, !121, !122, !123, !124}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !75, file: !76, line: 176, baseType: !26, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !75, file: !76, line: 177, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !76, line: 167, size: 128, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !81, file: !76, line: 169, baseType: !16, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !81, file: !76, line: 170, baseType: !80, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !81, file: !76, line: 171, baseType: !86, offset: 128)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: -1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !75, file: !76, line: 178, baseType: !16, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !75, file: !76, line: 179, baseType: !16, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !75, file: !76, line: 180, baseType: !16, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !75, file: !76, line: 185, baseType: !93, size: 64, offset: 320)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !75, file: !76, line: 181, size: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !93, file: !76, line: 183, baseType: !26, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !93, file: !76, line: 184, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !75, file: !76, line: 186, baseType: !26, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !75, file: !76, line: 193, baseType: !100, size: 64, offset: 448)
!100 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !75, file: !76, line: 189, size: 64, elements: !101)
!101 = !{!102, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !100, file: !76, line: 191, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!97, !26}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !100, file: !76, line: 192, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!97, !97, !26}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !75, file: !76, line: 198, baseType: !111, size: 64, offset: 512)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !75, file: !76, line: 194, size: 64, elements: !112)
!112 = !{!113, !117}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !111, file: !76, line: 196, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !97}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !111, file: !76, line: 197, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !97, !97}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !75, file: !76, line: 200, baseType: !97, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !75, file: !76, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !75, file: !76, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !75, file: !76, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !67, file: !68, line: 34, baseType: !75, size: 704, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !67, file: !68, line: 35, baseType: !75, size: 704, offset: 1600)
!127 = !DILocalVariable(name: "outfile", scope: !11, file: !3, line: 4215, type: !37)
!128 = !DILocalVariable(name: "locale_ok", scope: !11, file: !3, line: 4216, type: !35)
!129 = !DILocalVariable(name: "locale", scope: !130, file: !3, line: 4233, type: !131)
!130 = distinct !DILexicalBlock(scope: !11, file: !3, line: 4232, column: 3)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !134, line: 51, size: 768, elements: !135)
!134 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !133, file: !134, line: 55, baseType: !16, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !133, file: !134, line: 56, baseType: !16, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !133, file: !134, line: 62, baseType: !16, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !133, file: !134, line: 68, baseType: !16, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !133, file: !134, line: 69, baseType: !16, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !133, file: !134, line: 70, baseType: !16, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !133, file: !134, line: 71, baseType: !16, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !133, file: !134, line: 72, baseType: !16, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !133, file: !134, line: 73, baseType: !16, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !133, file: !134, line: 74, baseType: !16, size: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !133, file: !134, line: 75, baseType: !17, size: 8, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !133, file: !134, line: 76, baseType: !17, size: 8, offset: 648)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !133, file: !134, line: 78, baseType: !17, size: 8, offset: 656)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !133, file: !134, line: 80, baseType: !17, size: 8, offset: 664)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !133, file: !134, line: 82, baseType: !17, size: 8, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !133, file: !134, line: 84, baseType: !17, size: 8, offset: 680)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !133, file: !134, line: 91, baseType: !17, size: 8, offset: 688)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !133, file: !134, line: 92, baseType: !17, size: 8, offset: 696)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !133, file: !134, line: 95, baseType: !17, size: 8, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !133, file: !134, line: 97, baseType: !17, size: 8, offset: 712)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !133, file: !134, line: 99, baseType: !17, size: 8, offset: 720)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !133, file: !134, line: 101, baseType: !17, size: 8, offset: 728)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !133, file: !134, line: 108, baseType: !17, size: 8, offset: 736)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !133, file: !134, line: 109, baseType: !17, size: 8, offset: 744)
!160 = !DILocalVariable(name: "i", scope: !161, file: !3, line: 4252, type: !26)
!161 = distinct !DILexicalBlock(scope: !11, file: !3, line: 4251, column: 3)
!162 = !DILocalVariable(name: "act", scope: !161, file: !3, line: 4276, type: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !164, line: 27, size: 1216, elements: !165)
!164 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!165 = !{!166, !258, !267, !268}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !163, file: !164, line: 38, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !164, line: 31, size: 64, elements: !168)
!168 = !{!169, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !167, file: !164, line: 34, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !171, line: 72, baseType: !172)
!171 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !14}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !167, file: !164, line: 36, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !14, !179, !97}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !181, line: 124, baseType: !182)
!181 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 36, size: 1024, elements: !183)
!183 = !{!184, !185, !186, !187, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !182, file: !181, line: 38, baseType: !14, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !182, file: !181, line: 40, baseType: !14, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !182, file: !181, line: 42, baseType: !14, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !182, file: !181, line: 48, baseType: !14, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !182, file: !181, line: 123, baseType: !189, size: 896, offset: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !181, line: 51, size: 896, elements: !190)
!190 = !{!191, !195, !203, !215, !221, !231, !247, !252}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !189, file: !181, line: 53, baseType: !192, size: 896)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 896, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 28)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !189, file: !181, line: 60, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 56, size: 64, elements: !197)
!197 = !{!198, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !196, file: !181, line: 58, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !200, line: 154, baseType: !14)
!200 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !196, file: !181, line: 59, baseType: !202, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !200, line: 146, baseType: !6)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !189, file: !181, line: 68, baseType: !204, size: 128)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 63, size: 128, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !204, file: !181, line: 65, baseType: !14, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !204, file: !181, line: 66, baseType: !14, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !204, file: !181, line: 67, baseType: !209, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !210, line: 30, baseType: !211)
!210 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!211 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !210, line: 24, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !211, file: !210, line: 26, baseType: !14, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !211, file: !210, line: 27, baseType: !97, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !189, file: !181, line: 76, baseType: !216, size: 128)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 71, size: 128, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !216, file: !181, line: 73, baseType: !199, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !216, file: !181, line: 74, baseType: !202, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !216, file: !181, line: 75, baseType: !209, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !189, file: !181, line: 86, baseType: !222, size: 256)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 79, size: 256, elements: !223)
!223 = !{!224, !225, !226, !227, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !222, file: !181, line: 81, baseType: !199, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !222, file: !181, line: 82, baseType: !202, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !222, file: !181, line: 83, baseType: !14, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !222, file: !181, line: 84, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !200, line: 156, baseType: !229)
!229 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !222, file: !181, line: 85, baseType: !228, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !189, file: !181, line: 105, baseType: !232, size: 256)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 89, size: 256, elements: !233)
!233 = !{!234, !235, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !232, file: !181, line: 91, baseType: !97, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !232, file: !181, line: 93, baseType: !236, size: 16, offset: 64)
!236 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !232, file: !181, line: 104, baseType: !238, size: 128, offset: 128)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !181, line: 94, size: 128, elements: !239)
!239 = !{!240, !245}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !238, file: !181, line: 101, baseType: !241, size: 128)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !181, line: 97, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !241, file: !181, line: 99, baseType: !97, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !241, file: !181, line: 100, baseType: !97, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !238, file: !181, line: 103, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !200, line: 42, baseType: !6)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !189, file: !181, line: 112, baseType: !248, size: 128)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 108, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !248, file: !181, line: 110, baseType: !229, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !248, file: !181, line: 111, baseType: !14, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !189, file: !181, line: 121, baseType: !253, size: 128)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 116, size: 128, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !253, file: !181, line: 118, baseType: !97, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !253, file: !181, line: 119, baseType: !14, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !253, file: !181, line: 120, baseType: !6, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !163, file: !164, line: 46, baseType: !259, size: 1024, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !260, line: 8, baseType: !261)
!260 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 5, size: 1024, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !261, file: !260, line: 7, baseType: !264, size: 1024)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !163, file: !164, line: 49, baseType: !14, size: 32, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !163, file: !164, line: 52, baseType: !269, size: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null}
!272 = !DILocalVariable(name: "oi", scope: !273, file: !3, line: 4318, type: !14)
!273 = distinct !DILexicalBlock(scope: !11, file: !3, line: 4313, column: 5)
!274 = !DILocalVariable(name: "minus_pos_usage", scope: !275, file: !3, line: 4341, type: !35)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 4340, column: 13)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4339, column: 15)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 4336, column: 9)
!278 = distinct !DILexicalBlock(scope: !273, file: !3, line: 4320, column: 11)
!279 = !DILocalVariable(name: "optarg1", scope: !280, file: !3, line: 4360, type: !37)
!280 = distinct !DILexicalBlock(scope: !281, file: !3, line: 4359, column: 25)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 4358, column: 27)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 4357, column: 21)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 4354, column: 23)
!284 = distinct !DILexicalBlock(scope: !285, file: !3, line: 4345, column: 17)
!285 = distinct !DILexicalBlock(scope: !275, file: !3, line: 4344, column: 19)
!286 = !DILocalVariable(name: "str", scope: !287, file: !3, line: 4408, type: !288)
!287 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4407, column: 11)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 16, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 2)
!291 = !DILocalVariable(name: "newtab", scope: !292, file: !3, line: 4522, type: !17)
!292 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4521, column: 11)
!293 = !DILocalVariable(name: "p", scope: !294, file: !3, line: 4570, type: !37)
!294 = distinct !DILexicalBlock(scope: !295, file: !3, line: 4569, column: 13)
!295 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4568, column: 15)
!296 = !DILocalVariable(name: "stream", scope: !297, file: !3, line: 4602, type: !299)
!297 = distinct !DILexicalBlock(scope: !298, file: !3, line: 4591, column: 5)
!298 = distinct !DILexicalBlock(scope: !11, file: !3, line: 4590, column: 7)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !301, line: 7, baseType: !302)
!301 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !303, line: 49, size: 1728, elements: !304)
!303 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !320, !322, !323, !324, !326, !328, !330, !334, !337, !339, !342, !345, !346, !347, !348, !349}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !302, file: !303, line: 51, baseType: !14, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !302, file: !303, line: 54, baseType: !16, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !302, file: !303, line: 55, baseType: !16, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !302, file: !303, line: 56, baseType: !16, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !302, file: !303, line: 57, baseType: !16, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !302, file: !303, line: 58, baseType: !16, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !302, file: !303, line: 59, baseType: !16, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !302, file: !303, line: 60, baseType: !16, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !302, file: !303, line: 61, baseType: !16, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !302, file: !303, line: 64, baseType: !16, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !302, file: !303, line: 65, baseType: !16, size: 64, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !302, file: !303, line: 66, baseType: !16, size: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !302, file: !303, line: 68, baseType: !318, size: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !303, line: 36, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !302, file: !303, line: 70, baseType: !321, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !302, file: !303, line: 72, baseType: !14, size: 32, offset: 896)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !302, file: !303, line: 73, baseType: !14, size: 32, offset: 928)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !302, file: !303, line: 74, baseType: !325, size: 64, offset: 960)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !229)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !302, file: !303, line: 77, baseType: !327, size: 16, offset: 1024)
!327 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !302, file: !303, line: 78, baseType: !329, size: 8, offset: 1040)
!329 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !302, file: !303, line: 79, baseType: !331, size: 8, offset: 1048)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 1)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !302, file: !303, line: 81, baseType: !335, size: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !303, line: 43, baseType: null)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !302, file: !303, line: 89, baseType: !338, size: 64, offset: 1152)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !229)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !302, file: !303, line: 91, baseType: !340, size: 64, offset: 1216)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !303, line: 37, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !302, file: !303, line: 92, baseType: !343, size: 64, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !303, line: 38, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !302, file: !303, line: 93, baseType: !321, size: 64, offset: 1344)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !302, file: !303, line: 94, baseType: !97, size: 64, offset: 1408)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !302, file: !303, line: 95, baseType: !26, size: 64, offset: 1472)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !302, file: !303, line: 96, baseType: !14, size: 32, offset: 1536)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !302, file: !303, line: 98, baseType: !350, size: 160, offset: 1568)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 20)
!353 = !DILocalVariable(name: "i", scope: !354, file: !3, line: 4616, type: !26)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 4616, column: 11)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 4612, column: 9)
!356 = distinct !DILexicalBlock(scope: !297, file: !3, line: 4611, column: 11)
!357 = !DILocalVariable(name: "file_number", scope: !358, file: !3, line: 4627, type: !28)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 4623, column: 17)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 4622, column: 24)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 4618, column: 19)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 4617, column: 13)
!362 = distinct !DILexicalBlock(scope: !354, file: !3, line: 4616, column: 11)
!363 = !DILocalVariable(name: "tmp_dir", scope: !364, file: !3, line: 4704, type: !37)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 4703, column: 5)
!365 = distinct !DILexicalBlock(scope: !11, file: !3, line: 4702, column: 7)
!366 = !DILocalVariable(name: "sortfiles", scope: !367, file: !3, line: 4747, type: !369)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 4746, column: 5)
!368 = distinct !DILexicalBlock(scope: !11, file: !3, line: 4745, column: 7)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sortfile", file: !3, line: 668, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !3, line: 671, baseType: !37, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !370, file: !3, line: 674, baseType: !374, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !3, line: 657, size: 128, elements: !376)
!376 = !{!377, !379, !382, !383}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !3, line: 659, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !374)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !375, file: !3, line: 660, baseType: !380, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !381, line: 38, baseType: !199)
!381 = !DIFile(filename: "/usr/include/sched.h", directory: "")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !375, file: !3, line: 661, baseType: !17, size: 8, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !375, file: !3, line: 662, baseType: !86, offset: 104)
!384 = !DILocalVariable(name: "i", scope: !385, file: !3, line: 4749, type: !26)
!385 = distinct !DILexicalBlock(scope: !367, file: !3, line: 4749, column: 7)
!386 = !DILocalVariable(name: "np", scope: !387, file: !3, line: 4759, type: !28)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 4758, column: 9)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 4757, column: 11)
!389 = distinct !DILexicalBlock(scope: !368, file: !3, line: 4756, column: 5)
!390 = !DILocalVariable(name: "nthreads_max", scope: !389, file: !3, line: 4764, type: !26)
!391 = !{!392}
!392 = !DIEnumerator(name: "nsigs", value: 11, isUnsigned: true)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blanktype", file: !3, line: 169, baseType: !6, size: 32, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIEnumerator(name: "bl_start", value: 0, isUnsigned: true)
!396 = !DIEnumerator(name: "bl_end", value: 1, isUnsigned: true)
!397 = !DIEnumerator(name: "bl_both", value: 2, isUnsigned: true)
!398 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 342, baseType: !6, size: 32, elements: !399)
!399 = !{!400}
!400 = !DIEnumerator(name: "TAB_DEFAULT", value: 128, isUnsigned: true)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !402, line: 32, baseType: !6, size: 32, elements: !403)
!402 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!404 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!405 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!406 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!407 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!408 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!409 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!410 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!411 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!412 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!413 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!414 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nproc_query", file: !416, line: 32, baseType: !6, size: 32, elements: !417)
!416 = !DIFile(filename: "./lib/nproc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!417 = !{!418, !419, !420}
!418 = !DIEnumerator(name: "NPROC_ALL", value: 0, isUnsigned: true)
!419 = !DIEnumerator(name: "NPROC_CURRENT", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "NPROC_CURRENT_OVERRIDABLE", value: 2, isUnsigned: true)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 117, baseType: !6, size: 32, elements: !422)
!422 = !{!423}
!423 = !DIEnumerator(name: "DEFAULT_MAX_THREADS", value: 8, isUnsigned: true)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !425, line: 46, baseType: !6, size: 32, elements: !426)
!425 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!427 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!428 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!429 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!430 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!431 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!432 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!433 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!434 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!435 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!436 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!437 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!438 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !440, line: 41, baseType: !6, size: 32, elements: !441)
!440 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!442 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!443 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!444 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!445 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!446 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!447 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!448 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!449 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!450 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!451 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!452 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!453 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!454 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!455 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!456 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!457 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!458 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!459 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!460 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!461 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!462 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!463 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!464 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!465 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!466 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!467 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!468 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!469 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!470 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!471 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!472 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!473 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!474 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!475 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!476 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!477 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!478 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!479 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!480 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!481 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!482 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!483 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!484 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!485 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!486 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!487 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!488 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!489 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!490 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!491 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!550 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!553 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!554 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!555 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!556 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!557 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!558 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!559 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!560 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!561 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!562 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!563 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!564 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!637 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!710 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!711 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!712 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!713 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!714 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!715 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!716 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!717 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!718 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!719 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!720 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!721 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!722 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!723 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!724 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!726 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!727 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!728 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!729 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!730 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!731 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!757 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!758 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!759 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!760 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!761 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!766 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!767 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!768 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!769 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !826, line: 25, baseType: !6, size: 32, elements: !827)
!826 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!827 = !{!828, !829, !830, !831, !832}
!828 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!829 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!830 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!831 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!832 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !834, line: 31, baseType: !6, size: 32, elements: !835)
!834 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "")
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!836 = !DIEnumerator(name: "RLIMIT_CPU", value: 0, isUnsigned: true)
!837 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1, isUnsigned: true)
!838 = !DIEnumerator(name: "RLIMIT_DATA", value: 2, isUnsigned: true)
!839 = !DIEnumerator(name: "RLIMIT_STACK", value: 3, isUnsigned: true)
!840 = !DIEnumerator(name: "RLIMIT_CORE", value: 4, isUnsigned: true)
!841 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5, isUnsigned: true)
!842 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7, isUnsigned: true)
!843 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7, isUnsigned: true)
!844 = !DIEnumerator(name: "RLIMIT_AS", value: 9, isUnsigned: true)
!845 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6, isUnsigned: true)
!846 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8, isUnsigned: true)
!847 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10, isUnsigned: true)
!848 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11, isUnsigned: true)
!849 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12, isUnsigned: true)
!850 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13, isUnsigned: true)
!851 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14, isUnsigned: true)
!852 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15, isUnsigned: true)
!853 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16, isUnsigned: true)
!854 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16, isUnsigned: true)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !857, file: !856, line: 186, baseType: !6, size: 32, elements: !865)
!856 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!857 = distinct !DISubprogram(name: "x2nrealloc", scope: !856, file: !856, line: 174, type: !858, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!97, !97, !73, !26}
!860 = !{!861, !862, !863, !864}
!861 = !DILocalVariable(name: "p", arg: 1, scope: !857, file: !856, line: 174, type: !97)
!862 = !DILocalVariable(name: "pn", arg: 2, scope: !857, file: !856, line: 174, type: !73)
!863 = !DILocalVariable(name: "s", arg: 3, scope: !857, file: !856, line: 174, type: !26)
!864 = !DILocalVariable(name: "n", scope: !857, file: !856, line: 176, type: !26)
!865 = !{!866}
!866 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !868, line: 45, baseType: !6, size: 32, elements: !869)
!868 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!869 = !{!870, !871, !872, !873, !874, !875}
!870 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!871 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!872 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!873 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!874 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!875 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !878, file: !877, line: 187, baseType: !6, size: 32, elements: !886)
!877 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!878 = distinct !DISubprogram(name: "select_plural", scope: !877, file: !877, line: 183, type: !879, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !884)
!879 = !DISubroutineType(types: !880)
!880 = !{!28, !881}
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !882, line: 102, baseType: !883)
!882 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !200, line: 73, baseType: !28)
!884 = !{!885}
!885 = !DILocalVariable(name: "n", arg: 1, scope: !878, file: !877, line: 183, type: !881)
!886 = !{!887}
!887 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 654, baseType: !6, size: 32, elements: !889)
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "UNCOMPRESSED", value: 0, isUnsigned: true)
!891 = !DIEnumerator(name: "UNREAPED", value: 1, isUnsigned: true)
!892 = !DIEnumerator(name: "REAPED", value: 2, isUnsigned: true)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 131, baseType: !6, size: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "MAX_FORK_TRIES_COMPRESS", value: 4, isUnsigned: true)
!896 = !DIEnumerator(name: "MAX_FORK_TRIES_DECOMPRESS", value: 9, isUnsigned: true)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 680, baseType: !6, size: 32, elements: !898)
!898 = !{!899}
!899 = !DIEnumerator(name: "INIT_PROCTAB_SIZE", value: 47, isUnsigned: true)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 145, baseType: !6, size: 32, elements: !901)
!901 = !{!902, !903}
!902 = !DIEnumerator(name: "MERGE_END", value: 0, isUnsigned: true)
!903 = !DIEnumerator(name: "MERGE_ROOT", value: 1, isUnsigned: true)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 112, baseType: !6, size: 32, elements: !905)
!905 = !{!906}
!906 = !DIEnumerator(name: "SUBTHREAD_LINES_HEURISTIC", value: 131072, isUnsigned: true)
!907 = !{!908, !913, !917, !97, !921, !925, !929, !932, !935, !936, !940, !944, !948, !170, !954, !957, !962, !965, !968, !6, !983, !985, !989, !16, !993, !997, !1000, !1004, !1007, !1008, !1011, !1014, !1017, !1020, !14, !327, !1024, !1027, !1033, !1036, !1040, !1042, !26, !1046, !1047, !1051, !1054, !1065, !1069, !1073, !1078, !1081, !1085, !1088, !1091, !1094, !1095, !1098, !1099, !1102, !1105, !1108, !1114, !1117, !1120, !1140, !1143, !1147, !1151, !1155, !1158, !37, !1159, !1162, !1163, !1167, !1170, !1173, !1174, !1177, !1183, !1187, !1191, !1192, !1196, !1199, !1202, !1221, !1222, !1226, !1227, !1233, !1274, !1320, !1324, !1327, !1330, !1333, !1334, !1337}
!908 = !DISubprogram(name: "dcgettext", scope: !909, file: !909, line: 51, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!909 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!910 = !DISubroutineType(types: !911)
!911 = !{!16, !37, !37, !14}
!912 = !{}
!913 = !DISubprogram(name: "fputs_unlocked", scope: !914, file: !914, line: 662, type: !915, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!914 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!915 = !DISubroutineType(types: !916)
!916 = !{!14, !37, !321}
!917 = !DISubprogram(name: "getenv", scope: !918, file: !918, line: 634, type: !919, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!918 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!919 = !DISubroutineType(types: !920)
!920 = !{!16, !37}
!921 = !DISubprogram(name: "posix2_version", scope: !922, file: !922, line: 1, type: !923, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!922 = !DIFile(filename: "./lib/posixver.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!923 = !DISubroutineType(types: !924)
!924 = !{!14}
!925 = !DISubprogram(name: "set_program_name", scope: !926, file: !926, line: 37, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!926 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!927 = !DISubroutineType(types: !928)
!928 = !{null, !37}
!929 = !DISubprogram(name: "setlocale", scope: !134, file: !134, line: 122, type: !930, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!930 = !DISubroutineType(types: !931)
!931 = !{!16, !14, !37}
!932 = !DISubprogram(name: "bindtextdomain", scope: !909, file: !909, line: 86, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!933 = !DISubroutineType(types: !934)
!934 = !{!16, !37, !37}
!935 = !DISubprogram(name: "textdomain", scope: !909, file: !909, line: 82, type: !919, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!936 = !DISubprogram(name: "hard_locale", scope: !937, file: !937, line: 26, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!937 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!938 = !DISubroutineType(types: !939)
!939 = !{!35, !14}
!940 = !DISubprogram(name: "localeconv", scope: !134, file: !134, line: 125, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!941 = !DISubroutineType(types: !942)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!944 = !DISubprogram(name: "sigemptyset", scope: !171, file: !171, line: 196, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!945 = !DISubroutineType(types: !946)
!946 = !{!14, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!948 = !DISubprogram(name: "sigaction", scope: !171, file: !171, line: 240, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!949 = !DISubroutineType(types: !950)
!950 = !{!14, !14, !951, !953}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!954 = !DISubprogram(name: "sigaddset", scope: !171, file: !171, line: 202, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!955 = !DISubroutineType(types: !956)
!956 = !{!14, !947, !14}
!957 = !DISubprogram(name: "sigismember", scope: !171, file: !171, line: 208, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!958 = !DISubroutineType(types: !959)
!959 = !{!14, !960, !14}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!962 = !DISubprogram(name: "signal", scope: !171, file: !171, line: 88, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!963 = !DISubroutineType(types: !964)
!964 = !{!172, !14, !172}
!965 = !DISubprogram(name: "atexit", scope: !918, file: !918, line: 595, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!966 = !DISubroutineType(types: !967)
!967 = !{!14, !269}
!968 = !DISubprogram(name: "getopt_long", scope: !969, file: !969, line: 66, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!969 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!970 = !DISubroutineType(types: !971)
!971 = !{!14, !14, !972, !37, !974, !981}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !969, line: 50, size: 256, elements: !977)
!977 = !{!978, !979, !980, !982}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !976, file: !969, line: 52, baseType: !37, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !976, file: !969, line: 55, baseType: !14, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !976, file: !969, line: 56, baseType: !981, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !976, file: !969, line: 57, baseType: !14, size: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!985 = !DISubprogram(name: "error", scope: !986, file: !986, line: 52, type: !987, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!986 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!987 = !DISubroutineType(types: !988)
!988 = !{null, !14, !14, !37, null}
!989 = !DISubprogram(name: "quote", scope: !990, file: !990, line: 44, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!990 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!991 = !DISubroutineType(types: !992)
!992 = !{!37, !37}
!993 = !DISubprogram(name: "version_etc", scope: !994, file: !994, line: 69, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!994 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!995 = !DISubroutineType(types: !996)
!996 = !{null, !321, !37, !37, !37, null}
!997 = !DISubprogram(name: "quotearg_style", scope: !402, file: !402, line: 377, type: !998, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!998 = !DISubroutineType(types: !999)
!999 = !{!16, !401, !37}
!1000 = !DISubprogram(name: "readtokens0_init", scope: !68, file: !68, line: 38, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!1004 = !DISubprogram(name: "readtokens0", scope: !68, file: !68, line: 40, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!35, !321, !1003}
!1007 = !DISubprogram(name: "free", scope: !918, file: !918, line: 565, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1008 = !DISubprogram(name: "quotearg_n_style_colon", scope: !402, file: !402, line: 397, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!16, !14, !401, !37}
!1011 = !DISubprogram(name: "xmalloc", scope: !856, file: !856, line: 53, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!97, !28}
!1014 = !DISubprogram(name: "xcalloc", scope: !856, file: !856, line: 57, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!97, !28, !28}
!1017 = !DISubprogram(name: "num_processors", scope: !416, file: !416, line: 42, type: !1018, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!28, !415}
!1020 = !DISubprogram(name: "rpl_fclose", scope: !1021, file: !1021, line: 672, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1021 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!14, !321}
!1024 = !DISubprogram(name: "nl_langinfo", scope: !440, file: !440, line: 661, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!16, !14}
!1027 = !DISubprogram(name: "qsort", scope: !918, file: !918, line: 830, type: !1028, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !97, !28, !28, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!14, !983, !983}
!1033 = !DISubprogram(name: "raise", scope: !171, file: !171, line: 123, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!14, !14}
!1036 = !DISubprogram(name: "unlink", scope: !1037, file: !1037, line: 825, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1037 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!14, !37}
!1040 = !DISubprogram(name: "close_stdout", scope: !1041, file: !1041, line: 30, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1041 = !DIFile(filename: "./lib/closeout.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1042 = !DISubprogram(name: "pthread_sigmask", scope: !1043, file: !1043, line: 31, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1043 = !DIFile(filename: "/usr/include/bits/sigthread.h", directory: "")
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!14, !14, !960, !947}
!1046 = !DISubprogram(name: "xalloc_die", scope: !856, file: !856, line: 51, type: !270, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1047 = !DISubprogram(name: "xstrtoumax", scope: !826, file: !826, line: 48, type: !1048, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!825, !37, !15, !14, !1050, !37}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!1051 = !DISubprogram(name: "xmemdup", scope: !856, file: !856, line: 62, type: !1052, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!97, !983, !28}
!1054 = !DISubprogram(name: "getrlimit", scope: !1055, file: !1055, line: 50, type: !1056, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1055 = !DIFile(filename: "/usr/include/sys/resource.h", directory: "")
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!14, !833, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !834, line: 139, size: 128, elements: !1060)
!1060 = !{!1061, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !1059, file: !834, line: 142, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !834, line: 131, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !200, line: 157, baseType: !28)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !1059, file: !834, line: 144, baseType: !1062, size: 64, offset: 64)
!1065 = !DISubprogram(name: "uinttostr", scope: !1066, file: !1066, line: 45, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1066 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!16, !6, !16}
!1069 = !DISubprogram(name: "xstrtol_fatal", scope: !1070, file: !1070, line: 41, type: !1071, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1070 = !DIFile(filename: "./lib/xstrtol-error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !825, !14, !17, !974, !37}
!1073 = !DISubprogram(name: "physmem_total", scope: !1074, file: !1074, line: 23, type: !1075, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1074 = !DIFile(filename: "./lib/physmem.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1077}
!1077 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1078 = !DISubprogram(name: "xrealloc", scope: !856, file: !856, line: 59, type: !1079, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!97, !97, !28}
!1081 = !DISubprogram(name: "open", scope: !1082, file: !1082, line: 196, type: !1083, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1082 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!14, !37, !14, null}
!1085 = !DISubprogram(name: "fdopen", scope: !914, file: !914, line: 279, type: !1086, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!321, !14, !37}
!1088 = !DISubprogram(name: "fadvise", scope: !868, file: !868, line: 72, type: !1089, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !321, !867}
!1091 = !DISubprogram(name: "ftruncate", scope: !1037, file: !1037, line: 1014, type: !1092, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!14, !14, !229}
!1094 = !DISubprogram(name: "fileno", scope: !914, file: !914, line: 786, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1095 = !DISubprogram(name: "clearerr_unlocked", scope: !914, file: !914, line: 765, type: !1096, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !912)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !321}
