; ModuleID = 'coreutils-8.32/src/split.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__sigset_t = type { [16 x i64] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.of_info = type { i8*, i32, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon.8 }
%union.anon.8 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!88 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !83, line: 73, baseType: !66)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !93, line: 72, baseType: !94)
!93 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !75}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!99 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!101 = !{!102, !249, !251, !253, !257, !259, !261, !263, !265, !267, !0, !269, !306, !308, !310, !312, !326, !328, !330, !332, !346, !348, !350, !352, !354, !356, !358, !360}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "multipliers", scope: !104, file: !3, line: 1305, type: !246, isLocal: true, isDefinition: true)
!104 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1297, type: !105, scopeLine: 1298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !108)
!105 = !DISubroutineType(types: !106)
!106 = !{!75, !75, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !121, !122, !125, !131, !133, !134, !135, !136, !141}
!109 = !DILocalVariable(name: "argc", arg: 1, scope: !104, file: !3, line: 1297, type: !75)
!110 = !DILocalVariable(name: "argv", arg: 2, scope: !104, file: !3, line: 1297, type: !107)
!111 = !DILocalVariable(name: "split_type", scope: !104, file: !3, line: 1299, type: !5)
!112 = !DILocalVariable(name: "in_blk_size", scope: !104, file: !3, line: 1300, type: !64)
!113 = !DILocalVariable(name: "page_size", scope: !104, file: !3, line: 1301, type: !64)
!114 = !DILocalVariable(name: "k_units", scope: !104, file: !3, line: 1302, type: !87)
!115 = !DILocalVariable(name: "n_units", scope: !104, file: !3, line: 1303, type: !87)
!116 = !DILocalVariable(name: "c", scope: !104, file: !3, line: 1306, type: !75)
!117 = !DILocalVariable(name: "digits_optind", scope: !104, file: !3, line: 1307, type: !75)
!118 = !DILocalVariable(name: "file_size", scope: !104, file: !3, line: 1308, type: !80)
!119 = !DILocalVariable(name: "this_optind", scope: !120, file: !3, line: 1326, type: !75)
!120 = distinct !DILexicalBlock(scope: !104, file: !3, line: 1324, column: 5)
!121 = !DILocalVariable(name: "slash", scope: !120, file: !3, line: 1327, type: !90)
!122 = !DILocalVariable(name: "neweol", scope: !123, file: !3, line: 1410, type: !91)
!123 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1409, column: 11)
!124 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1335, column: 9)
!125 = !DILocalVariable(name: "buffer", scope: !126, file: !3, line: 1460, type: !128)
!126 = distinct !DILexicalBlock(scope: !127, file: !3, line: 1459, column: 13)
!127 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1458, column: 15)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 168, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 21)
!131 = !DILocalVariable(name: "specified_buf_size", scope: !104, file: !3, line: 1581, type: !132)
!132 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!133 = !DILocalVariable(name: "b", scope: !104, file: !3, line: 1585, type: !62)
!134 = !DILocalVariable(name: "buf", scope: !104, file: !3, line: 1586, type: !90)
!135 = !DILocalVariable(name: "initial_read", scope: !104, file: !3, line: 1587, type: !64)
!136 = !DILocalVariable(name: "buffer", scope: !137, file: !3, line: 1600, type: !128)
!137 = distinct !DILexicalBlock(scope: !138, file: !3, line: 1599, column: 9)
!138 = distinct !DILexicalBlock(scope: !139, file: !3, line: 1598, column: 11)
!139 = distinct !DILexicalBlock(scope: !140, file: !3, line: 1590, column: 5)
!140 = distinct !DILexicalBlock(scope: !104, file: !3, line: 1589, column: 7)
!141 = !DILocalVariable(name: "act", scope: !142, file: !3, line: 1614, type: !144)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 1613, column: 5)
!143 = distinct !DILexicalBlock(scope: !104, file: !3, line: 1612, column: 7)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !145, line: 27, size: 1216, elements: !146)
!145 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!146 = !{!147, !232, !241, !242}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !144, file: !145, line: 38, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !144, file: !145, line: 31, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !148, file: !145, line: 34, baseType: !92, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !148, file: !145, line: 36, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !75, !155, !62}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !157, line: 124, baseType: !158)
!157 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 36, size: 1024, elements: !159)
!159 = !{!160, !161, !162, !163, !164}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !158, file: !157, line: 38, baseType: !75, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !158, file: !157, line: 40, baseType: !75, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !158, file: !157, line: 42, baseType: !75, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !158, file: !157, line: 48, baseType: !75, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !158, file: !157, line: 123, baseType: !165, size: 896, offset: 128)
!165 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !158, file: !157, line: 51, size: 896, elements: !166)
!166 = !{!167, !171, !178, !190, !196, !205, !221, !226}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !165, file: !157, line: 53, baseType: !168, size: 896)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 896, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 28)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !165, file: !157, line: 60, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !157, line: 56, size: 64, elements: !173)
!173 = !{!174, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !172, file: !157, line: 58, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !83, line: 154, baseType: !75)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !172, file: !157, line: 59, baseType: !177, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !83, line: 146, baseType: !6)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !165, file: !157, line: 68, baseType: !179, size: 128)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !157, line: 63, size: 128, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !179, file: !157, line: 65, baseType: !75, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !179, file: !157, line: 66, baseType: !75, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !179, file: !157, line: 67, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !185, line: 30, baseType: !186)
!185 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !185, line: 24, size: 64, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !186, file: !185, line: 26, baseType: !75, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !186, file: !185, line: 27, baseType: !62, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !165, file: !157, line: 76, baseType: !191, size: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !157, line: 71, size: 128, elements: !192)
!192 = !{!193, !194, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !191, file: !157, line: 73, baseType: !175, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !191, file: !157, line: 74, baseType: !177, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !191, file: !157, line: 75, baseType: !184, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !165, file: !157, line: 86, baseType: !197, size: 256)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !157, line: 79, size: 256, elements: !198)
!198 = !{!199, !200, !201, !202, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !197, file: !157, line: 81, baseType: !175, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !197, file: !157, line: 82, baseType: !177, size: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !197, file: !157, line: 83, baseType: !75, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !197, file: !157, line: 84, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !83, line: 156, baseType: !84)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !197, file: !157, line: 85, baseType: !203, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !165, file: !157, line: 105, baseType: !206, size: 256)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !157, line: 89, size: 256, elements: !207)
!207 = !{!208, !209, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !206, file: !157, line: 91, baseType: !62, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !206, file: !157, line: 93, baseType: !210, size: 16, offset: 64)
!210 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !206, file: !157, line: 104, baseType: !212, size: 128, offset: 128)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !157, line: 94, size: 128, elements: !213)
!213 = !{!214, !219}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !212, file: !157, line: 101, baseType: !215, size: 128)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !157, line: 97, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !215, file: !157, line: 99, baseType: !62, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !215, file: !157, line: 100, baseType: !62, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !212, file: !157, line: 103, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !83, line: 42, baseType: !6)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !165, file: !157, line: 112, baseType: !222, size: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !157, line: 108, size: 128, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !222, file: !157, line: 110, baseType: !84, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !222, file: !157, line: 111, baseType: !75, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !165, file: !157, line: 121, baseType: !227, size: 128)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !157, line: 116, size: 128, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !227, file: !157, line: 118, baseType: !62, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !227, file: !157, line: 119, baseType: !75, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !227, file: !157, line: 120, baseType: !6, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !144, file: !145, line: 46, baseType: !233, size: 1024, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !234, line: 8, baseType: !235)
!234 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 5, size: 1024, elements: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !235, file: !234, line: 7, baseType: !238, size: 1024)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 1024, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !144, file: !145, line: 49, baseType: !75, size: 32, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !144, file: !145, line: 52, baseType: !243, size: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null}
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 104, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 13)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "filter_command", scope: !2, file: !3, line: 53, type: !97, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "filter_pid", scope: !2, file: !3, line: 56, type: !75, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "oldblocked", scope: !2, file: !3, line: 64, type: !255, isLocal: true, isDefinition: true)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !256, line: 7, baseType: !233)
!256 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "newblocked", scope: !2, file: !3, line: 65, type: !255, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "outbase", scope: !2, file: !3, line: 68, type: !97, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !3, line: 71, type: !90, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "suffix_length", scope: !2, file: !3, line: 81, type: !64, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !2, file: !3, line: 87, type: !97, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !2, file: !3, line: 90, type: !97, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !2, file: !3, line: 96, type: !271, isLocal: true, isDefinition: true)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !272, line: 26, size: 1152, elements: !273)
!272 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!273 = !{!274, !276, !278, !280, !282, !283, !285, !286, !287, !288, !290, !292, !300, !301, !302}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !271, file: !272, line: 28, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !83, line: 145, baseType: !66)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !271, file: !272, line: 33, baseType: !277, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !83, line: 148, baseType: !66)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !271, file: !272, line: 41, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !83, line: 151, baseType: !66)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !271, file: !272, line: 42, baseType: !281, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !83, line: 150, baseType: !6)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !271, file: !272, line: 44, baseType: !177, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !271, file: !272, line: 45, baseType: !284, size: 32, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !83, line: 147, baseType: !6)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !271, file: !272, line: 47, baseType: !75, size: 32, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !271, file: !272, line: 49, baseType: !275, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !271, file: !272, line: 54, baseType: !82, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !271, file: !272, line: 58, baseType: !289, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !83, line: 175, baseType: !84)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !271, file: !272, line: 60, baseType: !291, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !83, line: 180, baseType: !84)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !271, file: !272, line: 71, baseType: !293, size: 128, offset: 576)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !294, line: 10, size: 128, elements: !295)
!294 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!295 = !{!296, !298}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !293, file: !294, line: 12, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !83, line: 160, baseType: !84)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !293, file: !294, line: 16, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !83, line: 197, baseType: !84)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !271, file: !272, line: 72, baseType: !293, size: 128, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !271, file: !272, line: 73, baseType: !293, size: 128, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !271, file: !272, line: 86, baseType: !303, size: 192, offset: 960)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 192, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 3)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 103, type: !132, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 106, type: !132, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "unbuffered", scope: !2, file: !3, line: 110, type: !132, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 132, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 4352, elements: !324)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !317, line: 50, size: 256, elements: !318)
!317 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!318 = !{!319, !320, !321, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 52, baseType: !97, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !316, file: !317, line: 55, baseType: !75, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !316, file: !317, line: 56, baseType: !322, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !316, file: !317, line: 57, baseType: !75, size: 32, offset: 192)
!324 = !{!325}
!325 = !DISubrange(count: 17)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 113, type: !75, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !2, file: !3, line: 84, type: !97, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !2, file: !3, line: 78, type: !132, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "sufindex", scope: !334, file: !3, line: 353, type: !63, isLocal: true, isDefinition: true)
!334 = distinct !DISubprogram(name: "next_file_name", scope: !3, file: !3, line: 350, type: !244, scopeLine: 351, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !335)
!335 = !{!336, !339, !342, !343, !345}
!336 = !DILocalVariable(name: "widen", scope: !337, file: !3, line: 360, type: !132)
!337 = distinct !DILexicalBlock(scope: !338, file: !3, line: 359, column: 5)
!338 = distinct !DILexicalBlock(scope: !334, file: !3, line: 358, column: 7)
!339 = !DILocalVariable(name: "i", scope: !340, file: !3, line: 411, type: !64)
!340 = distinct !DILexicalBlock(scope: !341, file: !3, line: 407, column: 9)
!341 = distinct !DILexicalBlock(scope: !337, file: !3, line: 406, column: 11)
!342 = !DILocalVariable(name: "sufindex_end", scope: !340, file: !3, line: 415, type: !63)
!343 = !DILocalVariable(name: "i", scope: !344, file: !3, line: 438, type: !64)
!344 = distinct !DILexicalBlock(scope: !338, file: !3, line: 435, column: 5)
!345 = !DILabel(scope: !337, name: "new_name", file: !3, line: 362)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "outbase_length", scope: !334, file: !3, line: 354, type: !64, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "outfile_length", scope: !334, file: !3, line: 355, type: !64, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !334, file: !3, line: 356, type: !64, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !2, file: !3, line: 75, type: !90, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !2, file: !3, line: 61, type: !64, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "open_pipes", scope: !2, file: !3, line: 59, type: !322, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !2, file: !3, line: 60, type: !64, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "output_desc", scope: !2, file: !3, line: 99, type: !75, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!363 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!364 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!365 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "Version", scope: !368, file: !369, line: 2, type: !97, isLocal: false, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{}
!371 = !{!366}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "file_name", scope: !374, file: !375, line: 46, type: !97, isLocal: true, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, globals: !376, splitDebugInlining: false, nameTableKind: None)
!375 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!376 = !{!372, !377}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !374, file: !375, line: 56, type: !132, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "exit_failure", scope: !381, file: !382, line: 24, type: !384, isLocal: false, isDefinition: true)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, globals: !383, splitDebugInlining: false, nameTableKind: None)
!382 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!383 = !{!379}
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !75)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "program_name", scope: !387, file: !388, line: 33, type: !97, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !389, globals: !390, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!389 = !{!62, !90}
!390 = !{!385}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !393, file: !394, line: 85, type: !439, isLocal: false, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !395, retainedTypes: !401, globals: !402, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!395 = !{!31, !396, !16}
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !32, line: 242, baseType: !6, size: 32, elements: !397)
!397 = !{!398, !399, !400}
!398 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!399 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!400 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!401 = !{!75, !85, !64, !90}
!402 = !{!391, !403, !409, !421, !423, !428, !435, !437}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !393, file: !394, line: 101, type: !405, isLocal: false, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 320, elements: !407)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!407 = !{!408}
!408 = !DISubrange(count: 10)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !393, file: !394, line: 1052, type: !411, isLocal: false, isDefinition: true)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !394, line: 65, size: 448, elements: !412)
!412 = !{!413, !414, !415, !419, !420}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !411, file: !394, line: 68, baseType: !31, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !411, file: !394, line: 71, baseType: !75, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !411, file: !394, line: 75, baseType: !416, size: 256, offset: 64)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !411, file: !394, line: 78, baseType: !97, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !411, file: !394, line: 81, baseType: !97, size: 64, offset: 384)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !393, file: !394, line: 116, type: !411, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "slot0", scope: !393, file: !394, line: 842, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2048, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 256)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "slotvec", scope: !393, file: !394, line: 845, type: !430, isLocal: true, isDefinition: true)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !394, line: 834, size: 128, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !431, file: !394, line: 836, baseType: !64, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !431, file: !394, line: 837, baseType: !90, size: 64, offset: 64)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "nslots", scope: !393, file: !394, line: 843, type: !75, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "slotvec0", scope: !393, file: !394, line: 844, type: !431, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 704, elements: !441)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!441 = !{!442}
!442 = !DISubrange(count: 11)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !445, file: !446, line: 26, type: !448, isLocal: false, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, globals: !447, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!447 = !{!443}
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 376, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 47)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "numname_table", scope: !453, file: !454, line: 41, type: !457, isLocal: true, isDefinition: true)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !455, globals: !456, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!455 = !{!6}
!456 = !{!451}
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 3360, elements: !463)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !454, line: 41, size: 96, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !458, file: !454, line: 41, baseType: !75, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !454, line: 41, baseType: !462, size: 64, offset: 32)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !417)
!463 = !{!464}
!464 = !DISubrange(count: 35)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !467, file: !468, line: 507, type: !75, isLocal: true, isDefinition: true)
!467 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !468, file: !468, line: 488, type: !469, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !471, retainedNodes: !473)
!468 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!469 = !DISubroutineType(types: !470)
!470 = !{!75, !75, !75}
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, globals: !472, splitDebugInlining: false, nameTableKind: None)
!472 = !{!465}
!473 = !{!474, !475, !476, !477, !480}
!474 = !DILocalVariable(name: "fd", arg: 1, scope: !467, file: !468, line: 488, type: !75)
!475 = !DILocalVariable(name: "target", arg: 2, scope: !467, file: !468, line: 488, type: !75)
!476 = !DILocalVariable(name: "result", scope: !467, file: !468, line: 490, type: !75)
!477 = !DILocalVariable(name: "flags", scope: !478, file: !468, line: 531, type: !75)
!478 = distinct !DILexicalBlock(scope: !479, file: !468, line: 530, column: 5)
!479 = distinct !DILexicalBlock(scope: !467, file: !468, line: 529, column: 7)
!480 = !DILocalVariable(name: "saved_errno", scope: !481, file: !468, line: 534, type: !75)
!481 = distinct !DILexicalBlock(scope: !482, file: !468, line: 533, column: 9)
!482 = distinct !DILexicalBlock(scope: !478, file: !468, line: 532, column: 11)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !485, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!485 = !{!90}
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/fd-reopen.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !492, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!492 = !{!97, !64}
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !495, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !{!87}
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!498 = !{!499}
!499 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !500, line: 40, baseType: !6, size: 32, elements: !501)
!500 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!501 = !{!502}
!502 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !498, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !509, retainedTypes: !513, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = !{!510}
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !508, line: 40, baseType: !6, size: 32, elements: !511)
!511 = !{!512}
!512 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!513 = !{!62}
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !516, retainedTypes: !524, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!516 = !{!517}
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !518, file: !58, line: 186, baseType: !6, size: 32, elements: !72)
!518 = distinct !DISubprogram(name: "x2nrealloc", scope: !58, file: !58, line: 174, type: !60, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !514, retainedNodes: !519)
!519 = !{!520, !521, !522, !523}
!520 = !DILocalVariable(name: "p", arg: 1, scope: !518, file: !58, line: 174, type: !62)
!521 = !DILocalVariable(name: "pn", arg: 2, scope: !518, file: !58, line: 174, type: !63)
!522 = !DILocalVariable(name: "s", arg: 3, scope: !518, file: !58, line: 174, type: !64)
!523 = !DILocalVariable(name: "n", scope: !518, file: !58, line: 176, type: !64)
!524 = !{!64, !90, !62}
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = !{!45}
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !532, retainedTypes: !533, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!532 = !{!45, !16}
!533 = !{!75, !85}
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !513, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !513, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !513, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !544, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!544 = !{!64}
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, retainedTypes: !513, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!552}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 41, baseType: !6, size: 32, elements: !554)
!553 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937}
!555 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!556 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!557 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!558 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!559 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!560 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!561 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!562 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!563 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!564 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!565 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!566 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!567 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!568 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!569 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!570 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!571 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!572 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!573 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!574 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!575 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!576 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!577 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!578 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!579 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!580 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!581 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!582 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!583 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!584 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!585 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!586 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!587 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!588 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!589 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!590 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!591 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!592 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!593 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!594 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!595 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!596 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!597 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!598 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!599 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!600 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!601 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!602 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!603 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!604 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!663 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!666 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!667 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!668 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!669 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!670 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!671 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!672 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!673 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!674 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!675 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!676 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!677 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!750 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!823 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!824 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!825 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!826 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!827 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!828 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!829 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!830 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!831 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!832 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!833 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!834 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!835 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!836 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!837 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!839 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!840 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!841 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!842 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!843 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!844 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!870 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!871 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!872 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!873 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!874 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!879 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!880 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!881 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!882 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !513, splitDebugInlining: false, nameTableKind: None)
!939 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, splitDebugInlining: false, nameTableKind: None)
!941 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!942 = !{!"clang version 12.0.1"}
!943 = !{i32 7, !"Dwarf Version", i32 4}
!944 = !{i32 2, !"Debug Info Version", i32 3}
!945 = !{i32 1, !"wchar_size", i32 4}
!946 = !{i32 7, !"PIC Level", i32 2}
!947 = !{i32 7, !"PIE Level", i32 2}
!948 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 220, type: !95, scopeLine: 221, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !949)
!949 = !{!950}
!950 = !DILocalVariable(name: "status", arg: 1, scope: !948, file: !3, line: 220, type: !75)
!951 = !DILocation(line: 0, scope: !948)
!952 = !DILocation(line: 222, column: 14, scope: !953)
!953 = distinct !DILexicalBlock(scope: !948, file: !3, line: 222, column: 7)
!954 = !DILocation(line: 222, column: 7, scope: !948)
!955 = !DILocation(line: 223, column: 5, scope: !956)
!956 = distinct !DILexicalBlock(scope: !953, file: !3, line: 223, column: 5)
!957 = !{!958, !958, i64 0}
!958 = !{!"any pointer", !959, i64 0}
!959 = !{!"omnipotent char", !960, i64 0}
!960 = !{!"Simple C/C++ TBAA"}
!961 = !DILocation(line: 226, column: 7, scope: !962)
!962 = distinct !DILexicalBlock(scope: !953, file: !3, line: 225, column: 5)
!963 = !DILocation(line: 230, column: 7, scope: !962)
!964 = !DILocation(line: 583, column: 3, scope: !965, inlinedAt: !967)
!965 = distinct !DISubprogram(name: "emit_stdin_note", scope: !966, file: !966, line: 581, type: !244, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !370)
!966 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!967 = distinct !DILocation(line: 235, column: 7, scope: !962)
!968 = !DILocation(line: 590, column: 3, scope: !969, inlinedAt: !970)
!969 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !966, file: !966, line: 588, type: !244, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !370)
!970 = distinct !DILocation(line: 236, column: 7, scope: !962)
!971 = !DILocation(line: 238, column: 7, scope: !962)
!972 = !DILocation(line: 256, column: 7, scope: !962)
!973 = !DILocation(line: 260, column: 7, scope: !962)
!974 = !DILocation(line: 261, column: 7, scope: !962)
!975 = !DILocation(line: 598, column: 3, scope: !976, inlinedAt: !977)
!976 = distinct !DISubprogram(name: "emit_size_note", scope: !966, file: !966, line: 596, type: !244, scopeLine: 597, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !370)
!977 = distinct !DILocation(line: 262, column: 7, scope: !962)
!978 = !DILocation(line: 263, column: 7, scope: !962)
!979 = !DILocalVariable(name: "program", arg: 1, scope: !980, file: !966, line: 634, type: !97)
!980 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !966, file: !966, line: 634, type: !981, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !97}
!983 = !{!979, !984, !993, !994, !996}
!984 = !DILocalVariable(name: "infomap", scope: !980, file: !966, line: 636, type: !985)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 896, elements: !991)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !980, file: !966, line: 636, size: 128, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !987, file: !966, line: 636, baseType: !97, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !987, file: !966, line: 636, baseType: !97, size: 64, offset: 64)
!991 = !{!992}
!992 = !DISubrange(count: 7)
!993 = !DILocalVariable(name: "node", scope: !980, file: !966, line: 646, type: !97)
!994 = !DILocalVariable(name: "map_prog", scope: !980, file: !966, line: 647, type: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!996 = !DILocalVariable(name: "lc_messages", scope: !980, file: !966, line: 659, type: !97)
!997 = !DILocation(line: 0, scope: !980, inlinedAt: !998)
!998 = distinct !DILocation(line: 272, column: 7, scope: !962)
!999 = !DILocation(line: 636, column: 3, scope: !980, inlinedAt: !998)
!1000 = !DILocation(line: 636, column: 67, scope: !980, inlinedAt: !998)
!1001 = !DILocation(line: 647, column: 36, scope: !980, inlinedAt: !998)
!1002 = !DILocation(line: 649, column: 3, scope: !980, inlinedAt: !998)
!1003 = !DILocation(line: 649, column: 33, scope: !980, inlinedAt: !998)
!1004 = !DILocation(line: 650, column: 13, scope: !980, inlinedAt: !998)
!1005 = !DILocation(line: 649, column: 20, scope: !980, inlinedAt: !998)
!1006 = !{!1007, !958, i64 0}
!1007 = !{!"infomap", !958, i64 0, !958, i64 8}
!1008 = !DILocation(line: 649, column: 10, scope: !980, inlinedAt: !998)
!1009 = !DILocation(line: 649, column: 28, scope: !980, inlinedAt: !998)
!1010 = distinct !{!1010, !1002, !1004, !1011}
!1011 = !{!"llvm.loop.mustprogress"}
!1012 = !DILocation(line: 652, column: 17, scope: !1013, inlinedAt: !998)
!1013 = distinct !DILexicalBlock(scope: !980, file: !966, line: 652, column: 7)
!1014 = !{!1007, !958, i64 8}
!1015 = !DILocation(line: 652, column: 7, scope: !1013, inlinedAt: !998)
!1016 = !DILocation(line: 652, column: 7, scope: !980, inlinedAt: !998)
!1017 = !DILocation(line: 655, column: 3, scope: !980, inlinedAt: !998)
!1018 = !DILocation(line: 659, column: 29, scope: !980, inlinedAt: !998)
!1019 = !DILocation(line: 660, column: 7, scope: !1020, inlinedAt: !998)
!1020 = distinct !DILexicalBlock(scope: !980, file: !966, line: 660, column: 7)
!1021 = !DILocation(line: 660, column: 19, scope: !1020, inlinedAt: !998)
!1022 = !DILocation(line: 660, column: 22, scope: !1020, inlinedAt: !998)
!1023 = !DILocation(line: 660, column: 7, scope: !980, inlinedAt: !998)
!1024 = !DILocation(line: 666, column: 7, scope: !1025, inlinedAt: !998)
!1025 = distinct !DILexicalBlock(scope: !1020, file: !966, line: 661, column: 5)
!1026 = !DILocation(line: 668, column: 5, scope: !1025, inlinedAt: !998)
!1027 = !DILocation(line: 669, column: 3, scope: !980, inlinedAt: !998)
!1028 = !DILocation(line: 671, column: 3, scope: !980, inlinedAt: !998)
!1029 = !DILocation(line: 673, column: 1, scope: !980, inlinedAt: !998)
!1030 = !DILocation(line: 274, column: 3, scope: !948)
!1031 = !DISubprogram(name: "dcgettext", scope: !1032, file: !1032, line: 51, type: !1033, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !370)
!1032 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!90, !97, !97, !75}
!1035 = !DISubprogram(name: "fputs_unlocked", scope: !81, file: !81, line: 667, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !370)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!75, !97, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1040, line: 49, size: 1728, elements: !1041)
!1040 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1067, !1070, !1072, !1075, !1078, !1079, !1080, !1081, !1082}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1039, file: !1040, line: 51, baseType: !75, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1039, file: !1040, line: 54, baseType: !90, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1039, file: !1040, line: 55, baseType: !90, size: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1039, file: !1040, line: 56, baseType: !90, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1039, file: !1040, line: 57, baseType: !90, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1039, file: !1040, line: 58, baseType: !90, size: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1039, file: !1040, line: 59, baseType: !90, size: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1039, file: !1040, line: 60, baseType: !90, size: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1039, file: !1040, line: 61, baseType: !90, size: 64, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1039, file: !1040, line: 64, baseType: !90, size: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1039, file: !1040, line: 65, baseType: !90, size: 64, offset: 640)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1039, file: !1040, line: 66, baseType: !90, size: 64, offset: 704)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1039, file: !1040, line: 68, baseType: !1055, size: 64, offset: 768)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1040, line: 36, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1039, file: !1040, line: 70, baseType: !1038, size: 64, offset: 832)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1039, file: !1040, line: 72, baseType: !75, size: 32, offset: 896)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1039, file: !1040, line: 73, baseType: !75, size: 32, offset: 928)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1039, file: !1040, line: 74, baseType: !82, size: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1039, file: !1040, line: 77, baseType: !85, size: 16, offset: 1024)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1039, file: !1040, line: 78, baseType: !100, size: 8, offset: 1040)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1039, file: !1040, line: 79, baseType: !1064, size: 8, offset: 1048)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 8, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 1)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1039, file: !1040, line: 81, baseType: !1068, size: 64, offset: 1088)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1040, line: 43, baseType: null)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1039, file: !1040, line: 89, baseType: !1071, size: 64, offset: 1152)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 153, baseType: !84)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1039, file: !1040, line: 91, baseType: !1073, size: 64, offset: 1216)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1040, line: 37, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1039, file: !1040, line: 92, baseType: !1076, size: 64, offset: 1280)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1040, line: 38, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1039, file: !1040, line: 93, baseType: !1038, size: 64, offset: 1344)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1039, file: !1040, line: 94, baseType: !62, size: 64, offset: 1408)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1039, file: !1040, line: 95, baseType: !64, size: 64, offset: 1472)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1039, file: !1040, line: 96, baseType: !75, size: 32, offset: 1536)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1039, file: !1040, line: 98, baseType: !1083, size: 160, offset: 1568)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 160, elements: !1084)
!1084 = !{!1085}
!1085 = !DISubrange(count: 20)
!1086 = !DISubprogram(name: "setlocale", scope: !1087, file: !1087, line: 122, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !370)
!1087 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!90, !75, !97}
!1090 = !DILocation(line: 0, scope: !104)
!1091 = !DILocation(line: 1301, column: 22, scope: !104)
!1092 = !DILocation(line: 1311, column: 21, scope: !104)
!1093 = !DILocation(line: 1311, column: 3, scope: !104)
!1094 = !DILocation(line: 1312, column: 3, scope: !104)
!1095 = !DILocation(line: 1313, column: 3, scope: !104)
!1096 = !DILocation(line: 1314, column: 3, scope: !104)
!1097 = !DILocation(line: 1316, column: 3, scope: !104)
!1098 = !DILocation(line: 1320, column: 10, scope: !104)
!1099 = !DILocation(line: 1321, column: 11, scope: !104)
!1100 = !DILocation(line: 1323, column: 3, scope: !104)
!1101 = !DILocation(line: 1302, column: 13, scope: !104)
!1102 = !DILocation(line: 1303, column: 13, scope: !104)
!1103 = !DILocation(line: 1307, column: 7, scope: !104)
!1104 = !DILocation(line: 1300, column: 10, scope: !104)
!1105 = !DILocation(line: 1299, column: 19, scope: !104)
!1106 = !DILocation(line: 1326, column: 25, scope: !120)
!1107 = !{!1108, !1108, i64 0}
!1108 = !{!"int", !959, i64 0}
!1109 = !DILocation(line: 0, scope: !120)
!1110 = !DILocation(line: 1329, column: 11, scope: !120)
!1111 = !DILocation(line: 1331, column: 11, scope: !120)
!1112 = !DILocation(line: 1337, column: 39, scope: !124)
!1113 = !DILocation(line: 1338, column: 43, scope: !124)
!1114 = !DILocation(line: 1337, column: 27, scope: !124)
!1115 = !DILocation(line: 1337, column: 25, scope: !124)
!1116 = !{!1117, !1117, i64 0}
!1117 = !{!"long", !959, i64 0}
!1118 = !DILocation(line: 1339, column: 11, scope: !124)
!1119 = !DILocation(line: 1342, column: 31, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1342, column: 15)
!1121 = !DILocation(line: 1342, column: 15, scope: !1120)
!1122 = !DILocation(line: 1342, column: 39, scope: !1120)
!1123 = !DILocation(line: 1342, column: 15, scope: !124)
!1124 = !DILocation(line: 1345, column: 22, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1343, column: 13)
!1126 = !DILocation(line: 1346, column: 29, scope: !1125)
!1127 = !DILocation(line: 1346, column: 22, scope: !1125)
!1128 = !DILocation(line: 1344, column: 15, scope: !1125)
!1129 = !DILocation(line: 1347, column: 15, scope: !1125)
!1130 = !DILocation(line: 1349, column: 29, scope: !124)
!1131 = !DILocation(line: 1350, column: 11, scope: !124)
!1132 = !DILocation(line: 1353, column: 26, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1353, column: 15)
!1134 = !DILocation(line: 1353, column: 15, scope: !124)
!1135 = !DILocation(line: 1354, column: 13, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 1354, column: 13)
!1137 = !DILocation(line: 1359, column: 33, scope: !124)
!1138 = !DILocation(line: 1360, column: 33, scope: !124)
!1139 = !DILocation(line: 1359, column: 21, scope: !124)
!1140 = !DILocation(line: 1361, column: 11, scope: !124)
!1141 = !DILocation(line: 1364, column: 26, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1364, column: 15)
!1143 = !DILocation(line: 1364, column: 15, scope: !124)
!1144 = !DILocation(line: 1365, column: 13, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 1365, column: 13)
!1146 = !DILocation(line: 1367, column: 33, scope: !124)
!1147 = !DILocation(line: 1368, column: 33, scope: !124)
!1148 = !DILocation(line: 1367, column: 21, scope: !124)
!1149 = !DILocation(line: 1369, column: 11, scope: !124)
!1150 = !DILocation(line: 1372, column: 26, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1372, column: 15)
!1152 = !DILocation(line: 1372, column: 15, scope: !124)
!1153 = !DILocation(line: 1373, column: 13, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1373, column: 13)
!1155 = !DILocation(line: 1375, column: 33, scope: !124)
!1156 = !DILocation(line: 1376, column: 46, scope: !124)
!1157 = !DILocation(line: 1375, column: 21, scope: !124)
!1158 = !DILocation(line: 1377, column: 11, scope: !124)
!1159 = !DILocation(line: 1380, column: 26, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1380, column: 15)
!1161 = !DILocation(line: 1380, column: 15, scope: !124)
!1162 = !DILocation(line: 1383, column: 18, scope: !124)
!1163 = !{!959, !959, i64 0}
!1164 = !{!1165, !1165, i64 0}
!1165 = !{!"short", !959, i64 0}
!1166 = !DILocation(line: 1383, column: 11, scope: !124)
!1167 = !DILocation(line: 1381, column: 13, scope: !1168)
