source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.8 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.of_info = type { i8*, i32, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { void (i32)* }
%union.anon.8 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!88 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !83, line: 72, baseType: !66)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !93, line: 72, baseType: !94)
!93 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !75}
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !{!99, !247, !250, !252, !256, !258, !260, !262, !264, !266, !0, !268, !305, !307, !309, !311, !325, !327, !329, !331, !344, !346, !348, !350, !352, !354, !356, !358}
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "multipliers", scope: !101, file: !3, line: 1304, type: !243, isLocal: true, isDefinition: true)
!101 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1296, type: !102, isDefinition: true, scopeLine: 1297, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !105)
!102 = !DISubroutineType(types: !103)
!103 = !{!75, !75, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !118, !119, !122, !128, !130, !131, !132, !133, !138}
!106 = !DILocalVariable(name: "argc", arg: 1, scope: !101, file: !3, line: 1296, type: !75)
!107 = !DILocalVariable(name: "argv", arg: 2, scope: !101, file: !3, line: 1296, type: !104)
!108 = !DILocalVariable(name: "split_type", scope: !101, file: !3, line: 1298, type: !5)
!109 = !DILocalVariable(name: "in_blk_size", scope: !101, file: !3, line: 1299, type: !64)
!110 = !DILocalVariable(name: "page_size", scope: !101, file: !3, line: 1300, type: !64)
!111 = !DILocalVariable(name: "k_units", scope: !101, file: !3, line: 1301, type: !87)
!112 = !DILocalVariable(name: "n_units", scope: !101, file: !3, line: 1302, type: !87)
!113 = !DILocalVariable(name: "c", scope: !101, file: !3, line: 1305, type: !75)
!114 = !DILocalVariable(name: "digits_optind", scope: !101, file: !3, line: 1306, type: !75)
!115 = !DILocalVariable(name: "file_size", scope: !101, file: !3, line: 1307, type: !80)
!116 = !DILocalVariable(name: "this_optind", scope: !117, file: !3, line: 1325, type: !75)
!117 = distinct !DILexicalBlock(scope: !101, file: !3, line: 1323, column: 5)
!118 = !DILocalVariable(name: "slash", scope: !117, file: !3, line: 1326, type: !90)
!119 = !DILocalVariable(name: "neweol", scope: !120, file: !3, line: 1409, type: !91)
!120 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1408, column: 11)
!121 = distinct !DILexicalBlock(scope: !117, file: !3, line: 1334, column: 9)
!122 = !DILocalVariable(name: "buffer", scope: !123, file: !3, line: 1459, type: !125)
!123 = distinct !DILexicalBlock(scope: !124, file: !3, line: 1458, column: 13)
!124 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1457, column: 15)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 168, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 21)
!128 = !DILocalVariable(name: "specified_buf_size", scope: !101, file: !3, line: 1580, type: !129)
!129 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!130 = !DILocalVariable(name: "b", scope: !101, file: !3, line: 1584, type: !62)
!131 = !DILocalVariable(name: "buf", scope: !101, file: !3, line: 1585, type: !90)
!132 = !DILocalVariable(name: "initial_read", scope: !101, file: !3, line: 1586, type: !64)
!133 = !DILocalVariable(name: "buffer", scope: !134, file: !3, line: 1599, type: !125)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 1598, column: 9)
!135 = distinct !DILexicalBlock(scope: !136, file: !3, line: 1597, column: 11)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 1589, column: 5)
!137 = distinct !DILexicalBlock(scope: !101, file: !3, line: 1588, column: 7)
!138 = !DILocalVariable(name: "act", scope: !139, file: !3, line: 1613, type: !141)
!139 = distinct !DILexicalBlock(scope: !140, file: !3, line: 1612, column: 5)
!140 = distinct !DILexicalBlock(scope: !101, file: !3, line: 1611, column: 7)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !142, line: 27, size: 1216, elements: !143)
!142 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!143 = !{!144, !229, !238, !239}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !141, file: !142, line: 38, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !141, file: !142, line: 31, size: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !145, file: !142, line: 34, baseType: !92, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !145, file: !142, line: 36, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !75, !152, !62}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !154, line: 124, baseType: !155)
!154 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 36, size: 1024, elements: !156)
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !155, file: !154, line: 38, baseType: !75, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !155, file: !154, line: 40, baseType: !75, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !155, file: !154, line: 42, baseType: !75, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !155, file: !154, line: 48, baseType: !75, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !155, file: !154, line: 123, baseType: !162, size: 896, offset: 128)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !155, file: !154, line: 51, size: 896, elements: !163)
!163 = !{!164, !168, !175, !187, !193, !202, !218, !223}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !162, file: !154, line: 53, baseType: !165, size: 896)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 896, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 28)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !162, file: !154, line: 60, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !154, line: 56, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !169, file: !154, line: 58, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !83, line: 152, baseType: !75)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !169, file: !154, line: 59, baseType: !174, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !83, line: 144, baseType: !6)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !162, file: !154, line: 68, baseType: !176, size: 128)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !154, line: 63, size: 128, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !176, file: !154, line: 65, baseType: !75, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !176, file: !154, line: 66, baseType: !75, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !176, file: !154, line: 67, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !182, line: 30, baseType: !183)
!182 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !182, line: 24, size: 64, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !183, file: !182, line: 26, baseType: !75, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !183, file: !182, line: 27, baseType: !62, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !162, file: !154, line: 76, baseType: !188, size: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !154, line: 71, size: 128, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !188, file: !154, line: 73, baseType: !172, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !188, file: !154, line: 74, baseType: !174, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !188, file: !154, line: 75, baseType: !181, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !162, file: !154, line: 86, baseType: !194, size: 256)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !154, line: 79, size: 256, elements: !195)
!195 = !{!196, !197, !198, !199, !201}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !194, file: !154, line: 81, baseType: !172, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !194, file: !154, line: 82, baseType: !174, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !194, file: !154, line: 83, baseType: !75, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !194, file: !154, line: 84, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !83, line: 154, baseType: !84)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !194, file: !154, line: 85, baseType: !200, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !162, file: !154, line: 105, baseType: !203, size: 256)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !154, line: 89, size: 256, elements: !204)
!204 = !{!205, !206, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !203, file: !154, line: 91, baseType: !62, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !203, file: !154, line: 93, baseType: !207, size: 16, offset: 64)
!207 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !203, file: !154, line: 104, baseType: !209, size: 128, offset: 128)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !154, line: 94, size: 128, elements: !210)
!210 = !{!211, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !209, file: !154, line: 101, baseType: !212, size: 128)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !154, line: 97, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !212, file: !154, line: 99, baseType: !62, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !212, file: !154, line: 100, baseType: !62, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !209, file: !154, line: 103, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !83, line: 41, baseType: !6)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !162, file: !154, line: 112, baseType: !219, size: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !154, line: 108, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !219, file: !154, line: 110, baseType: !84, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !219, file: !154, line: 111, baseType: !75, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !162, file: !154, line: 121, baseType: !224, size: 128)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !154, line: 116, size: 128, elements: !225)
!225 = !{!226, !227, !228}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !224, file: !154, line: 118, baseType: !62, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !224, file: !154, line: 119, baseType: !75, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !224, file: !154, line: 120, baseType: !6, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !141, file: !142, line: 46, baseType: !230, size: 1024, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !231, line: 8, baseType: !232)
!231 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 5, size: 1024, elements: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !232, file: !231, line: 7, baseType: !235, size: 1024)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 1024, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !141, file: !142, line: 49, baseType: !75, size: 32, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !141, file: !142, line: 52, baseType: !240, size: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null}
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 104, elements: !245)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!245 = !{!246}
!246 = !DISubrange(count: 13)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "filter_command", scope: !2, file: !3, line: 53, type: !249, isLocal: true, isDefinition: true)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "filter_pid", scope: !2, file: !3, line: 56, type: !75, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "oldblocked", scope: !2, file: !3, line: 64, type: !254, isLocal: true, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !255, line: 7, baseType: !230)
!255 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "newblocked", scope: !2, file: !3, line: 65, type: !254, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "outbase", scope: !2, file: !3, line: 68, type: !249, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !3, line: 71, type: !90, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "suffix_length", scope: !2, file: !3, line: 81, type: !64, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !2, file: !3, line: 87, type: !249, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !2, file: !3, line: 90, type: !249, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !2, file: !3, line: 96, type: !270, isLocal: true, isDefinition: true)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !271, line: 46, size: 1152, elements: !272)
!271 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!272 = !{!273, !275, !277, !279, !281, !282, !284, !285, !286, !287, !289, !291, !299, !300, !301}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !270, file: !271, line: 48, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !83, line: 143, baseType: !66)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !270, file: !271, line: 53, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !83, line: 146, baseType: !66)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !270, file: !271, line: 61, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !83, line: 149, baseType: !66)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !270, file: !271, line: 62, baseType: !280, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !83, line: 148, baseType: !6)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !270, file: !271, line: 64, baseType: !174, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !270, file: !271, line: 65, baseType: !283, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !83, line: 145, baseType: !6)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !270, file: !271, line: 67, baseType: !75, size: 32, offset: 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !270, file: !271, line: 69, baseType: !274, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !270, file: !271, line: 74, baseType: !82, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !270, file: !271, line: 78, baseType: !288, size: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !83, line: 172, baseType: !84)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !270, file: !271, line: 80, baseType: !290, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !83, line: 177, baseType: !84)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !270, file: !271, line: 91, baseType: !292, size: 128, offset: 576)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !293, line: 9, size: 128, elements: !294)
!293 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !292, file: !293, line: 11, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !83, line: 158, baseType: !84)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !292, file: !293, line: 12, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !83, line: 194, baseType: !84)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !270, file: !271, line: 92, baseType: !292, size: 128, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !270, file: !271, line: 93, baseType: !292, size: 128, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !270, file: !271, line: 106, baseType: !302, size: 192, offset: 960)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 192, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 3)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 103, type: !129, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 106, type: !129, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "unbuffered", scope: !2, file: !3, line: 110, type: !129, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 132, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 4352, elements: !323)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !316, line: 50, size: 256, elements: !317)
!316 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!317 = !{!318, !319, !320, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !316, line: 52, baseType: !249, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !315, file: !316, line: 55, baseType: !75, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !316, line: 56, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !315, file: !316, line: 57, baseType: !75, size: 32, offset: 192)
!323 = !{!324}
!324 = !DISubrange(count: 17)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 113, type: !75, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !2, file: !3, line: 84, type: !249, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !2, file: !3, line: 78, type: !129, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "sufindex", scope: !333, file: !3, line: 353, type: !63, isLocal: true, isDefinition: true)
!333 = distinct !DISubprogram(name: "next_file_name", scope: !3, file: !3, line: 350, type: !241, isLocal: true, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !334)
!334 = !{!335, !338, !341, !342}
!335 = !DILocalVariable(name: "widen", scope: !336, file: !3, line: 360, type: !129)
!336 = distinct !DILexicalBlock(scope: !337, file: !3, line: 359, column: 5)
!337 = distinct !DILexicalBlock(scope: !333, file: !3, line: 358, column: 7)
!338 = !DILocalVariable(name: "i", scope: !339, file: !3, line: 411, type: !64)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 407, column: 9)
!340 = distinct !DILexicalBlock(scope: !336, file: !3, line: 406, column: 11)
!341 = !DILocalVariable(name: "sufindex_end", scope: !339, file: !3, line: 415, type: !63)
!342 = !DILocalVariable(name: "i", scope: !343, file: !3, line: 438, type: !64)
!343 = distinct !DILexicalBlock(scope: !337, file: !3, line: 435, column: 5)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "outbase_length", scope: !333, file: !3, line: 354, type: !64, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "outfile_length", scope: !333, file: !3, line: 355, type: !64, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !333, file: !3, line: 356, type: !64, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !2, file: !3, line: 75, type: !90, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !2, file: !3, line: 61, type: !64, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "open_pipes", scope: !2, file: !3, line: 59, type: !321, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !2, file: !3, line: 60, type: !64, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "output_desc", scope: !2, file: !3, line: 99, type: !75, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!361 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!362 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!363 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "Version", scope: !366, file: !367, line: 2, type: !249, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, globals: !369)
!367 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!368 = !{}
!369 = !{!364}
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "file_name", scope: !372, file: !377, line: 46, type: !249, isLocal: true, isDefinition: true)
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, globals: !374)
!373 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!374 = !{!370, !375}
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !372, file: !377, line: 56, type: !129, isLocal: true, isDefinition: true)
!377 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "exit_failure", scope: !380, file: !383, line: 24, type: !384, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, globals: !382)
!381 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!382 = !{!378}
!383 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !75)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "program_name", scope: !387, file: !391, line: 33, type: !249, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !389, globals: !390)
!388 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!389 = !{!62, !90}
!390 = !{!385}
!391 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !394, file: !406, line: 85, type: !441, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !396, retainedTypes: !402, globals: !403)
!395 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!396 = !{!31, !397, !16}
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !32, line: 242, baseType: !6, size: 32, elements: !398)
!398 = !{!399, !400, !401}
!399 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!400 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!401 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!402 = !{!75, !85, !64, !90}
!403 = !{!392, !404, !411, !423, !425, !430, !437, !439}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !394, file: !406, line: 101, type: !407, isDefinition: true)
!406 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 320, elements: !409)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!409 = !{!410}
!410 = !DISubrange(count: 10)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !394, file: !406, line: 1052, type: !413, isDefinition: true)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !406, line: 65, size: 448, elements: !414)
!414 = !{!415, !416, !417, !421, !422}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !413, file: !406, line: 68, baseType: !31, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !413, file: !406, line: 71, baseType: !75, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !413, file: !406, line: 75, baseType: !418, size: 256, offset: 64)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !413, file: !406, line: 78, baseType: !249, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !413, file: !406, line: 81, baseType: !249, size: 64, offset: 384)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !394, file: !406, line: 116, type: !413, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "slot0", scope: !394, file: !406, line: 842, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2048, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 256)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "slotvec", scope: !394, file: !406, line: 845, type: !432, isLocal: true, isDefinition: true)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !406, line: 834, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !433, file: !406, line: 836, baseType: !64, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !433, file: !406, line: 837, baseType: !90, size: 64, offset: 64)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "nslots", scope: !394, file: !406, line: 843, type: !75, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "slotvec0", scope: !394, file: !406, line: 844, type: !433, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 704, elements: !443)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!443 = !{!444}
!444 = !DISubrange(count: 11)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !447, file: !450, line: 26, type: !451, isDefinition: true)
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, globals: !449)
!448 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!449 = !{!445}
!450 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 376, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 47)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "numname_table", scope: !456, file: !460, line: 41, type: !461, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !458, globals: !459)
!457 = !DIFile(filename: "./lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!458 = !{!6}
!459 = !{!454}
!460 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 3360, elements: !467)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !460, line: 41, size: 96, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !462, file: !460, line: 41, baseType: !75, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !462, file: !460, line: 41, baseType: !466, size: 64, offset: 32)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 64, elements: !419)
!467 = !{!468}
!468 = !DISubrange(count: 35)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !471, file: !472, line: 339, type: !75, isLocal: true, isDefinition: true)
!471 = distinct !DISubprogram(name: "rpl_fcntl", scope: !472, file: !472, line: 276, type: !473, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !475, retainedNodes: !478)
!472 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!473 = !DISubroutineType(types: !474)
!474 = !{!75, !75, !75, null}
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, globals: !477)
!476 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!477 = !{!469}
!478 = !{!479, !480, !481, !494, !495, !498, !501, !504}
!479 = !DILocalVariable(name: "fd", arg: 1, scope: !471, file: !472, line: 276, type: !75)
!480 = !DILocalVariable(name: "action", arg: 2, scope: !471, file: !472, line: 276, type: !75)
!481 = !DILocalVariable(name: "arg", scope: !471, file: !472, line: 278, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !483, line: 30, baseType: !484)
!483 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !476, line: 278, baseType: !485)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 192, elements: !492)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !476, line: 278, size: 192, elements: !487)
!487 = !{!488, !489, !490, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !486, file: !476, line: 278, baseType: !6, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !486, file: !476, line: 278, baseType: !6, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !486, file: !476, line: 278, baseType: !62, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !486, file: !476, line: 278, baseType: !62, size: 64, offset: 128)
!492 = !{!493}
!493 = !DISubrange(count: 1)
!494 = !DILocalVariable(name: "result", scope: !471, file: !472, line: 279, type: !75)
!495 = !DILocalVariable(name: "target", scope: !496, file: !472, line: 326, type: !75)
!496 = distinct !DILexicalBlock(scope: !497, file: !472, line: 325, column: 7)
!497 = distinct !DILexicalBlock(scope: !471, file: !472, line: 282, column: 5)
!498 = !DILocalVariable(name: "flags", scope: !499, file: !472, line: 363, type: !75)
!499 = distinct !DILexicalBlock(scope: !500, file: !472, line: 362, column: 11)
!500 = distinct !DILexicalBlock(scope: !496, file: !472, line: 361, column: 13)
!501 = !DILocalVariable(name: "saved_errno", scope: !502, file: !472, line: 366, type: !75)
!502 = distinct !DILexicalBlock(scope: !503, file: !472, line: 365, column: 15)
!503 = distinct !DILexicalBlock(scope: !499, file: !472, line: 364, column: 17)
!504 = !DILocalVariable(name: "p", scope: !505, file: !472, line: 408, type: !62)
!505 = distinct !DILexicalBlock(scope: !497, file: !472, line: 406, column: 7)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !508)
!507 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!508 = !{!90}
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!510 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!512 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !515)
!514 = !DIFile(filename: "./lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!515 = !{!249, !64}
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !518)
!517 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!518 = !{!87}
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !521)
!520 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!521 = !{!522}
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !523, line: 40, baseType: !6, size: 32, elements: !524)
!523 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!524 = !{!525}
!525 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !521)
!527 = !DIFile(filename: "./lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!529 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !532, retainedTypes: !537)
!531 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!532 = !{!533}
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !534, line: 41, baseType: !6, size: 32, elements: !535)
!534 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!535 = !{!536}
!536 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!537 = !{!62}
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !540, retainedTypes: !548)
!539 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!540 = !{!541}
!541 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !542, file: !58, line: 186, baseType: !6, size: 32, elements: !72)
!542 = distinct !DISubprogram(name: "x2nrealloc", scope: !58, file: !58, line: 174, type: !60, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !538, retainedNodes: !543)
!543 = !{!544, !545, !546, !547}
!544 = !DILocalVariable(name: "p", arg: 1, scope: !542, file: !58, line: 174, type: !62)
!545 = !DILocalVariable(name: "pn", arg: 2, scope: !542, file: !58, line: 174, type: !63)
!546 = !DILocalVariable(name: "s", arg: 3, scope: !542, file: !58, line: 174, type: !64)
!547 = !DILocalVariable(name: "n", scope: !542, file: !58, line: 176, type: !64)
!548 = !{!64, !90, !62}
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!550 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !553)
!552 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!553 = !{!45}
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !556, retainedTypes: !557)
!555 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!556 = !{!45, !16}
!557 = !{!75, !85}
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !537)
!559 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!561 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !537)
!563 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !537)
!565 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !568)
!567 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!568 = !{!64}
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!570 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!572 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !575, retainedTypes: !537)
!574 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!575 = !{!576}
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !577, line: 41, baseType: !6, size: 32, elements: !578)
!577 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!579 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!580 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!581 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!582 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!583 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!584 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!585 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!586 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!587 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!588 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!589 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!590 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!591 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!592 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!593 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!594 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!595 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!596 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!597 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!598 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!599 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!600 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!601 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!602 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!603 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!604 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!605 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!606 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!607 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!608 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!609 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!610 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!611 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!612 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!613 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!614 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!615 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!616 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!617 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!618 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!619 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!620 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!621 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!622 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!623 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!624 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!625 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!626 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!627 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!628 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!687 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!690 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!691 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!692 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!693 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!694 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!695 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!696 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!697 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!698 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!699 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!700 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!701 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!774 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!847 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!848 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!849 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!850 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!851 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!852 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!853 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!854 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!855 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!856 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!857 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!858 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!859 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!860 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!861 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!863 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!864 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!865 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!866 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!867 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!868 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!894 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!895 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!896 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!897 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!898 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!903 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!904 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!905 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!906 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !963, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368)
!963 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!964 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!965 = !{i32 2, !"Dwarf Version", i32 4}
!966 = !{i32 2, !"Debug Info Version", i32 3}
!967 = !{i32 1, !"wchar_size", i32 4}
!968 = !{i32 7, !"PIC Level", i32 2}
!969 = !{i32 7, !"PIE Level", i32 2}
!970 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 220, type: !95, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !971)
!971 = !{!972}
!972 = !DILocalVariable(name: "status", arg: 1, scope: !970, file: !3, line: 220, type: !75)
!973 = !DILocalVariable(name: "infomap", scope: !974, file: !975, line: 632, type: !989)
!974 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !975, file: !975, line: 630, type: !976, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !978)
!975 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!976 = !DISubroutineType(types: !977)
!977 = !{null, !249}
!978 = !{!979, !973, !980, !981, !988}
!979 = !DILocalVariable(name: "program", arg: 1, scope: !974, file: !975, line: 630, type: !249)
!980 = !DILocalVariable(name: "node", scope: !974, file: !975, line: 642, type: !249)
!981 = !DILocalVariable(name: "map_prog", scope: !974, file: !975, line: 643, type: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !974, file: !975, line: 632, size: 128, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !984, file: !975, line: 632, baseType: !249, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !984, file: !975, line: 632, baseType: !249, size: 64, offset: 64)
!988 = !DILocalVariable(name: "lc_messages", scope: !974, file: !975, line: 655, type: !249)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 896, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 7)
!992 = !DILocation(line: 632, column: 67, scope: !974, inlinedAt: !993)
!993 = distinct !DILocation(line: 272, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 225, column: 5)
!995 = distinct !DILexicalBlock(scope: !970, file: !3, line: 222, column: 7)
!996 = !DILocation(line: 220, column: 12, scope: !970)
!997 = !DILocation(line: 222, column: 14, scope: !995)
!998 = !DILocation(line: 222, column: 7, scope: !970)
!999 = !DILocation(line: 223, column: 5, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !995, file: !3, line: 223, column: 5)
!1001 = !{!1002, !1002, i64 0}
!1002 = !{!"any pointer", !1003, i64 0}
!1003 = !{!"omnipotent char", !1004, i64 0}
!1004 = !{!"Simple C/C++ TBAA"}
!1005 = !DILocation(line: 226, column: 7, scope: !994)
!1006 = !DILocation(line: 230, column: 7, scope: !994)
!1007 = !DILocation(line: 580, column: 3, scope: !1008, inlinedAt: !1009)
!1008 = distinct !DISubprogram(name: "emit_stdin_note", scope: !975, file: !975, line: 578, type: !241, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !368)
!1009 = distinct !DILocation(line: 235, column: 7, scope: !994)
!1010 = !DILocation(line: 587, column: 3, scope: !1011, inlinedAt: !1012)
!1011 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !975, file: !975, line: 585, type: !241, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !368)
!1012 = distinct !DILocation(line: 236, column: 7, scope: !994)
!1013 = !DILocation(line: 238, column: 7, scope: !994)
!1014 = !DILocation(line: 256, column: 7, scope: !994)
!1015 = !DILocation(line: 260, column: 7, scope: !994)
!1016 = !DILocation(line: 261, column: 7, scope: !994)
!1017 = !DILocation(line: 595, column: 3, scope: !1018, inlinedAt: !1019)
!1018 = distinct !DISubprogram(name: "emit_size_note", scope: !975, file: !975, line: 593, type: !241, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !368)
!1019 = distinct !DILocation(line: 262, column: 7, scope: !994)
!1020 = !DILocation(line: 263, column: 7, scope: !994)
!1021 = !DILocation(line: 632, column: 3, scope: !974, inlinedAt: !993)
!1022 = !DILocation(line: 643, column: 36, scope: !974, inlinedAt: !993)
!1023 = !DILocation(line: 643, column: 25, scope: !974, inlinedAt: !993)
!1024 = !DILocation(line: 645, column: 33, scope: !974, inlinedAt: !993)
!1025 = !DILocation(line: 645, column: 3, scope: !974, inlinedAt: !993)
!1026 = !DILocation(line: 646, column: 13, scope: !974, inlinedAt: !993)
!1027 = !DILocation(line: 645, column: 20, scope: !974, inlinedAt: !993)
!1028 = !{!1029, !1002, i64 0}
!1029 = !{!"infomap", !1002, i64 0, !1002, i64 8}
!1030 = !DILocation(line: 645, column: 10, scope: !974, inlinedAt: !993)
!1031 = !DILocation(line: 645, column: 28, scope: !974, inlinedAt: !993)
!1032 = distinct !{!1032, !1033, !1034}
!1033 = !DILocation(line: 645, column: 3, scope: !974)
!1034 = !DILocation(line: 646, column: 13, scope: !974)
!1035 = !DILocation(line: 648, column: 17, scope: !1036, inlinedAt: !993)
!1036 = distinct !DILexicalBlock(scope: !974, file: !975, line: 648, column: 7)
!1037 = !{!1029, !1002, i64 8}
!1038 = !DILocation(line: 648, column: 7, scope: !1036, inlinedAt: !993)
!1039 = !DILocation(line: 648, column: 7, scope: !974, inlinedAt: !993)
!1040 = !DILocation(line: 642, column: 15, scope: !974, inlinedAt: !993)
!1041 = !DILocation(line: 651, column: 3, scope: !974, inlinedAt: !993)
!1042 = !DILocation(line: 655, column: 29, scope: !974, inlinedAt: !993)
!1043 = !DILocation(line: 655, column: 15, scope: !974, inlinedAt: !993)
!1044 = !DILocation(line: 656, column: 7, scope: !1045, inlinedAt: !993)
!1045 = distinct !DILexicalBlock(scope: !974, file: !975, line: 656, column: 7)
!1046 = !DILocation(line: 656, column: 19, scope: !1045, inlinedAt: !993)
!1047 = !DILocation(line: 656, column: 22, scope: !1045, inlinedAt: !993)
!1048 = !DILocation(line: 656, column: 7, scope: !974, inlinedAt: !993)
!1049 = !DILocation(line: 662, column: 7, scope: !1050, inlinedAt: !993)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !975, line: 657, column: 5)
!1051 = !DILocation(line: 664, column: 5, scope: !1050, inlinedAt: !993)
!1052 = !DILocation(line: 665, column: 3, scope: !974, inlinedAt: !993)
!1053 = !DILocation(line: 667, column: 3, scope: !974, inlinedAt: !993)
!1054 = !DILocation(line: 669, column: 1, scope: !974, inlinedAt: !993)
!1055 = !DILocation(line: 274, column: 3, scope: !970)
!1056 = !DILocation(line: 1296, column: 11, scope: !101)
!1057 = !DILocation(line: 1296, column: 24, scope: !101)
!1058 = !DILocation(line: 1298, column: 19, scope: !101)
!1059 = !DILocation(line: 1299, column: 10, scope: !101)
!1060 = !DILocation(line: 1300, column: 22, scope: !101)
!1061 = !DILocation(line: 1300, column: 10, scope: !101)
!1062 = !DILocation(line: 1301, column: 13, scope: !101)
!1063 = !DILocation(line: 1302, column: 13, scope: !101)
!1064 = !DILocation(line: 1306, column: 7, scope: !101)
!1065 = !DILocation(line: 1307, column: 9, scope: !101)
!1066 = !DILocation(line: 1310, column: 21, scope: !101)
!1067 = !DILocation(line: 1310, column: 3, scope: !101)
!1068 = !DILocation(line: 1311, column: 3, scope: !101)
!1069 = !DILocation(line: 1312, column: 3, scope: !101)
!1070 = !DILocation(line: 1313, column: 3, scope: !101)
!1071 = !DILocation(line: 1315, column: 3, scope: !101)
!1072 = !DILocation(line: 1319, column: 10, scope: !101)
!1073 = !DILocation(line: 1320, column: 11, scope: !101)
!1074 = !DILocation(line: 1322, column: 3, scope: !101)
!1075 = !DILocation(line: 1325, column: 25, scope: !117)
!1076 = !{!1077, !1077, i64 0}
!1077 = !{!"int", !1003, i64 0}
!1078 = !DILocation(line: 1325, column: 11, scope: !117)
!1079 = !DILocation(line: 1328, column: 11, scope: !117)
!1080 = !DILocation(line: 1305, column: 7, scope: !101)
!1081 = !DILocation(line: 1330, column: 11, scope: !117)
!1082 = !DILocation(line: 1336, column: 39, scope: !121)
!1083 = !DILocation(line: 1337, column: 43, scope: !121)
!1084 = !DILocation(line: 1336, column: 27, scope: !121)
!1085 = !DILocation(line: 1336, column: 25, scope: !121)
!1086 = !{!1087, !1087, i64 0}
!1087 = !{!"long", !1003, i64 0}
!1088 = !DILocation(line: 1338, column: 11, scope: !121)
!1089 = !DILocation(line: 1341, column: 31, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1341, column: 15)
!1091 = !DILocation(line: 1341, column: 15, scope: !1090)
!1092 = !DILocation(line: 1341, column: 39, scope: !1090)
!1093 = !DILocation(line: 1341, column: 15, scope: !121)
!1094 = !DILocation(line: 1344, column: 22, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 1342, column: 13)
!1096 = !DILocation(line: 1345, column: 29, scope: !1095)
!1097 = !DILocation(line: 1345, column: 22, scope: !1095)
!1098 = !DILocation(line: 1343, column: 15, scope: !1095)
!1099 = !DILocation(line: 1346, column: 15, scope: !1095)
!1100 = !DILocation(line: 1348, column: 29, scope: !121)
!1101 = !DILocation(line: 1349, column: 11, scope: !121)
!1102 = !DILocation(line: 1352, column: 26, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1352, column: 15)
!1104 = !DILocation(line: 1352, column: 15, scope: !121)
!1105 = !DILocation(line: 1353, column: 13, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 1353, column: 13)
!1107 = !DILocation(line: 1358, column: 33, scope: !121)
!1108 = !DILocation(line: 1359, column: 33, scope: !121)
!1109 = !DILocation(line: 1358, column: 21, scope: !121)
!1110 = !DILocation(line: 1360, column: 11, scope: !121)
!1111 = !DILocation(line: 1363, column: 26, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1363, column: 15)
!1113 = !DILocation(line: 1363, column: 15, scope: !121)
!1114 = !DILocation(line: 1364, column: 13, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 1364, column: 13)
!1116 = !DILocation(line: 1366, column: 33, scope: !121)
!1117 = !DILocation(line: 1367, column: 33, scope: !121)
!1118 = !DILocation(line: 1366, column: 21, scope: !121)
!1119 = !DILocation(line: 1368, column: 11, scope: !121)
!1120 = !DILocation(line: 1371, column: 26, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1371, column: 15)
!1122 = !DILocation(line: 1371, column: 15, scope: !121)
!1123 = !DILocation(line: 1372, column: 13, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 1372, column: 13)
!1125 = !DILocation(line: 1374, column: 33, scope: !121)
!1126 = !DILocation(line: 1375, column: 46, scope: !121)
!1127 = !DILocation(line: 1374, column: 21, scope: !121)
!1128 = !DILocation(line: 1376, column: 11, scope: !121)
!1129 = !DILocation(line: 1379, column: 26, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1379, column: 15)
!1131 = !DILocation(line: 1379, column: 15, scope: !121)
!1132 = !DILocation(line: 1382, column: 18, scope: !121)
!1133 = !{!1003, !1003, i64 0}
!1134 = !{!1135, !1135, i64 0}
!1135 = !{!"short", !1003, i64 0}
!1136 = !DILocation(line: 1382, column: 11, scope: !121)
!1137 = !DILocation(line: 1380, column: 13, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 1380, column: 13)
!1139 = !DILocation(line: 1383, column: 19, scope: !121)
!1140 = distinct !{!1140, !1136, !1139}
!1141 = !DILocation(line: 1384, column: 15, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1384, column: 15)
!1143 = !DILocation(line: 1384, column: 42, scope: !1142)
!1144 = !DILocation(line: 1384, column: 15, scope: !121)
!1145 = !DILocation(line: 1389, column: 20, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 1389, column: 20)
!1147 = !DILocation(line: 1389, column: 47, scope: !1146)
!1148 = !DILocation(line: 1389, column: 20, scope: !1142)
!1149 = !DILocation(scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 1390, column: 13)
!1151 = !DILocation(scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 1385, column: 13)
!1153 = !DILocation(line: 1396, column: 24, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !121, file: !3, line: 1396, column: 15)
!1155 = !DILocation(line: 1396, column: 32, scope: !1154)
!1156 = !DILocation(scope: !1146)
!1157 = !DILocation(line: 1326, column: 13, scope: !117)
!1158 = !DILocation(line: 1396, column: 22, scope: !1154)
!1159 = !DILocation(line: 1396, column: 15, scope: !121)
!1160 = !DILocalVariable(name: "slash", arg: 3, scope: !1161, file: !3, line: 1282, type: !90)
!1161 = distinct !DISubprogram(name: "parse_chunk", scope: !3, file: !3, line: 1282, type: !1162, isLocal: true, isDefinition: true, scopeLine: 1283, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1164)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{null, !86, !86, !90}
!1164 = !{!1165, !1166, !1160}
!1165 = !DILocalVariable(name: "k_units", arg: 1, scope: !1161, file: !3, line: 1282, type: !86)
!1166 = !DILocalVariable(name: "n_units", arg: 2, scope: !1161, file: !3, line: 1282, type: !86)
!1167 = !DILocation(line: 1282, column: 60, scope: !1161, inlinedAt: !1168)
!1168 = distinct !DILocation(line: 1397, column: 13, scope: !1154)
!1169 = !DILocation(line: 1284, column: 32, scope: !1161, inlinedAt: !1168)
!1170 = !DILocation(line: 1285, column: 26, scope: !1161, inlinedAt: !1168)
!1171 = !DILocation(line: 1284, column: 14, scope: !1161, inlinedAt: !1168)
!1172 = !DILocation(line: 1286, column: 16, scope: !1173, inlinedAt: !1168)
!1173 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 1286, column: 7)
!1174 = !DILocation(line: 1286, column: 13, scope: !1173, inlinedAt: !1168)
!1175 = !DILocation(line: 1286, column: 7, scope: !1161, inlinedAt: !1168)
!1176 = !DILocation(line: 1288, column: 14, scope: !1177, inlinedAt: !1168)
!1177 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 1287, column: 5)
!1178 = !DILocation(line: 1289, column: 30, scope: !1177, inlinedAt: !1168)
!1179 = !DILocation(line: 1290, column: 30, scope: !1177, inlinedAt: !1168)
!1180 = !DILocation(line: 1289, column: 18, scope: !1177, inlinedAt: !1168)
!1181 = !DILocation(line: 1291, column: 5, scope: !1177, inlinedAt: !1168)
!1182 = !DILocation(line: 1400, column: 35, scope: !1154)
!1183 = !DILocation(line: 1399, column: 23, scope: !1154)
!1184 = !DILocation(line: 1405, column: 11, scope: !121)
!1185 = !DILocation(line: 1409, column: 27, scope: !120)
!1186 = !DILocation(line: 1409, column: 18, scope: !120)
!1187 = !DILocation(line: 1410, column: 19, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1410, column: 17)
!1189 = !DILocation(line: 1410, column: 17, scope: !120)
!1190 = !DILocation(line: 1411, column: 15, scope: !1188)
!1191 = !DILocation(line: 1412, column: 17, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1412, column: 17)
!1193 = !DILocation(line: 1412, column: 17, scope: !120)
!1194 = !DILocation(line: 1414, column: 21, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 1414, column: 21)
!1196 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 1413, column: 15)
!1197 = !DILocation(line: 1414, column: 21, scope: !1196)
!1198 = !DILocation(line: 1422, column: 21, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 1417, column: 19)
!1200 = !DILocation(scope: !120)
!1201 = !DILocation(line: 1427, column: 22, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1427, column: 17)
!1203 = !DILocation(line: 1427, column: 19, scope: !1202)
!1204 = !DILocation(line: 1427, column: 33, scope: !1202)
!1205 = !DILocation(line: 1427, column: 40, scope: !1202)
!1206 = !DILocation(line: 1427, column: 30, scope: !1202)
!1207 = !DILocation(line: 1429, column: 17, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1202, file: !3, line: 1428, column: 15)
!1209 = !DILocation(line: 1433, column: 21, scope: !120)
!1210 = !DILocation(line: 1435, column: 11, scope: !121)
