source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.8 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.of_info = type { i8*, i32, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { void (i32)* }
%union.anon.8 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!28 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !32, line: 32, baseType: !6, size: 32, elements: !33)
!32 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!34 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !46, line: 25, baseType: !6, size: 32, elements: !47)
!46 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!47 = !{!48, !49, !50, !51, !52}
!48 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!52 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 73, baseType: !6, size: 32, elements: !55)
!54 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!55 = !{!56}
!56 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !59, file: !58, line: 186, baseType: !6, size: 32, elements: !72)
!58 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!59 = distinct !DISubprogram(name: "x2nrealloc", scope: !58, file: !58, line: 174, type: !60, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !67)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !62, !63, !64}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 46, baseType: !66)
!65 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!66 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!67 = !{!68, !69, !70, !71}
!68 = !DILocalVariable(name: "p", arg: 1, scope: !59, file: !58, line: 174, type: !62)
!69 = !DILocalVariable(name: "pn", arg: 2, scope: !59, file: !58, line: 174, type: !63)
!70 = !DILocalVariable(name: "s", arg: 3, scope: !59, file: !58, line: 174, type: !64)
!71 = !DILocalVariable(name: "n", scope: !59, file: !58, line: 176, type: !64)
!72 = !{!73}
!73 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1041, baseType: !75, size: 32, elements: !76)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !{!77, !78}
!77 = !DIEnumerator(name: "OFD_NEW", value: -1)
!78 = !DIEnumerator(name: "OFD_APPEND", value: -2)
!79 = !{!80, !89, !146, !150, !151, !155, !159, !162, !165, !172, !187, !191, !193, !197, !75, !120, !201, !62, !202, !205, !84, !209, !213, !217, !220, !223, !226, !238, !250, !340, !343, !348, !351, !64, !356, !359, !363, !369, !370, !373, !376, !379, !383, !386, !387, !390, !393, !394, !397, !400, !404, !86, !405, !408, !411, !415, !416, !419, !122, !423}
!80 = !DISubprogram(name: "dcgettext", scope: !81, file: !81, line: 51, type: !82, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!81 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !86, !86, !75}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!88 = !{}
!89 = !DISubprogram(name: "fputs_unlocked", scope: !90, file: !90, line: 662, type: !91, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!90 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!91 = !DISubroutineType(types: !92)
!92 = !{!75, !86, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !95, line: 49, size: 1728, elements: !96)
!95 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !112, !113, !114, !115, !119, !121, !123, !127, !130, !132, !135, !138, !139, !140, !141, !142}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !94, file: !95, line: 51, baseType: !75, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !94, file: !95, line: 54, baseType: !84, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !94, file: !95, line: 55, baseType: !84, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !94, file: !95, line: 56, baseType: !84, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !94, file: !95, line: 57, baseType: !84, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !94, file: !95, line: 58, baseType: !84, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !94, file: !95, line: 59, baseType: !84, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !94, file: !95, line: 60, baseType: !84, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !94, file: !95, line: 61, baseType: !84, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !94, file: !95, line: 64, baseType: !84, size: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !94, file: !95, line: 65, baseType: !84, size: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !94, file: !95, line: 66, baseType: !84, size: 64, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !94, file: !95, line: 68, baseType: !110, size: 64, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !95, line: 36, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !94, file: !95, line: 70, baseType: !93, size: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !94, file: !95, line: 72, baseType: !75, size: 32, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !94, file: !95, line: 73, baseType: !75, size: 32, offset: 928)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !94, file: !95, line: 74, baseType: !116, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !117, line: 152, baseType: !118)
!117 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!118 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !94, file: !95, line: 77, baseType: !120, size: 16, offset: 1024)
!120 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !94, file: !95, line: 78, baseType: !122, size: 8, offset: 1040)
!122 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !94, file: !95, line: 79, baseType: !124, size: 8, offset: 1048)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !94, file: !95, line: 81, baseType: !128, size: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !95, line: 43, baseType: null)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !94, file: !95, line: 89, baseType: !131, size: 64, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !117, line: 153, baseType: !118)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !94, file: !95, line: 91, baseType: !133, size: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !95, line: 37, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !94, file: !95, line: 92, baseType: !136, size: 64, offset: 1280)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !95, line: 38, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !94, file: !95, line: 93, baseType: !93, size: 64, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !94, file: !95, line: 94, baseType: !62, size: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !94, file: !95, line: 95, baseType: !64, size: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !94, file: !95, line: 96, baseType: !75, size: 32, offset: 1536)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !94, file: !95, line: 98, baseType: !143, size: 160, offset: 1568)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 160, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 20)
!146 = !DISubprogram(name: "getpagesize", scope: !147, file: !147, line: 976, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!147 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!148 = !DISubroutineType(types: !149)
!149 = !{!75}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !90, line: 63, baseType: !116)
!151 = !DISubprogram(name: "set_program_name", scope: !152, file: !152, line: 37, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!152 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !86}
!155 = !DISubprogram(name: "setlocale", scope: !156, file: !156, line: 122, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!156 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!157 = !DISubroutineType(types: !158)
!158 = !{!84, !75, !86}
!159 = !DISubprogram(name: "bindtextdomain", scope: !81, file: !81, line: 86, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!160 = !DISubroutineType(types: !161)
!161 = !{!84, !86, !86}
!162 = !DISubprogram(name: "textdomain", scope: !81, file: !81, line: 82, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!163 = !DISubroutineType(types: !164)
!164 = !{!84, !86}
!165 = !DISubprogram(name: "atexit", scope: !166, file: !166, line: 595, type: !167, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!166 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!167 = !DISubroutineType(types: !168)
!168 = !{!75, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DISubprogram(name: "getopt_long", scope: !173, file: !173, line: 66, type: !174, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!173 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!174 = !DISubroutineType(types: !175)
!175 = !{!75, !75, !176, !86, !178, !185}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !173, line: 50, size: 256, elements: !181)
!181 = !{!182, !183, !184, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !173, line: 52, baseType: !86, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !180, file: !173, line: 55, baseType: !75, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !180, file: !173, line: 56, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !180, file: !173, line: 57, baseType: !75, size: 32, offset: 192)
!187 = !DISubprogram(name: "xdectoumax", scope: !188, file: !188, line: 31, type: !189, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!188 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!189 = !DISubroutineType(types: !190)
!190 = !{!66, !86, !66, !66, !86, !86, !75}
!191 = !DISubprogram(name: "last_component", scope: !192, file: !192, line: 46, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!192 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = !DISubprogram(name: "quote", scope: !194, file: !194, line: 44, type: !195, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!194 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!195 = !DISubroutineType(types: !196)
!196 = !{!86, !86}
!197 = !DISubprogram(name: "error", scope: !198, file: !198, line: 52, type: !199, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!198 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !75, !75, !86, null}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !203, line: 102, baseType: !204)
!203 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !117, line: 73, baseType: !66)
!205 = !DISubprogram(name: "umaxtostr", scope: !206, file: !206, line: 46, type: !207, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!206 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !DISubroutineType(types: !208)
!208 = !{!84, !66, !84}
!209 = !DISubprogram(name: "version_etc", scope: !210, file: !210, line: 69, type: !211, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!210 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!211 = !DISubroutineType(types: !212)
!212 = !{null, !93, !86, !86, !86, null}
!213 = !DISubprogram(name: "fd_reopen", scope: !214, file: !214, line: 22, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!214 = !DIFile(filename: "./lib/fd-reopen.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !DISubroutineType(types: !216)
!216 = !{!75, !75, !86, !75, !6}
!217 = !DISubprogram(name: "quotearg_style", scope: !32, file: !32, line: 377, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!218 = !DISubroutineType(types: !219)
!219 = !{!84, !31, !86}
!220 = !DISubprogram(name: "quotearg_n_style_colon", scope: !32, file: !32, line: 397, type: !221, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!221 = !DISubroutineType(types: !222)
!222 = !{!84, !75, !31, !86}
!223 = !DISubprogram(name: "xmalloc", scope: !58, file: !58, line: 53, type: !224, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!224 = !DISubroutineType(types: !225)
!225 = !{!62, !66}
!226 = !DISubprogram(name: "sigemptyset", scope: !227, file: !227, line: 196, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!227 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!228 = !DISubroutineType(types: !229)
!229 = !{!75, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 5, size: 1024, elements: !233)
!232 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !231, file: !232, line: 7, baseType: !235, size: 1024)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 1024, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 16)
!238 = !DISubprogram(name: "sigaction", scope: !227, file: !227, line: 240, type: !239, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!239 = !DISubroutineType(types: !240)
!240 = !{!75, !75, !241, !339}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !244, line: 27, size: 1216, elements: !245)
!244 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!245 = !{!246, !335, !337, !338}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !243, file: !244, line: 38, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !243, file: !244, line: 31, size: 64, elements: !248)
!248 = !{!249, !254}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !247, file: !244, line: 34, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !227, line: 72, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !75}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !247, file: !244, line: 36, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !75, !258, !62}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !260, line: 124, baseType: !261)
!260 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 36, size: 1024, elements: !262)
!262 = !{!263, !264, !265, !266, !267}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !261, file: !260, line: 38, baseType: !75, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !261, file: !260, line: 40, baseType: !75, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !261, file: !260, line: 42, baseType: !75, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !261, file: !260, line: 48, baseType: !75, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !261, file: !260, line: 123, baseType: !268, size: 896, offset: 128)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !261, file: !260, line: 51, size: 896, elements: !269)
!269 = !{!270, !274, !281, !293, !299, !308, !324, !329}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !268, file: !260, line: 53, baseType: !271, size: 896)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 896, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 28)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !268, file: !260, line: 60, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !260, line: 56, size: 64, elements: !276)
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !275, file: !260, line: 58, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !117, line: 154, baseType: !75)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !275, file: !260, line: 59, baseType: !280, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !117, line: 146, baseType: !6)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !268, file: !260, line: 68, baseType: !282, size: 128)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !260, line: 63, size: 128, elements: !283)
!283 = !{!284, !285, !286}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !282, file: !260, line: 65, baseType: !75, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !282, file: !260, line: 66, baseType: !75, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !282, file: !260, line: 67, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !288, line: 30, baseType: !289)
!288 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !288, line: 24, size: 64, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !289, file: !288, line: 26, baseType: !75, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !289, file: !288, line: 27, baseType: !62, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !268, file: !260, line: 76, baseType: !294, size: 128)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !260, line: 71, size: 128, elements: !295)
!295 = !{!296, !297, !298}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !294, file: !260, line: 73, baseType: !278, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !294, file: !260, line: 74, baseType: !280, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !294, file: !260, line: 75, baseType: !287, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !268, file: !260, line: 86, baseType: !300, size: 256)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !260, line: 79, size: 256, elements: !301)
!301 = !{!302, !303, !304, !305, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !300, file: !260, line: 81, baseType: !278, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !300, file: !260, line: 82, baseType: !280, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !300, file: !260, line: 83, baseType: !75, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !300, file: !260, line: 84, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !117, line: 156, baseType: !118)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !300, file: !260, line: 85, baseType: !306, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !268, file: !260, line: 105, baseType: !309, size: 256)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !260, line: 89, size: 256, elements: !310)
!310 = !{!311, !312, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !309, file: !260, line: 91, baseType: !62, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !309, file: !260, line: 93, baseType: !313, size: 16, offset: 64)
!313 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !309, file: !260, line: 104, baseType: !315, size: 128, offset: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !260, line: 94, size: 128, elements: !316)
!316 = !{!317, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !315, file: !260, line: 101, baseType: !318, size: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !315, file: !260, line: 97, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !318, file: !260, line: 99, baseType: !62, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !318, file: !260, line: 100, baseType: !62, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !315, file: !260, line: 103, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !117, line: 42, baseType: !6)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !268, file: !260, line: 112, baseType: !325, size: 128)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !260, line: 108, size: 128, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !325, file: !260, line: 110, baseType: !118, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !325, file: !260, line: 111, baseType: !75, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !268, file: !260, line: 121, baseType: !330, size: 128)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !260, line: 116, size: 128, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !330, file: !260, line: 118, baseType: !62, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !330, file: !260, line: 119, baseType: !75, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !330, file: !260, line: 120, baseType: !6, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !243, file: !244, line: 46, baseType: !336, size: 1024, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !232, line: 8, baseType: !231)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !243, file: !244, line: 49, baseType: !75, size: 32, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !243, file: !244, line: 52, baseType: !169, size: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!340 = !DISubprogram(name: "sigaddset", scope: !227, file: !227, line: 202, type: !341, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!341 = !DISubroutineType(types: !342)
!342 = !{!75, !230, !75}
!343 = !DISubprogram(name: "sigprocmask", scope: !227, file: !227, line: 229, type: !344, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!344 = !DISubroutineType(types: !345)
!345 = !{!75, !75, !346, !230}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!348 = !DISubprogram(name: "close", scope: !147, file: !147, line: 353, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!349 = !DISubroutineType(types: !350)
!350 = !{!75, !75}
!351 = !DISubprogram(name: "xstrtoumax", scope: !46, file: !46, line: 48, type: !352, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!352 = !DISubroutineType(types: !353)
!353 = !{!45, !86, !354, !75, !355, !86}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!356 = !DISubprogram(name: "lseek", scope: !147, file: !147, line: 334, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!357 = !DISubroutineType(types: !358)
!358 = !{!118, !75, !118, !75}
!359 = !DISubprogram(name: "safe_read", scope: !360, file: !360, line: 42, type: !361, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!360 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!361 = !DISubroutineType(types: !362)
!362 = !{!66, !75, !62, !66}
!363 = !DISubprogram(name: "full_write", scope: !364, file: !364, line: 29, type: !365, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!364 = !DIFile(filename: "./lib/full-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!365 = !DISubroutineType(types: !366)
!366 = !{!66, !75, !367, !66}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!369 = !DISubprogram(name: "xalloc_die", scope: !58, file: !58, line: 51, type: !170, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !88)
!370 = !DISubprogram(name: "xrealloc", scope: !58, file: !58, line: 59, type: !371, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!371 = !DISubroutineType(types: !372)
!372 = !{!62, !62, !66}
!373 = !DISubprogram(name: "free", scope: !166, file: !166, line: 565, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !62}
!376 = !DISubprogram(name: "xcalloc", scope: !58, file: !58, line: 57, type: !377, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!377 = !DISubroutineType(types: !378)
!378 = !{!62, !66, !66}
!379 = !DISubprogram(name: "open_safer", scope: !380, file: !380, line: 22, type: !381, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!380 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!381 = !DISubroutineType(types: !382)
!382 = !{!75, !86, !75, null}
!383 = !DISubprogram(name: "ftruncate", scope: !147, file: !147, line: 1014, type: !384, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!384 = !DISubroutineType(types: !385)
!385 = !{!75, !75, !118}
!386 = !DISubprogram(name: "getenv", scope: !166, file: !166, line: 634, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!387 = !DISubprogram(name: "setenv", scope: !166, file: !166, line: 653, type: !388, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!388 = !DISubroutineType(types: !389)
!389 = !{!75, !86, !86, !75}
!390 = !DISubprogram(name: "pipe", scope: !147, file: !147, line: 417, type: !391, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!391 = !DISubroutineType(types: !392)
!392 = !{!75, !185}
!393 = !DISubprogram(name: "fork", scope: !147, file: !147, line: 756, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!394 = !DISubprogram(name: "dup2", scope: !147, file: !147, line: 534, type: !395, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!395 = !DISubroutineType(types: !396)
!396 = !{!75, !75, !75}
!397 = !DISubprogram(name: "execl", scope: !147, file: !147, line: 573, type: !398, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!398 = !DISubroutineType(types: !399)
!399 = !{!75, !86, !86, null}
!400 = !DISubprogram(name: "memrchr", scope: !401, file: !401, line: 115, type: !402, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!401 = !DIFile(filename: "/usr/include/string.h", directory: "")
!402 = !DISubroutineType(types: !403)
!403 = !{!62, !367, !75, !66}
!404 = !DISubprogram(name: "xstrdup", scope: !58, file: !58, line: 64, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!405 = !DISubprogram(name: "fwrite_unlocked", scope: !90, file: !90, line: 675, type: !406, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!406 = !DISubroutineType(types: !407)
!407 = !{!66, !367, !66, !66, !93}
!408 = !DISubprogram(name: "clearerr_unlocked", scope: !90, file: !90, line: 765, type: !409, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !93}
!411 = !DISubprogram(name: "rpl_fclose", scope: !412, file: !412, line: 672, type: !413, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!412 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!413 = !DISubroutineType(types: !414)
!414 = !{!75, !93}
!415 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!416 = !DISubprogram(name: "fdopen", scope: !90, file: !90, line: 279, type: !417, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!417 = !DISubroutineType(types: !418)
!418 = !{!93, !75, !86}
!419 = !DISubprogram(name: "waitpid", scope: !420, file: !420, line: 111, type: !421, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!420 = !DIFile(filename: "/usr/include/sys/wait.h", directory: "")
!421 = !DISubroutineType(types: !422)
!422 = !{!75, !75, !185, !75}
!423 = !DISubprogram(name: "sig2str", scope: !424, file: !424, line: 34, type: !425, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!424 = !DIFile(filename: "./lib/sig2str.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = !DISubroutineType(types: !426)
!426 = !{!75, !75, !84}
!427 = !{!428, !472, !474, !476, !480, !482, !484, !486, !488, !490, !0, !492, !529, !531, !533, !535, !540, !542, !544, !546, !560, !562, !564, !566, !568, !570, !572, !574}
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "multipliers", scope: !430, file: !3, line: 1305, type: !469, isLocal: true, isDefinition: true)
!430 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1297, type: !431, scopeLine: 1298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{!75, !75, !354}
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !446, !447, !450, !456, !458, !459, !460, !461, !466}
!434 = !DILocalVariable(name: "argc", arg: 1, scope: !430, file: !3, line: 1297, type: !75)
!435 = !DILocalVariable(name: "argv", arg: 2, scope: !430, file: !3, line: 1297, type: !354)
!436 = !DILocalVariable(name: "split_type", scope: !430, file: !3, line: 1299, type: !5)
!437 = !DILocalVariable(name: "in_blk_size", scope: !430, file: !3, line: 1300, type: !64)
!438 = !DILocalVariable(name: "page_size", scope: !430, file: !3, line: 1301, type: !64)
!439 = !DILocalVariable(name: "k_units", scope: !430, file: !3, line: 1302, type: !202)
!440 = !DILocalVariable(name: "n_units", scope: !430, file: !3, line: 1303, type: !202)
!441 = !DILocalVariable(name: "c", scope: !430, file: !3, line: 1306, type: !75)
!442 = !DILocalVariable(name: "digits_optind", scope: !430, file: !3, line: 1307, type: !75)
!443 = !DILocalVariable(name: "file_size", scope: !430, file: !3, line: 1308, type: !150)
!444 = !DILocalVariable(name: "this_optind", scope: !445, file: !3, line: 1326, type: !75)
!445 = distinct !DILexicalBlock(scope: !430, file: !3, line: 1324, column: 5)
!446 = !DILocalVariable(name: "slash", scope: !445, file: !3, line: 1327, type: !84)
!447 = !DILocalVariable(name: "neweol", scope: !448, file: !3, line: 1410, type: !85)
!448 = distinct !DILexicalBlock(scope: !449, file: !3, line: 1409, column: 11)
!449 = distinct !DILexicalBlock(scope: !445, file: !3, line: 1335, column: 9)
!450 = !DILocalVariable(name: "buffer", scope: !451, file: !3, line: 1460, type: !453)
!451 = distinct !DILexicalBlock(scope: !452, file: !3, line: 1459, column: 13)
!452 = distinct !DILexicalBlock(scope: !449, file: !3, line: 1458, column: 15)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 168, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 21)
!456 = !DILocalVariable(name: "specified_buf_size", scope: !430, file: !3, line: 1581, type: !457)
!457 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!458 = !DILocalVariable(name: "b", scope: !430, file: !3, line: 1585, type: !62)
!459 = !DILocalVariable(name: "buf", scope: !430, file: !3, line: 1586, type: !84)
!460 = !DILocalVariable(name: "initial_read", scope: !430, file: !3, line: 1587, type: !64)
!461 = !DILocalVariable(name: "buffer", scope: !462, file: !3, line: 1600, type: !453)
!462 = distinct !DILexicalBlock(scope: !463, file: !3, line: 1599, column: 9)
!463 = distinct !DILexicalBlock(scope: !464, file: !3, line: 1598, column: 11)
!464 = distinct !DILexicalBlock(scope: !465, file: !3, line: 1590, column: 5)
!465 = distinct !DILexicalBlock(scope: !430, file: !3, line: 1589, column: 7)
!466 = !DILocalVariable(name: "act", scope: !467, file: !3, line: 1614, type: !243)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1613, column: 5)
!468 = distinct !DILexicalBlock(scope: !430, file: !3, line: 1612, column: 7)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 104, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 13)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "filter_command", scope: !2, file: !3, line: 53, type: !86, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "filter_pid", scope: !2, file: !3, line: 56, type: !75, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "oldblocked", scope: !2, file: !3, line: 64, type: !478, isLocal: true, isDefinition: true)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !479, line: 7, baseType: !336)
!479 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "newblocked", scope: !2, file: !3, line: 65, type: !478, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "outbase", scope: !2, file: !3, line: 68, type: !86, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !3, line: 71, type: !84, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "suffix_length", scope: !2, file: !3, line: 81, type: !64, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !2, file: !3, line: 87, type: !86, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !2, file: !3, line: 90, type: !86, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !2, file: !3, line: 96, type: !494, isLocal: true, isDefinition: true)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !495, line: 46, size: 1152, elements: !496)
!495 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!496 = !{!497, !499, !501, !503, !505, !506, !508, !509, !510, !511, !513, !515, !523, !524, !525}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !494, file: !495, line: 48, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !117, line: 145, baseType: !66)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !494, file: !495, line: 53, baseType: !500, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !117, line: 148, baseType: !66)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !494, file: !495, line: 61, baseType: !502, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !117, line: 151, baseType: !66)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !494, file: !495, line: 62, baseType: !504, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !117, line: 150, baseType: !6)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !494, file: !495, line: 64, baseType: !280, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !494, file: !495, line: 65, baseType: !507, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !117, line: 147, baseType: !6)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !494, file: !495, line: 67, baseType: !75, size: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !494, file: !495, line: 69, baseType: !498, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !494, file: !495, line: 74, baseType: !116, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !494, file: !495, line: 78, baseType: !512, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !117, line: 174, baseType: !118)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !494, file: !495, line: 80, baseType: !514, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !117, line: 179, baseType: !118)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !494, file: !495, line: 91, baseType: !516, size: 128, offset: 576)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !517, line: 10, size: 128, elements: !518)
!517 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!518 = !{!519, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !516, file: !517, line: 12, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !117, line: 160, baseType: !118)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !516, file: !517, line: 16, baseType: !522, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !117, line: 196, baseType: !118)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !494, file: !495, line: 92, baseType: !516, size: 128, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !494, file: !495, line: 93, baseType: !516, size: 128, offset: 832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !494, file: !495, line: 106, baseType: !526, size: 192, offset: 960)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 192, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 3)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 103, type: !457, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 106, type: !457, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "unbuffered", scope: !2, file: !3, line: 110, type: !457, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 132, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 4352, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 17)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 113, type: !75, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !2, file: !3, line: 84, type: !86, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !2, file: !3, line: 78, type: !457, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "sufindex", scope: !548, file: !3, line: 353, type: !63, isLocal: true, isDefinition: true)
!548 = distinct !DISubprogram(name: "next_file_name", scope: !3, file: !3, line: 350, type: !170, scopeLine: 351, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !549)
!549 = !{!550, !553, !556, !557, !559}
!550 = !DILocalVariable(name: "widen", scope: !551, file: !3, line: 360, type: !457)
!551 = distinct !DILexicalBlock(scope: !552, file: !3, line: 359, column: 5)
!552 = distinct !DILexicalBlock(scope: !548, file: !3, line: 358, column: 7)
!553 = !DILocalVariable(name: "i", scope: !554, file: !3, line: 411, type: !64)
!554 = distinct !DILexicalBlock(scope: !555, file: !3, line: 407, column: 9)
!555 = distinct !DILexicalBlock(scope: !551, file: !3, line: 406, column: 11)
!556 = !DILocalVariable(name: "sufindex_end", scope: !554, file: !3, line: 415, type: !63)
!557 = !DILocalVariable(name: "i", scope: !558, file: !3, line: 438, type: !64)
!558 = distinct !DILexicalBlock(scope: !552, file: !3, line: 435, column: 5)
!559 = !DILabel(scope: !551, name: "new_name", file: !3, line: 362)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "outbase_length", scope: !548, file: !3, line: 354, type: !64, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "outfile_length", scope: !548, file: !3, line: 355, type: !64, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !548, file: !3, line: 356, type: !64, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !2, file: !3, line: 75, type: !84, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !2, file: !3, line: 61, type: !64, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "open_pipes", scope: !2, file: !3, line: 59, type: !185, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !2, file: !3, line: 60, type: !64, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "output_desc", scope: !2, file: !3, line: 99, type: !75, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!577 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!578 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!579 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "Version", scope: !582, file: !583, line: 2, type: !86, isDefinition: true)
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, globals: !584, nameTableKind: None)
!583 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!584 = !{!580}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "file_name", scope: !587, file: !588, line: 46, type: !86, isLocal: true, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !589, globals: !627, nameTableKind: None)
!588 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = !{!590, !80, !626, !197}
!590 = !DISubprogram(name: "close_stream", scope: !591, file: !591, line: 2, type: !592, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!591 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!592 = !DISubroutineType(types: !593)
!593 = !{!75, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !95, line: 49, size: 1728, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !595, file: !95, line: 51, baseType: !75, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !595, file: !95, line: 54, baseType: !84, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !595, file: !95, line: 55, baseType: !84, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !595, file: !95, line: 56, baseType: !84, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !595, file: !95, line: 57, baseType: !84, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !595, file: !95, line: 58, baseType: !84, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !595, file: !95, line: 59, baseType: !84, size: 64, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !595, file: !95, line: 60, baseType: !84, size: 64, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !595, file: !95, line: 61, baseType: !84, size: 64, offset: 512)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !595, file: !95, line: 64, baseType: !84, size: 64, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !595, file: !95, line: 65, baseType: !84, size: 64, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !595, file: !95, line: 66, baseType: !84, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !595, file: !95, line: 68, baseType: !110, size: 64, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !595, file: !95, line: 70, baseType: !594, size: 64, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !595, file: !95, line: 72, baseType: !75, size: 32, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !595, file: !95, line: 73, baseType: !75, size: 32, offset: 928)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !595, file: !95, line: 74, baseType: !116, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !595, file: !95, line: 77, baseType: !120, size: 16, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !595, file: !95, line: 78, baseType: !122, size: 8, offset: 1040)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !595, file: !95, line: 79, baseType: !124, size: 8, offset: 1048)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !595, file: !95, line: 81, baseType: !128, size: 64, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !595, file: !95, line: 89, baseType: !131, size: 64, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !595, file: !95, line: 91, baseType: !133, size: 64, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !595, file: !95, line: 92, baseType: !136, size: 64, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !595, file: !95, line: 93, baseType: !594, size: 64, offset: 1344)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !595, file: !95, line: 94, baseType: !62, size: 64, offset: 1408)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !595, file: !95, line: 95, baseType: !64, size: 64, offset: 1472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !595, file: !95, line: 96, baseType: !75, size: 32, offset: 1536)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !595, file: !95, line: 98, baseType: !143, size: 160, offset: 1568)
!626 = !DISubprogram(name: "quotearg_colon", scope: !32, file: !32, line: 391, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!627 = !{!585, !628}
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !587, file: !588, line: 56, type: !457, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "exit_failure", scope: !632, file: !633, line: 24, type: !635, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, globals: !634, nameTableKind: None)
!633 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!634 = !{!630}
!635 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !75)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "program_name", scope: !638, file: !639, line: 33, type: !86, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !640, globals: !676, nameTableKind: None)
!639 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!640 = !{!62, !641, !84}
!641 = !DISubprogram(name: "fputs", scope: !90, file: !90, line: 626, type: !642, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!642 = !DISubroutineType(types: !643)
!643 = !{!75, !86, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !95, line: 49, size: 1728, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !645, file: !95, line: 51, baseType: !75, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !645, file: !95, line: 54, baseType: !84, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !645, file: !95, line: 55, baseType: !84, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !645, file: !95, line: 56, baseType: !84, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !645, file: !95, line: 57, baseType: !84, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !645, file: !95, line: 58, baseType: !84, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !645, file: !95, line: 59, baseType: !84, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !645, file: !95, line: 60, baseType: !84, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !645, file: !95, line: 61, baseType: !84, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !645, file: !95, line: 64, baseType: !84, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !645, file: !95, line: 65, baseType: !84, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !645, file: !95, line: 66, baseType: !84, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !645, file: !95, line: 68, baseType: !110, size: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !645, file: !95, line: 70, baseType: !644, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !645, file: !95, line: 72, baseType: !75, size: 32, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !645, file: !95, line: 73, baseType: !75, size: 32, offset: 928)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !645, file: !95, line: 74, baseType: !116, size: 64, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !645, file: !95, line: 77, baseType: !120, size: 16, offset: 1024)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !645, file: !95, line: 78, baseType: !122, size: 8, offset: 1040)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !645, file: !95, line: 79, baseType: !124, size: 8, offset: 1048)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !645, file: !95, line: 81, baseType: !128, size: 64, offset: 1088)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !645, file: !95, line: 89, baseType: !131, size: 64, offset: 1152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !645, file: !95, line: 91, baseType: !133, size: 64, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !645, file: !95, line: 92, baseType: !136, size: 64, offset: 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !645, file: !95, line: 93, baseType: !644, size: 64, offset: 1344)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !645, file: !95, line: 94, baseType: !62, size: 64, offset: 1408)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !645, file: !95, line: 95, baseType: !64, size: 64, offset: 1472)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !645, file: !95, line: 96, baseType: !75, size: 32, offset: 1536)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !645, file: !95, line: 98, baseType: !143, size: 160, offset: 1568)
!676 = !{!636}
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !679, file: !680, line: 85, type: !771, isDefinition: true)
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !681, retainedTypes: !687, globals: !744, nameTableKind: None)
!680 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!681 = !{!31, !682, !16}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !32, line: 242, baseType: !6, size: 32, elements: !683)
!683 = !{!684, !685, !686}
!684 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!685 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!686 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!687 = !{!688, !691, !373, !706, !75, !120, !709, !64, !726, !730, !80, !736, !740, !84, !223, !369, !370}
!688 = !DISubprogram(name: "xmemdup", scope: !58, file: !58, line: 62, type: !689, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!689 = !DISubroutineType(types: !690)
!690 = !{!62, !367, !66}
!691 = !DISubprogram(name: "quotearg_alloc_mem", scope: !32, file: !32, line: 342, type: !692, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!692 = !DISubroutineType(types: !693)
!693 = !{!84, !86, !66, !355, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !680, line: 65, size: 448, elements: !697)
!697 = !{!698, !699, !700, !704, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !696, file: !680, line: 68, baseType: !31, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !696, file: !680, line: 71, baseType: !75, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !696, file: !680, line: 75, baseType: !701, size: 256, offset: 64)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 8)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !696, file: !680, line: 78, baseType: !86, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !696, file: !680, line: 81, baseType: !86, size: 64, offset: 384)
!706 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !32, file: !32, line: 408, type: !707, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!707 = !DISubroutineType(types: !708)
!708 = !{!84, !75, !86, !86, !86, !66}
!709 = !DISubprogram(name: "rpl_mbrtowc", scope: !710, file: !710, line: 717, type: !711, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!710 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!711 = !DISubroutineType(types: !712)
!712 = !{!66, !185, !86, !66, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 13, size: 64, elements: !716)
!715 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !714, file: !715, line: 15, baseType: !75, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !714, file: !715, line: 20, baseType: !719, size: 32, offset: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !714, file: !715, line: 16, size: 32, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !719, file: !715, line: 18, baseType: !6, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !719, file: !715, line: 19, baseType: !723, size: 32)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 32, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 4)
!726 = !DISubprogram(name: "iswprint", scope: !727, file: !727, line: 120, type: !728, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!727 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!728 = !DISubroutineType(types: !729)
!729 = !{!75, !6}
!730 = !DISubprogram(name: "mbsinit", scope: !731, file: !731, line: 292, type: !732, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!731 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!732 = !DISubroutineType(types: !733)
!733 = !{!75, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!736 = !DISubprogram(name: "locale_charset", scope: !737, file: !737, line: 35, type: !738, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!737 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!738 = !DISubroutineType(types: !739)
!739 = !{!86}
!740 = !DISubprogram(name: "c_strcasecmp", scope: !741, file: !741, line: 42, type: !742, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!741 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!742 = !DISubroutineType(types: !743)
!743 = !{!75, !86, !86}
!744 = !{!677, !745, !751, !753, !755, !760, !767, !769}
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !679, file: !680, line: 101, type: !747, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 320, elements: !749)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!749 = !{!750}
!750 = !DISubrange(count: 10)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !679, file: !680, line: 1052, type: !696, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !679, file: !680, line: 116, type: !696, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "slot0", scope: !679, file: !680, line: 842, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 256)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "slotvec", scope: !679, file: !680, line: 845, type: !762, isLocal: true, isDefinition: true)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !680, line: 834, size: 128, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !763, file: !680, line: 836, baseType: !64, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !763, file: !680, line: 837, baseType: !84, size: 64, offset: 64)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "nslots", scope: !679, file: !680, line: 843, type: !75, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "slotvec0", scope: !679, file: !680, line: 844, type: !763, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 704, elements: !773)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!773 = !{!774}
!774 = !DISubrange(count: 11)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !777, file: !778, line: 26, type: !780, isDefinition: true)
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, globals: !779, nameTableKind: None)
!778 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!779 = !{!775}
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 376, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 47)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "numname_table", scope: !785, file: !786, line: 41, type: !789, isLocal: true, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !787, globals: !788, nameTableKind: None)
!786 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!787 = !{!6}
!788 = !{!783}
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 3360, elements: !795)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !786, line: 41, size: 96, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !790, file: !786, line: 41, baseType: !75, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !790, file: !786, line: 41, baseType: !794, size: 64, offset: 32)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 64, elements: !702)
!795 = !{!796}
!796 = !DISubrange(count: 35)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !799, file: !800, line: 507, type: !75, isLocal: true, isDefinition: true)
!799 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !800, file: !800, line: 488, type: !395, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !801, retainedNodes: !808)
!800 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !802, globals: !807, nameTableKind: None)
!802 = !{!803, !348}
!803 = !DISubprogram(name: "fcntl", scope: !804, file: !804, line: 176, type: !805, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!804 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!805 = !DISubroutineType(types: !806)
!806 = !{!75, !75, !75, null}
!807 = !{!797}
!808 = !{!809, !810, !811, !812, !815}
!809 = !DILocalVariable(name: "fd", arg: 1, scope: !799, file: !800, line: 488, type: !75)
!810 = !DILocalVariable(name: "target", arg: 2, scope: !799, file: !800, line: 488, type: !75)
!811 = !DILocalVariable(name: "result", scope: !799, file: !800, line: 490, type: !75)
!812 = !DILocalVariable(name: "flags", scope: !813, file: !800, line: 531, type: !75)
!813 = distinct !DILexicalBlock(scope: !814, file: !800, line: 530, column: 5)
!814 = distinct !DILexicalBlock(scope: !799, file: !800, line: 529, column: 7)
!815 = !DILocalVariable(name: "saved_errno", scope: !816, file: !800, line: 534, type: !75)
!816 = distinct !DILexicalBlock(scope: !817, file: !800, line: 533, column: 9)
!817 = distinct !DILexicalBlock(scope: !813, file: !800, line: 532, column: 11)
!818 = distinct !DICompileUnit(language: DW_LANG_C99, file: !819, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !820, nameTableKind: None)
!819 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!820 = !{!84}
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !823, nameTableKind: None)
!822 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!823 = !{!824, !825}
!824 = !DISubprogram(name: "open", scope: !804, file: !804, line: 196, type: !381, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!825 = !DISubprogram(name: "fd_safer", scope: !826, file: !826, line: 21, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!826 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!827 = distinct !DICompileUnit(language: DW_LANG_C99, file: !828, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !829, nameTableKind: None)
!828 = !DIFile(filename: "lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!829 = !{!824, !394, !348}
!830 = distinct !DICompileUnit(language: DW_LANG_C99, file: !831, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !832, nameTableKind: None)
!831 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!832 = !{!86, !833, !64}
!833 = !DISubprogram(name: "safe_write", scope: !834, file: !834, line: 37, type: !365, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!834 = !DIFile(filename: "./lib/safe-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !837, nameTableKind: None)
!836 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!837 = !{!202}
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !840, nameTableKind: None)
!839 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!840 = !{!841}
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !842, line: 40, baseType: !6, size: 32, elements: !843)
!842 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!843 = !{!844}
!844 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !840, retainedTypes: !847, nameTableKind: None)
!846 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!847 = !{!848}
!848 = !DISubprogram(name: "write", scope: !147, file: !147, line: 366, type: !849, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!849 = !DISubroutineType(types: !850)
!850 = !{!118, !75, !367, !66}
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !853, nameTableKind: None)
!852 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!853 = !{!854, !348}
!854 = !DISubprogram(name: "dup_safer", scope: !826, file: !826, line: 20, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !857, retainedTypes: !861, nameTableKind: None)
!856 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!857 = !{!858}
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !856, line: 40, baseType: !6, size: 32, elements: !859)
!859 = !{!860}
!860 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!861 = !{!80, !862, !62}
!862 = !DISubprogram(name: "fputs_unlocked", scope: !90, file: !90, line: 662, type: !863, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!863 = !DISubroutineType(types: !864)
!864 = !{!75, !86, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !95, line: 49, size: 1728, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !866, file: !95, line: 51, baseType: !75, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !866, file: !95, line: 54, baseType: !84, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !866, file: !95, line: 55, baseType: !84, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !866, file: !95, line: 56, baseType: !84, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !866, file: !95, line: 57, baseType: !84, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !866, file: !95, line: 58, baseType: !84, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !866, file: !95, line: 59, baseType: !84, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !866, file: !95, line: 60, baseType: !84, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !866, file: !95, line: 61, baseType: !84, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !866, file: !95, line: 64, baseType: !84, size: 64, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !866, file: !95, line: 65, baseType: !84, size: 64, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !866, file: !95, line: 66, baseType: !84, size: 64, offset: 704)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !866, file: !95, line: 68, baseType: !110, size: 64, offset: 768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !866, file: !95, line: 70, baseType: !865, size: 64, offset: 832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !866, file: !95, line: 72, baseType: !75, size: 32, offset: 896)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !866, file: !95, line: 73, baseType: !75, size: 32, offset: 928)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !866, file: !95, line: 74, baseType: !116, size: 64, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !866, file: !95, line: 77, baseType: !120, size: 16, offset: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !866, file: !95, line: 78, baseType: !122, size: 8, offset: 1040)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !866, file: !95, line: 79, baseType: !124, size: 8, offset: 1048)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !866, file: !95, line: 81, baseType: !128, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !866, file: !95, line: 89, baseType: !131, size: 64, offset: 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !866, file: !95, line: 91, baseType: !133, size: 64, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !866, file: !95, line: 92, baseType: !136, size: 64, offset: 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !866, file: !95, line: 93, baseType: !865, size: 64, offset: 1344)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !866, file: !95, line: 94, baseType: !62, size: 64, offset: 1408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !866, file: !95, line: 95, baseType: !64, size: 64, offset: 1472)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !866, file: !95, line: 96, baseType: !75, size: 32, offset: 1536)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !866, file: !95, line: 98, baseType: !143, size: 160, offset: 1568)
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !899, retainedTypes: !907, nameTableKind: None)
!898 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!899 = !{!900}
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !901, file: !58, line: 186, baseType: !6, size: 32, elements: !72)
!901 = distinct !DISubprogram(name: "x2nrealloc", scope: !58, file: !58, line: 174, type: !60, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !897, retainedNodes: !902)
!902 = !{!903, !904, !905, !906}
!903 = !DILocalVariable(name: "p", arg: 1, scope: !901, file: !58, line: 174, type: !62)
!904 = !DILocalVariable(name: "pn", arg: 2, scope: !901, file: !58, line: 174, type: !63)
!905 = !DILocalVariable(name: "s", arg: 3, scope: !901, file: !58, line: 174, type: !64)
!906 = !DILocalVariable(name: "n", scope: !901, file: !58, line: 176, type: !64)
!907 = !{!64, !369, !223, !370, !84, !373, !62, !376, !908}
!908 = !DISubprogram(name: "rpl_calloc", scope: !909, file: !909, line: 688, type: !377, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!909 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !912, nameTableKind: None)
!911 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!912 = !{!80, !197}
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !915, retainedTypes: !916, nameTableKind: None)
!914 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!915 = !{!45}
!916 = !{!351, !193, !197}
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !919, retainedTypes: !920, nameTableKind: None)
!918 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!919 = !{!45, !16}
!920 = !{!75, !120}
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !923, nameTableKind: None)
!922 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!923 = !{!62}
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !926, nameTableKind: None)
!925 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!926 = !{!927, !962, !356, !963}
!927 = !DISubprogram(name: "fileno", scope: !90, file: !90, line: 786, type: !928, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!928 = !DISubroutineType(types: !929)
!929 = !{!75, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !95, line: 49, size: 1728, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !931, file: !95, line: 51, baseType: !75, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !931, file: !95, line: 54, baseType: !84, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !931, file: !95, line: 55, baseType: !84, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !931, file: !95, line: 56, baseType: !84, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !931, file: !95, line: 57, baseType: !84, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !931, file: !95, line: 58, baseType: !84, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !931, file: !95, line: 59, baseType: !84, size: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !931, file: !95, line: 60, baseType: !84, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !931, file: !95, line: 61, baseType: !84, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !931, file: !95, line: 64, baseType: !84, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !931, file: !95, line: 65, baseType: !84, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !931, file: !95, line: 66, baseType: !84, size: 64, offset: 704)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !931, file: !95, line: 68, baseType: !110, size: 64, offset: 768)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !931, file: !95, line: 70, baseType: !930, size: 64, offset: 832)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !931, file: !95, line: 72, baseType: !75, size: 32, offset: 896)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !931, file: !95, line: 73, baseType: !75, size: 32, offset: 928)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !931, file: !95, line: 74, baseType: !116, size: 64, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !931, file: !95, line: 77, baseType: !120, size: 16, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !931, file: !95, line: 78, baseType: !122, size: 8, offset: 1040)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !931, file: !95, line: 79, baseType: !124, size: 8, offset: 1048)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !931, file: !95, line: 81, baseType: !128, size: 64, offset: 1088)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !931, file: !95, line: 89, baseType: !131, size: 64, offset: 1152)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !931, file: !95, line: 91, baseType: !133, size: 64, offset: 1216)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !931, file: !95, line: 92, baseType: !136, size: 64, offset: 1280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !931, file: !95, line: 93, baseType: !930, size: 64, offset: 1344)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !931, file: !95, line: 94, baseType: !62, size: 64, offset: 1408)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !931, file: !95, line: 95, baseType: !64, size: 64, offset: 1472)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !931, file: !95, line: 96, baseType: !75, size: 32, offset: 1536)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !931, file: !95, line: 98, baseType: !143, size: 160, offset: 1568)
!962 = !DISubprogram(name: "fclose", scope: !90, file: !90, line: 213, type: !928, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!963 = !DISubprogram(name: "rpl_fflush", scope: !412, file: !412, line: 718, type: !928, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !88, retainedTypes: !966, nameTableKind: None)
!965 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!966 = !{!62, !967, !1002}
!967 = !DISubprogram(name: "fflush", scope: !90, file: !90, line: 218, type: !968, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!968 = !DISubroutineType(types: !969)
!969 = !{!75, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !95, line: 49, size: 1728, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !971, file: !95, line: 51, baseType: !75, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !971, file: !95, line: 54, baseType: !84, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !971, file: !95, line: 55, baseType: !84, size: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !971, file: !95, line: 56, baseType: !84, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !971, file: !95, line: 57, baseType: !84, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !971, file: !95, line: 58, baseType: !84, size: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !971, file: !95, line: 59, baseType: !84, size: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !971, file: !95, line: 60, baseType: !84, size: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !971, file: !95, line: 61, baseType: !84, size: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !971, file: !95, line: 64, baseType: !84, size: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !971, file: !95, line: 65, baseType: !84, size: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !971, file: !95, line: 66, baseType: !84, size: 64, offset: 704)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !971, file: !95, line: 68, baseType: !110, size: 64, offset: 768)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !971, file: !95, line: 70, baseType: !970, size: 64, offset: 832)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !971, file: !95, line: 72, baseType: !75, size: 32, offset: 896)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !971, file: !95, line: 73, baseType: !75, size: 32, offset: 928)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !971, file: !95, line: 74, baseType: !116, size: 64, offset: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !971, file: !95, line: 77, baseType: !120, size: 16, offset: 1024)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !971, file: !95, line: 78, baseType: !122, size: 8, offset: 1040)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !971, file: !95, line: 79, baseType: !124, size: 8, offset: 1048)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !971, file: !95, line: 81, baseType: !128, size: 64, offset: 1088)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !971, file: !95, line: 89, baseType: !131, size: 64, offset: 1152)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !971, file: !95, line: 91, baseType: !133, size: 64, offset: 1216)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !971, file: !95, line: 92, baseType: !136, size: 64, offset: 1280)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !971, file: !95, line: 93, baseType: !970, size: 64, offset: 1344)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !971, file: !95, line: 94, baseType: !62, size: 64, offset: 1408)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !971, file: !95, line: 95, baseType: !64, size: 64, offset: 1472)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !971, file: !95, line: 96, baseType: !75, size: 32, offset: 1536)
