source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.saved_cwd = type { i32, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }

!34 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !54, !55, !56, !59, !60}
!39 = !DILocalVariable(name: "format", arg: 1, scope: !21, file: !3, line: 1227, type: !25)
!40 = !DILocalVariable(name: "fd", arg: 2, scope: !21, file: !3, line: 1227, type: !28)
!41 = !DILocalVariable(name: "filename", arg: 3, scope: !21, file: !3, line: 1227, type: !25)
!42 = !DILocalVariable(name: "print_func", arg: 4, scope: !21, file: !3, line: 1228, type: !29)
!43 = !DILocalVariable(name: "data", arg: 5, scope: !21, file: !3, line: 1230, type: !36)
!44 = !DILocalVariable(name: "fail", scope: !21, file: !3, line: 1232, type: !24)
!45 = !DILocalVariable(name: "n_alloc", scope: !21, file: !3, line: 1243, type: !33)
!46 = !DILocalVariable(name: "dest", scope: !21, file: !3, line: 1244, type: !32)
!47 = !DILocalVariable(name: "b", scope: !21, file: !3, line: 1245, type: !25)
!48 = !DILocalVariable(name: "len", scope: !49, file: !3, line: 1252, type: !33)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1251, column: 11)
!50 = distinct !DILexicalBlock(scope: !51, file: !3, line: 1249, column: 9)
!51 = distinct !DILexicalBlock(scope: !52, file: !3, line: 1247, column: 5)
!52 = distinct !DILexicalBlock(scope: !53, file: !3, line: 1246, column: 3)
!53 = distinct !DILexicalBlock(scope: !21, file: !3, line: 1246, column: 3)
!54 = !DILocalVariable(name: "fmt_char", scope: !49, file: !3, line: 1253, type: !25)
!55 = !DILocalVariable(name: "fmt_code", scope: !49, file: !3, line: 1258, type: !7)
!56 = !DILocalVariable(name: "esc_value", scope: !57, file: !3, line: 1294, type: !28)
!57 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1293, column: 13)
!58 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1292, column: 15)
!59 = !DILocalVariable(name: "esc_length", scope: !57, file: !3, line: 1295, type: !28)
!60 = !DILocalVariable(name: "esc_value", scope: !61, file: !3, line: 1306, type: !28)
!61 = distinct !DILexicalBlock(scope: !62, file: !3, line: 1305, column: 13)
!62 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1304, column: 20)
!63 = !{!64}
!64 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 46, baseType: !7, size: 32, elements: !67)
!66 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!68 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!69 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!70 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!71 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!72 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!73 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!74 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!75 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!76 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!80 = !{!32, !81, !25, !28, !82, !83, !84, !145, !33, !150, !7}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !86, file: !3, line: 825, baseType: !7)
!86 = distinct !DISubprogram(name: "print_statfs", scope: !3, file: !3, line: 807, type: !30, isLocal: true, isDefinition: true, scopeLine: 810, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !127, !128, !133, !137, !138, !140, !143}
!88 = !DILocalVariable(name: "pformat", arg: 1, scope: !86, file: !3, line: 807, type: !32)
!89 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !86, file: !3, line: 807, type: !33)
!90 = !DILocalVariable(name: "m", arg: 3, scope: !86, file: !3, line: 807, type: !7)
!91 = !DILocalVariable(name: "fd", arg: 4, scope: !86, file: !3, line: 808, type: !28)
!92 = !DILocalVariable(name: "filename", arg: 5, scope: !86, file: !3, line: 808, type: !25)
!93 = !DILocalVariable(name: "data", arg: 6, scope: !86, file: !3, line: 809, type: !36)
!94 = !DILocalVariable(name: "statfsbuf", scope: !86, file: !3, line: 811, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !98, line: 24, size: 960, elements: !99)
!98 = !DIFile(filename: "/usr/include/bits/statfs.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!99 = !{!100, !104, !105, !107, !108, !109, !111, !112, !120, !121, !122, !123}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !97, file: !98, line: 26, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !102, line: 189, baseType: !103)
!102 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !97, file: !98, line: 27, baseType: !101, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !97, file: !98, line: 29, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !102, line: 181, baseType: !35)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !97, file: !98, line: 30, baseType: !106, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !97, file: !98, line: 31, baseType: !106, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !97, file: !98, line: 32, baseType: !110, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !102, line: 185, baseType: !35)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !97, file: !98, line: 33, baseType: !110, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !97, file: !98, line: 41, baseType: !113, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !102, line: 153, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 153, size: 64, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !114, file: !102, line: 153, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !97, file: !98, line: 42, baseType: !101, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !97, file: !98, line: 43, baseType: !101, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !97, file: !98, line: 44, baseType: !101, size: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !97, file: !98, line: 45, baseType: !124, size: 256, offset: 704)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 256, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 4)
!127 = !DILocalVariable(name: "fail", scope: !86, file: !3, line: 812, type: !24)
!128 = !DILocalVariable(name: "p", scope: !129, file: !3, line: 829, type: !131)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 821, column: 7)
!130 = distinct !DILexicalBlock(scope: !86, file: !3, line: 815, column: 5)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!133 = !DILocalVariable(name: "fsid", scope: !129, file: !3, line: 833, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !135, line: 102, baseType: !136)
!135 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !102, line: 72, baseType: !35)
!137 = !DILocalVariable(name: "words", scope: !129, file: !3, line: 834, type: !28)
!138 = !DILocalVariable(name: "i", scope: !139, file: !3, line: 835, type: !28)
!139 = distinct !DILexicalBlock(scope: !129, file: !3, line: 835, column: 9)
!140 = !DILocalVariable(name: "u", scope: !141, file: !3, line: 837, type: !134)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 836, column: 11)
!142 = distinct !DILexicalBlock(scope: !139, file: !3, line: 835, column: 9)
!143 = !DILocalVariable(name: "frsize", scope: !144, file: !3, line: 872, type: !134)
!144 = distinct !DILexicalBlock(scope: !130, file: !3, line: 871, column: 7)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !147, line: 46, size: 1152, elements: !148)
!147 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!148 = !{!149, !151, !153, !155, !157, !159, !161, !162, !163, !165, !167, !169, !177, !178, !179}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !146, file: !147, line: 48, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !102, line: 143, baseType: !35)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !146, file: !147, line: 53, baseType: !152, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !102, line: 146, baseType: !35)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !146, file: !147, line: 61, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !102, line: 149, baseType: !35)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !146, file: !147, line: 62, baseType: !156, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !102, line: 148, baseType: !7)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !146, file: !147, line: 64, baseType: !158, size: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !102, line: 144, baseType: !7)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !146, file: !147, line: 65, baseType: !160, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !102, line: 145, baseType: !7)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !146, file: !147, line: 67, baseType: !28, size: 32, offset: 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !146, file: !147, line: 69, baseType: !150, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !146, file: !147, line: 74, baseType: !164, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 150, baseType: !103)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !146, file: !147, line: 78, baseType: !166, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !102, line: 172, baseType: !103)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !146, file: !147, line: 80, baseType: !168, size: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !102, line: 177, baseType: !103)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !146, file: !147, line: 91, baseType: !170, size: 128, offset: 576)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !171, line: 9, size: 128, elements: !172)
!171 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !170, file: !171, line: 11, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !102, line: 158, baseType: !103)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !170, file: !171, line: 12, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !102, line: 194, baseType: !103)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !146, file: !147, line: 92, baseType: !170, size: 128, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !146, file: !147, line: 93, baseType: !170, size: 128, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !146, file: !147, line: 106, baseType: !180, size: 192, offset: 960)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 192, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 3)
!183 = !{!184, !186, !188, !190, !0, !192, !197, !211, !213, !216, !221, !234, !246, !277, !279, !311}
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "follow_links", scope: !2, file: !3, line: 210, type: !24, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !2, file: !3, line: 214, type: !24, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 221, type: !25, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !2, file: !3, line: 222, type: !33, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "fmt_terse_fs", scope: !2, file: !3, line: 182, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 272, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 34)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 197, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 2048, elements: !209)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !202, line: 50, size: 256, elements: !203)
!202 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!203 = !{!204, !205, !206, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !202, line: 52, baseType: !25, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !201, file: !202, line: 55, baseType: !28, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !202, line: 56, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !201, file: !202, line: 57, baseType: !28, size: 32, offset: 192)
!209 = !{!210}
!210 = !DISubrange(count: 8)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !2, file: !3, line: 218, type: !25, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "printf_flags", scope: !2, file: !3, line: 179, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !209)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 171, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 88, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 11)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "buf", scope: !223, file: !3, line: 574, type: !231, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "human_fstype", scope: !3, file: !3, line: 231, type: !224, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!25, !95}
!226 = !{!227, !228}
!227 = !DILocalVariable(name: "statfsbuf", arg: 1, scope: !223, file: !3, line: 231, type: !95)
!228 = !DILocalVariable(name: "type", scope: !229, file: !3, line: 573, type: !35)
!229 = distinct !DILexicalBlock(scope: !230, file: !3, line: 572, column: 7)
!230 = distinct !DILexicalBlock(scope: !223, file: !3, line: 237, column: 5)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 232, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 29)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "modebuf", scope: !236, file: !3, line: 586, type: !243, isLocal: true, isDefinition: true)
!236 = distinct !DISubprogram(name: "human_access", scope: !3, file: !3, line: 584, type: !237, isLocal: true, isDefinition: true, scopeLine: 585, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !241)
!237 = !DISubroutineType(types: !238)
!238 = !{!32, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!241 = !{!242}
!242 = !DILocalVariable(name: "statbuf", arg: 1, scope: !236, file: !3, line: 584, type: !239)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 12)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "mount_list", scope: !248, file: !3, line: 899, type: !256, isLocal: true, isDefinition: true)
!248 = distinct !DISubprogram(name: "find_bind_mount", scope: !3, file: !3, line: 895, type: !249, isLocal: true, isDefinition: true, scopeLine: 896, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{!25, !25}
!251 = !{!252, !253, !254, !255, !271}
!252 = !DILocalVariable(name: "name", arg: 1, scope: !248, file: !3, line: 895, type: !25)
!253 = !DILocalVariable(name: "bind_mount", scope: !248, file: !3, line: 897, type: !25)
!254 = !DILocalVariable(name: "name_stats", scope: !248, file: !3, line: 908, type: !146)
!255 = !DILocalVariable(name: "me", scope: !248, file: !3, line: 912, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !258, line: 26, size: 448, elements: !259)
!258 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!259 = !{!260, !261, !262, !263, !264, !267, !268, !269, !270}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !257, file: !258, line: 28, baseType: !32, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !257, file: !258, line: 29, baseType: !32, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !257, file: !258, line: 30, baseType: !32, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !257, file: !258, line: 32, baseType: !32, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !257, file: !258, line: 33, baseType: !265, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !266, line: 59, baseType: !150)
!266 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!267 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !257, file: !258, line: 34, baseType: !7, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !257, file: !258, line: 35, baseType: !7, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !257, file: !258, line: 36, baseType: !7, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !257, file: !258, line: 37, baseType: !256, size: 64, offset: 384)
!271 = !DILocalVariable(name: "dev_stats", scope: !272, file: !3, line: 918, type: !146)
!272 = distinct !DILexicalBlock(scope: !273, file: !3, line: 917, column: 9)
!273 = distinct !DILexicalBlock(scope: !274, file: !3, line: 915, column: 11)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 914, column: 5)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 913, column: 3)
!276 = distinct !DILexicalBlock(scope: !248, file: !3, line: 913, column: 3)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !248, file: !3, line: 900, type: !24, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "str", scope: !281, file: !3, line: 598, type: !308, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "human_time", scope: !3, file: !3, line: 593, type: !282, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !284)
!282 = !DISubroutineType(types: !283)
!283 = !{!32, !170}
!284 = !{!285, !286, !301, !302}
!285 = !DILocalVariable(name: "t", arg: 1, scope: !281, file: !3, line: 593, type: !170)
!286 = !DILocalVariable(name: "tm", scope: !281, file: !3, line: 605, type: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !288, line: 7, size: 448, elements: !289)
!288 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !287, file: !288, line: 9, baseType: !28, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !287, file: !288, line: 10, baseType: !28, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !287, file: !288, line: 11, baseType: !28, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !287, file: !288, line: 12, baseType: !28, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !287, file: !288, line: 13, baseType: !28, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !287, file: !288, line: 14, baseType: !28, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !287, file: !288, line: 15, baseType: !28, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !287, file: !288, line: 16, baseType: !28, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !287, file: !288, line: 17, baseType: !28, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !287, file: !288, line: 20, baseType: !103, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !287, file: !288, line: 21, baseType: !25, size: 64, offset: 384)
!301 = !DILocalVariable(name: "ns", scope: !281, file: !3, line: 606, type: !28)
!302 = !DILocalVariable(name: "secbuf", scope: !303, file: !3, line: 611, type: !305)
!303 = distinct !DILexicalBlock(scope: !304, file: !3, line: 610, column: 5)
!304 = distinct !DILexicalBlock(scope: !281, file: !3, line: 607, column: 7)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 21)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 488, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 61)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "tz", scope: !281, file: !3, line: 602, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !314, line: 742, baseType: !315)
!314 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !314, line: 742, flags: DIFlagFwdDecl)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 392, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 49)
!320 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!321 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!322 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "Version", scope: !325, file: !326, line: 2, type: !25, isDefinition: true)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !328)
!326 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!327 = !{}
!328 = !{!323}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !331, file: !336, line: 69, type: !337, isDefinition: true)
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !333, retainedTypes: !334, globals: !335)
!332 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!333 = !{!5}
!334 = !{!81, !83}
!335 = !{!329}
!336 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !338, line: 55, baseType: !339)
!338 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "file_name", scope: !344, file: !349, line: 46, type: !25, isLocal: true, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !346)
!345 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!346 = !{!342, !347}
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !344, file: !349, line: 56, type: !24, isLocal: true, isDefinition: true)
!349 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "exit_failure", scope: !352, file: !355, line: 24, type: !356, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !354)
!353 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!354 = !{!350}
!355 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "program_name", scope: !359, file: !363, line: 33, type: !25, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !361, globals: !362)
!360 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!361 = !{!81, !32}
!362 = !{!357}
!363 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !366, file: !378, line: 85, type: !411, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !368, retainedTypes: !374, globals: !375)
!367 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!368 = !{!5, !369, !65}
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !370)
!370 = !{!371, !372, !373}
!371 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!373 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!374 = !{!28, !82, !33, !32}
!375 = !{!364, !376, !383, !393, !395, !400, !407, !409}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !366, file: !378, line: 101, type: !379, isDefinition: true)
!378 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 320, elements: !381)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!381 = !{!382}
!382 = !DISubrange(count: 10)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !366, file: !378, line: 1052, type: !385, isDefinition: true)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !378, line: 65, size: 448, elements: !386)
!386 = !{!387, !388, !389, !391, !392}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !385, file: !378, line: 68, baseType: !5, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !385, file: !378, line: 71, baseType: !28, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !385, file: !378, line: 75, baseType: !390, size: 256, offset: 64)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !209)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !385, file: !378, line: 78, baseType: !25, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !385, file: !378, line: 81, baseType: !25, size: 64, offset: 384)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !366, file: !378, line: 116, type: !385, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "slot0", scope: !366, file: !378, line: 842, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 256)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "slotvec", scope: !366, file: !378, line: 845, type: !402, isLocal: true, isDefinition: true)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !378, line: 834, size: 128, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !403, file: !378, line: 836, baseType: !33, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !403, file: !378, line: 837, baseType: !32, size: 64, offset: 64)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "nslots", scope: !366, file: !378, line: 843, type: !28, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "slotvec0", scope: !366, file: !378, line: 844, type: !403, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 704, elements: !219)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !415, file: !418, line: 26, type: !419, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !417)
!416 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!417 = !{!413}
!418 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 376, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 47)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !424, file: !425, line: 339, type: !28, isLocal: true, isDefinition: true)
!424 = distinct !DISubprogram(name: "rpl_fcntl", scope: !425, file: !425, line: 276, type: !426, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !428, retainedNodes: !431)
!425 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!426 = !DISubroutineType(types: !427)
!427 = !{!28, !28, !28, null}
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !430)
!429 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!430 = !{!422}
!431 = !{!432, !433, !434, !447, !448, !451, !454, !457}
!432 = !DILocalVariable(name: "fd", arg: 1, scope: !424, file: !425, line: 276, type: !28)
!433 = !DILocalVariable(name: "action", arg: 2, scope: !424, file: !425, line: 276, type: !28)
!434 = !DILocalVariable(name: "arg", scope: !424, file: !425, line: 278, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !436, line: 30, baseType: !437)
!436 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !429, line: 278, baseType: !438)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 192, elements: !445)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !429, line: 278, size: 192, elements: !440)
!440 = !{!441, !442, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !439, file: !429, line: 278, baseType: !7, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !439, file: !429, line: 278, baseType: !7, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !439, file: !429, line: 278, baseType: !81, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !439, file: !429, line: 278, baseType: !81, size: 64, offset: 128)
!445 = !{!446}
!446 = !DISubrange(count: 1)
!447 = !DILocalVariable(name: "result", scope: !424, file: !425, line: 279, type: !28)
!448 = !DILocalVariable(name: "target", scope: !449, file: !425, line: 326, type: !28)
!449 = distinct !DILexicalBlock(scope: !450, file: !425, line: 325, column: 7)
!450 = distinct !DILexicalBlock(scope: !424, file: !425, line: 282, column: 5)
!451 = !DILocalVariable(name: "flags", scope: !452, file: !425, line: 363, type: !28)
!452 = distinct !DILexicalBlock(scope: !453, file: !425, line: 362, column: 11)
!453 = distinct !DILexicalBlock(scope: !449, file: !425, line: 361, column: 13)
!454 = !DILocalVariable(name: "saved_errno", scope: !455, file: !425, line: 366, type: !28)
!455 = distinct !DILexicalBlock(scope: !456, file: !425, line: 365, column: 15)
!456 = distinct !DILexicalBlock(scope: !452, file: !425, line: 364, column: 17)
!457 = !DILocalVariable(name: "p", scope: !458, file: !425, line: 408, type: !81)
!458 = distinct !DILexicalBlock(scope: !450, file: !425, line: 406, column: 7)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !333, retainedTypes: !461)
!460 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!461 = !{!32}
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !464)
!463 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!464 = !{!81}
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!466 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!468 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !461)
!470 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!472 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!474 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !477)
!476 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !135, line: 101, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !102, line: 71, baseType: !103)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !482)
!481 = !DIFile(filename: "./lib/nstrftime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!482 = !{!25, !7, !33, !81, !36, !28, !83}
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!484 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !487, retainedTypes: !464)
!486 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!487 = !{!488}
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !489, line: 41, baseType: !7, size: 32, elements: !490)
!489 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!490 = !{!491}
!491 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !494, retainedTypes: !508)
!493 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!494 = !{!495}
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !497, file: !496, line: 186, baseType: !7, size: 32, elements: !506)
!496 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!497 = distinct !DISubprogram(name: "x2nrealloc", scope: !496, file: !496, line: 174, type: !498, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !492, retainedNodes: !501)
!498 = !DISubroutineType(types: !499)
!499 = !{!81, !81, !500, !33}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!501 = !{!502, !503, !504, !505}
!502 = !DILocalVariable(name: "p", arg: 1, scope: !497, file: !496, line: 174, type: !81)
!503 = !DILocalVariable(name: "pn", arg: 2, scope: !497, file: !496, line: 174, type: !500)
!504 = !DILocalVariable(name: "s", arg: 3, scope: !497, file: !496, line: 174, type: !33)
!505 = !DILocalVariable(name: "n", scope: !497, file: !496, line: 176, type: !33)
!506 = !{!507}
!507 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!508 = !{!33, !32, !81}
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!510 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!512 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!514 = !DIFile(filename: "./lib/xasprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !464)
!516 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !361)
!518 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !521)
!520 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!521 = !{!33}
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !524)
!523 = !DIFile(filename: "./lib/mountlist.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!524 = !{!81, !150}
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !527, retainedTypes: !532, globals: !533)
!526 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!527 = !{!528}
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !529, line: 50, baseType: !7, size: 32, elements: !530)
!529 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!530 = !{!531}
!531 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!532 = !{!32, !33}
!533 = !{!534}
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "local_tz", scope: !525, file: !529, line: 55, type: !536, isLocal: true, isDefinition: true)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !314, line: 742, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !540, line: 21, size: 128, elements: !541)
!540 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !540, line: 25, baseType: !538, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !539, file: !540, line: 36, baseType: !27, size: 8, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !539, file: !540, line: 48, baseType: !545, offset: 72)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: -1)
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!549 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!551 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!553 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !556, retainedTypes: !464)
!555 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!556 = !{!557}
!557 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !558, line: 41, baseType: !7, size: 32, elements: !559)
!558 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942}
!560 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!561 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!562 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!563 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!564 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!565 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!566 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!567 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!568 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!569 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!570 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!571 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!572 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!573 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!574 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!575 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!576 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!577 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!578 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!579 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!580 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!581 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!582 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!583 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!584 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!585 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!586 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!587 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!588 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!589 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!590 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!591 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!592 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!593 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!594 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!595 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!596 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!597 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!598 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!599 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!600 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!601 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!602 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!603 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!604 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!605 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!606 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!607 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!608 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!609 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!668 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!671 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!672 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!673 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!674 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!675 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!676 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!677 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!678 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!679 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!680 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!681 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!682 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!755 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!828 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!829 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!830 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!831 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!832 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!833 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!834 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!835 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!836 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!837 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!838 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!839 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!840 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!841 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!842 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!844 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!845 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!846 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!847 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!848 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!849 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!875 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!876 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!877 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!878 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!879 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!884 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!885 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!886 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!887 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!944 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !461)
!946 = !DIFile(filename: "./lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!948 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !464)
!950 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !464)
!952 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!953 = distinct !DICompileUnit(language: DW_LANG_C99, file: !954, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!954 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!955 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!956 = !{i32 2, !"Dwarf Version", i32 4}
!957 = !{i32 2, !"Debug Info Version", i32 3}
!958 = !{i32 1, !"wchar_size", i32 4}
!959 = !{i32 7, !"PIC Level", i32 2}
!960 = !{i32 7, !"PIE Level", i32 2}
!961 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1491, type: !962, isDefinition: true, scopeLine: 1492, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !28}
!964 = !{!965}
!965 = !DILocalVariable(name: "status", arg: 1, scope: !961, file: !3, line: 1491, type: !28)
!966 = !DILocalVariable(name: "infomap", scope: !967, file: !968, line: 632, type: !982)
!967 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !968, file: !968, line: 630, type: !969, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !971)
!968 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!969 = !DISubroutineType(types: !970)
!970 = !{null, !25}
!971 = !{!972, !966, !973, !974, !981}
!972 = !DILocalVariable(name: "program", arg: 1, scope: !967, file: !968, line: 630, type: !25)
!973 = !DILocalVariable(name: "node", scope: !967, file: !968, line: 642, type: !25)
!974 = !DILocalVariable(name: "map_prog", scope: !967, file: !968, line: 643, type: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !967, file: !968, line: 632, size: 128, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !977, file: !968, line: 632, baseType: !25, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !977, file: !968, line: 632, baseType: !25, size: 64, offset: 64)
!981 = !DILocalVariable(name: "lc_messages", scope: !967, file: !968, line: 655, type: !25)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 896, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 7)
!985 = !DILocation(line: 632, column: 67, scope: !967, inlinedAt: !986)
!986 = distinct !DILocation(line: 1597, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1496, column: 5)
!988 = distinct !DILexicalBlock(scope: !961, file: !3, line: 1493, column: 7)
!989 = !DILocation(line: 1491, column: 12, scope: !961)
!990 = !DILocation(line: 1493, column: 14, scope: !988)
!991 = !DILocation(line: 1493, column: 7, scope: !961)
!992 = !DILocation(line: 1494, column: 5, scope: !993)
!993 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1494, column: 5)
!994 = !{!995, !995, i64 0}
!995 = !{!"any pointer", !996, i64 0}
!996 = !{!"omnipotent char", !997, i64 0}
!997 = !{!"Simple C/C++ TBAA"}
!998 = !DILocation(line: 1497, column: 7, scope: !987)
!999 = !DILocation(line: 1498, column: 7, scope: !987)
!1000 = !DILocation(line: 587, column: 3, scope: !1001, inlinedAt: !1002)
!1001 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !968, file: !968, line: 585, type: !340, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !327)
!1002 = distinct !DILocation(line: 1502, column: 7, scope: !987)
!1003 = !DILocation(line: 1504, column: 7, scope: !987)
!1004 = !DILocation(line: 1508, column: 7, scope: !987)
!1005 = !DILocation(line: 1516, column: 7, scope: !987)
!1006 = !DILocation(line: 1517, column: 7, scope: !987)
!1007 = !DILocation(line: 1519, column: 7, scope: !987)
!1008 = !DILocation(line: 1528, column: 7, scope: !987)
!1009 = !DILocation(line: 1536, column: 7, scope: !987)
!1010 = !DILocation(line: 1547, column: 7, scope: !987)
!1011 = !DILocation(line: 1561, column: 7, scope: !987)
!1012 = !DILocation(line: 1570, column: 7, scope: !987)
!1013 = !DILocation(line: 1580, column: 7, scope: !987)
!1014 = !DILocation(line: 1591, column: 9, scope: !987)
!1015 = !DILocation(line: 1596, column: 7, scope: !987)
!1016 = !DILocation(line: 632, column: 3, scope: !967, inlinedAt: !986)
!1017 = !DILocation(line: 643, column: 36, scope: !967, inlinedAt: !986)
!1018 = !DILocation(line: 643, column: 25, scope: !967, inlinedAt: !986)
!1019 = !DILocation(line: 645, column: 33, scope: !967, inlinedAt: !986)
!1020 = !DILocation(line: 645, column: 3, scope: !967, inlinedAt: !986)
!1021 = !DILocation(line: 646, column: 13, scope: !967, inlinedAt: !986)
!1022 = !DILocation(line: 645, column: 20, scope: !967, inlinedAt: !986)
!1023 = !{!1024, !995, i64 0}
!1024 = !{!"infomap", !995, i64 0, !995, i64 8}
!1025 = !DILocation(line: 645, column: 10, scope: !967, inlinedAt: !986)
!1026 = !DILocation(line: 645, column: 28, scope: !967, inlinedAt: !986)
!1027 = distinct !{!1027, !1028, !1029}
!1028 = !DILocation(line: 645, column: 3, scope: !967)
!1029 = !DILocation(line: 646, column: 13, scope: !967)
!1030 = !DILocation(line: 648, column: 17, scope: !1031, inlinedAt: !986)
!1031 = distinct !DILexicalBlock(scope: !967, file: !968, line: 648, column: 7)
!1032 = !{!1024, !995, i64 8}
!1033 = !DILocation(line: 648, column: 7, scope: !1031, inlinedAt: !986)
!1034 = !DILocation(line: 648, column: 7, scope: !967, inlinedAt: !986)
!1035 = !DILocation(line: 642, column: 15, scope: !967, inlinedAt: !986)
!1036 = !DILocation(line: 651, column: 3, scope: !967, inlinedAt: !986)
!1037 = !DILocation(line: 655, column: 29, scope: !967, inlinedAt: !986)
!1038 = !DILocation(line: 655, column: 15, scope: !967, inlinedAt: !986)
!1039 = !DILocation(line: 656, column: 7, scope: !1040, inlinedAt: !986)
!1040 = distinct !DILexicalBlock(scope: !967, file: !968, line: 656, column: 7)
!1041 = !DILocation(line: 656, column: 19, scope: !1040, inlinedAt: !986)
!1042 = !DILocation(line: 656, column: 22, scope: !1040, inlinedAt: !986)
!1043 = !DILocation(line: 656, column: 7, scope: !967, inlinedAt: !986)
!1044 = !DILocation(line: 662, column: 7, scope: !1045, inlinedAt: !986)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !968, line: 657, column: 5)
!1046 = !DILocation(line: 664, column: 5, scope: !1045, inlinedAt: !986)
!1047 = !DILocation(line: 665, column: 3, scope: !967, inlinedAt: !986)
!1048 = !DILocation(line: 667, column: 3, scope: !967, inlinedAt: !986)
!1049 = !DILocation(line: 669, column: 1, scope: !967, inlinedAt: !986)
!1050 = !DILocation(line: 1599, column: 3, scope: !961)
!1051 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1603, type: !1052, isDefinition: true, scopeLine: 1604, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1055)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!28, !28, !1054}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1094}
!1056 = !DILocalVariable(name: "argc", arg: 1, scope: !1051, file: !3, line: 1603, type: !28)
!1057 = !DILocalVariable(name: "argv", arg: 2, scope: !1051, file: !3, line: 1603, type: !1054)
!1058 = !DILocalVariable(name: "c", scope: !1051, file: !3, line: 1605, type: !28)
!1059 = !DILocalVariable(name: "fs", scope: !1051, file: !3, line: 1606, type: !24)
!1060 = !DILocalVariable(name: "terse", scope: !1051, file: !3, line: 1607, type: !24)
!1061 = !DILocalVariable(name: "format", scope: !1051, file: !3, line: 1608, type: !32)
!1062 = !DILocalVariable(name: "format2", scope: !1051, file: !3, line: 1609, type: !32)
!1063 = !DILocalVariable(name: "ok", scope: !1051, file: !3, line: 1610, type: !24)
!1064 = !DILocalVariable(name: "locale", scope: !1051, file: !3, line: 1618, type: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !1068, line: 51, size: 768, elements: !1069)
!1068 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !1067, file: !1068, line: 55, baseType: !32, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !1067, file: !1068, line: 56, baseType: !32, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !1067, file: !1068, line: 62, baseType: !32, size: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !1067, file: !1068, line: 68, baseType: !32, size: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !1067, file: !1068, line: 69, baseType: !32, size: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !1067, file: !1068, line: 70, baseType: !32, size: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !1067, file: !1068, line: 71, baseType: !32, size: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !1067, file: !1068, line: 72, baseType: !32, size: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !1067, file: !1068, line: 73, baseType: !32, size: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !1067, file: !1068, line: 74, baseType: !32, size: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !1067, file: !1068, line: 75, baseType: !27, size: 8, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !1067, file: !1068, line: 76, baseType: !27, size: 8, offset: 648)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !1067, file: !1068, line: 78, baseType: !27, size: 8, offset: 656)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !1067, file: !1068, line: 80, baseType: !27, size: 8, offset: 664)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !1067, file: !1068, line: 82, baseType: !27, size: 8, offset: 672)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !1067, file: !1068, line: 84, baseType: !27, size: 8, offset: 680)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !1067, file: !1068, line: 91, baseType: !27, size: 8, offset: 688)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !1067, file: !1068, line: 92, baseType: !27, size: 8, offset: 696)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !1067, file: !1068, line: 95, baseType: !27, size: 8, offset: 704)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !1067, file: !1068, line: 97, baseType: !27, size: 8, offset: 712)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !1067, file: !1068, line: 99, baseType: !27, size: 8, offset: 720)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !1067, file: !1068, line: 101, baseType: !27, size: 8, offset: 728)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !1067, file: !1068, line: 108, baseType: !27, size: 8, offset: 736)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !1067, file: !1068, line: 109, baseType: !27, size: 8, offset: 744)
!1094 = !DILocalVariable(name: "i", scope: !1095, file: !3, line: 1679, type: !28)
!1095 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 1679, column: 3)
!1096 = !DILocation(line: 1603, column: 11, scope: !1051)
!1097 = !DILocation(line: 1603, column: 23, scope: !1051)
!1098 = !DILocation(line: 1606, column: 8, scope: !1051)
!1099 = !DILocation(line: 1607, column: 8, scope: !1051)
!1100 = !DILocation(line: 1608, column: 9, scope: !1051)
!1101 = !DILocation(line: 1610, column: 8, scope: !1051)
!1102 = !DILocation(line: 1613, column: 21, scope: !1051)
