source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.print_args = type { %struct.stat*, %struct.timespec }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.saved_cwd = type { i32, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!25 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !26, file: !3, line: 1122, baseType: !6, size: 32, elements: !67)
!26 = distinct !DISubprogram(name: "print_it", scope: !3, file: !3, line: 1113, type: !27, scopeLine: 1117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !43)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !30, !33, !30, !34, !41}
!29 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!29, !37, !38, !6, !33, !30, !41}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !59, !60, !63, !64}
!44 = !DILocalVariable(name: "format", arg: 1, scope: !26, file: !3, line: 1113, type: !30)
!45 = !DILocalVariable(name: "fd", arg: 2, scope: !26, file: !3, line: 1113, type: !33)
!46 = !DILocalVariable(name: "filename", arg: 3, scope: !26, file: !3, line: 1113, type: !30)
!47 = !DILocalVariable(name: "print_func", arg: 4, scope: !26, file: !3, line: 1114, type: !34)
!48 = !DILocalVariable(name: "data", arg: 5, scope: !26, file: !3, line: 1116, type: !41)
!49 = !DILocalVariable(name: "fail", scope: !26, file: !3, line: 1118, type: !29)
!50 = !DILocalVariable(name: "n_alloc", scope: !26, file: !3, line: 1129, type: !38)
!51 = !DILocalVariable(name: "dest", scope: !26, file: !3, line: 1130, type: !37)
!52 = !DILocalVariable(name: "b", scope: !26, file: !3, line: 1131, type: !30)
!53 = !DILocalVariable(name: "len", scope: !54, file: !3, line: 1138, type: !38)
!54 = distinct !DILexicalBlock(scope: !55, file: !3, line: 1137, column: 11)
!55 = distinct !DILexicalBlock(scope: !56, file: !3, line: 1135, column: 9)
!56 = distinct !DILexicalBlock(scope: !57, file: !3, line: 1133, column: 5)
!57 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1132, column: 3)
!58 = distinct !DILexicalBlock(scope: !26, file: !3, line: 1132, column: 3)
!59 = !DILocalVariable(name: "fmt_char", scope: !54, file: !3, line: 1139, type: !30)
!60 = !DILocalVariable(name: "esc_value", scope: !61, file: !3, line: 1175, type: !33)
!61 = distinct !DILexicalBlock(scope: !62, file: !3, line: 1174, column: 13)
!62 = distinct !DILexicalBlock(scope: !55, file: !3, line: 1173, column: 15)
!63 = !DILocalVariable(name: "esc_length", scope: !61, file: !3, line: 1176, type: !33)
!64 = !DILocalVariable(name: "esc_value", scope: !65, file: !3, line: 1187, type: !33)
!65 = distinct !DILexicalBlock(scope: !66, file: !3, line: 1186, column: 13)
!66 = distinct !DILexicalBlock(scope: !62, file: !3, line: 1185, column: 20)
!67 = !{!68}
!68 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 46, baseType: !6, size: 32, elements: !71)
!70 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!72 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!73 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!74 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!75 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!76 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!77 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!78 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!79 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!80 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!83 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!84 = !{!85, !90, !148, !152, !156, !159, !162, !192, !199, !41, !37, !141, !214, !218, !222, !223, !229, !234, !238, !240, !244, !247, !250, !283, !33, !121, !286, !287, !318, !364, !365, !406, !411, !415, !421, !435, !38, !447, !451, !452, !456, !474, !480, !500, !506, !6}
!85 = !DISubprogram(name: "dcgettext", scope: !86, file: !86, line: 51, type: !87, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!86 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!87 = !DISubroutineType(types: !88)
!88 = !{!37, !30, !30, !33}
!89 = !{}
!90 = !DISubprogram(name: "fputs_unlocked", scope: !91, file: !91, line: 662, type: !92, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!91 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!33, !30, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !96, line: 49, size: 1728, elements: !97)
!96 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !113, !114, !115, !116, !120, !122, !124, !128, !131, !133, !136, !139, !140, !142, !143, !144}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !95, file: !96, line: 51, baseType: !33, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !95, file: !96, line: 54, baseType: !37, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !95, file: !96, line: 55, baseType: !37, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !95, file: !96, line: 56, baseType: !37, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !95, file: !96, line: 57, baseType: !37, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !95, file: !96, line: 58, baseType: !37, size: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !95, file: !96, line: 59, baseType: !37, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !95, file: !96, line: 60, baseType: !37, size: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !95, file: !96, line: 61, baseType: !37, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !95, file: !96, line: 64, baseType: !37, size: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !95, file: !96, line: 65, baseType: !37, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !95, file: !96, line: 66, baseType: !37, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !95, file: !96, line: 68, baseType: !111, size: 64, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !96, line: 36, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !95, file: !96, line: 70, baseType: !94, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !95, file: !96, line: 72, baseType: !33, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !95, file: !96, line: 73, baseType: !33, size: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !95, file: !96, line: 74, baseType: !117, size: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 152, baseType: !119)
!118 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!119 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !95, file: !96, line: 77, baseType: !121, size: 16, offset: 1024)
!121 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !95, file: !96, line: 78, baseType: !123, size: 8, offset: 1040)
!123 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !95, file: !96, line: 79, baseType: !125, size: 8, offset: 1048)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !95, file: !96, line: 81, baseType: !129, size: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !96, line: 43, baseType: null)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !95, file: !96, line: 89, baseType: !132, size: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !118, line: 153, baseType: !119)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !95, file: !96, line: 91, baseType: !134, size: 64, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !96, line: 37, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !95, file: !96, line: 92, baseType: !137, size: 64, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !96, line: 38, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !95, file: !96, line: 93, baseType: !94, size: 64, offset: 1344)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !95, file: !96, line: 94, baseType: !141, size: 64, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !95, file: !96, line: 95, baseType: !38, size: 64, offset: 1472)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !95, file: !96, line: 96, baseType: !33, size: 32, offset: 1536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !95, file: !96, line: 98, baseType: !145, size: 160, offset: 1568)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 20)
!148 = !DISubprogram(name: "set_program_name", scope: !149, file: !149, line: 37, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!149 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubroutineType(types: !151)
!151 = !{null, !30}
!152 = !DISubprogram(name: "setlocale", scope: !153, file: !153, line: 122, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!153 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!37, !33, !30}
!156 = !DISubprogram(name: "bindtextdomain", scope: !86, file: !86, line: 86, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!157 = !DISubroutineType(types: !158)
!158 = !{!37, !30, !30}
!159 = !DISubprogram(name: "textdomain", scope: !86, file: !86, line: 82, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!160 = !DISubroutineType(types: !161)
!161 = !{!37, !30}
!162 = !DISubprogram(name: "localeconv", scope: !153, file: !153, line: 125, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!163 = !DISubroutineType(types: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !153, line: 51, size: 768, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !166, file: !153, line: 55, baseType: !37, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !166, file: !153, line: 56, baseType: !37, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !166, file: !153, line: 62, baseType: !37, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !166, file: !153, line: 68, baseType: !37, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !166, file: !153, line: 69, baseType: !37, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !166, file: !153, line: 70, baseType: !37, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !166, file: !153, line: 71, baseType: !37, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !166, file: !153, line: 72, baseType: !37, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !166, file: !153, line: 73, baseType: !37, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !166, file: !153, line: 74, baseType: !37, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !166, file: !153, line: 75, baseType: !32, size: 8, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !166, file: !153, line: 76, baseType: !32, size: 8, offset: 648)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !166, file: !153, line: 78, baseType: !32, size: 8, offset: 656)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !166, file: !153, line: 80, baseType: !32, size: 8, offset: 664)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !166, file: !153, line: 82, baseType: !32, size: 8, offset: 672)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !166, file: !153, line: 84, baseType: !32, size: 8, offset: 680)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !166, file: !153, line: 91, baseType: !32, size: 8, offset: 688)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !166, file: !153, line: 92, baseType: !32, size: 8, offset: 696)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !166, file: !153, line: 95, baseType: !32, size: 8, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !166, file: !153, line: 97, baseType: !32, size: 8, offset: 712)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !166, file: !153, line: 99, baseType: !32, size: 8, offset: 720)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !166, file: !153, line: 101, baseType: !32, size: 8, offset: 728)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !166, file: !153, line: 108, baseType: !32, size: 8, offset: 736)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !166, file: !153, line: 109, baseType: !32, size: 8, offset: 744)
!192 = !DISubprogram(name: "atexit", scope: !193, file: !193, line: 595, type: !194, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!193 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!194 = !DISubroutineType(types: !195)
!195 = !{!33, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null}
!199 = !DISubprogram(name: "getopt_long", scope: !200, file: !200, line: 66, type: !201, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!200 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!201 = !DISubroutineType(types: !202)
!202 = !{!33, !33, !203, !30, !205, !212}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !200, line: 50, size: 256, elements: !208)
!208 = !{!209, !210, !211, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !200, line: 52, baseType: !30, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !207, file: !200, line: 55, baseType: !33, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !207, file: !200, line: 56, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !207, file: !200, line: 57, baseType: !33, size: 32, offset: 192)
!214 = !DISubprogram(name: "version_etc", scope: !215, file: !215, line: 69, type: !216, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!215 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!216 = !DISubroutineType(types: !217)
!217 = !{null, !94, !30, !30, !30, null}
!218 = !DISubprogram(name: "error", scope: !219, file: !219, line: 52, type: !220, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!219 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !DISubroutineType(types: !221)
!221 = !{null, !33, !33, !30, null}
!222 = !DISubprogram(name: "getenv", scope: !193, file: !193, line: 634, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!223 = !DISubprogram(name: "argmatch", scope: !224, file: !224, line: 52, type: !225, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!224 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !DISubroutineType(types: !226)
!226 = !{!119, !30, !227, !41, !40}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!229 = !DISubprogram(name: "set_quoting_style", scope: !12, file: !12, line: 285, type: !230, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !232, !11}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !12, line: 270, flags: DIFlagFwdDecl)
!234 = !DISubprogram(name: "quote", scope: !235, file: !235, line: 44, type: !236, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!235 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!236 = !DISubroutineType(types: !237)
!237 = !{!30, !30}
!238 = !DISubprogram(name: "xstrdup", scope: !239, file: !239, line: 64, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!239 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !DISubprogram(name: "xasprintf", scope: !241, file: !241, line: 46, type: !242, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!241 = !DIFile(filename: "./lib/xvasprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!242 = !DISubroutineType(types: !243)
!243 = !{!37, !30, null}
!244 = !DISubprogram(name: "free", scope: !193, file: !193, line: 565, type: !245, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !141}
!247 = !DISubprogram(name: "quotearg_style", scope: !12, file: !12, line: 377, type: !248, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!248 = !DISubroutineType(types: !249)
!249 = !{!37, !11, !30}
!250 = !DISubprogram(name: "statfs", scope: !251, file: !251, line: 31, type: !252, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!251 = !DIFile(filename: "/usr/include/sys/statfs.h", directory: "")
!252 = !DISubroutineType(types: !253)
!253 = !{!33, !30, !254}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !256, line: 24, size: 960, elements: !257)
!256 = !DIFile(filename: "/usr/include/bits/statfs.h", directory: "")
!257 = !{!258, !260, !261, !263, !264, !265, !267, !268, !276, !277, !278, !279}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !255, file: !256, line: 26, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !118, line: 191, baseType: !119)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !255, file: !256, line: 27, baseType: !259, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !255, file: !256, line: 29, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !118, line: 183, baseType: !40)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !255, file: !256, line: 30, baseType: !262, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !255, file: !256, line: 31, baseType: !262, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !255, file: !256, line: 32, baseType: !266, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !118, line: 187, baseType: !40)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !255, file: !256, line: 33, baseType: !266, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !255, file: !256, line: 41, baseType: !269, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !118, line: 155, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 155, size: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !270, file: !118, line: 155, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 2)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !255, file: !256, line: 42, baseType: !259, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !255, file: !256, line: 43, baseType: !259, size: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !255, file: !256, line: 44, baseType: !259, size: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !255, file: !256, line: 45, baseType: !280, size: 256, offset: 704)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 256, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 4)
!283 = !DISubprogram(name: "xmalloc", scope: !239, file: !239, line: 53, type: !284, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!284 = !DISubroutineType(types: !285)
!285 = !{!141, !40}
!286 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !289, file: !3, line: 865, baseType: !6)
!289 = distinct !DISubprogram(name: "print_statfs", scope: !3, file: !3, line: 847, type: !35, scopeLine: 850, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !300, !301, !306, !310, !311, !313, !316}
!291 = !DILocalVariable(name: "pformat", arg: 1, scope: !289, file: !3, line: 847, type: !37)
!292 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !289, file: !3, line: 847, type: !38)
!293 = !DILocalVariable(name: "m", arg: 3, scope: !289, file: !3, line: 847, type: !6)
!294 = !DILocalVariable(name: "fd", arg: 4, scope: !289, file: !3, line: 848, type: !33)
!295 = !DILocalVariable(name: "filename", arg: 5, scope: !289, file: !3, line: 848, type: !30)
!296 = !DILocalVariable(name: "data", arg: 6, scope: !289, file: !3, line: 849, type: !41)
!297 = !DILocalVariable(name: "statfsbuf", scope: !289, file: !3, line: 851, type: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!300 = !DILocalVariable(name: "fail", scope: !289, file: !3, line: 852, type: !29)
!301 = !DILocalVariable(name: "p", scope: !302, file: !3, line: 869, type: !304)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 861, column: 7)
!303 = distinct !DILexicalBlock(scope: !289, file: !3, line: 855, column: 5)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!306 = !DILocalVariable(name: "fsid", scope: !302, file: !3, line: 873, type: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !308, line: 102, baseType: !309)
!308 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !118, line: 73, baseType: !40)
!310 = !DILocalVariable(name: "words", scope: !302, file: !3, line: 874, type: !33)
!311 = !DILocalVariable(name: "i", scope: !312, file: !3, line: 875, type: !33)
!312 = distinct !DILexicalBlock(scope: !302, file: !3, line: 875, column: 9)
!313 = !DILocalVariable(name: "u", scope: !314, file: !3, line: 877, type: !307)
!314 = distinct !DILexicalBlock(scope: !315, file: !3, line: 876, column: 11)
!315 = distinct !DILexicalBlock(scope: !312, file: !3, line: 875, column: 9)
!316 = !DILocalVariable(name: "frsize", scope: !317, file: !3, line: 912, type: !307)
!317 = distinct !DILexicalBlock(scope: !303, file: !3, line: 911, column: 7)
!318 = !DISubprogram(name: "statx", scope: !319, file: !319, line: 56, type: !320, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!319 = !DIFile(filename: "/usr/include/bits/statx-generic.h", directory: "")
!320 = !DISubroutineType(types: !321)
!321 = !{!33, !33, !30, !33, !6, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statx", file: !324, line: 99, size: 2048, elements: !325)
!324 = !DIFile(filename: "/usr/include/linux/stat.h", directory: "")
!325 = !{!326, !329, !330, !333, !334, !335, !336, !338, !340, !341, !342, !343, !344, !353, !354, !355, !356, !357, !358, !359, !360}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "stx_mask", scope: !323, file: !324, line: 101, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !328, line: 27, baseType: !6)
!328 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "stx_blksize", scope: !323, file: !324, line: 102, baseType: !327, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "stx_attributes", scope: !323, file: !324, line: 103, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !328, line: 31, baseType: !332)
!332 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "stx_nlink", scope: !323, file: !324, line: 105, baseType: !327, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "stx_uid", scope: !323, file: !324, line: 106, baseType: !327, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "stx_gid", scope: !323, file: !324, line: 107, baseType: !327, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "stx_mode", scope: !323, file: !324, line: 108, baseType: !337, size: 16, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !328, line: 24, baseType: !121)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__spare0", scope: !323, file: !324, line: 109, baseType: !339, size: 16, offset: 240)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 16, elements: !126)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "stx_ino", scope: !323, file: !324, line: 111, baseType: !331, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "stx_size", scope: !323, file: !324, line: 112, baseType: !331, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "stx_blocks", scope: !323, file: !324, line: 113, baseType: !331, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stx_attributes_mask", scope: !323, file: !324, line: 114, baseType: !331, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "stx_atime", scope: !323, file: !324, line: 116, baseType: !345, size: 128, offset: 512)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statx_timestamp", file: !324, line: 56, size: 128, elements: !346)
!346 = !{!347, !350, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !345, file: !324, line: 57, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !328, line: 30, baseType: !349)
!349 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !345, file: !324, line: 58, baseType: !327, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved", scope: !345, file: !324, line: 59, baseType: !352, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !328, line: 26, baseType: !33)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "stx_btime", scope: !323, file: !324, line: 117, baseType: !345, size: 128, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "stx_ctime", scope: !323, file: !324, line: 118, baseType: !345, size: 128, offset: 768)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "stx_mtime", scope: !323, file: !324, line: 119, baseType: !345, size: 128, offset: 896)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stx_rdev_major", scope: !323, file: !324, line: 121, baseType: !327, size: 32, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "stx_rdev_minor", scope: !323, file: !324, line: 122, baseType: !327, size: 32, offset: 1056)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "stx_dev_major", scope: !323, file: !324, line: 123, baseType: !327, size: 32, offset: 1088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "stx_dev_minor", scope: !323, file: !324, line: 124, baseType: !327, size: 32, offset: 1120)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__spare2", scope: !323, file: !324, line: 126, baseType: !361, size: 896, offset: 1152)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 896, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 14)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !118, line: 145, baseType: !40)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "print_args", file: !3, line: 1247, size: 192, elements: !367)
!367 = !{!368, !405}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !366, file: !3, line: 1248, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !371, line: 46, size: 1152, elements: !372)
!371 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!372 = !{!373, !374, !376, !378, !380, !382, !384, !385, !386, !387, !389, !391, !399, !400, !401}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !370, file: !371, line: 48, baseType: !364, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !370, file: !371, line: 53, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !118, line: 148, baseType: !40)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !370, file: !371, line: 61, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !118, line: 151, baseType: !40)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !370, file: !371, line: 62, baseType: !379, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !118, line: 150, baseType: !6)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !370, file: !371, line: 64, baseType: !381, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !118, line: 146, baseType: !6)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !370, file: !371, line: 65, baseType: !383, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !118, line: 147, baseType: !6)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !370, file: !371, line: 67, baseType: !33, size: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !370, file: !371, line: 69, baseType: !364, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !370, file: !371, line: 74, baseType: !117, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !370, file: !371, line: 78, baseType: !388, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !118, line: 174, baseType: !119)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !370, file: !371, line: 80, baseType: !390, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !118, line: 179, baseType: !119)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !370, file: !371, line: 91, baseType: !392, size: 128, offset: 576)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !393, line: 10, size: 128, elements: !394)
!393 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!394 = !{!395, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !392, file: !393, line: 12, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !118, line: 160, baseType: !119)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !392, file: !393, line: 16, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !118, line: 196, baseType: !119)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !370, file: !371, line: 92, baseType: !392, size: 128, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !370, file: !371, line: 93, baseType: !392, size: 128, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !370, file: !371, line: 106, baseType: !402, size: 192, offset: 960)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 192, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 3)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !366, file: !3, line: 1249, baseType: !392, size: 128, offset: 64)
!406 = !DISubprogram(name: "get_quoting_style", scope: !12, file: !12, line: 281, type: !407, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!407 = !DISubroutineType(types: !408)
!408 = !{!11, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!411 = !DISubprogram(name: "areadlink_with_size", scope: !412, file: !412, line: 24, type: !413, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!412 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!413 = !DISubroutineType(types: !414)
!414 = !{!37, !30, !40}
!415 = !DISubprogram(name: "file_type", scope: !416, file: !416, line: 27, type: !417, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!416 = !DIFile(filename: "./lib/file-type.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!417 = !DISubroutineType(types: !418)
!418 = !{!30, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!421 = !DISubprogram(name: "getpwuid", scope: !422, file: !422, line: 110, type: !423, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!422 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !6}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !422, line: 49, size: 384, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !426, file: !422, line: 51, baseType: !37, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !426, file: !422, line: 52, baseType: !37, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !426, file: !422, line: 54, baseType: !381, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !426, file: !422, line: 55, baseType: !383, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !426, file: !422, line: 56, baseType: !37, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !426, file: !422, line: 57, baseType: !37, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !426, file: !422, line: 58, baseType: !37, size: 64, offset: 320)
!435 = !DISubprogram(name: "getgrgid", scope: !436, file: !436, line: 101, type: !437, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!436 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !6}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !436, line: 42, size: 256, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !440, file: !436, line: 44, baseType: !37, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !440, file: !436, line: 45, baseType: !37, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !440, file: !436, line: 46, baseType: !383, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !440, file: !436, line: 47, baseType: !446, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!447 = !DISubprogram(name: "filemodestring", scope: !448, file: !448, line: 38, type: !449, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!448 = !DIFile(filename: "./lib/filemode.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!449 = !DISubroutineType(types: !450)
!450 = !{null, !419, !37}
!451 = !DISubprogram(name: "canonicalize_file_name", scope: !193, file: !193, line: 790, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!452 = !DISubprogram(name: "find_mount_point", scope: !453, file: !453, line: 17, type: !454, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!453 = !DIFile(filename: "src/find-mount-point.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!454 = !DISubroutineType(types: !455)
!455 = !{!37, !30, !419}
!456 = !DISubprogram(name: "read_file_system_list", scope: !457, file: !457, line: 40, type: !458, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!457 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !29}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !457, line: 26, size: 448, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !470, !471, !472, !473}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !461, file: !457, line: 28, baseType: !37, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !461, file: !457, line: 29, baseType: !37, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !461, file: !457, line: 30, baseType: !37, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !461, file: !457, line: 32, baseType: !37, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !461, file: !457, line: 33, baseType: !468, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !469, line: 59, baseType: !364)
!469 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!470 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !461, file: !457, line: 34, baseType: !6, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !461, file: !457, line: 35, baseType: !6, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !461, file: !457, line: 36, baseType: !6, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !461, file: !457, line: 37, baseType: !460, size: 64, offset: 384)
!474 = !DISubprogram(name: "tzalloc", scope: !475, file: !475, line: 779, type: !476, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!475 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !30}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !475, line: 778, flags: DIFlagFwdDecl)
!480 = !DISubprogram(name: "localtime_rz", scope: !475, file: !475, line: 783, type: !481, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !478, !498, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !485, line: 7, size: 448, elements: !486)
!485 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !484, file: !485, line: 9, baseType: !33, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !484, file: !485, line: 10, baseType: !33, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !484, file: !485, line: 11, baseType: !33, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !484, file: !485, line: 12, baseType: !33, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !484, file: !485, line: 13, baseType: !33, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !484, file: !485, line: 14, baseType: !33, size: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !484, file: !485, line: 15, baseType: !33, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !484, file: !485, line: 16, baseType: !33, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !484, file: !485, line: 17, baseType: !33, size: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !484, file: !485, line: 20, baseType: !119, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !484, file: !485, line: 21, baseType: !30, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!500 = !DISubprogram(name: "nstrftime", scope: !501, file: !501, line: 28, type: !502, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!501 = !DIFile(filename: "./lib/strftime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = !DISubroutineType(types: !503)
!503 = !{!40, !37, !40, !30, !504, !478, !33}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!506 = !DISubprogram(name: "imaxtostr", scope: !507, file: !507, line: 42, type: !508, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!507 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !DISubroutineType(types: !509)
!509 = !{!37, !119, !37}
!510 = !{!511, !513, !515, !517, !519, !521, !0, !523, !528, !533, !535, !539, !542, !547, !552, !565, !575, !589, !591, !609}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "follow_links", scope: !2, file: !3, line: 235, type: !29, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !2, file: !3, line: 239, type: !29, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 246, type: !30, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !2, file: !3, line: 247, type: !38, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "dont_sync", scope: !2, file: !3, line: 1253, type: !29, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "force_sync", scope: !2, file: !3, line: 1256, type: !29, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "fmt_terse_fs", scope: !2, file: !3, line: 189, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 272, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 34)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 221, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 2304, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 9)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !2, file: !3, line: 243, type: !30, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "cached_modes", scope: !2, file: !3, line: 216, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 96, elements: !403)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "cached_args", scope: !2, file: !3, line: 211, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 256, elements: !281)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "printf_flags", scope: !2, file: !3, line: 186, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 8)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 178, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 88, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 11)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "buf", scope: !554, file: !3, line: 615, type: !562, isLocal: true, isDefinition: true)
!554 = distinct !DISubprogram(name: "human_fstype", scope: !3, file: !3, line: 260, type: !555, scopeLine: 261, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!30, !298}
!557 = !{!558, !559}
!558 = !DILocalVariable(name: "statfsbuf", arg: 1, scope: !554, file: !3, line: 260, type: !298)
!559 = !DILocalVariable(name: "type", scope: !560, file: !3, line: 614, type: !40)
!560 = distinct !DILexicalBlock(scope: !561, file: !3, line: 613, column: 7)
!561 = distinct !DILexicalBlock(scope: !554, file: !3, line: 266, column: 5)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 232, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 29)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "modebuf", scope: !567, file: !3, line: 627, type: !572, isLocal: true, isDefinition: true)
!567 = distinct !DISubprogram(name: "human_access", scope: !3, file: !3, line: 625, type: !568, scopeLine: 626, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!37, !419}
!570 = !{!571}
!571 = !DILocalVariable(name: "statbuf", arg: 1, scope: !567, file: !3, line: 625, type: !419)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 12)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "mount_list", scope: !577, file: !3, line: 939, type: !460, isLocal: true, isDefinition: true)
!577 = distinct !DISubprogram(name: "find_bind_mount", scope: !3, file: !3, line: 935, type: !236, scopeLine: 936, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !578)
!578 = !{!579, !580, !581, !582, !583}
!579 = !DILocalVariable(name: "name", arg: 1, scope: !577, file: !3, line: 935, type: !30)
!580 = !DILocalVariable(name: "bind_mount", scope: !577, file: !3, line: 937, type: !30)
!581 = !DILocalVariable(name: "name_stats", scope: !577, file: !3, line: 948, type: !370)
!582 = !DILocalVariable(name: "me", scope: !577, file: !3, line: 952, type: !460)
!583 = !DILocalVariable(name: "dev_stats", scope: !584, file: !3, line: 958, type: !370)
!584 = distinct !DILexicalBlock(scope: !585, file: !3, line: 957, column: 9)
!585 = distinct !DILexicalBlock(scope: !586, file: !3, line: 955, column: 11)
!586 = distinct !DILexicalBlock(scope: !587, file: !3, line: 954, column: 5)
!587 = distinct !DILexicalBlock(scope: !588, file: !3, line: 953, column: 3)
!588 = distinct !DILexicalBlock(scope: !577, file: !3, line: 953, column: 3)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !577, file: !3, line: 940, type: !29, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "str", scope: !593, file: !3, line: 639, type: !606, isLocal: true, isDefinition: true)
!593 = distinct !DISubprogram(name: "human_time", scope: !3, file: !3, line: 634, type: !594, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!37, !392}
!596 = !{!597, !598, !599, !600}
!597 = !DILocalVariable(name: "t", arg: 1, scope: !593, file: !3, line: 634, type: !392)
!598 = !DILocalVariable(name: "tm", scope: !593, file: !3, line: 646, type: !484)
!599 = !DILocalVariable(name: "ns", scope: !593, file: !3, line: 647, type: !33)
!600 = !DILocalVariable(name: "secbuf", scope: !601, file: !3, line: 652, type: !603)
!601 = distinct !DILexicalBlock(scope: !602, file: !3, line: 651, column: 5)
!602 = distinct !DILexicalBlock(scope: !593, file: !3, line: 648, column: 7)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 168, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 21)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 488, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 61)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "tz", scope: !593, file: !3, line: 643, type: !611, isLocal: true, isDefinition: true)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !475, line: 778, baseType: !478)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 392, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 49)
!615 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!616 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!617 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!618 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!619 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "Version", scope: !622, file: !623, line: 2, type: !30, isDefinition: true)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, globals: !624, nameTableKind: None)
!623 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!624 = !{!620}
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !627, file: !628, line: 67, type: !676, isDefinition: true)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !629, retainedTypes: !630, globals: !675, nameTableKind: None)
!628 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!629 = !{!11}
!630 = !{!141, !30, !85, !631, !634, !218, !637, !234, !672, !286}
!631 = !DISubprogram(name: "quotearg_n_style", scope: !12, file: !12, line: 368, type: !632, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!632 = !DISubroutineType(types: !633)
!633 = !{!37, !33, !11, !30}
!634 = !DISubprogram(name: "quote_n", scope: !235, file: !235, line: 40, type: !635, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!635 = !DISubroutineType(types: !636)
!636 = !{!30, !33, !30}
!637 = !DISubprogram(name: "fputs_unlocked", scope: !91, file: !91, line: 662, type: !638, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!638 = !DISubroutineType(types: !639)
!639 = !{!33, !30, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !96, line: 49, size: 1728, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !641, file: !96, line: 51, baseType: !33, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !641, file: !96, line: 54, baseType: !37, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !641, file: !96, line: 55, baseType: !37, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !641, file: !96, line: 56, baseType: !37, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !641, file: !96, line: 57, baseType: !37, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !641, file: !96, line: 58, baseType: !37, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !641, file: !96, line: 59, baseType: !37, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !641, file: !96, line: 60, baseType: !37, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !641, file: !96, line: 61, baseType: !37, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !641, file: !96, line: 64, baseType: !37, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !641, file: !96, line: 65, baseType: !37, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !641, file: !96, line: 66, baseType: !37, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !641, file: !96, line: 68, baseType: !111, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !641, file: !96, line: 70, baseType: !640, size: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !641, file: !96, line: 72, baseType: !33, size: 32, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !641, file: !96, line: 73, baseType: !33, size: 32, offset: 928)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !641, file: !96, line: 74, baseType: !117, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !641, file: !96, line: 77, baseType: !121, size: 16, offset: 1024)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !641, file: !96, line: 78, baseType: !123, size: 8, offset: 1040)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !641, file: !96, line: 79, baseType: !125, size: 8, offset: 1048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !641, file: !96, line: 81, baseType: !129, size: 64, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !641, file: !96, line: 89, baseType: !132, size: 64, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !641, file: !96, line: 91, baseType: !134, size: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !641, file: !96, line: 92, baseType: !137, size: 64, offset: 1280)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !641, file: !96, line: 93, baseType: !640, size: 64, offset: 1344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !641, file: !96, line: 94, baseType: !141, size: 64, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !641, file: !96, line: 95, baseType: !38, size: 64, offset: 1472)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !641, file: !96, line: 96, baseType: !33, size: 32, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !641, file: !96, line: 98, baseType: !145, size: 160, offset: 1568)
!672 = !DISubprogram(name: "usage", scope: !628, file: !628, line: 56, type: !673, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !33}
!675 = !{!625}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !224, line: 61, baseType: !196)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "file_name", scope: !679, file: !680, line: 46, type: !30, isLocal: true, isDefinition: true)
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !681, globals: !719, nameTableKind: None)
!680 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!681 = !{!682, !85, !718, !218}
!682 = !DISubprogram(name: "close_stream", scope: !683, file: !683, line: 2, type: !684, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!683 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!684 = !DISubroutineType(types: !685)
!685 = !{!33, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !96, line: 49, size: 1728, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !687, file: !96, line: 51, baseType: !33, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !687, file: !96, line: 54, baseType: !37, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !687, file: !96, line: 55, baseType: !37, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !687, file: !96, line: 56, baseType: !37, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !687, file: !96, line: 57, baseType: !37, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !687, file: !96, line: 58, baseType: !37, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !687, file: !96, line: 59, baseType: !37, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !687, file: !96, line: 60, baseType: !37, size: 64, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !687, file: !96, line: 61, baseType: !37, size: 64, offset: 512)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !687, file: !96, line: 64, baseType: !37, size: 64, offset: 576)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !687, file: !96, line: 65, baseType: !37, size: 64, offset: 640)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !687, file: !96, line: 66, baseType: !37, size: 64, offset: 704)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !687, file: !96, line: 68, baseType: !111, size: 64, offset: 768)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !687, file: !96, line: 70, baseType: !686, size: 64, offset: 832)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !687, file: !96, line: 72, baseType: !33, size: 32, offset: 896)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !687, file: !96, line: 73, baseType: !33, size: 32, offset: 928)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !687, file: !96, line: 74, baseType: !117, size: 64, offset: 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !687, file: !96, line: 77, baseType: !121, size: 16, offset: 1024)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !687, file: !96, line: 78, baseType: !123, size: 8, offset: 1040)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !687, file: !96, line: 79, baseType: !125, size: 8, offset: 1048)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !687, file: !96, line: 81, baseType: !129, size: 64, offset: 1088)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !687, file: !96, line: 89, baseType: !132, size: 64, offset: 1152)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !687, file: !96, line: 91, baseType: !134, size: 64, offset: 1216)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !687, file: !96, line: 92, baseType: !137, size: 64, offset: 1280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !687, file: !96, line: 93, baseType: !686, size: 64, offset: 1344)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !687, file: !96, line: 94, baseType: !141, size: 64, offset: 1408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !687, file: !96, line: 95, baseType: !38, size: 64, offset: 1472)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !687, file: !96, line: 96, baseType: !33, size: 32, offset: 1536)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !687, file: !96, line: 98, baseType: !145, size: 160, offset: 1568)
!718 = !DISubprogram(name: "quotearg_colon", scope: !12, file: !12, line: 391, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!719 = !{!677, !720}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !679, file: !680, line: 56, type: !29, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "exit_failure", scope: !724, file: !725, line: 24, type: !727, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, globals: !726, nameTableKind: None)
!725 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!726 = !{!722}
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "program_name", scope: !730, file: !731, line: 33, type: !30, isDefinition: true)
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !732, globals: !768, nameTableKind: None)
!731 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!732 = !{!141, !733, !37}
!733 = !DISubprogram(name: "fputs", scope: !91, file: !91, line: 626, type: !734, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!734 = !DISubroutineType(types: !735)
!735 = !{!33, !30, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !96, line: 49, size: 1728, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !737, file: !96, line: 51, baseType: !33, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !737, file: !96, line: 54, baseType: !37, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !737, file: !96, line: 55, baseType: !37, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !737, file: !96, line: 56, baseType: !37, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !737, file: !96, line: 57, baseType: !37, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !737, file: !96, line: 58, baseType: !37, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !737, file: !96, line: 59, baseType: !37, size: 64, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !737, file: !96, line: 60, baseType: !37, size: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !737, file: !96, line: 61, baseType: !37, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !737, file: !96, line: 64, baseType: !37, size: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !737, file: !96, line: 65, baseType: !37, size: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !737, file: !96, line: 66, baseType: !37, size: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !737, file: !96, line: 68, baseType: !111, size: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !737, file: !96, line: 70, baseType: !736, size: 64, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !737, file: !96, line: 72, baseType: !33, size: 32, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !737, file: !96, line: 73, baseType: !33, size: 32, offset: 928)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !737, file: !96, line: 74, baseType: !117, size: 64, offset: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !737, file: !96, line: 77, baseType: !121, size: 16, offset: 1024)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !737, file: !96, line: 78, baseType: !123, size: 8, offset: 1040)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !737, file: !96, line: 79, baseType: !125, size: 8, offset: 1048)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !737, file: !96, line: 81, baseType: !129, size: 64, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !737, file: !96, line: 89, baseType: !132, size: 64, offset: 1152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !737, file: !96, line: 91, baseType: !134, size: 64, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !737, file: !96, line: 92, baseType: !137, size: 64, offset: 1280)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !737, file: !96, line: 93, baseType: !736, size: 64, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !737, file: !96, line: 94, baseType: !141, size: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !737, file: !96, line: 95, baseType: !38, size: 64, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !737, file: !96, line: 96, baseType: !33, size: 32, offset: 1536)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !737, file: !96, line: 98, baseType: !145, size: 160, offset: 1568)
!768 = !{!728}
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !771, file: !772, line: 85, type: !864, isDefinition: true)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !773, retainedTypes: !779, globals: !837, nameTableKind: None)
!772 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!773 = !{!11, !774, !69}
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!777 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!778 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!779 = !{!780, !783, !244, !797, !33, !121, !800, !38, !815, !819, !85, !825, !829, !37, !283, !833, !834}
!780 = !DISubprogram(name: "xmemdup", scope: !239, file: !239, line: 62, type: !781, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!781 = !DISubroutineType(types: !782)
!782 = !{!141, !41, !40}
!783 = !DISubprogram(name: "quotearg_alloc_mem", scope: !12, file: !12, line: 342, type: !784, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!784 = !DISubroutineType(types: !785)
!785 = !{!37, !30, !40, !786, !787}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !772, line: 65, size: 448, elements: !790)
!790 = !{!791, !792, !793, !795, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !789, file: !772, line: 68, baseType: !11, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !772, line: 71, baseType: !33, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !789, file: !772, line: 75, baseType: !794, size: 256, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !545)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !789, file: !772, line: 78, baseType: !30, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !789, file: !772, line: 81, baseType: !30, size: 64, offset: 384)
!797 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !12, file: !12, line: 408, type: !798, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!798 = !DISubroutineType(types: !799)
!799 = !{!37, !33, !30, !30, !30, !40}
!800 = !DISubprogram(name: "rpl_mbrtowc", scope: !801, file: !801, line: 717, type: !802, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!801 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!802 = !DISubroutineType(types: !803)
!803 = !{!40, !212, !30, !40, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !806, line: 13, size: 64, elements: !807)
!806 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !805, file: !806, line: 15, baseType: !33, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !805, file: !806, line: 20, baseType: !810, size: 32, offset: 32)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !805, file: !806, line: 16, size: 32, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !810, file: !806, line: 18, baseType: !6, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !810, file: !806, line: 19, baseType: !814, size: 32)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !281)
!815 = !DISubprogram(name: "iswprint", scope: !816, file: !816, line: 120, type: !817, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!816 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!817 = !DISubroutineType(types: !818)
!818 = !{!33, !6}
!819 = !DISubprogram(name: "mbsinit", scope: !820, file: !820, line: 292, type: !821, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!820 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!821 = !DISubroutineType(types: !822)
!822 = !{!33, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!825 = !DISubprogram(name: "locale_charset", scope: !826, file: !826, line: 35, type: !827, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!826 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!827 = !DISubroutineType(types: !828)
!828 = !{!30}
!829 = !DISubprogram(name: "c_strcasecmp", scope: !830, file: !830, line: 42, type: !831, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!830 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!831 = !DISubroutineType(types: !832)
!832 = !{!33, !30, !30}
!833 = !DISubprogram(name: "xalloc_die", scope: !239, file: !239, line: 51, type: !197, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !89)
!834 = !DISubprogram(name: "xrealloc", scope: !239, file: !239, line: 59, type: !835, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!835 = !DISubroutineType(types: !836)
!836 = !{!141, !141, !40}
!837 = !{!769, !838, !844, !846, !848, !853, !860, !862}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !771, file: !772, line: 101, type: !840, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 320, elements: !842)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!842 = !{!843}
!843 = !DISubrange(count: 10)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !771, file: !772, line: 1052, type: !789, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !771, file: !772, line: 116, type: !789, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "slot0", scope: !771, file: !772, line: 842, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 256)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "slotvec", scope: !771, file: !772, line: 845, type: !855, isLocal: true, isDefinition: true)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !772, line: 834, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !856, file: !772, line: 836, baseType: !38, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !856, file: !772, line: 837, baseType: !37, size: 64, offset: 64)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "nslots", scope: !771, file: !772, line: 843, type: !33, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "slotvec0", scope: !771, file: !772, line: 844, type: !856, isLocal: true, isDefinition: true)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 704, elements: !550)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !867, file: !868, line: 26, type: !870, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, globals: !869, nameTableKind: None)
!868 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!869 = !{!865}
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 47)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !875, file: !876, line: 507, type: !33, isLocal: true, isDefinition: true)
!875 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !876, file: !876, line: 488, type: !877, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !879, retainedNodes: !890)
!876 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!877 = !DISubroutineType(types: !878)
!878 = !{!33, !33, !33}
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !880, globals: !889, nameTableKind: None)
!880 = !{!881, !885}
!881 = !DISubprogram(name: "fcntl", scope: !882, file: !882, line: 176, type: !883, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!882 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!883 = !DISubroutineType(types: !884)
!884 = !{!33, !33, !33, null}
!885 = !DISubprogram(name: "close", scope: !886, file: !886, line: 353, type: !887, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!886 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!887 = !DISubroutineType(types: !888)
!888 = !{!33, !33}
!889 = !{!873}
!890 = !{!891, !892, !893, !894, !897}
!891 = !DILocalVariable(name: "fd", arg: 1, scope: !875, file: !876, line: 488, type: !33)
!892 = !DILocalVariable(name: "target", arg: 2, scope: !875, file: !876, line: 488, type: !33)
!893 = !DILocalVariable(name: "result", scope: !875, file: !876, line: 490, type: !33)
!894 = !DILocalVariable(name: "flags", scope: !895, file: !876, line: 531, type: !33)
!895 = distinct !DILexicalBlock(scope: !896, file: !876, line: 530, column: 5)
!896 = distinct !DILexicalBlock(scope: !875, file: !876, line: 529, column: 7)
!897 = !DILocalVariable(name: "saved_errno", scope: !898, file: !876, line: 534, type: !33)
!898 = distinct !DILexicalBlock(scope: !899, file: !876, line: 533, column: 9)
!899 = distinct !DILexicalBlock(scope: !895, file: !876, line: 532, column: 11)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !629, retainedTypes: !902, nameTableKind: None)
!901 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!902 = !{!903, !85, !218, !912, !247, !915, !37, !244, !917, !921, !926}
!903 = !DISubprogram(name: "save_cwd", scope: !904, file: !904, line: 30, type: !905, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!904 = !DIFile(filename: "./lib/save-cwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!905 = !DISubroutineType(types: !906)
!906 = !{!33, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "saved_cwd", file: !904, line: 24, size: 128, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !908, file: !904, line: 26, baseType: !33, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !904, line: 27, baseType: !37, size: 64, offset: 64)
!912 = !DISubprogram(name: "chdir", scope: !886, file: !886, line: 497, type: !913, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!913 = !DISubroutineType(types: !914)
!914 = !{!33, !30}
!915 = !DISubprogram(name: "dir_name", scope: !916, file: !916, line: 40, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!916 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!917 = !DISubprogram(name: "xgetcwd", scope: !918, file: !918, line: 17, type: !919, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!918 = !DIFile(filename: "./lib/xgetcwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!919 = !DISubroutineType(types: !920)
!920 = !{!37}
!921 = !DISubprogram(name: "restore_cwd", scope: !904, file: !904, line: 31, type: !922, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!922 = !DISubroutineType(types: !923)
!923 = !{!33, !924}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!926 = !DISubprogram(name: "free_cwd", scope: !904, file: !904, line: 32, type: !927, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !907}
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !931, retainedTypes: !965, nameTableKind: None)
!930 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!931 = !{!932}
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !933, file: !930, line: 64, baseType: !6, size: 32, elements: !963)
!933 = distinct !DISubprogram(name: "areadlink_with_size", scope: !930, file: !930, line: 53, type: !934, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !929, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!37, !30, !38}
!936 = !{!937, !938, !939, !940, !941, !942, !943, !947, !948, !952, !953, !954, !957}
!937 = !DILocalVariable(name: "file", arg: 1, scope: !933, file: !930, line: 53, type: !30)
!938 = !DILocalVariable(name: "size", arg: 2, scope: !933, file: !930, line: 53, type: !38)
!939 = !DILocalVariable(name: "symlink_max", scope: !933, file: !930, line: 58, type: !38)
!940 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !933, file: !930, line: 59, type: !38)
!941 = !DILocalVariable(name: "initial_limit", scope: !933, file: !930, line: 60, type: !38)
!942 = !DILocalVariable(name: "buf_size", scope: !933, file: !930, line: 67, type: !38)
!943 = !DILocalVariable(name: "r", scope: !944, file: !930, line: 72, type: !945)
!944 = distinct !DILexicalBlock(scope: !933, file: !930, line: 71, column: 5)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !469, line: 108, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !118, line: 193, baseType: !119)
!947 = !DILocalVariable(name: "link_length", scope: !944, file: !930, line: 73, type: !38)
!948 = !DILocalVariable(name: "stackbuf", scope: !944, file: !930, line: 74, type: !949)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 128)
!952 = !DILocalVariable(name: "buf", scope: !944, file: !930, line: 75, type: !37)
!953 = !DILocalVariable(name: "buffer", scope: !944, file: !930, line: 76, type: !37)
!954 = !DILocalVariable(name: "saved_errno", scope: !955, file: !930, line: 92, type: !33)
!955 = distinct !DILexicalBlock(scope: !956, file: !930, line: 91, column: 9)
!956 = distinct !DILexicalBlock(scope: !944, file: !930, line: 90, column: 11)
!957 = !DILocalVariable(name: "shrinked_buffer", scope: !958, file: !930, line: 110, type: !37)
!958 = distinct !DILexicalBlock(scope: !959, file: !930, line: 108, column: 13)
!959 = distinct !DILexicalBlock(scope: !960, file: !930, line: 107, column: 20)
!960 = distinct !DILexicalBlock(scope: !961, file: !930, line: 101, column: 15)
!961 = distinct !DILexicalBlock(scope: !962, file: !930, line: 99, column: 9)
!962 = distinct !DILexicalBlock(scope: !944, file: !930, line: 98, column: 11)
!963 = !{!964}
!964 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!965 = !{!244, !141}
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !968, nameTableKind: None)
!967 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!968 = !{!969, !833}
!969 = !DISubprogram(name: "mdir_name", scope: !916, file: !916, line: 43, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !972, nameTableKind: None)
!971 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!972 = !{!973}
!973 = !DISubprogram(name: "last_component", scope: !916, file: !916, line: 46, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !920, nameTableKind: None)
!975 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !978, nameTableKind: None)
!977 = !DIFile(filename: "lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!978 = !{!85}
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !980, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, nameTableKind: None)
!980 = !DIFile(filename: "lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !983, nameTableKind: None)
!982 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !308, line: 101, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !118, line: 72, baseType: !119)
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !988, nameTableKind: None)
!987 = !DIFile(filename: "lib/nstrftime.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!988 = !{!30, !6, !33, !123, !286, !989, !121, !119, !40, !349, !332, !38, !990, !141, !41, !1009}
!989 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!990 = !DISubprogram(name: "strftime", scope: !991, file: !991, line: 88, type: !992, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !89)
!991 = !DIFile(filename: "/usr/include/time.h", directory: "")
!992 = !DISubroutineType(types: !993)
!993 = !{!40, !37, !40, !30, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !485, line: 7, size: 448, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !996, file: !485, line: 9, baseType: !33, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !996, file: !485, line: 10, baseType: !33, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !996, file: !485, line: 11, baseType: !33, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !996, file: !485, line: 12, baseType: !33, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !996, file: !485, line: 13, baseType: !33, size: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !996, file: !485, line: 14, baseType: !33, size: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !996, file: !485, line: 15, baseType: !33, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !996, file: !485, line: 16, baseType: !33, size: 32, offset: 224)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !996, file: !485, line: 17, baseType: !33, size: 32, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !996, file: !485, line: 20, baseType: !119, size: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !996, file: !485, line: 21, baseType: !30, size: 64, offset: 384)
