; ModuleID = 'coreutils-8.32/src/stat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.statx = type { i32, i32, i64, i32, i32, i32, i16, [1 x i16], i64, i64, i64, i64, %struct.statx_timestamp, %struct.statx_timestamp, %struct.statx_timestamp, %struct.statx_timestamp, i32, i32, i32, i32, i64, i64, [12 x i64] }
%struct.statx_timestamp = type { i64, i32, i32 }
%struct.print_args = type { %struct.stat*, %struct.timespec }

!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!29, !37, !38, !6, !33, !30, !41}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !59, !60, !63, !64}
!44 = !DILocalVariable(name: "format", arg: 1, scope: !26, file: !3, line: 1113, type: !30)
!45 = !DILocalVariable(name: "fd", arg: 2, scope: !26, file: !3, line: 1113, type: !33)
!46 = !DILocalVariable(name: "filename", arg: 3, scope: !26, file: !3, line: 1113, type: !30)
!47 = !DILocalVariable(name: "print_func", arg: 4, scope: !26, file: !3, line: 1114, type: !34)
!48 = !DILocalVariable(name: "data", arg: 5, scope: !26, file: !3, line: 1116, type: !41)
!49 = !DILocalVariable(name: "fail", scope: !26, file: !3, line: 1118, type: !29)
!50 = !DILocalVariable(name: "n_alloc", scope: !26, file: !3, line: 1129, type: !38)
!51 = !DILocalVariable(name: "dest", scope: !26, file: !3, line: 1130, type: !37)
!52 = !DILocalVariable(name: "b", scope: !26, file: !3, line: 1131, type: !30)
!53 = !DILocalVariable(name: "len", scope: !54, file: !3, line: 1138, type: !38)
!54 = distinct !DILexicalBlock(scope: !55, file: !3, line: 1137, column: 11)
!55 = distinct !DILexicalBlock(scope: !56, file: !3, line: 1135, column: 9)
!56 = distinct !DILexicalBlock(scope: !57, file: !3, line: 1133, column: 5)
!57 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1132, column: 3)
!58 = distinct !DILexicalBlock(scope: !26, file: !3, line: 1132, column: 3)
!59 = !DILocalVariable(name: "fmt_char", scope: !54, file: !3, line: 1139, type: !30)
!60 = !DILocalVariable(name: "esc_value", scope: !61, file: !3, line: 1175, type: !33)
!61 = distinct !DILexicalBlock(scope: !62, file: !3, line: 1174, column: 13)
!62 = distinct !DILexicalBlock(scope: !55, file: !3, line: 1173, column: 15)
!63 = !DILocalVariable(name: "esc_length", scope: !61, file: !3, line: 1176, type: !33)
!64 = !DILocalVariable(name: "esc_value", scope: !65, file: !3, line: 1187, type: !33)
!65 = distinct !DILexicalBlock(scope: !66, file: !3, line: 1186, column: 13)
!66 = distinct !DILexicalBlock(scope: !62, file: !3, line: 1185, column: 20)
!67 = !{!68}
!68 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 46, baseType: !6, size: 32, elements: !71)
!70 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!72 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!73 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!74 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!75 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!76 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!77 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!78 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!79 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!80 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!83 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!84 = !{!41, !37, !85, !33, !86, !87, !88, !149, !150, !38, !6}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !90, file: !3, line: 865, baseType: !6)
!90 = distinct !DISubprogram(name: "print_statfs", scope: !3, file: !3, line: 847, type: !35, scopeLine: 850, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !131, !132, !137, !141, !142, !144, !147}
!92 = !DILocalVariable(name: "pformat", arg: 1, scope: !90, file: !3, line: 847, type: !37)
!93 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !90, file: !3, line: 847, type: !38)
!94 = !DILocalVariable(name: "m", arg: 3, scope: !90, file: !3, line: 847, type: !6)
!95 = !DILocalVariable(name: "fd", arg: 4, scope: !90, file: !3, line: 848, type: !33)
!96 = !DILocalVariable(name: "filename", arg: 5, scope: !90, file: !3, line: 848, type: !30)
!97 = !DILocalVariable(name: "data", arg: 6, scope: !90, file: !3, line: 849, type: !41)
!98 = !DILocalVariable(name: "statfsbuf", scope: !90, file: !3, line: 851, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !102, line: 24, size: 960, elements: !103)
!102 = !DIFile(filename: "/usr/include/bits/statfs.h", directory: "")
!103 = !{!104, !108, !109, !111, !112, !113, !115, !116, !124, !125, !126, !127}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !101, file: !102, line: 26, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !106, line: 192, baseType: !107)
!106 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!107 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !101, file: !102, line: 27, baseType: !105, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !101, file: !102, line: 29, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !106, line: 184, baseType: !40)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !101, file: !102, line: 30, baseType: !110, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !101, file: !102, line: 31, baseType: !110, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !101, file: !102, line: 32, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !106, line: 188, baseType: !40)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !101, file: !102, line: 33, baseType: !114, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !101, file: !102, line: 41, baseType: !117, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !106, line: 155, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 155, size: 64, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !118, file: !106, line: 155, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 2)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !101, file: !102, line: 42, baseType: !105, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !101, file: !102, line: 43, baseType: !105, size: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !101, file: !102, line: 44, baseType: !105, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !101, file: !102, line: 45, baseType: !128, size: 256, offset: 704)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 256, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 4)
!131 = !DILocalVariable(name: "fail", scope: !90, file: !3, line: 852, type: !29)
!132 = !DILocalVariable(name: "p", scope: !133, file: !3, line: 869, type: !135)
!133 = distinct !DILexicalBlock(scope: !134, file: !3, line: 861, column: 7)
!134 = distinct !DILexicalBlock(scope: !90, file: !3, line: 855, column: 5)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!137 = !DILocalVariable(name: "fsid", scope: !133, file: !3, line: 873, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !139, line: 102, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !106, line: 73, baseType: !40)
!141 = !DILocalVariable(name: "words", scope: !133, file: !3, line: 874, type: !33)
!142 = !DILocalVariable(name: "i", scope: !143, file: !3, line: 875, type: !33)
!143 = distinct !DILexicalBlock(scope: !133, file: !3, line: 875, column: 9)
!144 = !DILocalVariable(name: "u", scope: !145, file: !3, line: 877, type: !138)
!145 = distinct !DILexicalBlock(scope: !146, file: !3, line: 876, column: 11)
!146 = distinct !DILexicalBlock(scope: !143, file: !3, line: 875, column: 9)
!147 = !DILocalVariable(name: "frsize", scope: !148, file: !3, line: 912, type: !138)
!148 = distinct !DILexicalBlock(scope: !134, file: !3, line: 911, column: 7)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !106, line: 145, baseType: !40)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "print_args", file: !3, line: 1247, size: 192, elements: !152)
!152 = !{!153, !191}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !151, file: !3, line: 1248, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !156, line: 26, size: 1152, elements: !157)
!156 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!157 = !{!158, !159, !161, !163, !165, !167, !169, !170, !171, !173, !175, !177, !185, !186, !187}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !155, file: !156, line: 28, baseType: !149, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !155, file: !156, line: 33, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !106, line: 148, baseType: !40)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !155, file: !156, line: 41, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !106, line: 151, baseType: !40)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !155, file: !156, line: 42, baseType: !164, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !106, line: 150, baseType: !6)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !155, file: !156, line: 44, baseType: !166, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !106, line: 146, baseType: !6)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !155, file: !156, line: 45, baseType: !168, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !106, line: 147, baseType: !6)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !155, file: !156, line: 47, baseType: !33, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !155, file: !156, line: 49, baseType: !149, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !155, file: !156, line: 54, baseType: !172, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !107)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !155, file: !156, line: 58, baseType: !174, size: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !106, line: 175, baseType: !107)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !155, file: !156, line: 60, baseType: !176, size: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !106, line: 180, baseType: !107)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !155, file: !156, line: 71, baseType: !178, size: 128, offset: 576)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !179, line: 10, size: 128, elements: !180)
!179 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !178, file: !179, line: 12, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !106, line: 160, baseType: !107)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !178, file: !179, line: 16, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !106, line: 197, baseType: !107)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !155, file: !156, line: 72, baseType: !178, size: 128, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !155, file: !156, line: 73, baseType: !178, size: 128, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !155, file: !156, line: 86, baseType: !188, size: 192, offset: 960)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 192, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 3)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !151, file: !3, line: 1249, baseType: !178, size: 128, offset: 64)
!192 = !{!193, !195, !197, !199, !201, !203, !0, !205, !210, !224, !226, !230, !234, !239, !244, !257, !269, !300, !302, !334}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "follow_links", scope: !2, file: !3, line: 235, type: !29, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !2, file: !3, line: 239, type: !29, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 246, type: !30, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !2, file: !3, line: 247, type: !38, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "dont_sync", scope: !2, file: !3, line: 1253, type: !29, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "force_sync", scope: !2, file: !3, line: 1256, type: !29, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "fmt_terse_fs", scope: !2, file: !3, line: 189, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 272, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 34)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 221, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 2304, elements: !222)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !215, line: 50, size: 256, elements: !216)
!215 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!216 = !{!217, !218, !219, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !215, line: 52, baseType: !30, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !214, file: !215, line: 55, baseType: !33, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !214, file: !215, line: 56, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !214, file: !215, line: 57, baseType: !33, size: 32, offset: 192)
!222 = !{!223}
!223 = !DISubrange(count: 9)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !2, file: !3, line: 243, type: !30, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "cached_modes", scope: !2, file: !3, line: 216, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 96, elements: !189)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "cached_args", scope: !2, file: !3, line: 211, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 256, elements: !129)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "printf_flags", scope: !2, file: !3, line: 186, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 8)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 178, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 88, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 11)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "buf", scope: !246, file: !3, line: 615, type: !254, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "human_fstype", scope: !3, file: !3, line: 260, type: !247, scopeLine: 261, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{!30, !99}
!249 = !{!250, !251}
!250 = !DILocalVariable(name: "statfsbuf", arg: 1, scope: !246, file: !3, line: 260, type: !99)
!251 = !DILocalVariable(name: "type", scope: !252, file: !3, line: 614, type: !40)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 613, column: 7)
!253 = distinct !DILexicalBlock(scope: !246, file: !3, line: 266, column: 5)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 232, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 29)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "modebuf", scope: !259, file: !3, line: 627, type: !266, isLocal: true, isDefinition: true)
!259 = distinct !DISubprogram(name: "human_access", scope: !3, file: !3, line: 625, type: !260, scopeLine: 626, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !264)
!260 = !DISubroutineType(types: !261)
!261 = !{!37, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!264 = !{!265}
!265 = !DILocalVariable(name: "statbuf", arg: 1, scope: !259, file: !3, line: 625, type: !262)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 12)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "mount_list", scope: !271, file: !3, line: 939, type: !279, isLocal: true, isDefinition: true)
!271 = distinct !DISubprogram(name: "find_bind_mount", scope: !3, file: !3, line: 935, type: !272, scopeLine: 936, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !274)
!272 = !DISubroutineType(types: !273)
!273 = !{!30, !30}
!274 = !{!275, !276, !277, !278, !294}
!275 = !DILocalVariable(name: "name", arg: 1, scope: !271, file: !3, line: 935, type: !30)
!276 = !DILocalVariable(name: "bind_mount", scope: !271, file: !3, line: 937, type: !30)
!277 = !DILocalVariable(name: "name_stats", scope: !271, file: !3, line: 948, type: !155)
!278 = !DILocalVariable(name: "me", scope: !271, file: !3, line: 952, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !281, line: 26, size: 448, elements: !282)
!281 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!282 = !{!283, !284, !285, !286, !287, !290, !291, !292, !293}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !280, file: !281, line: 28, baseType: !37, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !280, file: !281, line: 29, baseType: !37, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !280, file: !281, line: 30, baseType: !37, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !280, file: !281, line: 32, baseType: !37, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !280, file: !281, line: 33, baseType: !288, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !289, line: 59, baseType: !149)
!289 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !280, file: !281, line: 34, baseType: !6, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !280, file: !281, line: 35, baseType: !6, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !280, file: !281, line: 36, baseType: !6, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !280, file: !281, line: 37, baseType: !279, size: 64, offset: 384)
!294 = !DILocalVariable(name: "dev_stats", scope: !295, file: !3, line: 958, type: !155)
!295 = distinct !DILexicalBlock(scope: !296, file: !3, line: 957, column: 9)
!296 = distinct !DILexicalBlock(scope: !297, file: !3, line: 955, column: 11)
!297 = distinct !DILexicalBlock(scope: !298, file: !3, line: 954, column: 5)
!298 = distinct !DILexicalBlock(scope: !299, file: !3, line: 953, column: 3)
!299 = distinct !DILexicalBlock(scope: !271, file: !3, line: 953, column: 3)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !271, file: !3, line: 940, type: !29, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "str", scope: !304, file: !3, line: 639, type: !331, isLocal: true, isDefinition: true)
!304 = distinct !DISubprogram(name: "human_time", scope: !3, file: !3, line: 634, type: !305, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !307)
!305 = !DISubroutineType(types: !306)
!306 = !{!37, !178}
!307 = !{!308, !309, !324, !325}
!308 = !DILocalVariable(name: "t", arg: 1, scope: !304, file: !3, line: 634, type: !178)
!309 = !DILocalVariable(name: "tm", scope: !304, file: !3, line: 646, type: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !311, line: 7, size: 448, elements: !312)
!311 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !310, file: !311, line: 9, baseType: !33, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !310, file: !311, line: 10, baseType: !33, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !310, file: !311, line: 11, baseType: !33, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !310, file: !311, line: 12, baseType: !33, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !310, file: !311, line: 13, baseType: !33, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !310, file: !311, line: 14, baseType: !33, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !310, file: !311, line: 15, baseType: !33, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !310, file: !311, line: 16, baseType: !33, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !310, file: !311, line: 17, baseType: !33, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !310, file: !311, line: 20, baseType: !107, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !310, file: !311, line: 21, baseType: !30, size: 64, offset: 384)
!324 = !DILocalVariable(name: "ns", scope: !304, file: !3, line: 647, type: !33)
!325 = !DILocalVariable(name: "secbuf", scope: !326, file: !3, line: 652, type: !328)
!326 = distinct !DILexicalBlock(scope: !327, file: !3, line: 651, column: 5)
!327 = distinct !DILexicalBlock(scope: !304, file: !3, line: 648, column: 7)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 168, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 21)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 488, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 61)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "tz", scope: !304, file: !3, line: 643, type: !336, isLocal: true, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !337, line: 778, baseType: !338)
!337 = !DIFile(filename: "./lib/time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !337, line: 778, flags: DIFlagFwdDecl)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 392, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 49)
!343 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!344 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!345 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!346 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!347 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "Version", scope: !350, file: !351, line: 2, type: !30, isLocal: false, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, globals: !353, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!352 = !{}
!353 = !{!348}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !356, file: !357, line: 67, type: !361, isLocal: false, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, retainedTypes: !359, globals: !360, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!358 = !{!11}
!359 = !{!85, !30, !87}
!360 = !{!354}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !362, line: 61, baseType: !363)
!362 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "file_name", scope: !368, file: !369, line: 46, type: !30, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, globals: !370, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{!366, !371}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !368, file: !369, line: 56, type: !29, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "exit_failure", scope: !375, file: !376, line: 24, type: !378, isLocal: false, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, globals: !377, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!377 = !{!373}
!378 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "program_name", scope: !381, file: !382, line: 33, type: !30, isLocal: false, isDefinition: true)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !383, globals: !384, splitDebugInlining: false, nameTableKind: None)
!382 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!383 = !{!85, !37}
!384 = !{!379}
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !387, file: !388, line: 85, type: !431, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !389, retainedTypes: !395, globals: !396, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!389 = !{!11, !390, !69}
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!394 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!395 = !{!33, !86, !38, !37}
!396 = !{!385, !397, !403, !413, !415, !420, !427, !429}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !387, file: !388, line: 101, type: !399, isLocal: false, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 320, elements: !401)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!401 = !{!402}
!402 = !DISubrange(count: 10)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !387, file: !388, line: 1052, type: !405, isLocal: false, isDefinition: true)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !388, line: 65, size: 448, elements: !406)
!406 = !{!407, !408, !409, !411, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !405, file: !388, line: 68, baseType: !11, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !405, file: !388, line: 71, baseType: !33, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !405, file: !388, line: 75, baseType: !410, size: 256, offset: 64)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !237)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !405, file: !388, line: 78, baseType: !30, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !405, file: !388, line: 81, baseType: !30, size: 64, offset: 384)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !387, file: !388, line: 116, type: !405, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "slot0", scope: !387, file: !388, line: 842, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 256)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "slotvec", scope: !387, file: !388, line: 845, type: !422, isLocal: true, isDefinition: true)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !388, line: 834, size: 128, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !388, line: 836, baseType: !38, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !423, file: !388, line: 837, baseType: !37, size: 64, offset: 64)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "nslots", scope: !387, file: !388, line: 843, type: !33, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "slotvec0", scope: !387, file: !388, line: 844, type: !423, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 704, elements: !242)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !434, file: !435, line: 26, type: !437, isLocal: false, isDefinition: true)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, globals: !436, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = !{!432}
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 47)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !442, file: !443, line: 507, type: !33, isLocal: true, isDefinition: true)
!442 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !443, file: !443, line: 488, type: !444, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !446, retainedNodes: !448)
!443 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!444 = !DISubroutineType(types: !445)
!445 = !{!33, !33, !33}
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, globals: !447, splitDebugInlining: false, nameTableKind: None)
!447 = !{!440}
!448 = !{!449, !450, !451, !452, !455}
!449 = !DILocalVariable(name: "fd", arg: 1, scope: !442, file: !443, line: 488, type: !33)
!450 = !DILocalVariable(name: "target", arg: 2, scope: !442, file: !443, line: 488, type: !33)
!451 = !DILocalVariable(name: "result", scope: !442, file: !443, line: 490, type: !33)
!452 = !DILocalVariable(name: "flags", scope: !453, file: !443, line: 531, type: !33)
!453 = distinct !DILexicalBlock(scope: !454, file: !443, line: 530, column: 5)
!454 = distinct !DILexicalBlock(scope: !442, file: !443, line: 529, column: 7)
!455 = !DILocalVariable(name: "saved_errno", scope: !456, file: !443, line: 534, type: !33)
!456 = distinct !DILexicalBlock(scope: !457, file: !443, line: 533, column: 9)
!457 = distinct !DILexicalBlock(scope: !453, file: !443, line: 532, column: 11)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, retainedTypes: !460, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !{!37}
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !463, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = !{!464}
!464 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !465, file: !462, line: 64, baseType: !6, size: 32, elements: !495)
!465 = distinct !DISubprogram(name: "areadlink_with_size", scope: !462, file: !462, line: 53, type: !466, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !461, retainedNodes: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{!37, !30, !38}
!468 = !{!469, !470, !471, !472, !473, !474, !475, !479, !480, !484, !485, !486, !489}
!469 = !DILocalVariable(name: "file", arg: 1, scope: !465, file: !462, line: 53, type: !30)
!470 = !DILocalVariable(name: "size", arg: 2, scope: !465, file: !462, line: 53, type: !38)
!471 = !DILocalVariable(name: "symlink_max", scope: !465, file: !462, line: 58, type: !38)
!472 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !465, file: !462, line: 59, type: !38)
!473 = !DILocalVariable(name: "initial_limit", scope: !465, file: !462, line: 60, type: !38)
!474 = !DILocalVariable(name: "buf_size", scope: !465, file: !462, line: 67, type: !38)
!475 = !DILocalVariable(name: "r", scope: !476, file: !462, line: 72, type: !477)
!476 = distinct !DILexicalBlock(scope: !465, file: !462, line: 71, column: 5)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !289, line: 108, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !106, line: 194, baseType: !107)
!479 = !DILocalVariable(name: "link_length", scope: !476, file: !462, line: 73, type: !38)
!480 = !DILocalVariable(name: "stackbuf", scope: !476, file: !462, line: 74, type: !481)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 128)
!484 = !DILocalVariable(name: "buf", scope: !476, file: !462, line: 75, type: !37)
!485 = !DILocalVariable(name: "buffer", scope: !476, file: !462, line: 76, type: !37)
!486 = !DILocalVariable(name: "saved_errno", scope: !487, file: !462, line: 92, type: !33)
!487 = distinct !DILexicalBlock(scope: !488, file: !462, line: 91, column: 9)
!488 = distinct !DILexicalBlock(scope: !476, file: !462, line: 90, column: 11)
!489 = !DILocalVariable(name: "shrinked_buffer", scope: !490, file: !462, line: 110, type: !37)
!490 = distinct !DILexicalBlock(scope: !491, file: !462, line: 108, column: 13)
!491 = distinct !DILexicalBlock(scope: !492, file: !462, line: 107, column: 20)
!492 = distinct !DILexicalBlock(scope: !493, file: !462, line: 101, column: 15)
!493 = distinct !DILexicalBlock(scope: !494, file: !462, line: 99, column: 9)
!494 = distinct !DILexicalBlock(scope: !476, file: !462, line: 98, column: 11)
!495 = !{!496}
!496 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!497 = !{!85}
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !460, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/file-type.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "lib/filemode.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!510 = !{!511}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !139, line: 101, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !106, line: 72, baseType: !107)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !515, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "lib/nstrftime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!515 = !{!30, !6, !33, !516, !87, !517, !86, !107, !40, !518, !519, !38, !85, !41}
!516 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!517 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!518 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!519 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/save-cwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!524 = !{!525}
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !523, line: 40, baseType: !6, size: 32, elements: !526)
!526 = !{!527}
!527 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !530, retainedTypes: !544, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !{!531}
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !533, file: !532, line: 186, baseType: !6, size: 32, elements: !542)
!532 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = distinct !DISubprogram(name: "x2nrealloc", scope: !532, file: !532, line: 174, type: !534, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !528, retainedNodes: !537)
!534 = !DISubroutineType(types: !535)
!535 = !{!85, !85, !536, !38}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!537 = !{!538, !539, !540, !541}
!538 = !DILocalVariable(name: "p", arg: 1, scope: !533, file: !532, line: 174, type: !85)
!539 = !DILocalVariable(name: "pn", arg: 2, scope: !533, file: !532, line: 174, type: !536)
!540 = !DILocalVariable(name: "s", arg: 3, scope: !533, file: !532, line: 174, type: !38)
!541 = !DILocalVariable(name: "n", scope: !533, file: !532, line: 176, type: !38)
!542 = !{!543}
!543 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!544 = !{!38, !37, !85}
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/xasprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !383, splitDebugInlining: false, nameTableKind: None)
!554 = !DIFile(filename: "lib/chdir-long.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !557, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !{!38}
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !560, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "lib/mountlist.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!560 = !{!85, !149}
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !563, retainedTypes: !567, globals: !568, splitDebugInlining: false, nameTableKind: None)
!562 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !{!564}
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 50, baseType: !6, size: 32, elements: !565)
!565 = !{!566}
!566 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!567 = !{!37, !38}
!568 = !{!569}
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "local_tz", scope: !561, file: !562, line: 55, type: !571, isLocal: true, isDefinition: true)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !337, line: 778, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !575, line: 21, size: 128, elements: !576)
!575 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !575, line: 25, baseType: !573, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !574, file: !575, line: 36, baseType: !32, size: 8, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !574, file: !575, line: 48, baseType: !580, offset: 72)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: -1)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!586 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !591, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!591 = !{!592}
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !593, line: 41, baseType: !6, size: 32, elements: !594)
!593 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!595 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!596 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!597 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!598 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!599 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!600 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!601 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!602 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!603 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!604 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!605 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!606 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!607 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!608 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!609 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!610 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!611 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!612 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!613 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!614 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!615 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!616 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!617 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!618 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!619 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!620 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!621 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!622 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!623 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!624 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!625 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!626 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!627 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!628 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!629 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!630 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!631 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!632 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!633 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!634 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!635 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!636 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!637 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!638 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!639 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!640 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!641 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!642 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!643 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!644 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!703 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!706 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!707 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!708 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!709 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!710 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!711 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!712 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!713 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!714 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!715 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!716 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!717 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!790 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!863 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!864 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!865 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!866 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!867 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!868 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!869 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!870 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!871 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!872 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!873 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!874 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!875 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!876 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!877 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!879 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!880 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!881 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!882 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!883 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!884 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!910 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!911 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!912 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!913 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!914 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!919 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!920 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!921 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!922 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !460, splitDebugInlining: false, nameTableKind: None)
!983 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!984 = distinct !DICompileUnit(language: DW_LANG_C99, file: !985, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!985 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !989, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!989 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!992 = !{!"clang version 12.0.1"}
!993 = !{i32 7, !"Dwarf Version", i32 4}
!994 = !{i32 2, !"Debug Info Version", i32 3}
!995 = !{i32 1, !"wchar_size", i32 4}
!996 = !{i32 7, !"PIC Level", i32 2}
!997 = !{i32 7, !"PIE Level", i32 2}
!998 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1685, type: !999, scopeLine: 1686, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1001)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !33}
!1001 = !{!1002}
!1002 = !DILocalVariable(name: "status", arg: 1, scope: !998, file: !3, line: 1685, type: !33)
!1003 = !DILocation(line: 0, scope: !998)
!1004 = !DILocation(line: 1687, column: 14, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !998, file: !3, line: 1687, column: 7)
!1006 = !DILocation(line: 1687, column: 7, scope: !998)
!1007 = !DILocation(line: 1688, column: 5, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1688, column: 5)
!1009 = !{!1010, !1010, i64 0}
!1010 = !{!"any pointer", !1011, i64 0}
!1011 = !{!"omnipotent char", !1012, i64 0}
!1012 = !{!"Simple C/C++ TBAA"}
!1013 = !DILocation(line: 1691, column: 7, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1690, column: 5)
!1015 = !DILocation(line: 1692, column: 7, scope: !1014)
!1016 = !DILocation(line: 590, column: 3, scope: !1017, inlinedAt: !1019)
!1017 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !1018, file: !1018, line: 588, type: !364, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !352)
!1018 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1019 = distinct !DILocation(line: 1696, column: 7, scope: !1014)
!1020 = !DILocation(line: 1698, column: 7, scope: !1014)
!1021 = !DILocation(line: 1702, column: 7, scope: !1014)
!1022 = !DILocation(line: 1706, column: 7, scope: !1014)
!1023 = !DILocation(line: 1714, column: 7, scope: !1014)
!1024 = !DILocation(line: 1715, column: 7, scope: !1014)
!1025 = !DILocation(line: 1717, column: 7, scope: !1014)
!1026 = !DILocation(line: 1724, column: 7, scope: !1014)
!1027 = !DILocation(line: 1733, column: 7, scope: !1014)
!1028 = !DILocation(line: 1741, column: 7, scope: !1014)
!1029 = !DILocation(line: 1752, column: 7, scope: !1014)
!1030 = !DILocation(line: 1766, column: 7, scope: !1014)
!1031 = !DILocation(line: 1775, column: 7, scope: !1014)
!1032 = !DILocation(line: 1785, column: 7, scope: !1014)
!1033 = !DILocation(line: 1796, column: 9, scope: !1014)
!1034 = !DILocation(line: 1801, column: 7, scope: !1014)
!1035 = !DILocalVariable(name: "program", arg: 1, scope: !1036, file: !1018, line: 634, type: !30)
!1036 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !1018, file: !1018, line: 634, type: !1037, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1039)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !30}
!1039 = !{!1035, !1040, !1049, !1050, !1052}
!1040 = !DILocalVariable(name: "infomap", scope: !1036, file: !1018, line: 636, type: !1041)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 896, elements: !1047)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1036, file: !1018, line: 636, size: 128, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1043, file: !1018, line: 636, baseType: !30, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1043, file: !1018, line: 636, baseType: !30, size: 64, offset: 64)
!1047 = !{!1048}
!1048 = !DISubrange(count: 7)
!1049 = !DILocalVariable(name: "node", scope: !1036, file: !1018, line: 646, type: !30)
!1050 = !DILocalVariable(name: "map_prog", scope: !1036, file: !1018, line: 647, type: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1052 = !DILocalVariable(name: "lc_messages", scope: !1036, file: !1018, line: 659, type: !30)
!1053 = !DILocation(line: 0, scope: !1036, inlinedAt: !1054)
!1054 = distinct !DILocation(line: 1802, column: 7, scope: !1014)
!1055 = !DILocation(line: 636, column: 3, scope: !1036, inlinedAt: !1054)
!1056 = !DILocation(line: 636, column: 67, scope: !1036, inlinedAt: !1054)
!1057 = !DILocation(line: 647, column: 36, scope: !1036, inlinedAt: !1054)
!1058 = !DILocation(line: 649, column: 3, scope: !1036, inlinedAt: !1054)
!1059 = !DILocation(line: 649, column: 33, scope: !1036, inlinedAt: !1054)
!1060 = !DILocation(line: 650, column: 13, scope: !1036, inlinedAt: !1054)
!1061 = !DILocation(line: 649, column: 20, scope: !1036, inlinedAt: !1054)
!1062 = !{!1063, !1010, i64 0}
!1063 = !{!"infomap", !1010, i64 0, !1010, i64 8}
!1064 = !DILocation(line: 649, column: 10, scope: !1036, inlinedAt: !1054)
!1065 = !DILocation(line: 649, column: 28, scope: !1036, inlinedAt: !1054)
!1066 = distinct !{!1066, !1058, !1060, !1067}
!1067 = !{!"llvm.loop.mustprogress"}
!1068 = !DILocation(line: 652, column: 17, scope: !1069, inlinedAt: !1054)
!1069 = distinct !DILexicalBlock(scope: !1036, file: !1018, line: 652, column: 7)
!1070 = !{!1063, !1010, i64 8}
!1071 = !DILocation(line: 652, column: 7, scope: !1069, inlinedAt: !1054)
!1072 = !DILocation(line: 652, column: 7, scope: !1036, inlinedAt: !1054)
!1073 = !DILocation(line: 655, column: 3, scope: !1036, inlinedAt: !1054)
!1074 = !DILocation(line: 659, column: 29, scope: !1036, inlinedAt: !1054)
!1075 = !DILocation(line: 660, column: 7, scope: !1076, inlinedAt: !1054)
!1076 = distinct !DILexicalBlock(scope: !1036, file: !1018, line: 660, column: 7)
!1077 = !DILocation(line: 660, column: 19, scope: !1076, inlinedAt: !1054)
!1078 = !DILocation(line: 660, column: 22, scope: !1076, inlinedAt: !1054)
!1079 = !DILocation(line: 660, column: 7, scope: !1036, inlinedAt: !1054)
!1080 = !DILocation(line: 666, column: 7, scope: !1081, inlinedAt: !1054)
!1081 = distinct !DILexicalBlock(scope: !1076, file: !1018, line: 661, column: 5)
!1082 = !DILocation(line: 668, column: 5, scope: !1081, inlinedAt: !1054)
!1083 = !DILocation(line: 669, column: 3, scope: !1036, inlinedAt: !1054)
!1084 = !DILocation(line: 671, column: 3, scope: !1036, inlinedAt: !1054)
!1085 = !DILocation(line: 673, column: 1, scope: !1036, inlinedAt: !1054)
!1086 = !DILocation(line: 1804, column: 3, scope: !998)
!1087 = !DISubprogram(name: "dcgettext", scope: !1088, file: !1088, line: 51, type: !1089, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !352)
!1088 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!37, !30, !30, !33}
!1091 = !DISubprogram(name: "fputs_unlocked", scope: !1092, file: !1092, line: 667, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !352)
!1092 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!33, !30, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1097, line: 49, size: 1728, elements: !1098)
!1097 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1124, !1127, !1129, !1132, !1135, !1136, !1137, !1138, !1139}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1096, file: !1097, line: 51, baseType: !33, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1096, file: !1097, line: 54, baseType: !37, size: 64, offset: 64)
