; ModuleID = 'coreutils-8.32/src/stdbuf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.anon = type { i64, i32, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.allocator = type { i8* (i64)*, i8* (i8*, i64)*, void (i8*)*, void (i64)* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... COMMAND\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !46, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !30, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/stdbuf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 87, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124, isUnsigned: true)
!10 = !DIEnumerator(name: "EXIT_CANCELED", value: 125, isUnsigned: true)
!11 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126, isUnsigned: true)
!12 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !14, line: 25, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !26, line: 102, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !28, line: 73, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !{!31, !33, !0}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_path", scope: !2, file: !3, line: 40, type: !22, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "stdbuf", scope: !2, file: !3, line: 47, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 576, elements: !44)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 192, elements: !37)
!37 = !{!38, !41, !43}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !3, line: 44, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !40, line: 46, baseType: !29)
!40 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "optc", scope: !36, file: !3, line: 45, baseType: !42, size: 32, offset: 64)
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "optarg", scope: !36, file: !3, line: 46, baseType: !22, size: 64, offset: 128)
!44 = !{!45}
!45 = !DISubrange(count: 3)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1536, elements: !58)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !49, line: 50, size: 256, elements: !50)
!49 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!50 = !{!51, !54, !55, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !49, line: 52, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !48, file: !49, line: 55, baseType: !42, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !48, file: !49, line: 56, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !48, file: !49, line: 57, baseType: !42, size: 32, offset: 192)
!58 = !{!59}
!59 = !DISubrange(count: 6)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "Version", scope: !62, file: !63, line: 2, type: !52, isLocal: false, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, globals: !65, splitDebugInlining: false, nameTableKind: None)
!63 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!64 = !{}
!65 = !{!60}
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "file_name", scope: !68, file: !69, line: 46, type: !52, isLocal: true, isDefinition: true)
!68 = distinct !DICompileUnit(language: DW_LANG_C99, file: !69, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, globals: !70, splitDebugInlining: false, nameTableKind: None)
!69 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!70 = !{!66, !71}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !68, file: !69, line: 56, type: !73, isLocal: true, isDefinition: true)
!73 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "exit_failure", scope: !76, file: !77, line: 24, type: !79, isLocal: false, isDefinition: true)
!76 = distinct !DICompileUnit(language: DW_LANG_C99, file: !77, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, globals: !78, splitDebugInlining: false, nameTableKind: None)
!77 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !{!74}
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "program_name", scope: !82, file: !83, line: 33, type: !52, isLocal: false, isDefinition: true)
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !83, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !84, globals: !85, splitDebugInlining: false, nameTableKind: None)
!83 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!84 = !{!24, !22}
!85 = !{!80}
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !88, file: !89, line: 85, type: !164, isLocal: false, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !90, retainedTypes: !125, globals: !127, splitDebugInlining: false, nameTableKind: None)
!89 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!90 = !{!91, !105, !110}
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !92, line: 32, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!94 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!98 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!99 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!100 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!101 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!102 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!103 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!104 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !92, line: 242, baseType: !7, size: 32, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 46, baseType: !7, size: 32, elements: !112)
!111 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!113 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!116 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!117 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!119 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!120 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!121 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!124 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!125 = !{!42, !126, !39, !22}
!126 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!127 = !{!86, !128, !134, !146, !148, !153, !160, !162}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !88, file: !89, line: 101, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 320, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!132 = !{!133}
!133 = !DISubrange(count: 10)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !88, file: !89, line: 1052, type: !136, isLocal: false, isDefinition: true)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !89, line: 65, size: 448, elements: !137)
!137 = !{!138, !139, !140, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !136, file: !89, line: 68, baseType: !91, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !89, line: 71, baseType: !42, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !136, file: !89, line: 75, baseType: !141, size: 256, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !136, file: !89, line: 78, baseType: !52, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !136, file: !89, line: 81, baseType: !52, size: 64, offset: 384)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !88, file: !89, line: 116, type: !136, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "slot0", scope: !88, file: !89, line: 842, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 256)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "slotvec", scope: !88, file: !89, line: 845, type: !155, isLocal: true, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !89, line: 834, size: 128, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !89, line: 836, baseType: !39, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !156, file: !89, line: 837, baseType: !22, size: 64, offset: 64)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "nslots", scope: !88, file: !89, line: 843, type: !42, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "slotvec0", scope: !88, file: !89, line: 844, type: !156, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 704, elements: !166)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!166 = !{!167}
!167 = !DISubrange(count: 11)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !170, file: !171, line: 26, type: !173, isLocal: false, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, globals: !172, splitDebugInlining: false, nameTableKind: None)
!171 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !{!168}
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 376, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 47)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "stdlib_allocator", scope: !178, file: !179, line: 5, type: !181, isLocal: false, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, globals: !180, splitDebugInlining: false, nameTableKind: None)
!179 = !DIFile(filename: "lib/allocator.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !{!176}
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator", file: !183, line: 27, size: 256, elements: !184)
!183 = !DIFile(filename: "./lib/allocator.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !{!185, !189, !193, !197}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !182, file: !183, line: 37, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!24, !39}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate", scope: !182, file: !183, line: 43, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!24, !24, !39}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !182, file: !183, line: 46, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !24}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !182, file: !183, line: 52, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !39}
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, splitDebugInlining: false, nameTableKind: None)
!202 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !207, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !{!22}
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!209 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !{!24}
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!212 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !215, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!214 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!216}
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !214, line: 40, baseType: !7, size: 32, elements: !217)
!217 = !{!218}
!218 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !221, retainedTypes: !235, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!221 = !{!222}
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !224, file: !223, line: 186, baseType: !7, size: 32, elements: !233)
!223 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!224 = distinct !DISubprogram(name: "x2nrealloc", scope: !223, file: !223, line: 174, type: !225, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !228)
!225 = !DISubroutineType(types: !226)
!226 = !{!24, !24, !227, !39}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!228 = !{!229, !230, !231, !232}
!229 = !DILocalVariable(name: "p", arg: 1, scope: !224, file: !223, line: 174, type: !24)
!230 = !DILocalVariable(name: "pn", arg: 2, scope: !224, file: !223, line: 174, type: !227)
!231 = !DILocalVariable(name: "s", arg: 3, scope: !224, file: !223, line: 174, type: !39)
!232 = !DILocalVariable(name: "n", scope: !224, file: !223, line: 176, type: !39)
!233 = !{!234}
!234 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!235 = !{!39, !22, !24}
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "lib/xreadlink.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!242 = !{!13, !110}
!243 = !{!42, !126}
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !248, splitDebugInlining: false, nameTableKind: None)
!247 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = !{!39}
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, splitDebugInlining: false, nameTableKind: None)
!250 = !DIFile(filename: "lib/areadlink.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !253, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "lib/careadlinkat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !{!39, !22}
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, splitDebugInlining: false, nameTableKind: None)
!257 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!260 = !{!261}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 41, baseType: !7, size: 32, elements: !263)
!262 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!264 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!265 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!266 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!267 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!268 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!269 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!270 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!271 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!272 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!273 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!274 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!275 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!276 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!277 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!278 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!279 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!280 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!281 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!282 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!283 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!284 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!285 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!286 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!287 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!288 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!289 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!290 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!291 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!292 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!293 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!294 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!295 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!296 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!297 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!298 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!299 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!300 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!301 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!302 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!303 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!304 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!305 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!306 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!307 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!308 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!309 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!310 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!311 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!312 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!313 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!372 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!375 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!376 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!377 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!378 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!379 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!380 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!381 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!382 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!383 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!384 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!385 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!386 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!459 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!532 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!533 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!534 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!535 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!536 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!537 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!538 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!539 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!540 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!541 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!542 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!543 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!544 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!545 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!546 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!548 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!549 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!550 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!551 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!552 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!553 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!579 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!580 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!581 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!582 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!583 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!588 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!589 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!590 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!591 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!655 = !{!"clang version 12.0.1"}
!656 = !{i32 7, !"Dwarf Version", i32 4}
!657 = !{i32 2, !"Debug Info Version", i32 3}
!658 = !{i32 1, !"wchar_size", i32 4}
!659 = !{i32 7, !"PIC Level", i32 2}
!660 = !{i32 7, !"PIE Level", i32 2}
!661 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 85, type: !662, scopeLine: 86, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !664)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !42}
!664 = !{!665}
!665 = !DILocalVariable(name: "status", arg: 1, scope: !661, file: !3, line: 85, type: !42)
!666 = !DILocation(line: 0, scope: !661)
!667 = !DILocation(line: 87, column: 14, scope: !668)
!668 = distinct !DILexicalBlock(scope: !661, file: !3, line: 87, column: 7)
!669 = !DILocation(line: 87, column: 7, scope: !661)
!670 = !DILocation(line: 88, column: 5, scope: !671)
!671 = distinct !DILexicalBlock(scope: !668, file: !3, line: 88, column: 5)
!672 = !{!673, !673, i64 0}
!673 = !{!"any pointer", !674, i64 0}
!674 = !{!"omnipotent char", !675, i64 0}
!675 = !{!"Simple C/C++ TBAA"}
!676 = !DILocation(line: 91, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !668, file: !3, line: 90, column: 5)
!678 = !DILocation(line: 92, column: 7, scope: !677)
!679 = !DILocation(line: 590, column: 3, scope: !680, inlinedAt: !683)
!680 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !6, file: !6, line: 588, type: !681, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !64)
!681 = !DISubroutineType(types: !682)
!682 = !{null}
!683 = distinct !DILocation(line: 96, column: 7, scope: !677)
!684 = !DILocation(line: 98, column: 7, scope: !677)
!685 = !DILocation(line: 103, column: 7, scope: !677)
!686 = !DILocation(line: 104, column: 7, scope: !677)
!687 = !DILocation(line: 105, column: 7, scope: !677)
!688 = !DILocation(line: 108, column: 7, scope: !677)
!689 = !DILocation(line: 111, column: 7, scope: !677)
!690 = !DILocation(line: 118, column: 7, scope: !677)
!691 = !DILocalVariable(name: "program", arg: 1, scope: !692, file: !6, line: 634, type: !52)
!692 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !6, file: !6, line: 634, type: !693, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !52}
!695 = !{!691, !696, !705, !706, !708}
!696 = !DILocalVariable(name: "infomap", scope: !692, file: !6, line: 636, type: !697)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 896, elements: !703)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !692, file: !6, line: 636, size: 128, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !699, file: !6, line: 636, baseType: !52, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !699, file: !6, line: 636, baseType: !52, size: 64, offset: 64)
!703 = !{!704}
!704 = !DISubrange(count: 7)
!705 = !DILocalVariable(name: "node", scope: !692, file: !6, line: 646, type: !52)
!706 = !DILocalVariable(name: "map_prog", scope: !692, file: !6, line: 647, type: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!708 = !DILocalVariable(name: "lc_messages", scope: !692, file: !6, line: 659, type: !52)
!709 = !DILocation(line: 0, scope: !692, inlinedAt: !710)
!710 = distinct !DILocation(line: 124, column: 7, scope: !677)
!711 = !DILocation(line: 636, column: 3, scope: !692, inlinedAt: !710)
!712 = !DILocation(line: 636, column: 67, scope: !692, inlinedAt: !710)
!713 = !DILocation(line: 647, column: 36, scope: !692, inlinedAt: !710)
!714 = !DILocation(line: 649, column: 3, scope: !692, inlinedAt: !710)
!715 = !DILocation(line: 649, column: 33, scope: !692, inlinedAt: !710)
!716 = !DILocation(line: 650, column: 13, scope: !692, inlinedAt: !710)
!717 = !DILocation(line: 649, column: 20, scope: !692, inlinedAt: !710)
!718 = !{!719, !673, i64 0}
!719 = !{!"infomap", !673, i64 0, !673, i64 8}
!720 = !DILocation(line: 649, column: 10, scope: !692, inlinedAt: !710)
!721 = !DILocation(line: 649, column: 28, scope: !692, inlinedAt: !710)
!722 = distinct !{!722, !714, !716, !723}
!723 = !{!"llvm.loop.mustprogress"}
!724 = !DILocation(line: 652, column: 17, scope: !725, inlinedAt: !710)
!725 = distinct !DILexicalBlock(scope: !692, file: !6, line: 652, column: 7)
!726 = !{!719, !673, i64 8}
!727 = !DILocation(line: 652, column: 7, scope: !725, inlinedAt: !710)
!728 = !DILocation(line: 652, column: 7, scope: !692, inlinedAt: !710)
!729 = !DILocation(line: 655, column: 3, scope: !692, inlinedAt: !710)
!730 = !DILocation(line: 659, column: 29, scope: !692, inlinedAt: !710)
!731 = !DILocation(line: 660, column: 7, scope: !732, inlinedAt: !710)
!732 = distinct !DILexicalBlock(scope: !692, file: !6, line: 660, column: 7)
!733 = !DILocation(line: 660, column: 19, scope: !732, inlinedAt: !710)
!734 = !DILocation(line: 660, column: 22, scope: !732, inlinedAt: !710)
!735 = !DILocation(line: 660, column: 7, scope: !692, inlinedAt: !710)
!736 = !DILocation(line: 666, column: 7, scope: !737, inlinedAt: !710)
!737 = distinct !DILexicalBlock(scope: !732, file: !6, line: 661, column: 5)
!738 = !DILocation(line: 668, column: 5, scope: !737, inlinedAt: !710)
!739 = !DILocation(line: 669, column: 3, scope: !692, inlinedAt: !710)
!740 = !DILocation(line: 671, column: 3, scope: !692, inlinedAt: !710)
!741 = !DILocation(line: 673, column: 1, scope: !692, inlinedAt: !710)
!742 = !DILocation(line: 126, column: 3, scope: !661)
!743 = !DISubprogram(name: "dcgettext", scope: !744, file: !744, line: 51, type: !745, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !64)
!744 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!745 = !DISubroutineType(types: !746)
!746 = !{!22, !52, !52, !42}
!747 = !DISubprogram(name: "fputs_unlocked", scope: !748, file: !748, line: 667, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !64)
!748 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!749 = !DISubroutineType(types: !750)
!750 = !{!42, !52, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !753, line: 49, size: 1728, elements: !754)
!753 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !770, !771, !772, !773, !776, !777, !779, !783, !786, !788, !791, !794, !795, !796, !797, !798}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !752, file: !753, line: 51, baseType: !42, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !752, file: !753, line: 54, baseType: !22, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !752, file: !753, line: 55, baseType: !22, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !752, file: !753, line: 56, baseType: !22, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !752, file: !753, line: 57, baseType: !22, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !752, file: !753, line: 58, baseType: !22, size: 64, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !752, file: !753, line: 59, baseType: !22, size: 64, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !752, file: !753, line: 60, baseType: !22, size: 64, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !752, file: !753, line: 61, baseType: !22, size: 64, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !752, file: !753, line: 64, baseType: !22, size: 64, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !752, file: !753, line: 65, baseType: !22, size: 64, offset: 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !752, file: !753, line: 66, baseType: !22, size: 64, offset: 704)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !752, file: !753, line: 68, baseType: !768, size: 64, offset: 768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !753, line: 36, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !752, file: !753, line: 70, baseType: !751, size: 64, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !752, file: !753, line: 72, baseType: !42, size: 32, offset: 896)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !752, file: !753, line: 73, baseType: !42, size: 32, offset: 928)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !752, file: !753, line: 74, baseType: !774, size: 64, offset: 960)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 152, baseType: !775)
!775 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !752, file: !753, line: 77, baseType: !126, size: 16, offset: 1024)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !752, file: !753, line: 78, baseType: !778, size: 8, offset: 1040)
!778 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !752, file: !753, line: 79, baseType: !780, size: 8, offset: 1048)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 1)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !752, file: !753, line: 81, baseType: !784, size: 64, offset: 1088)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !753, line: 43, baseType: null)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !752, file: !753, line: 89, baseType: !787, size: 64, offset: 1152)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 153, baseType: !775)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !752, file: !753, line: 91, baseType: !789, size: 64, offset: 1216)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !753, line: 37, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !752, file: !753, line: 92, baseType: !792, size: 64, offset: 1280)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !753, line: 38, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !752, file: !753, line: 93, baseType: !751, size: 64, offset: 1344)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !752, file: !753, line: 94, baseType: !24, size: 64, offset: 1408)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !752, file: !753, line: 95, baseType: !39, size: 64, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !752, file: !753, line: 96, baseType: !42, size: 32, offset: 1536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !752, file: !753, line: 98, baseType: !799, size: 160, offset: 1568)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 20)
!802 = !DISubprogram(name: "setlocale", scope: !803, file: !803, line: 122, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !64)
!803 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!804 = !DISubroutineType(types: !805)
!805 = !{!22, !42, !52}
!806 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 312, type: !807, scopeLine: 313, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !810)
!807 = !DISubroutineType(types: !808)
!808 = !{!42, !42, !809}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!810 = !{!811, !812, !813, !814, !816}
!811 = !DILocalVariable(name: "argc", arg: 1, scope: !806, file: !3, line: 312, type: !42)
!812 = !DILocalVariable(name: "argv", arg: 2, scope: !806, file: !3, line: 312, type: !809)
!813 = !DILocalVariable(name: "c", scope: !806, file: !3, line: 314, type: !42)
!814 = !DILocalVariable(name: "opt_fileno", scope: !815, file: !3, line: 327, type: !42)
!815 = distinct !DILexicalBlock(scope: !806, file: !3, line: 326, column: 5)
!816 = !DILocalVariable(name: "exit_status", scope: !806, file: !3, line: 391, type: !42)
!817 = !DILocation(line: 0, scope: !806)
!818 = !DILocation(line: 317, column: 21, scope: !806)
!819 = !DILocation(line: 317, column: 3, scope: !806)
!820 = !DILocation(line: 318, column: 3, scope: !806)
!821 = !DILocation(line: 319, column: 3, scope: !806)
!822 = !DILocation(line: 320, column: 3, scope: !806)
!823 = !DILocalVariable(name: "status", arg: 1, scope: !824, file: !6, line: 99, type: !42)
!824 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !6, file: !6, line: 99, type: !662, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !825)
!825 = !{!823}
!826 = !DILocation(line: 0, scope: !824, inlinedAt: !827)
!827 = distinct !DILocation(line: 322, column: 3, scope: !806)
!828 = !DILocation(line: 102, column: 18, scope: !829, inlinedAt: !827)
!829 = distinct !DILexicalBlock(scope: !824, file: !6, line: 101, column: 7)
!830 = !{!831, !831, i64 0}
!831 = !{!"int", !674, i64 0}
!832 = !DILocation(line: 323, column: 3, scope: !806)
!833 = !DILocation(line: 325, column: 3, scope: !806)
!834 = !DILocation(line: 325, column: 15, scope: !806)
!835 = !DILocalVariable(name: "ret", scope: !836, file: !3, line: 170, type: !42)
!836 = distinct !DISubprogram(name: "optc_to_fileno", scope: !3, file: !3, line: 168, type: !837, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !839)
!837 = !DISubroutineType(types: !838)
!838 = !{!42, !42}
!839 = !{!840, !835}
!840 = !DILocalVariable(name: "c", arg: 1, scope: !836, file: !3, line: 168, type: !42)
!841 = !DILocation(line: 0, scope: !836, inlinedAt: !842)
!842 = distinct !DILocation(line: 335, column: 24, scope: !843)
!843 = distinct !DILexicalBlock(scope: !815, file: !3, line: 330, column: 9)
!844 = !DILocation(line: 179, column: 7, scope: !845, inlinedAt: !842)
!845 = distinct !DILexicalBlock(scope: !836, file: !3, line: 173, column: 5)
!846 = !DILocation(line: 182, column: 7, scope: !845, inlinedAt: !842)
!847 = !DILocation(line: 0, scope: !815)
!848 = !DILocation(line: 337, column: 30, scope: !843)
!849 = !DILocation(line: 337, column: 35, scope: !843)
!850 = !{!851, !831, i64 8}
!851 = !{!"", !852, i64 0, !831, i64 8, !673, i64 16}
!852 = !{!"long", !674, i64 0}
!853 = !DILocation(line: 338, column: 30, scope: !843)
!854 = !DILocation(line: 338, column: 11, scope: !843)
!855 = !DILocation(line: 338, column: 29, scope: !843)
!856 = !{!674, !674, i64 0}
!857 = !DILocalVariable(name: "c", arg: 1, scope: !858, file: !859, line: 300, type: !42)
!858 = distinct !DISubprogram(name: "c_isspace", scope: !859, file: !859, line: 300, type: !860, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !862)
!859 = !DIFile(filename: "./lib/c-ctype.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!860 = !DISubroutineType(types: !861)
!861 = !{!73, !42}
!862 = !{!857}
!863 = !DILocation(line: 0, scope: !858, inlinedAt: !864)
!864 = distinct !DILocation(line: 338, column: 18, scope: !843)
!865 = !DILocation(line: 302, column: 3, scope: !858, inlinedAt: !864)
!866 = !DILocation(line: 339, column: 19, scope: !843)
!867 = distinct !{!867, !854, !866, !723}
!868 = !DILocation(line: 340, column: 30, scope: !843)
!869 = !DILocation(line: 340, column: 37, scope: !843)
!870 = !{!851, !673, i64 16}
!871 = !DILocation(line: 341, column: 17, scope: !872)
!872 = distinct !DILexicalBlock(scope: !843, file: !3, line: 341, column: 15)
!873 = !DILocation(line: 341, column: 24, scope: !872)
!874 = !DILocation(line: 341, column: 27, scope: !872)
!875 = !DILocation(line: 341, column: 35, scope: !872)
!876 = !DILocation(line: 341, column: 15, scope: !843)
!877 = !DILocation(line: 346, column: 28, scope: !878)
!878 = distinct !DILexicalBlock(scope: !872, file: !3, line: 342, column: 13)
!879 = !DILocation(line: 346, column: 15, scope: !878)
!880 = !DILocation(line: 347, column: 15, scope: !878)
!881 = !DILocation(line: 350, column: 16, scope: !882)
!882 = distinct !DILexicalBlock(scope: !843, file: !3, line: 350, column: 15)
!883 = !DILocation(line: 351, column: 15, scope: !882)
!884 = !DILocalVariable(name: "str", arg: 1, scope: !885, file: !3, line: 66, type: !52)
!885 = distinct !DISubprogram(name: "parse_size", scope: !3, file: !3, line: 66, type: !886, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !888)
!886 = !DISubroutineType(types: !887)
!887 = !{!42, !52, !227}
!888 = !{!884, !889, !890, !891}
!889 = !DILocalVariable(name: "size", arg: 2, scope: !885, file: !3, line: 66, type: !227)
!890 = !DILocalVariable(name: "tmp_size", scope: !885, file: !3, line: 68, type: !25)
!891 = !DILocalVariable(name: "e", scope: !885, file: !3, line: 69, type: !13)
!892 = !DILocation(line: 0, scope: !885, inlinedAt: !893)
!893 = distinct !DILocation(line: 351, column: 18, scope: !882)
!894 = !DILocation(line: 68, column: 3, scope: !885, inlinedAt: !893)
!895 = !DILocation(line: 69, column: 25, scope: !885, inlinedAt: !893)
!896 = !DILocation(line: 73, column: 7, scope: !885, inlinedAt: !893)
!897 = !DILocation(line: 80, column: 3, scope: !885, inlinedAt: !893)
!898 = !DILocation(line: 80, column: 48, scope: !885, inlinedAt: !893)
!899 = !DILocation(line: 80, column: 12, scope: !885, inlinedAt: !893)
!900 = !DILocation(line: 351, column: 58, scope: !882)
!901 = !DILocation(line: 75, column: 7, scope: !902, inlinedAt: !893)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 74, column: 5)
!903 = distinct !DILexicalBlock(scope: !885, file: !3, line: 73, column: 7)
!904 = !DILocation(line: 75, column: 13, scope: !902, inlinedAt: !893)
!905 = !DILocation(line: 76, column: 15, scope: !902, inlinedAt: !893)
!906 = !{!852, !852, i64 0}
!907 = !DILocation(line: 76, column: 13, scope: !902, inlinedAt: !893)
!908 = !DILocation(line: 82, column: 1, scope: !885, inlinedAt: !893)
!909 = !DILocation(line: 350, column: 15, scope: !843)
!910 = distinct !{!910, !833, !911, !723}
!911 = !DILocation(line: 363, column: 5, scope: !806)
!912 = !DILocation(line: 80, column: 9, scope: !885, inlinedAt: !893)
!913 = !DILocation(line: 352, column: 13, scope: !882)
!914 = !DILocation(line: 356, column: 9, scope: !843)
!915 = !DILocation(line: 358, column: 9, scope: !843)
!916 = !DILocation(line: 361, column: 11, scope: !843)
!917 = !DILocation(line: 365, column: 11, scope: !806)
!918 = !DILocation(line: 365, column: 8, scope: !806)
!919 = !DILocation(line: 369, column: 12, scope: !920)
!920 = distinct !DILexicalBlock(scope: !806, file: !3, line: 369, column: 7)
!921 = !DILocation(line: 369, column: 7, scope: !806)
!922 = !DILocation(line: 371, column: 20, scope: !923)
!923 = distinct !DILexicalBlock(scope: !920, file: !3, line: 370, column: 5)
!924 = !DILocation(line: 371, column: 7, scope: !923)
!925 = !DILocation(line: 372, column: 7, scope: !923)
!926 = !DILocalVariable(name: "env_set", scope: !927, file: !3, line: 278, type: !73)
!927 = distinct !DISubprogram(name: "set_libstdbuf_options", scope: !3, file: !3, line: 276, type: !928, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !930)
!928 = !DISubroutineType(types: !929)
!929 = !{!73}
!930 = !{!926, !931, !933, !938, !939, !942, !947, !949}
!931 = !DILocalVariable(name: "i", scope: !932, file: !3, line: 280, type: !39)
!932 = distinct !DILexicalBlock(scope: !927, file: !3, line: 280, column: 3)
!933 = !DILocalVariable(name: "var", scope: !934, file: !3, line: 284, type: !22)
!934 = distinct !DILexicalBlock(scope: !935, file: !3, line: 283, column: 9)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 282, column: 11)
!936 = distinct !DILexicalBlock(scope: !937, file: !3, line: 281, column: 5)
!937 = distinct !DILexicalBlock(scope: !932, file: !3, line: 280, column: 3)
!938 = !DILocalVariable(name: "ret", scope: !934, file: !3, line: 285, type: !42)
!939 = !DILocalVariable(name: "__res", scope: !940, file: !3, line: 288, type: !42)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 288, column: 19)
!941 = distinct !DILexicalBlock(scope: !934, file: !3, line: 287, column: 15)
!942 = !DILocalVariable(name: "__c", scope: !943, file: !3, line: 288, type: !42)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 288, column: 19)
!944 = distinct !DILexicalBlock(scope: !945, file: !3, line: 288, column: 19)
!945 = distinct !DILexicalBlock(scope: !946, file: !3, line: 288, column: 19)
!946 = distinct !DILexicalBlock(scope: !940, file: !3, line: 288, column: 19)
!947 = !DILocalVariable(name: "__res", scope: !948, file: !3, line: 291, type: !42)
!948 = distinct !DILexicalBlock(scope: !941, file: !3, line: 291, column: 19)
!949 = !DILocalVariable(name: "__c", scope: !950, file: !3, line: 291, type: !42)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 291, column: 19)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 291, column: 19)
!952 = distinct !DILexicalBlock(scope: !953, file: !3, line: 291, column: 19)
!953 = distinct !DILexicalBlock(scope: !948, file: !3, line: 291, column: 19)
!954 = !DILocation(line: 0, scope: !927, inlinedAt: !955)
!955 = distinct !DILocation(line: 375, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !806, file: !3, line: 375, column: 7)
!957 = !DILocation(line: 0, scope: !932, inlinedAt: !955)
!958 = !DILocation(line: 282, column: 21, scope: !935, inlinedAt: !955)
!959 = !DILocation(line: 282, column: 11, scope: !935, inlinedAt: !955)
!960 = !DILocation(line: 282, column: 11, scope: !936, inlinedAt: !955)
!961 = !DILocation(line: 284, column: 11, scope: !934, inlinedAt: !955)
!962 = !DILocation(line: 287, column: 15, scope: !941, inlinedAt: !955)
!963 = !DILocation(line: 287, column: 33, scope: !941, inlinedAt: !955)
!964 = !DILocation(line: 0, scope: !941, inlinedAt: !955)
!965 = !DILocalVariable(name: "__c", arg: 1, scope: !966, file: !111, line: 213, type: !42)
!966 = distinct !DISubprogram(name: "toupper", scope: !111, file: !111, line: 213, type: !837, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !967)
!967 = !{!965}
!968 = !DILocation(line: 0, scope: !966, inlinedAt: !969)
!969 = distinct !DILocation(line: 288, column: 19, scope: !944, inlinedAt: !955)
!970 = !DILocation(line: 0, scope: !966, inlinedAt: !971)
!971 = distinct !DILocation(line: 291, column: 19, scope: !951, inlinedAt: !955)
!972 = !DILocation(line: 287, column: 15, scope: !934, inlinedAt: !955)
!973 = !DILocation(line: 215, column: 22, scope: !966, inlinedAt: !969)
!974 = !DILocation(line: 215, column: 39, scope: !966, inlinedAt: !969)
!975 = !DILocation(line: 215, column: 38, scope: !966, inlinedAt: !969)
!976 = !DILocation(line: 215, column: 37, scope: !966, inlinedAt: !969)
!977 = !DILocation(line: 215, column: 10, scope: !966, inlinedAt: !969)
!978 = !DILocation(line: 0, scope: !944, inlinedAt: !955)
!979 = !DILocation(line: 0, scope: !940, inlinedAt: !955)
!980 = !DILocation(line: 0, scope: !934, inlinedAt: !955)
!981 = !DILocation(line: 288, column: 19, scope: !941, inlinedAt: !955)
!982 = !DILocation(line: 288, column: 13, scope: !941, inlinedAt: !955)
!983 = !DILocation(line: 215, column: 22, scope: !966, inlinedAt: !971)
!984 = !DILocation(line: 215, column: 39, scope: !966, inlinedAt: !971)
!985 = !DILocation(line: 215, column: 38, scope: !966, inlinedAt: !971)
!986 = !DILocation(line: 215, column: 37, scope: !966, inlinedAt: !971)
!987 = !DILocation(line: 215, column: 10, scope: !966, inlinedAt: !971)
!988 = !DILocation(line: 0, scope: !951, inlinedAt: !955)
!989 = !DILocation(line: 0, scope: !948, inlinedAt: !955)
!990 = !DILocation(line: 291, column: 19, scope: !941, inlinedAt: !955)
!991 = !{!851, !852, i64 0}
!992 = !DILocation(line: 294, column: 19, scope: !993, inlinedAt: !955)
!993 = distinct !DILexicalBlock(scope: !934, file: !3, line: 294, column: 15)
!994 = !DILocation(line: 294, column: 15, scope: !934, inlinedAt: !955)
!995 = !DILocation(line: 295, column: 13, scope: !993, inlinedAt: !955)
!996 = !DILocation(line: 297, column: 23, scope: !997, inlinedAt: !955)
!997 = distinct !DILexicalBlock(scope: !934, file: !3, line: 297, column: 15)
!998 = !DILocation(line: 297, column: 15, scope: !997, inlinedAt: !955)
!999 = !DILocation(line: 297, column: 28, scope: !997, inlinedAt: !955)
!1000 = !DILocation(line: 297, column: 15, scope: !934, inlinedAt: !955)
!1001 = !DILocation(line: 299, column: 15, scope: !1002, inlinedAt: !955)
!1002 = distinct !DILexicalBlock(scope: !997, file: !3, line: 298, column: 13)
!1003 = !DILocation(line: 305, column: 9, scope: !935, inlinedAt: !955)
!1004 = !DILocation(line: 305, column: 9, scope: !934, inlinedAt: !955)
!1005 = !DILocation(line: 377, column: 20, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !956, file: !3, line: 376, column: 5)
!1007 = !DILocation(line: 377, column: 7, scope: !1006)
!1008 = !DILocation(line: 378, column: 7, scope: !1006)
!1009 = !DILocation(line: 383, column: 21, scope: !806)
!1010 = !DILocalVariable(name: "arg", arg: 1, scope: !1011, file: !3, line: 136, type: !52)
!1011 = distinct !DISubprogram(name: "set_program_path", scope: !3, file: !3, line: 136, type: !693, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1012)
!1012 = !{!1010, !1013, !1016, !1020}
!1013 = !DILocalVariable(name: "path", scope: !1014, file: !3, line: 144, type: !22)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 143, column: 5)
!1015 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 138, column: 7)
!1016 = !DILocalVariable(name: "dir", scope: !1017, file: !3, line: 149, type: !22)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 148, column: 9)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 147, column: 16)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 145, column: 11)
!1020 = !DILocalVariable(name: "candidate", scope: !1021, file: !3, line: 153, type: !22)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 152, column: 13)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 151, column: 11)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 151, column: 11)
!1024 = !DILocation(line: 0, scope: !1011, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 383, column: 3, scope: !806)
!1026 = !DILocation(line: 138, column: 7, scope: !1015, inlinedAt: !1025)
!1027 = !DILocation(line: 138, column: 7, scope: !1011, inlinedAt: !1025)
!1028 = !DILocation(line: 140, column: 22, scope: !1029, inlinedAt: !1025)
!1029 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 139, column: 5)
!1030 = !DILocation(line: 140, column: 20, scope: !1029, inlinedAt: !1025)
!1031 = !DILocation(line: 141, column: 5, scope: !1029, inlinedAt: !1025)
!1032 = !DILocation(line: 144, column: 20, scope: !1014, inlinedAt: !1025)
!1033 = !DILocation(line: 0, scope: !1014, inlinedAt: !1025)
!1034 = !DILocation(line: 145, column: 11, scope: !1019, inlinedAt: !1025)
!1035 = !DILocation(line: 145, column: 11, scope: !1014, inlinedAt: !1025)
!1036 = !DILocation(line: 146, column: 24, scope: !1019, inlinedAt: !1025)
!1037 = !DILocation(line: 146, column: 22, scope: !1019, inlinedAt: !1025)
!1038 = !DILocation(line: 146, column: 9, scope: !1019, inlinedAt: !1025)
!1039 = !DILocation(line: 147, column: 24, scope: !1018, inlinedAt: !1025)
!1040 = !DILocation(line: 147, column: 22, scope: !1018, inlinedAt: !1025)
!1041 = !DILocation(line: 147, column: 16, scope: !1019, inlinedAt: !1025)
!1042 = !DILocation(line: 150, column: 18, scope: !1017, inlinedAt: !1025)
!1043 = !DILocation(line: 151, column: 22, scope: !1023, inlinedAt: !1025)
!1044 = !DILocation(line: 0, scope: !1017, inlinedAt: !1025)
!1045 = !DILocation(line: 151, column: 46, scope: !1022, inlinedAt: !1025)
!1046 = !DILocation(line: 151, column: 11, scope: !1023, inlinedAt: !1025)
!1047 = !DILocation(line: 153, column: 33, scope: !1021, inlinedAt: !1025)
!1048 = !DILocation(line: 0, scope: !1021, inlinedAt: !1025)
!1049 = !DILocation(line: 154, column: 19, scope: !1050, inlinedAt: !1025)
!1050 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 154, column: 19)
!1051 = !DILocation(line: 154, column: 44, scope: !1050, inlinedAt: !1025)
!1052 = !DILocation(line: 154, column: 19, scope: !1021, inlinedAt: !1025)
!1053 = !DILocation(line: 156, column: 34, scope: !1054, inlinedAt: !1025)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 155, column: 17)
!1055 = !DILocation(line: 156, column: 32, scope: !1054, inlinedAt: !1025)
!1056 = !DILocation(line: 157, column: 19, scope: !1054, inlinedAt: !1025)
!1057 = !DILocation(line: 160, column: 15, scope: !1021, inlinedAt: !1025)
!1058 = !DILocation(line: 151, column: 61, scope: !1022, inlinedAt: !1025)
!1059 = distinct !{!1059, !1046, !1060, !723}
!1060 = !DILocation(line: 161, column: 13, scope: !1023, inlinedAt: !1025)
!1061 = !DILocation(line: 163, column: 7, scope: !1014, inlinedAt: !1025)
!1062 = !DILocation(line: 384, column: 8, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !806, file: !3, line: 384, column: 7)
!1064 = !DILocation(line: 384, column: 7, scope: !806)
!1065 = !DILocation(line: 385, column: 20, scope: !1063)
!1066 = !DILocation(line: 385, column: 18, scope: !1063)
!1067 = !DILocation(line: 385, column: 5, scope: !1063)
!1068 = !DILocation(line: 217, column: 5, scope: !1069, inlinedAt: !1116)
!1069 = distinct !DISubprogram(name: "set_LD_PRELOAD", scope: !3, file: !3, line: 189, type: !681, scopeLine: 190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1077, !1079, !1080}
!1071 = !DILocalVariable(name: "ret", scope: !1069, file: !3, line: 191, type: !42)
!1072 = !DILocalVariable(name: "preload_env", scope: !1069, file: !3, line: 195, type: !52)
!1073 = !DILocalVariable(name: "old_libs", scope: !1069, file: !3, line: 197, type: !22)
!1074 = !DILocalVariable(name: "LD_PRELOAD", scope: !1069, file: !3, line: 198, type: !22)
!1075 = !DILocalVariable(name: "search_path", scope: !1069, file: !3, line: 216, type: !1076)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 192, elements: !44)
!1077 = !DILocalVariable(name: "path", scope: !1069, file: !3, line: 222, type: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!1079 = !DILocalVariable(name: "libstdbuf", scope: !1069, file: !3, line: 223, type: !22)
!1080 = !DILocalVariable(name: "sb", scope: !1081, file: !3, line: 227, type: !1082)
!1081 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 226, column: 5)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1083, line: 26, size: 1152, elements: !1084)
!1083 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!1084 = !{!1085, !1087, !1089, !1091, !1093, !1095, !1097, !1098, !1099, !1100, !1102, !1104, !1112, !1113, !1114}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1082, file: !1083, line: 28, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !28, line: 145, baseType: !29)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1082, file: !1083, line: 33, baseType: !1088, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !28, line: 148, baseType: !29)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1082, file: !1083, line: 41, baseType: !1090, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !28, line: 151, baseType: !29)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1082, file: !1083, line: 42, baseType: !1092, size: 32, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !28, line: 150, baseType: !7)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1082, file: !1083, line: 44, baseType: !1094, size: 32, offset: 224)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !28, line: 146, baseType: !7)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1082, file: !1083, line: 45, baseType: !1096, size: 32, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !28, line: 147, baseType: !7)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1082, file: !1083, line: 47, baseType: !42, size: 32, offset: 288)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1082, file: !1083, line: 49, baseType: !1086, size: 64, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1082, file: !1083, line: 54, baseType: !774, size: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1082, file: !1083, line: 58, baseType: !1101, size: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !28, line: 175, baseType: !775)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1082, file: !1083, line: 60, baseType: !1103, size: 64, offset: 512)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !28, line: 180, baseType: !775)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1082, file: !1083, line: 71, baseType: !1105, size: 128, offset: 576)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1106, line: 10, size: 128, elements: !1107)
!1106 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!1107 = !{!1108, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1105, file: !1106, line: 12, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !28, line: 160, baseType: !775)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1105, file: !1106, line: 16, baseType: !1111, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !28, line: 197, baseType: !775)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1082, file: !1083, line: 72, baseType: !1105, size: 128, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1082, file: !1083, line: 73, baseType: !1105, size: 128, offset: 832)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1082, file: !1083, line: 86, baseType: !1115, size: 192, offset: 960)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 192, elements: !44)
!1116 = distinct !DILocation(line: 386, column: 3, scope: !806)
!1117 = !DILocation(line: 0, scope: !1069, inlinedAt: !1116)
!1118 = !DILocation(line: 197, column: 20, scope: !1069, inlinedAt: !1116)
!1119 = !DILocation(line: 198, column: 3, scope: !1069, inlinedAt: !1116)
!1120 = !DILocation(line: 216, column: 3, scope: !1069, inlinedAt: !1116)
!1121 = !DILocation(line: 216, column: 21, scope: !1069, inlinedAt: !1116)
!1122 = !DILocation(line: 216, column: 37, scope: !1069, inlinedAt: !1116)
!1123 = !DILocation(line: 223, column: 3, scope: !1069, inlinedAt: !1116)
!1124 = !DILocation(line: 227, column: 7, scope: !1081, inlinedAt: !1116)
!1125 = !DILocation(line: 227, column: 19, scope: !1081, inlinedAt: !1116)
!1126 = !DILocation(line: 229, column: 12, scope: !1127, inlinedAt: !1116)
!1127 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 229, column: 11)
!1128 = !DILocation(line: 229, column: 11, scope: !1081, inlinedAt: !1116)
!1129 = !DILocation(line: 231, column: 23, scope: !1130, inlinedAt: !1116)
!1130 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 230, column: 9)
!1131 = !DILocation(line: 231, column: 21, scope: !1130, inlinedAt: !1116)
!1132 = !DILocation(line: 232, column: 11, scope: !1130, inlinedAt: !1116)
!1133 = !DILocation(line: 234, column: 13, scope: !1081, inlinedAt: !1116)
!1134 = !DILocation(line: 235, column: 15, scope: !1135, inlinedAt: !1116)
!1135 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 235, column: 11)
!1136 = !DILocation(line: 235, column: 11, scope: !1081, inlinedAt: !1116)
!1137 = !DILocation(line: 236, column: 9, scope: !1135, inlinedAt: !1116)
!1138 = !DILocation(line: 237, column: 17, scope: !1139, inlinedAt: !1116)
!1139 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 237, column: 11)
!1140 = !DILocation(line: 237, column: 11, scope: !1139, inlinedAt: !1116)
!1141 = !DILocation(line: 237, column: 33, scope: !1139, inlinedAt: !1116)
!1142 = !DILocation(line: 237, column: 11, scope: !1081, inlinedAt: !1116)
!1143 = !DILocation(line: 239, column: 13, scope: !1081, inlinedAt: !1116)
