source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.allocator = type { i8* (i64)*, i8* (i8*, i64)*, void (i8*)*, void (i64)* }
%struct.anon = type { i64, i32, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... COMMAND\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !187, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !174, nameTableKind: None)
!3 = !DIFile(filename: "src/stdbuf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 87, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124, isUnsigned: true)
!10 = !DIEnumerator(name: "EXIT_CANCELED", value: 125, isUnsigned: true)
!11 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126, isUnsigned: true)
!12 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !14, line: 25, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!21 = !{!22, !32, !93, !97, !101, !104, !107, !114, !129, !133, !26, !83, !137, !141, !143, !146, !150, !155, !158, !159, !162, !164, !166, !167, !171}
!22 = !DISubprogram(name: "dcgettext", scope: !23, file: !23, line: 51, type: !24, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!23 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !28, !28, !30}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !{}
!32 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !34, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!30, !28, !36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !39)
!38 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !55, !56, !57, !58, !62, !64, !66, !70, !73, !75, !78, !81, !82, !84, !88, !89}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 51, baseType: !30, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 36, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 70, baseType: !36, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 152, baseType: !61)
!60 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!65 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 43, baseType: null)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 153, baseType: !61)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !37, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !38, line: 37, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !37, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !38, line: 38, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !37, file: !38, line: 93, baseType: !36, size: 64, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !37, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DISubprogram(name: "set_program_name", scope: !94, file: !94, line: 37, type: !95, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!94 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!95 = !DISubroutineType(types: !96)
!96 = !{null, !28}
!97 = !DISubprogram(name: "setlocale", scope: !98, file: !98, line: 122, type: !99, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!98 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!26, !30, !28}
!101 = !DISubprogram(name: "bindtextdomain", scope: !23, file: !23, line: 86, type: !102, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!102 = !DISubroutineType(types: !103)
!103 = !{!26, !28, !28}
!104 = !DISubprogram(name: "textdomain", scope: !23, file: !23, line: 82, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!105 = !DISubroutineType(types: !106)
!106 = !{!26, !28}
!107 = !DISubprogram(name: "atexit", scope: !108, file: !108, line: 595, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!108 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!30, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null}
!114 = !DISubprogram(name: "getopt_long", scope: !115, file: !115, line: 66, type: !116, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!115 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!116 = !DISubroutineType(types: !117)
!117 = !{!30, !30, !118, !28, !120, !127}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !115, line: 50, size: 256, elements: !123)
!123 = !{!124, !125, !126, !128}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !115, line: 52, baseType: !28, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !122, file: !115, line: 55, baseType: !30, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !115, line: 56, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !122, file: !115, line: 57, baseType: !30, size: 32, offset: 192)
!129 = !DISubprogram(name: "error", scope: !130, file: !130, line: 52, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!130 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!131 = !DISubroutineType(types: !132)
!132 = !{null, !30, !30, !28, null}
!133 = !DISubprogram(name: "quote", scope: !134, file: !134, line: 44, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!134 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!135 = !DISubroutineType(types: !136)
!136 = !{!28, !28}
!137 = !DISubprogram(name: "version_etc", scope: !138, file: !138, line: 69, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!138 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{null, !36, !28, !28, !28, null}
!141 = !DISubprogram(name: "xstrdup", scope: !142, file: !142, line: 64, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!142 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!143 = !DISubprogram(name: "free", scope: !108, file: !108, line: 565, type: !144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !83}
!146 = !DISubprogram(name: "execvp", scope: !147, file: !147, line: 578, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!147 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!148 = !DISubroutineType(types: !149)
!149 = !{!30, !28, !118}
!150 = !DISubprogram(name: "xstrtoumax", scope: !14, file: !14, line: 48, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!151 = !DISubroutineType(types: !152)
!152 = !{!13, !28, !153, !30, !154, !28}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !156, line: 102, baseType: !157)
!156 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !60, line: 73, baseType: !87)
!158 = !DISubprogram(name: "xalloc_die", scope: !142, file: !142, line: 51, type: !112, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !31)
!159 = !DISubprogram(name: "putenv", scope: !108, file: !108, line: 647, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!160 = !DISubroutineType(types: !161)
!161 = !{!30, !26}
!162 = !DISubprogram(name: "dir_name", scope: !163, file: !163, line: 40, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!163 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!164 = !DISubprogram(name: "xreadlink", scope: !165, file: !165, line: 21, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!165 = !DIFile(filename: "./lib/xreadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !DISubprogram(name: "getenv", scope: !108, file: !108, line: 634, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!167 = !DISubprogram(name: "file_name_concat", scope: !168, file: !168, line: 22, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!168 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{!26, !28, !28, !153}
!171 = !DISubprogram(name: "access", scope: !147, file: !147, line: 287, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!172 = !DISubroutineType(types: !173)
!173 = !{!30, !28, !30}
!174 = !{!175, !177, !0}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "program_path", scope: !2, file: !3, line: 40, type: !26, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "stdbuf", scope: !2, file: !3, line: 47, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 576, elements: !185)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 192, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !180, file: !3, line: 44, baseType: !85, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "optc", scope: !180, file: !3, line: 45, baseType: !30, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "optarg", scope: !180, file: !3, line: 46, baseType: !26, size: 64, offset: 128)
!185 = !{!186}
!186 = !DISubrange(count: 3)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 1536, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 6)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "Version", scope: !192, file: !193, line: 2, type: !28, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, globals: !194, nameTableKind: None)
!193 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!194 = !{!190}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "file_name", scope: !197, file: !198, line: 46, type: !28, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !199, globals: !238, nameTableKind: None)
!198 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !{!200, !22, !236, !129}
!200 = !DISubprogram(name: "close_stream", scope: !201, file: !201, line: 2, type: !202, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!201 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !DISubroutineType(types: !203)
!203 = !{!30, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !205, file: !38, line: 51, baseType: !30, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !205, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !205, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !205, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !205, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !205, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !205, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !205, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !205, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !205, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !205, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !205, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !205, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !205, file: !38, line: 70, baseType: !204, size: 64, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !205, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !205, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !205, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !205, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !205, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !205, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !205, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !205, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !205, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !205, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !205, file: !38, line: 93, baseType: !204, size: 64, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !205, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !205, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !205, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !205, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!236 = !DISubprogram(name: "quotearg_colon", scope: !237, file: !237, line: 391, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!237 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!238 = !{!195, !239}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !197, file: !198, line: 56, type: !241, isLocal: true, isDefinition: true)
!241 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "exit_failure", scope: !244, file: !245, line: 24, type: !247, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, globals: !246, nameTableKind: None)
!245 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !{!242}
!247 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "program_name", scope: !250, file: !251, line: 33, type: !28, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !252, globals: !288, nameTableKind: None)
!251 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = !{!83, !253, !26}
!253 = !DISubprogram(name: "fputs", scope: !33, file: !33, line: 626, type: !254, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!254 = !DISubroutineType(types: !255)
!255 = !{!30, !28, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !257, file: !38, line: 51, baseType: !30, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !257, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !257, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !257, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !257, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !257, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !257, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !257, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !257, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !257, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !257, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !257, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !257, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !257, file: !38, line: 70, baseType: !256, size: 64, offset: 832)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !257, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !257, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !257, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !257, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !257, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !257, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !257, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !257, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !257, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !257, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !257, file: !38, line: 93, baseType: !256, size: 64, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !257, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !257, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !257, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !257, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!288 = !{!248}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !291, file: !292, line: 85, type: !419, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !327, globals: !392, nameTableKind: None)
!292 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!293 = !{!294, !307, !312}
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !237, line: 32, baseType: !7, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!296 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!300 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!301 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!302 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!303 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!304 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!305 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!306 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !237, line: 242, baseType: !7, size: 32, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !313, line: 46, baseType: !7, size: 32, elements: !314)
!313 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!315 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!316 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!317 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!318 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!319 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!320 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!321 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!322 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!323 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!326 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!327 = !{!328, !333, !143, !348, !30, !63, !351, !85, !368, !372, !22, !378, !382, !26, !386, !158, !389}
!328 = !DISubprogram(name: "xmemdup", scope: !142, file: !142, line: 62, type: !329, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!329 = !DISubroutineType(types: !330)
!330 = !{!83, !331, !87}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!333 = !DISubprogram(name: "quotearg_alloc_mem", scope: !237, file: !237, line: 342, type: !334, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!334 = !DISubroutineType(types: !335)
!335 = !{!26, !28, !87, !154, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !292, line: 65, size: 448, elements: !339)
!339 = !{!340, !341, !342, !346, !347}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !338, file: !292, line: 68, baseType: !294, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !338, file: !292, line: 71, baseType: !30, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !338, file: !292, line: 75, baseType: !343, size: 256, offset: 64)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !338, file: !292, line: 78, baseType: !28, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !338, file: !292, line: 81, baseType: !28, size: 64, offset: 384)
!348 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !237, file: !237, line: 408, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!349 = !DISubroutineType(types: !350)
!350 = !{!26, !30, !28, !28, !28, !87}
!351 = !DISubprogram(name: "rpl_mbrtowc", scope: !352, file: !352, line: 717, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!352 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!353 = !DISubroutineType(types: !354)
!354 = !{!87, !127, !28, !87, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 13, size: 64, elements: !358)
!357 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !356, file: !357, line: 15, baseType: !30, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !356, file: !357, line: 20, baseType: !361, size: 32, offset: 32)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !356, file: !357, line: 16, size: 32, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !361, file: !357, line: 18, baseType: !7, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !361, file: !357, line: 19, baseType: !365, size: 32)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 4)
!368 = !DISubprogram(name: "iswprint", scope: !369, file: !369, line: 120, type: !370, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!369 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!370 = !DISubroutineType(types: !371)
!371 = !{!30, !7}
!372 = !DISubprogram(name: "mbsinit", scope: !373, file: !373, line: 292, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!373 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!374 = !DISubroutineType(types: !375)
!375 = !{!30, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!378 = !DISubprogram(name: "locale_charset", scope: !379, file: !379, line: 35, type: !380, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!379 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!380 = !DISubroutineType(types: !381)
!381 = !{!28}
!382 = !DISubprogram(name: "c_strcasecmp", scope: !383, file: !383, line: 42, type: !384, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!383 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!384 = !DISubroutineType(types: !385)
!385 = !{!30, !28, !28}
!386 = !DISubprogram(name: "xmalloc", scope: !142, file: !142, line: 53, type: !387, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!387 = !DISubroutineType(types: !388)
!388 = !{!83, !87}
!389 = !DISubprogram(name: "xrealloc", scope: !142, file: !142, line: 59, type: !390, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!390 = !DISubroutineType(types: !391)
!391 = !{!83, !83, !87}
!392 = !{!289, !393, !399, !401, !403, !408, !415, !417}
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !291, file: !292, line: 101, type: !395, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 320, elements: !397)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!397 = !{!398}
!398 = !DISubrange(count: 10)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !291, file: !292, line: 1052, type: !338, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !291, file: !292, line: 116, type: !338, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "slot0", scope: !291, file: !292, line: 842, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 256)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "slotvec", scope: !291, file: !292, line: 845, type: !410, isLocal: true, isDefinition: true)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !292, line: 834, size: 128, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !411, file: !292, line: 836, baseType: !85, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !411, file: !292, line: 837, baseType: !26, size: 64, offset: 64)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "nslots", scope: !291, file: !292, line: 843, type: !30, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "slotvec0", scope: !291, file: !292, line: 844, type: !411, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 704, elements: !421)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!421 = !{!422}
!422 = !DISubrange(count: 11)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !425, file: !426, line: 26, type: !428, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, globals: !427, nameTableKind: None)
!426 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!427 = !{!423}
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 376, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 47)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "stdlib_allocator", scope: !433, file: !434, line: 5, type: !436, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, globals: !435, nameTableKind: None)
!434 = !DIFile(filename: "lib/allocator.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!435 = !{!431}
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator", file: !438, line: 27, size: 256, elements: !439)
!438 = !DIFile(filename: "./lib/allocator.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!439 = !{!440, !444, !448, !450}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !437, file: !438, line: 37, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!83, !85}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate", scope: !437, file: !438, line: 43, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!83, !83, !85}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !437, file: !438, line: 46, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !437, file: !438, line: 52, baseType: !451, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !85}
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !456, nameTableKind: None)
!455 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!456 = !{!457, !158}
!457 = !DISubprogram(name: "mdir_name", scope: !163, file: !163, line: 43, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !460, nameTableKind: None)
!459 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !{!461}
!461 = !DISubprogram(name: "last_component", scope: !163, file: !163, line: 46, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !464, nameTableKind: None)
!463 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!464 = !{!26}
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !467, nameTableKind: None)
!466 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!468, !83, !158}
!468 = !DISubprogram(name: "mfile_name_concat", scope: !168, file: !168, line: 26, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !471, nameTableKind: None)
!470 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!471 = !{!461, !472, !83}
!472 = !DISubprogram(name: "base_len", scope: !163, file: !163, line: 44, type: !473, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!473 = !DISubroutineType(types: !474)
!474 = !{!87, !28}
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !477, retainedTypes: !481, nameTableKind: None)
!476 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!477 = !{!478}
!478 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !476, line: 40, baseType: !7, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!481 = !{!22, !482, !83}
!482 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !483, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!483 = !DISubroutineType(types: !484)
!484 = !{!30, !28, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !486, file: !38, line: 51, baseType: !30, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !486, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !486, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !486, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !486, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !486, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !486, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !486, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !486, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !486, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !486, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !486, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !486, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !486, file: !38, line: 70, baseType: !485, size: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !486, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !486, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !486, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !486, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !486, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !486, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !486, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !486, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !486, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !486, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !486, file: !38, line: 93, baseType: !485, size: 64, offset: 1344)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !486, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !486, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !486, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !486, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !519, retainedTypes: !532, nameTableKind: None)
!518 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !{!520}
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !521, file: !142, line: 186, baseType: !7, size: 32, elements: !530)
!521 = distinct !DISubprogram(name: "x2nrealloc", scope: !142, file: !142, line: 174, type: !522, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !517, retainedNodes: !525)
!522 = !DISubroutineType(types: !523)
!523 = !{!83, !83, !524, !85}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!525 = !{!526, !527, !528, !529}
!526 = !DILocalVariable(name: "p", arg: 1, scope: !521, file: !142, line: 174, type: !83)
!527 = !DILocalVariable(name: "pn", arg: 2, scope: !521, file: !142, line: 174, type: !524)
!528 = !DILocalVariable(name: "s", arg: 3, scope: !521, file: !142, line: 174, type: !85)
!529 = !DILocalVariable(name: "n", scope: !521, file: !142, line: 176, type: !85)
!530 = !{!531}
!531 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!532 = !{!85, !158, !386, !389, !26, !143, !83, !533, !536}
!533 = !DISubprogram(name: "xcalloc", scope: !142, file: !142, line: 57, type: !534, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!534 = !DISubroutineType(types: !535)
!535 = !{!83, !87, !87}
!536 = !DISubprogram(name: "rpl_calloc", scope: !537, file: !537, line: 688, type: !534, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!537 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !540, nameTableKind: None)
!539 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!540 = !{!22, !129}
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !543, nameTableKind: None)
!542 = !DIFile(filename: "lib/xreadlink.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!543 = !{!544, !83, !158}
!544 = !DISubprogram(name: "areadlink", scope: !545, file: !545, line: 23, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!545 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !548, retainedTypes: !549, nameTableKind: None)
!547 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!548 = !{!13, !312}
!549 = !{!30, !63}
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !552, nameTableKind: None)
!551 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = !{!83}
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !555, nameTableKind: None)
!554 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = !{!556, !85, !568}
!556 = !DISubprogram(name: "mbrtowc", scope: !373, file: !373, line: 296, type: !557, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!557 = !DISubroutineType(types: !558)
!558 = !{!87, !127, !28, !87, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 13, size: 64, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !560, file: !357, line: 15, baseType: !30, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !560, file: !357, line: 20, baseType: !564, size: 32, offset: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !560, file: !357, line: 16, size: 32, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !564, file: !357, line: 18, baseType: !7, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !564, file: !357, line: 19, baseType: !365, size: 32)
!568 = !DISubprogram(name: "hard_locale", scope: !569, file: !569, line: 26, type: !570, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!569 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!570 = !DISubroutineType(types: !571)
!571 = !{!241, !30}
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !574, nameTableKind: None)
!573 = !DIFile(filename: "lib/areadlink.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !{!575}
!575 = !DISubprogram(name: "careadlinkat", scope: !576, file: !576, line: 49, type: !577, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!576 = !DIFile(filename: "./lib/careadlinkat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!577 = !DISubroutineType(types: !578)
!578 = !{!26, !30, !28, !26, !87, !579, !582}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "allocator", file: !576, line: 26, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!61, !30, !28, !26, !87}
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !587, nameTableKind: None)
!586 = !DIFile(filename: "lib/careadlinkat.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!587 = !{!85, !26}
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !590, nameTableKind: None)
!589 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!590 = !{!591}
!591 = !DISubprogram(name: "rpl_fclose", scope: !592, file: !592, line: 672, type: !593, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!592 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = !DISubroutineType(types: !594)
!594 = !{!30, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !596, file: !38, line: 51, baseType: !30, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !596, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !596, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !596, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !596, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !596, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !596, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !596, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !596, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !596, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !596, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !596, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !596, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !596, file: !38, line: 70, baseType: !595, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !596, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !596, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !596, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !596, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !596, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !596, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !596, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !596, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !596, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !596, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !596, file: !38, line: 93, baseType: !595, size: 64, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !596, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !596, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !596, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !596, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !629, nameTableKind: None)
!628 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!629 = !{!630}
!630 = !DISubprogram(name: "setlocale_null_r", scope: !631, file: !631, line: 64, type: !632, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!631 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!632 = !DISubroutineType(types: !633)
!633 = !{!30, !30, !26, !87}
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !636, retainedTypes: !1023, nameTableKind: None)
!635 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!636 = !{!637}
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !638, line: 41, baseType: !7, size: 32, elements: !639)
!638 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!640 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!641 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!642 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!643 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!644 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!645 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!646 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!647 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!648 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!649 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!650 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!651 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!652 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!653 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!654 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!655 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!656 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!657 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!658 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!659 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!660 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!661 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!662 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!663 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!664 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!665 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!666 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!667 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!668 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!669 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!670 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!671 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!672 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!673 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!674 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!675 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!676 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!677 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!678 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!679 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!680 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!681 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!682 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!683 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!684 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!685 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!686 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!687 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!688 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!689 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!748 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!751 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!752 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!753 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!754 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!755 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!756 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!757 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!758 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!759 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!760 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!761 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!762 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!835 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!908 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!909 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!910 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!911 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!912 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!913 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!914 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!915 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!916 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!917 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!918 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!919 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!920 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!921 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!922 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!924 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!925 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!926 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!927 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!928 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!929 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!955 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!956 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!957 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!958 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!959 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!964 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!965 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!966 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!967 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1023 = !{!1024, !83}
!1024 = !DISubprogram(name: "nl_langinfo", scope: !638, file: !638, line: 661, type: !1025, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!26, !30}
!1027 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1028, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !1029, nameTableKind: None)
!1028 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1029 = !{!83, !97}
!1030 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1031, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !1032, nameTableKind: None)
