; ModuleID = 'coreutils-8.32/src/stty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.control_info = type { i8*, i8, i64 }
%struct.mode_info = type { i8*, i32, i8, i64, i64 }
%struct.speed_map = type { i8*, i32, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.winsize = type { i16, i16, i16, i16 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "tcsetattr_options", scope: !2, file: !3, line: 472, type: !54, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !232, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/stty.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !25, !30, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "output_type", file: !3, line: 179, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "changed", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "all", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "recoverable", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "speed_setting", file: !3, line: 173, baseType: !6, size: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "input_speed", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "output_speed", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "both_speeds", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_type", file: !3, line: 185, baseType: !6, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "control", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "input", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "output", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "local", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "combination", value: 4, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !38, line: 25, baseType: !6, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44}
!40 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!45 = !{!46, !56, !117, !121, !125, !128, !131, !138, !153, !50, !107, !157, !161, !165, !168, !172, !196, !201, !194, !187, !205, !208, !209, !213, !217, !219, !188, !222, !225, !181, !226, !227, !111, !52}
!46 = !DISubprogram(name: "dcgettext", scope: !47, file: !47, line: 51, type: !48, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!47 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !52, !52, !54}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !{}
!56 = !DISubprogram(name: "fputs_unlocked", scope: !57, file: !57, line: 662, type: !58, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!57 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!58 = !DISubroutineType(types: !59)
!59 = !{!54, !52, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !63)
!62 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !80, !81, !82, !86, !88, !90, !94, !97, !99, !102, !105, !106, !108, !112, !113}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 51, baseType: !54, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 54, baseType: !50, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 55, baseType: !50, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 56, baseType: !50, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 57, baseType: !50, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 58, baseType: !50, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 59, baseType: !50, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 60, baseType: !50, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 61, baseType: !50, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 64, baseType: !50, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 65, baseType: !50, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 66, baseType: !50, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 70, baseType: !60, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 72, baseType: !54, size: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 73, baseType: !54, size: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 152, baseType: !85)
!84 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!85 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 77, baseType: !87, size: 16, offset: 1024)
!87 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 78, baseType: !89, size: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 79, baseType: !91, size: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 81, baseType: !95, size: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 43, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 89, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 153, baseType: !85)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !61, file: !62, line: 91, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !62, line: 37, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !61, file: !62, line: 92, baseType: !103, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !62, line: 38, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !61, file: !62, line: 93, baseType: !60, size: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !61, file: !62, line: 94, baseType: !107, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 95, baseType: !109, size: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 96, baseType: !54, size: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 98, baseType: !114, size: 160, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 160, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DISubprogram(name: "set_program_name", scope: !118, file: !118, line: 37, type: !119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!118 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!119 = !DISubroutineType(types: !120)
!120 = !{null, !52}
!121 = !DISubprogram(name: "setlocale", scope: !122, file: !122, line: 122, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!122 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!123 = !DISubroutineType(types: !124)
!124 = !{!50, !54, !52}
!125 = !DISubprogram(name: "bindtextdomain", scope: !47, file: !47, line: 86, type: !126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!126 = !DISubroutineType(types: !127)
!127 = !{!50, !52, !52}
!128 = !DISubprogram(name: "textdomain", scope: !47, file: !47, line: 82, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!129 = !DISubroutineType(types: !130)
!130 = !{!50, !52}
!131 = !DISubprogram(name: "atexit", scope: !132, file: !132, line: 595, type: !133, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!132 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!133 = !DISubroutineType(types: !134)
!134 = !{!54, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null}
!138 = !DISubprogram(name: "getopt_long", scope: !139, file: !139, line: 66, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!139 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!140 = !DISubroutineType(types: !141)
!141 = !{!54, !54, !142, !52, !144, !151}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !139, line: 50, size: 256, elements: !147)
!147 = !{!148, !149, !150, !152}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !139, line: 52, baseType: !52, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !146, file: !139, line: 55, baseType: !54, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !139, line: 56, baseType: !151, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !146, file: !139, line: 57, baseType: !54, size: 32, offset: 192)
!153 = !DISubprogram(name: "error", scope: !154, file: !154, line: 52, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!154 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !DISubroutineType(types: !156)
!156 = !{null, !54, !54, !52, null}
!157 = !DISubprogram(name: "version_etc", scope: !158, file: !158, line: 69, type: !159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!158 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!159 = !DISubroutineType(types: !160)
!160 = !{null, !60, !52, !52, !52, null}
!161 = !DISubprogram(name: "fd_reopen", scope: !162, file: !162, line: 22, type: !163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!162 = !DIFile(filename: "./lib/fd-reopen.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!163 = !DISubroutineType(types: !164)
!164 = !{!54, !54, !52, !54, !6}
!165 = !DISubprogram(name: "quotearg_n_style_colon", scope: !12, file: !12, line: 397, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!166 = !DISubroutineType(types: !167)
!167 = !{!50, !54, !11, !52}
!168 = !DISubprogram(name: "rpl_fcntl", scope: !169, file: !169, line: 588, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!169 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !DISubroutineType(types: !171)
!171 = !{!54, !54, !54, null}
!172 = !DISubprogram(name: "tcgetattr", scope: !173, file: !173, line: 66, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!173 = !DIFile(filename: "/usr/include/termios.h", directory: "")
!174 = !DISubroutineType(types: !175)
!175 = !{!54, !54, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !178, line: 24, size: 480, elements: !179)
!178 = !DIFile(filename: "/usr/include/bits/termios-struct.h", directory: "")
!179 = !{!180, !183, !184, !185, !186, !189, !193, !195}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !177, file: !178, line: 26, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !182, line: 25, baseType: !6)
!182 = !DIFile(filename: "/usr/include/bits/termios.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !177, file: !178, line: 27, baseType: !181, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !177, file: !178, line: 28, baseType: !181, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !177, file: !178, line: 29, baseType: !181, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !177, file: !178, line: 30, baseType: !187, size: 8, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !182, line: 23, baseType: !188)
!188 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !177, file: !178, line: 31, baseType: !190, size: 256, offset: 136)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 256, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !177, file: !178, line: 32, baseType: !194, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !182, line: 24, baseType: !6)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !177, file: !178, line: 33, baseType: !194, size: 32, offset: 448)
!196 = !DISubprogram(name: "tcsetattr", scope: !173, file: !173, line: 70, type: !197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!197 = !DISubroutineType(types: !198)
!198 = !{!54, !54, !54, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!201 = !DISubprogram(name: "quote", scope: !202, file: !202, line: 44, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!202 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = !DISubroutineType(types: !204)
!204 = !{!52, !52}
!205 = !DISubprogram(name: "cfsetispeed", scope: !173, file: !173, line: 57, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!206 = !DISubroutineType(types: !207)
!207 = !{!54, !176, !6}
!208 = !DISubprogram(name: "cfsetospeed", scope: !173, file: !173, line: 54, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!209 = !DISubprogram(name: "ioctl", scope: !210, file: !210, line: 41, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!210 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!211 = !DISubroutineType(types: !212)
!212 = !{!54, !54, !111, null}
!213 = !DISubprogram(name: "xnumtoumax", scope: !214, file: !214, line: 34, type: !215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!214 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !DISubroutineType(types: !216)
!216 = !{!111, !52, !54, !111, !111, !52, !52, !54}
!217 = !DISubprogram(name: "xalloc_die", scope: !218, file: !218, line: 51, type: !136, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !55)
!218 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = !DISubprogram(name: "free", scope: !132, file: !132, line: 565, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !107}
!222 = !DISubprogram(name: "cfgetispeed", scope: !173, file: !173, line: 51, type: !223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!223 = !DISubroutineType(types: !224)
!224 = !{!6, !199}
!225 = !DISubprogram(name: "cfgetospeed", scope: !173, file: !173, line: 48, type: !223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!226 = !DISubprogram(name: "getenv", scope: !132, file: !132, line: 634, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!227 = !DISubprogram(name: "xstrtol", scope: !38, file: !38, line: 43, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!228 = !DISubroutineType(types: !229)
!229 = !{!37, !52, !230, !54, !231, !52}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!232 = !{!233, !256, !258, !260, !262, !0, !264, !269, !282, !293, !304}
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "mode", scope: !235, file: !3, line: 1272, type: !177, isLocal: true, isDefinition: true)
!235 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1268, type: !236, scopeLine: 1269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !238)
!236 = !DISubroutineType(types: !237)
!237 = !{!54, !54, !230}
!238 = !{!239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !250, !251, !252, !253}
!239 = !DILocalVariable(name: "argc", arg: 1, scope: !235, file: !3, line: 1268, type: !54)
!240 = !DILocalVariable(name: "argv", arg: 2, scope: !235, file: !3, line: 1268, type: !230)
!241 = !DILocalVariable(name: "output_type", scope: !235, file: !3, line: 1274, type: !5)
!242 = !DILocalVariable(name: "optc", scope: !235, file: !3, line: 1275, type: !54)
!243 = !DILocalVariable(name: "argi", scope: !235, file: !3, line: 1276, type: !54)
!244 = !DILocalVariable(name: "opti", scope: !235, file: !3, line: 1277, type: !54)
!245 = !DILocalVariable(name: "require_set_attr", scope: !235, file: !3, line: 1278, type: !246)
!246 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!247 = !DILocalVariable(name: "speed_was_set", scope: !235, file: !3, line: 1279, type: !246)
!248 = !DILocalVariable(name: "verbose_output", scope: !235, file: !3, line: 1280, type: !246)
!249 = !DILocalVariable(name: "recoverable_output", scope: !235, file: !3, line: 1281, type: !246)
!250 = !DILocalVariable(name: "noargs", scope: !235, file: !3, line: 1282, type: !246)
!251 = !DILocalVariable(name: "file_name", scope: !235, file: !3, line: 1283, type: !50)
!252 = !DILocalVariable(name: "device_name", scope: !235, file: !3, line: 1284, type: !52)
!253 = !DILocalVariable(name: "fdflags", scope: !254, file: !3, line: 1379, type: !54)
!254 = distinct !DILexicalBlock(scope: !255, file: !3, line: 1378, column: 5)
!255 = distinct !DILexicalBlock(scope: !235, file: !3, line: 1377, column: 7)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "check_mode", scope: !235, file: !3, line: 1372, type: !177, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "new_mode", scope: !235, file: !3, line: 1408, type: !177, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "max_col", scope: !2, file: !3, line: 466, type: !54, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "current_col", scope: !2, file: !3, line: 469, type: !54, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 474, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1536, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 6)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "mode_info", scope: !2, file: !3, line: 207, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 23040, elements: !280)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_info", file: !3, line: 198, size: 256, elements: !274)
!274 = !{!275, !276, !277, !278, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !3, line: 200, baseType: !52, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !273, file: !3, line: 201, baseType: !30, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !3, line: 202, baseType: !51, size: 8, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !273, file: !3, line: 203, baseType: !111, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !273, file: !3, line: 204, baseType: !111, size: 64, offset: 192)
!280 = !{!281}
!281 = !DISubrange(count: 90)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "control_info", scope: !2, file: !3, line: 393, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 3648, elements: !291)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_info", file: !3, line: 384, size: 192, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !286, file: !3, line: 386, baseType: !52, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "saneval", scope: !286, file: !3, line: 387, baseType: !187, size: 8, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !286, file: !3, line: 388, baseType: !109, size: 64, offset: 128)
!291 = !{!292}
!292 = !DISubrange(count: 19)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "speeds", scope: !2, file: !3, line: 2141, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 6720, elements: !302)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "speed_map", file: !3, line: 2134, size: 192, elements: !298)
!298 = !{!299, !300, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !297, file: !3, line: 2136, baseType: !52, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !297, file: !3, line: 2137, baseType: !194, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !297, file: !3, line: 2138, baseType: !111, size: 64, offset: 128)
!302 = !{!303}
!303 = !DISubrange(count: 35)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "buf", scope: !306, file: !3, line: 2269, type: !312, isLocal: true, isDefinition: true)
!306 = distinct !DISubprogram(name: "visible", scope: !3, file: !3, line: 2267, type: !307, scopeLine: 2268, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !309)
!307 = !DISubroutineType(types: !308)
!308 = !{!52, !187}
!309 = !{!310, !311}
!310 = !DILocalVariable(name: "ch", arg: 1, scope: !306, file: !3, line: 2267, type: !187)
!311 = !DILocalVariable(name: "bpout", scope: !306, file: !3, line: 2270, type: !50)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 80, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 10)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "Version", scope: !317, file: !318, line: 2, type: !52, isLocal: false, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, globals: !319, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !{!315}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "file_name", scope: !322, file: !323, line: 46, type: !52, isLocal: true, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !324, globals: !362, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!324 = !{!325, !46, !361, !153}
!325 = !DISubprogram(name: "close_stream", scope: !326, file: !326, line: 2, type: !327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!326 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!327 = !DISubroutineType(types: !328)
!328 = !{!54, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !330, file: !62, line: 51, baseType: !54, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !330, file: !62, line: 54, baseType: !50, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !330, file: !62, line: 55, baseType: !50, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !330, file: !62, line: 56, baseType: !50, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !330, file: !62, line: 57, baseType: !50, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !330, file: !62, line: 58, baseType: !50, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !330, file: !62, line: 59, baseType: !50, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !330, file: !62, line: 60, baseType: !50, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !330, file: !62, line: 61, baseType: !50, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !330, file: !62, line: 64, baseType: !50, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !330, file: !62, line: 65, baseType: !50, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !330, file: !62, line: 66, baseType: !50, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !330, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !330, file: !62, line: 70, baseType: !329, size: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !330, file: !62, line: 72, baseType: !54, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !330, file: !62, line: 73, baseType: !54, size: 32, offset: 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !330, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !330, file: !62, line: 77, baseType: !87, size: 16, offset: 1024)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !330, file: !62, line: 78, baseType: !89, size: 8, offset: 1040)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !330, file: !62, line: 79, baseType: !91, size: 8, offset: 1048)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !330, file: !62, line: 81, baseType: !95, size: 64, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !330, file: !62, line: 89, baseType: !98, size: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !330, file: !62, line: 91, baseType: !100, size: 64, offset: 1216)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !330, file: !62, line: 92, baseType: !103, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !330, file: !62, line: 93, baseType: !329, size: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !330, file: !62, line: 94, baseType: !107, size: 64, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !330, file: !62, line: 95, baseType: !109, size: 64, offset: 1472)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !330, file: !62, line: 96, baseType: !54, size: 32, offset: 1536)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !330, file: !62, line: 98, baseType: !114, size: 160, offset: 1568)
!361 = !DISubprogram(name: "quotearg_colon", scope: !12, file: !12, line: 391, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!362 = !{!320, !363}
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !322, file: !323, line: 56, type: !246, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "exit_failure", scope: !367, file: !368, line: 24, type: !370, isLocal: false, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, globals: !369, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!369 = !{!365}
!370 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "program_name", scope: !373, file: !374, line: 33, type: !52, isLocal: false, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !375, globals: !411, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!375 = !{!107, !376, !50}
!376 = !DISubprogram(name: "fputs", scope: !57, file: !57, line: 626, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!377 = !DISubroutineType(types: !378)
!378 = !{!54, !52, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !380, file: !62, line: 51, baseType: !54, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !380, file: !62, line: 54, baseType: !50, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !380, file: !62, line: 55, baseType: !50, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !380, file: !62, line: 56, baseType: !50, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !380, file: !62, line: 57, baseType: !50, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !380, file: !62, line: 58, baseType: !50, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !380, file: !62, line: 59, baseType: !50, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !380, file: !62, line: 60, baseType: !50, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !380, file: !62, line: 61, baseType: !50, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !380, file: !62, line: 64, baseType: !50, size: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !380, file: !62, line: 65, baseType: !50, size: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !380, file: !62, line: 66, baseType: !50, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !380, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !380, file: !62, line: 70, baseType: !379, size: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !380, file: !62, line: 72, baseType: !54, size: 32, offset: 896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !380, file: !62, line: 73, baseType: !54, size: 32, offset: 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !380, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !380, file: !62, line: 77, baseType: !87, size: 16, offset: 1024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !380, file: !62, line: 78, baseType: !89, size: 8, offset: 1040)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !380, file: !62, line: 79, baseType: !91, size: 8, offset: 1048)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !380, file: !62, line: 81, baseType: !95, size: 64, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !380, file: !62, line: 89, baseType: !98, size: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !380, file: !62, line: 91, baseType: !100, size: 64, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !380, file: !62, line: 92, baseType: !103, size: 64, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !380, file: !62, line: 93, baseType: !379, size: 64, offset: 1344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !380, file: !62, line: 94, baseType: !107, size: 64, offset: 1408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !380, file: !62, line: 95, baseType: !109, size: 64, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !380, file: !62, line: 96, baseType: !54, size: 32, offset: 1536)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !380, file: !62, line: 98, baseType: !114, size: 160, offset: 1568)
!411 = !{!371}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !414, file: !415, line: 85, type: !528, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !437, globals: !503, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !{!11, !417, !422}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!421 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 46, baseType: !6, size: 32, elements: !424)
!423 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!425 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!426 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!427 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!428 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!429 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!430 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!431 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!432 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!433 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!434 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!435 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!436 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!437 = !{!438, !443, !219, !459, !54, !87, !462, !109, !479, !483, !46, !489, !493, !50, !497, !217, !500}
!438 = !DISubprogram(name: "xmemdup", scope: !218, file: !218, line: 62, type: !439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!439 = !DISubroutineType(types: !440)
!440 = !{!107, !441, !111}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!443 = !DISubprogram(name: "quotearg_alloc_mem", scope: !12, file: !12, line: 342, type: !444, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!444 = !DISubroutineType(types: !445)
!445 = !{!50, !52, !111, !446, !447}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !415, line: 65, size: 448, elements: !450)
!450 = !{!451, !452, !453, !457, !458}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !449, file: !415, line: 68, baseType: !11, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !415, line: 71, baseType: !54, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !449, file: !415, line: 75, baseType: !454, size: 256, offset: 64)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !449, file: !415, line: 78, baseType: !52, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !449, file: !415, line: 81, baseType: !52, size: 64, offset: 384)
!459 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !12, file: !12, line: 408, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!460 = !DISubroutineType(types: !461)
!461 = !{!50, !54, !52, !52, !52, !111}
!462 = !DISubprogram(name: "rpl_mbrtowc", scope: !463, file: !463, line: 717, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!463 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!464 = !DISubroutineType(types: !465)
!465 = !{!111, !151, !52, !111, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 13, size: 64, elements: !469)
!468 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !467, file: !468, line: 15, baseType: !54, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !467, file: !468, line: 20, baseType: !472, size: 32, offset: 32)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !467, file: !468, line: 16, size: 32, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !472, file: !468, line: 18, baseType: !6, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !472, file: !468, line: 19, baseType: !476, size: 32)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 32, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 4)
!479 = !DISubprogram(name: "iswprint", scope: !480, file: !480, line: 120, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!480 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!481 = !DISubroutineType(types: !482)
!482 = !{!54, !6}
!483 = !DISubprogram(name: "mbsinit", scope: !484, file: !484, line: 292, type: !485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!484 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!485 = !DISubroutineType(types: !486)
!486 = !{!54, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!489 = !DISubprogram(name: "locale_charset", scope: !490, file: !490, line: 35, type: !491, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!490 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!491 = !DISubroutineType(types: !492)
!492 = !{!52}
!493 = !DISubprogram(name: "c_strcasecmp", scope: !494, file: !494, line: 42, type: !495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!494 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !DISubroutineType(types: !496)
!496 = !{!54, !52, !52}
!497 = !DISubprogram(name: "xmalloc", scope: !218, file: !218, line: 53, type: !498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!498 = !DISubroutineType(types: !499)
!499 = !{!107, !111}
!500 = !DISubprogram(name: "xrealloc", scope: !218, file: !218, line: 59, type: !501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!501 = !DISubroutineType(types: !502)
!502 = !{!107, !107, !111}
!503 = !{!412, !504, !508, !510, !512, !517, !524, !526}
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !414, file: !415, line: 101, type: !506, isLocal: false, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 320, elements: !313)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !414, file: !415, line: 1052, type: !449, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !414, file: !415, line: 116, type: !449, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "slot0", scope: !414, file: !415, line: 842, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 256)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "slotvec", scope: !414, file: !415, line: 845, type: !519, isLocal: true, isDefinition: true)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !415, line: 834, size: 128, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !520, file: !415, line: 836, baseType: !109, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !520, file: !415, line: 837, baseType: !50, size: 64, offset: 64)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "nslots", scope: !414, file: !415, line: 843, type: !54, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "slotvec0", scope: !414, file: !415, line: 844, type: !520, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 704, elements: !530)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!530 = !{!531}
!531 = !DISubrange(count: 11)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !534, file: !535, line: 26, type: !537, isLocal: false, isDefinition: true)
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, globals: !536, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!536 = !{!532}
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 376, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 47)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !542, file: !543, line: 507, type: !54, isLocal: true, isDefinition: true)
!542 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !543, file: !543, line: 488, type: !544, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !546, retainedNodes: !555)
!543 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!544 = !DISubroutineType(types: !545)
!545 = !{!54, !54, !54}
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !547, globals: !554, splitDebugInlining: false, nameTableKind: None)
!547 = !{!548, !550}
!548 = !DISubprogram(name: "fcntl", scope: !549, file: !549, line: 176, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!549 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!550 = !DISubprogram(name: "close", scope: !551, file: !551, line: 353, type: !552, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!551 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!552 = !DISubroutineType(types: !553)
!553 = !{!54, !54}
!554 = !{!540}
!555 = !{!556, !557, !558, !559, !562}
!556 = !DILocalVariable(name: "fd", arg: 1, scope: !542, file: !543, line: 488, type: !54)
!557 = !DILocalVariable(name: "target", arg: 2, scope: !542, file: !543, line: 488, type: !54)
!558 = !DILocalVariable(name: "result", scope: !542, file: !543, line: 490, type: !54)
!559 = !DILocalVariable(name: "flags", scope: !560, file: !543, line: 531, type: !54)
!560 = distinct !DILexicalBlock(scope: !561, file: !543, line: 530, column: 5)
!561 = distinct !DILexicalBlock(scope: !542, file: !543, line: 529, column: 7)
!562 = !DILocalVariable(name: "saved_errno", scope: !563, file: !543, line: 534, type: !54)
!563 = distinct !DILexicalBlock(scope: !564, file: !543, line: 533, column: 9)
!564 = distinct !DILexicalBlock(scope: !560, file: !543, line: 532, column: 11)
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !567, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!567 = !{!568, !571, !550}
!568 = !DISubprogram(name: "open", scope: !549, file: !549, line: 196, type: !569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!569 = !DISubroutineType(types: !570)
!570 = !{!54, !52, !54, null}
!571 = !DISubprogram(name: "dup2", scope: !551, file: !551, line: 534, type: !544, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !574, retainedTypes: !578, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !{!575}
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !573, line: 40, baseType: !6, size: 32, elements: !576)
!576 = !{!577}
!577 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!578 = !{!46, !579, !107}
!579 = !DISubprogram(name: "fputs_unlocked", scope: !57, file: !57, line: 662, type: !580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!580 = !DISubroutineType(types: !581)
!581 = !{!54, !52, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !583, file: !62, line: 51, baseType: !54, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !583, file: !62, line: 54, baseType: !50, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !583, file: !62, line: 55, baseType: !50, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !583, file: !62, line: 56, baseType: !50, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !583, file: !62, line: 57, baseType: !50, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !583, file: !62, line: 58, baseType: !50, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !583, file: !62, line: 59, baseType: !50, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !583, file: !62, line: 60, baseType: !50, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !583, file: !62, line: 61, baseType: !50, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !583, file: !62, line: 64, baseType: !50, size: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !583, file: !62, line: 65, baseType: !50, size: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !583, file: !62, line: 66, baseType: !50, size: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !583, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !583, file: !62, line: 70, baseType: !582, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !583, file: !62, line: 72, baseType: !54, size: 32, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !583, file: !62, line: 73, baseType: !54, size: 32, offset: 928)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !583, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !583, file: !62, line: 77, baseType: !87, size: 16, offset: 1024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !583, file: !62, line: 78, baseType: !89, size: 8, offset: 1040)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !583, file: !62, line: 79, baseType: !91, size: 8, offset: 1048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !583, file: !62, line: 81, baseType: !95, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !583, file: !62, line: 89, baseType: !98, size: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !583, file: !62, line: 91, baseType: !100, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !583, file: !62, line: 92, baseType: !103, size: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !583, file: !62, line: 93, baseType: !582, size: 64, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !583, file: !62, line: 94, baseType: !107, size: 64, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !583, file: !62, line: 95, baseType: !109, size: 64, offset: 1472)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !583, file: !62, line: 96, baseType: !54, size: 32, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !583, file: !62, line: 98, baseType: !114, size: 160, offset: 1568)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !629, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!616 = !{!617}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !618, file: !218, line: 186, baseType: !6, size: 32, elements: !627)
!618 = distinct !DISubprogram(name: "x2nrealloc", scope: !218, file: !218, line: 174, type: !619, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !622)
!619 = !DISubroutineType(types: !620)
!620 = !{!107, !107, !621, !109}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!622 = !{!623, !624, !625, !626}
!623 = !DILocalVariable(name: "p", arg: 1, scope: !618, file: !218, line: 174, type: !107)
!624 = !DILocalVariable(name: "pn", arg: 2, scope: !618, file: !218, line: 174, type: !621)
!625 = !DILocalVariable(name: "s", arg: 3, scope: !618, file: !218, line: 174, type: !109)
!626 = !DILocalVariable(name: "n", scope: !618, file: !218, line: 176, type: !109)
!627 = !{!628}
!628 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!629 = !{!109, !217, !497, !500, !50, !219, !107, !630, !633}
!630 = !DISubprogram(name: "xcalloc", scope: !218, file: !218, line: 57, type: !631, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!631 = !DISubroutineType(types: !632)
!632 = !{!107, !111, !111}
!633 = !DISubprogram(name: "rpl_calloc", scope: !634, file: !634, line: 688, type: !631, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!634 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !637, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!637 = !{!46, !153}
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, retainedTypes: !641, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!640 = !{!37}
!641 = !{!642, !201, !153}
!642 = !DISubprogram(name: "xstrtoumax", scope: !38, file: !38, line: 48, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!643 = !DISubroutineType(types: !644)
!644 = !{!37, !52, !230, !54, !446, !52}
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/xstrtol.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !649, retainedTypes: !650, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!649 = !{!37, !422}
!650 = !{!54, !87}
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !653, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!653 = !{!107}
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !656, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !{!657, !109, !669}
!657 = !DISubprogram(name: "mbrtowc", scope: !484, file: !484, line: 296, type: !658, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!658 = !DISubroutineType(types: !659)
!659 = !{!111, !151, !52, !111, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 13, size: 64, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !661, file: !468, line: 15, baseType: !54, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !661, file: !468, line: 20, baseType: !665, size: 32, offset: 32)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !468, line: 16, size: 32, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !665, file: !468, line: 18, baseType: !6, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !665, file: !468, line: 19, baseType: !476, size: 32)
!669 = !DISubprogram(name: "hard_locale", scope: !670, file: !670, line: 26, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!670 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!671 = !DISubroutineType(types: !672)
!672 = !{!246, !54}
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !675, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!675 = !{!676}
!676 = !DISubprogram(name: "rpl_fclose", scope: !677, file: !677, line: 672, type: !678, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!677 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!678 = !DISubroutineType(types: !679)
!679 = !{!54, !680}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !681, file: !62, line: 51, baseType: !54, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !681, file: !62, line: 54, baseType: !50, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !681, file: !62, line: 55, baseType: !50, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !681, file: !62, line: 56, baseType: !50, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !681, file: !62, line: 57, baseType: !50, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !681, file: !62, line: 58, baseType: !50, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !681, file: !62, line: 59, baseType: !50, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !681, file: !62, line: 60, baseType: !50, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !681, file: !62, line: 61, baseType: !50, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !681, file: !62, line: 64, baseType: !50, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !681, file: !62, line: 65, baseType: !50, size: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !681, file: !62, line: 66, baseType: !50, size: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !681, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !681, file: !62, line: 70, baseType: !680, size: 64, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !681, file: !62, line: 72, baseType: !54, size: 32, offset: 896)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !681, file: !62, line: 73, baseType: !54, size: 32, offset: 928)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !681, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !681, file: !62, line: 77, baseType: !87, size: 16, offset: 1024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !681, file: !62, line: 78, baseType: !89, size: 8, offset: 1040)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !681, file: !62, line: 79, baseType: !91, size: 8, offset: 1048)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !681, file: !62, line: 81, baseType: !95, size: 64, offset: 1088)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !681, file: !62, line: 89, baseType: !98, size: 64, offset: 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !681, file: !62, line: 91, baseType: !100, size: 64, offset: 1216)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !681, file: !62, line: 92, baseType: !103, size: 64, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !681, file: !62, line: 93, baseType: !680, size: 64, offset: 1344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !681, file: !62, line: 94, baseType: !107, size: 64, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !681, file: !62, line: 95, baseType: !109, size: 64, offset: 1472)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !681, file: !62, line: 96, baseType: !54, size: 32, offset: 1536)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !681, file: !62, line: 98, baseType: !114, size: 160, offset: 1568)
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !714, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!714 = !{!715}
!715 = !DISubprogram(name: "setlocale_null_r", scope: !716, file: !716, line: 64, type: !717, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !55)
!716 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!717 = !DISubroutineType(types: !718)
!718 = !{!54, !54, !50, !111}
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !721, retainedTypes: !1108, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!721 = !{!722}
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !723, line: 41, baseType: !6, size: 32, elements: !724)
!723 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107}
!725 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!726 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!727 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!728 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!729 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!730 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!731 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!732 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!733 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!734 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!735 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!736 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!737 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!738 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!739 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!740 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!741 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!742 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!743 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!744 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!745 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!746 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!747 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!748 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!749 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!750 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!751 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!752 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!753 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!754 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!755 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!756 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!757 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!758 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!759 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!760 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!761 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!762 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!763 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!764 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!765 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!766 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!767 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!768 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!769 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!770 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!771 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!772 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!773 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!774 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!833 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!836 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!837 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!838 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!839 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!840 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!841 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!842 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!843 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!844 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!845 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!846 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!847 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!920 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!993 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!994 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!995 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!996 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!997 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!998 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!999 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!1000 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!1001 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!1002 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!1003 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!1004 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!1005 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!1006 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!1007 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!1009 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!1010 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!1011 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!1012 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!1013 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!1014 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
