source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.control_info = type { i8*, i8, i64 }
%struct.infomap = type { i8*, i8* }
%struct.mode_info = type { i8*, i32, i8, i64, i64 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.speed_map = type { i8*, i32, i64 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.winsize = type { i16, i16, i16, i16 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [151 x i8] c"Usage: %s [-F DEVICE | --file=DEVICE] [SETTING]...\0A  or:  %s [-F DEVICE | --file=DEVICE] [-a|--all]\0A  or:  %s [-F DEVICE | --file=DEVICE] [-g|--save]\0A\00", align 1

!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "speed_setting", file: !3, line: 173, baseType: !6, size: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "input_speed", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "output_speed", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "both_speeds", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_type", file: !3, line: 185, baseType: !6, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "control", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "input", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "output", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "local", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "combination", value: 4, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !38, line: 25, baseType: !6, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44}
!40 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!45 = !{!46, !48, !49, !51, !52, !53, !54, !55}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !50, line: 24, baseType: !6)
!50 = !DIFile(filename: "/usr/include/bits/termios.h", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !50, line: 23, baseType: !52)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !50, line: 25, baseType: !6)
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!57 = !{!58, !97, !99, !101, !103, !0, !105, !119, !132, !145, !156}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "mode", scope: !60, file: !3, line: 1272, type: !83, isLocal: true, isDefinition: true)
!60 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1268, type: !61, scopeLine: 1269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !65)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !63, !64}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !74, !75, !76, !77, !78, !79, !80}
!66 = !DILocalVariable(name: "argc", arg: 1, scope: !60, file: !3, line: 1268, type: !63)
!67 = !DILocalVariable(name: "argv", arg: 2, scope: !60, file: !3, line: 1268, type: !64)
!68 = !DILocalVariable(name: "output_type", scope: !60, file: !3, line: 1274, type: !5)
!69 = !DILocalVariable(name: "optc", scope: !60, file: !3, line: 1275, type: !63)
!70 = !DILocalVariable(name: "argi", scope: !60, file: !3, line: 1276, type: !63)
!71 = !DILocalVariable(name: "opti", scope: !60, file: !3, line: 1277, type: !63)
!72 = !DILocalVariable(name: "require_set_attr", scope: !60, file: !3, line: 1278, type: !73)
!73 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DILocalVariable(name: "speed_was_set", scope: !60, file: !3, line: 1279, type: !73)
!75 = !DILocalVariable(name: "verbose_output", scope: !60, file: !3, line: 1280, type: !73)
!76 = !DILocalVariable(name: "recoverable_output", scope: !60, file: !3, line: 1281, type: !73)
!77 = !DILocalVariable(name: "noargs", scope: !60, file: !3, line: 1282, type: !73)
!78 = !DILocalVariable(name: "file_name", scope: !60, file: !3, line: 1283, type: !46)
!79 = !DILocalVariable(name: "device_name", scope: !60, file: !3, line: 1284, type: !55)
!80 = !DILocalVariable(name: "fdflags", scope: !81, file: !3, line: 1379, type: !63)
!81 = distinct !DILexicalBlock(scope: !82, file: !3, line: 1378, column: 5)
!82 = distinct !DILexicalBlock(scope: !60, file: !3, line: 1377, column: 7)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !84, line: 24, size: 480, elements: !85)
!84 = !DIFile(filename: "/usr/include/bits/termios-struct.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !95, !96}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !83, file: !84, line: 26, baseType: !53, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !83, file: !84, line: 27, baseType: !53, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !83, file: !84, line: 28, baseType: !53, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !83, file: !84, line: 29, baseType: !53, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !83, file: !84, line: 30, baseType: !51, size: 8, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !83, file: !84, line: 31, baseType: !92, size: 256, offset: 136)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 256, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !83, file: !84, line: 32, baseType: !49, size: 32, offset: 416)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !83, file: !84, line: 33, baseType: !49, size: 32, offset: 448)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "check_mode", scope: !60, file: !3, line: 1372, type: !83, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "new_mode", scope: !60, file: !3, line: 1408, type: !83, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "max_col", scope: !2, file: !3, line: 466, type: !63, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "current_col", scope: !2, file: !3, line: 469, type: !63, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 474, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1536, elements: !117)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !110, line: 50, size: 256, elements: !111)
!110 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!111 = !{!112, !113, !114, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 52, baseType: !55, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !109, file: !110, line: 55, baseType: !63, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !109, file: !110, line: 56, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !109, file: !110, line: 57, baseType: !63, size: 32, offset: 192)
!117 = !{!118}
!118 = !DISubrange(count: 6)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "mode_info", scope: !2, file: !3, line: 207, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 23040, elements: !130)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_info", file: !3, line: 198, size: 256, elements: !124)
!124 = !{!125, !126, !127, !128, !129}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !3, line: 200, baseType: !55, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !3, line: 201, baseType: !30, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !3, line: 202, baseType: !47, size: 8, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !123, file: !3, line: 203, baseType: !54, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !123, file: !3, line: 204, baseType: !54, size: 64, offset: 192)
!130 = !{!131}
!131 = !DISubrange(count: 90)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "control_info", scope: !2, file: !3, line: 393, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 3648, elements: !143)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_info", file: !3, line: 384, size: 192, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !3, line: 386, baseType: !55, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "saneval", scope: !136, file: !3, line: 387, baseType: !51, size: 8, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !136, file: !3, line: 388, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !142, line: 46, baseType: !54)
!142 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!143 = !{!144}
!144 = !DISubrange(count: 19)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "speeds", scope: !2, file: !3, line: 2141, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 6720, elements: !154)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "speed_map", file: !3, line: 2134, size: 192, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !149, file: !3, line: 2136, baseType: !55, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !149, file: !3, line: 2137, baseType: !49, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !149, file: !3, line: 2138, baseType: !54, size: 64, offset: 128)
!154 = !{!155}
!155 = !DISubrange(count: 35)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "buf", scope: !158, file: !3, line: 2269, type: !164, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "visible", scope: !3, file: !3, line: 2267, type: !159, scopeLine: 2268, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{!55, !51}
!161 = !{!162, !163}
!162 = !DILocalVariable(name: "ch", arg: 1, scope: !158, file: !3, line: 2267, type: !51)
!163 = !DILocalVariable(name: "bpout", scope: !158, file: !3, line: 2270, type: !46)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 80, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 10)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "Version", scope: !169, file: !170, line: 2, type: !55, isDefinition: true)
!169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !170, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, globals: !172, nameTableKind: None)
!170 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !{}
!172 = !{!167}
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "file_name", scope: !175, file: !176, line: 46, type: !55, isLocal: true, isDefinition: true)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, globals: !177, nameTableKind: None)
!176 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!173, !178}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !175, file: !176, line: 56, type: !73, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "exit_failure", scope: !182, file: !183, line: 24, type: !185, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, globals: !184, nameTableKind: None)
!183 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !{!180}
!185 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "program_name", scope: !188, file: !189, line: 33, type: !55, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, retainedTypes: !190, globals: !191, nameTableKind: None)
!189 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!190 = !{!48, !46}
!191 = !{!186}
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !194, file: !195, line: 85, type: !254, isDefinition: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !196, retainedTypes: !217, globals: !219, nameTableKind: None)
!195 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !{!11, !197, !202}
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !198)
!198 = !{!199, !200, !201}
!199 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!200 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!201 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !203, line: 46, baseType: !6, size: 32, elements: !204)
!203 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!206 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!207 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!208 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!209 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!210 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!211 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!212 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!213 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!214 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!215 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!216 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!217 = !{!63, !218, !141, !46}
!218 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!219 = !{!192, !220, !224, !236, !238, !243, !250, !252}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !194, file: !195, line: 101, type: !222, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 320, elements: !165)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !194, file: !195, line: 1052, type: !226, isDefinition: true)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !195, line: 65, size: 448, elements: !227)
!227 = !{!228, !229, !230, !234, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !226, file: !195, line: 68, baseType: !11, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !226, file: !195, line: 71, baseType: !63, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !226, file: !195, line: 75, baseType: !231, size: 256, offset: 64)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !226, file: !195, line: 78, baseType: !55, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !226, file: !195, line: 81, baseType: !55, size: 64, offset: 384)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !194, file: !195, line: 116, type: !226, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "slot0", scope: !194, file: !195, line: 842, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 256)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "slotvec", scope: !194, file: !195, line: 845, type: !245, isLocal: true, isDefinition: true)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !195, line: 834, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !195, line: 836, baseType: !141, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !246, file: !195, line: 837, baseType: !46, size: 64, offset: 64)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "nslots", scope: !194, file: !195, line: 843, type: !63, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "slotvec0", scope: !194, file: !195, line: 844, type: !246, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 704, elements: !256)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!256 = !{!257}
!257 = !DISubrange(count: 11)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !260, file: !261, line: 26, type: !263, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, globals: !262, nameTableKind: None)
!261 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = !{!258}
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 47)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !268, file: !269, line: 507, type: !63, isLocal: true, isDefinition: true)
!268 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !269, file: !269, line: 488, type: !270, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !274)
!269 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = !DISubroutineType(types: !271)
!271 = !{!63, !63, !63}
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, globals: !273, nameTableKind: None)
!273 = !{!266}
!274 = !{!275, !276, !277, !278, !281}
!275 = !DILocalVariable(name: "fd", arg: 1, scope: !268, file: !269, line: 488, type: !63)
!276 = !DILocalVariable(name: "target", arg: 2, scope: !268, file: !269, line: 488, type: !63)
!277 = !DILocalVariable(name: "result", scope: !268, file: !269, line: 490, type: !63)
!278 = !DILocalVariable(name: "flags", scope: !279, file: !269, line: 531, type: !63)
!279 = distinct !DILexicalBlock(scope: !280, file: !269, line: 530, column: 5)
!280 = distinct !DILexicalBlock(scope: !268, file: !269, line: 529, column: 7)
!281 = !DILocalVariable(name: "saved_errno", scope: !282, file: !269, line: 534, type: !63)
!282 = distinct !DILexicalBlock(scope: !283, file: !269, line: 533, column: 9)
!283 = distinct !DILexicalBlock(scope: !279, file: !269, line: 532, column: 11)
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, nameTableKind: None)
!285 = !DIFile(filename: "lib/fd-reopen.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !288, retainedTypes: !292, nameTableKind: None)
!287 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !287, line: 40, baseType: !6, size: 32, elements: !290)
!290 = !{!291}
!291 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!292 = !{!48}
!293 = distinct !DICompileUnit(language: DW_LANG_C99, file: !294, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !309, nameTableKind: None)
!294 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!295 = !{!296}
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !298, file: !297, line: 186, baseType: !6, size: 32, elements: !307)
!297 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!298 = distinct !DISubprogram(name: "x2nrealloc", scope: !297, file: !297, line: 174, type: !299, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !293, retainedNodes: !302)
!299 = !DISubroutineType(types: !300)
!300 = !{!48, !48, !301, !141}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!302 = !{!303, !304, !305, !306}
!303 = !DILocalVariable(name: "p", arg: 1, scope: !298, file: !297, line: 174, type: !48)
!304 = !DILocalVariable(name: "pn", arg: 2, scope: !298, file: !297, line: 174, type: !301)
!305 = !DILocalVariable(name: "s", arg: 3, scope: !298, file: !297, line: 174, type: !141)
!306 = !DILocalVariable(name: "n", scope: !298, file: !297, line: 176, type: !141)
!307 = !{!308}
!308 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!309 = !{!141, !46, !48}
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, nameTableKind: None)
!311 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !314, nameTableKind: None)
!313 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!314 = !{!37}
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !314, nameTableKind: None)
!316 = !DIFile(filename: "lib/xstrtol.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !319, retainedTypes: !320, nameTableKind: None)
!318 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !{!37, !202}
!320 = !{!63, !218}
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, retainedTypes: !292, nameTableKind: None)
!322 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, retainedTypes: !325, nameTableKind: None)
!324 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!325 = !{!141}
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, nameTableKind: None)
!327 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, nameTableKind: None)
!329 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !332, retainedTypes: !292, nameTableKind: None)
!331 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!332 = !{!333}
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !334, line: 41, baseType: !6, size: 32, elements: !335)
!334 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!336 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!337 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!338 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!339 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!340 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!341 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!342 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!343 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!344 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!345 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!346 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!347 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!348 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!349 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!350 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!351 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!352 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!353 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!354 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!355 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!356 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!357 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!358 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!359 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!360 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!361 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!362 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!363 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!364 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!365 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!366 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!367 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!368 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!369 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!370 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!371 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!372 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!373 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!374 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!375 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!376 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!377 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!378 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!379 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!380 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!381 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!382 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!383 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!384 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!385 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!444 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!447 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!448 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!449 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!450 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!451 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!452 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!453 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!454 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!455 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!456 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!457 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!458 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!531 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!604 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!605 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!606 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!607 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!608 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!609 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!610 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!611 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!612 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!613 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!614 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!615 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!616 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!617 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!618 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!620 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!621 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!622 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!623 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!624 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!625 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!651 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!652 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!653 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!654 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!655 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!660 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!661 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!662 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!663 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, retainedTypes: !292, nameTableKind: None)
!720 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, nameTableKind: None)
!722 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, retainedTypes: !292, nameTableKind: None)
!724 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !171, retainedTypes: !292, nameTableKind: None)
!726 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!727 = !{!"clang version 12.0.1"}
!728 = !{i32 7, !"Dwarf Version", i32 4}
!729 = !{i32 2, !"Debug Info Version", i32 3}
!730 = !{i32 1, !"wchar_size", i32 4}
!731 = !{i32 7, !"PIC Level", i32 2}
!732 = !{i32 7, !"PIE Level", i32 2}
!733 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 525, type: !734, scopeLine: 526, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !63}
!736 = !{!737}
!737 = !DILocalVariable(name: "status", arg: 1, scope: !733, file: !3, line: 525, type: !63)
!738 = !DILocation(scope: !733)
!739 = !DILocation(line: 527, column: 14, scope: !740)
!740 = distinct !DILexicalBlock(scope: !733, file: !3, line: 527, column: 7)
!741 = !DILocation(line: 527, column: 7, scope: !733)
!742 = !DILocation(line: 528, column: 5, scope: !743)
!743 = distinct !DILexicalBlock(scope: !740, file: !3, line: 528, column: 5)
!744 = !{!745, !745, i64 0}
!745 = !{!"any pointer", !746, i64 0}
!746 = !{!"omnipotent char", !747, i64 0}
!747 = !{!"Simple C/C++ TBAA"}
!748 = !DILocation(line: 531, column: 7, scope: !749)
!749 = distinct !DILexicalBlock(scope: !740, file: !3, line: 530, column: 5)
!750 = !DILocation(line: 537, column: 7, scope: !749)
!751 = !DILocation(line: 590, column: 3, scope: !752, inlinedAt: !756)
!752 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !753, file: !753, line: 588, type: !754, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !171)
!753 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!754 = !DISubroutineType(types: !755)
!755 = !{null}
!756 = distinct !DILocation(line: 541, column: 7, scope: !749)
!757 = !DILocation(line: 543, column: 7, scope: !749)
!758 = !DILocation(line: 548, column: 7, scope: !749)
!759 = !DILocation(line: 549, column: 7, scope: !749)
!760 = !DILocation(line: 550, column: 7, scope: !749)
!761 = !DILocation(line: 555, column: 7, scope: !749)
!762 = !DILocation(line: 559, column: 7, scope: !749)
!763 = !DILocation(line: 568, column: 7, scope: !749)
!764 = !DILocation(line: 573, column: 7, scope: !749)
!765 = !DILocation(line: 577, column: 7, scope: !749)
!766 = !DILocation(line: 583, column: 7, scope: !749)
!767 = !DILocation(line: 592, column: 7, scope: !749)
!768 = !DILocation(line: 596, column: 7, scope: !749)
!769 = !DILocation(line: 600, column: 7, scope: !749)
!770 = !DILocation(line: 606, column: 7, scope: !749)
!771 = !DILocation(line: 611, column: 7, scope: !749)
!772 = !DILocation(line: 615, column: 7, scope: !749)
!773 = !DILocation(line: 621, column: 7, scope: !749)
!774 = !DILocation(line: 626, column: 7, scope: !749)
!775 = !{!776, !776, i64 0}
!776 = !{!"int", !746, i64 0}
!777 = !DILocation(line: 629, column: 7, scope: !749)
!778 = !DILocation(line: 633, column: 7, scope: !749)
!779 = !DILocation(line: 637, column: 7, scope: !749)
!780 = !DILocation(line: 642, column: 7, scope: !749)
!781 = !DILocation(line: 647, column: 7, scope: !749)
!782 = !DILocation(line: 651, column: 7, scope: !749)
!783 = !DILocation(line: 658, column: 7, scope: !749)
!784 = !DILocation(line: 667, column: 7, scope: !749)
!785 = !DILocation(line: 670, column: 7, scope: !749)
!786 = !DILocation(line: 678, column: 7, scope: !749)
!787 = !DILocation(line: 682, column: 7, scope: !749)
!788 = !DILocation(line: 692, column: 7, scope: !749)
!789 = !DILocation(line: 696, column: 7, scope: !749)
!790 = !DILocation(line: 702, column: 7, scope: !749)
!791 = !DILocation(line: 707, column: 7, scope: !749)
!792 = !DILocation(line: 712, column: 7, scope: !749)
!793 = !DILocation(line: 716, column: 7, scope: !749)
!794 = !DILocation(line: 722, column: 7, scope: !749)
!795 = !DILocation(line: 727, column: 7, scope: !749)
!796 = !DILocation(line: 732, column: 7, scope: !749)
!797 = !DILocation(line: 737, column: 7, scope: !749)
!798 = !DILocation(line: 742, column: 7, scope: !749)
!799 = !DILocation(line: 747, column: 7, scope: !749)
!800 = !DILocation(line: 752, column: 7, scope: !749)
!801 = !DILocation(line: 757, column: 7, scope: !749)
!802 = !DILocation(line: 762, column: 7, scope: !749)
!803 = !DILocation(line: 767, column: 7, scope: !749)
!804 = !DILocation(line: 772, column: 7, scope: !749)
!805 = !DILocation(line: 777, column: 7, scope: !749)
!806 = !DILocation(line: 781, column: 7, scope: !749)
!807 = !DILocation(line: 785, column: 7, scope: !749)
!808 = !DILocation(line: 792, column: 7, scope: !749)
!809 = !DILocation(line: 796, column: 7, scope: !749)
!810 = !DILocation(line: 802, column: 7, scope: !749)
!811 = !DILocation(line: 808, column: 7, scope: !749)
!812 = !DILocation(line: 812, column: 7, scope: !749)
!813 = !DILocation(line: 816, column: 7, scope: !749)
!814 = !DILocation(line: 820, column: 7, scope: !749)
!815 = !DILocation(line: 825, column: 7, scope: !749)
!816 = !DILocation(line: 829, column: 7, scope: !749)
!817 = !DILocation(line: 833, column: 7, scope: !749)
!818 = !DILocation(line: 838, column: 7, scope: !749)
!819 = !DILocation(line: 843, column: 7, scope: !749)
!820 = !DILocation(line: 847, column: 7, scope: !749)
!821 = !DILocation(line: 858, column: 7, scope: !749)
!822 = !DILocation(line: 863, column: 7, scope: !749)
!823 = !DILocation(line: 868, column: 7, scope: !749)
!824 = !DILocation(line: 873, column: 7, scope: !749)
!825 = !DILocation(line: 877, column: 7, scope: !749)
!826 = !DILocation(line: 882, column: 7, scope: !749)
!827 = !DILocation(line: 886, column: 7, scope: !749)
!828 = !DILocation(line: 890, column: 7, scope: !749)
!829 = !DILocation(line: 895, column: 7, scope: !749)
!830 = !DILocation(line: 905, column: 7, scope: !749)
!831 = !DILocation(line: 920, column: 7, scope: !749)
!832 = !DILocation(line: 924, column: 7, scope: !749)
!833 = !DILocation(line: 930, column: 7, scope: !749)
!834 = !DILocation(line: 934, column: 7, scope: !749)
!835 = !DILocation(line: 938, column: 7, scope: !749)
!836 = !DILocation(line: 956, column: 7, scope: !749)
!837 = !DILocation(line: 963, column: 7, scope: !749)
!838 = !DILocation(line: 982, column: 7, scope: !749)
!839 = !DILocation(line: 1068, column: 7, scope: !749)
!840 = !DILocalVariable(name: "program", arg: 1, scope: !841, file: !753, line: 634, type: !55)
!841 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !753, file: !753, line: 634, type: !842, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !844)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !55}
!844 = !{!840, !845, !854, !855, !857}
!845 = !DILocalVariable(name: "infomap", scope: !841, file: !753, line: 636, type: !846)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 896, elements: !852)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !841, file: !753, line: 636, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !848, file: !753, line: 636, baseType: !55, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !848, file: !753, line: 636, baseType: !55, size: 64, offset: 64)
!852 = !{!853}
!853 = !DISubrange(count: 7)
!854 = !DILocalVariable(name: "node", scope: !841, file: !753, line: 646, type: !55)
!855 = !DILocalVariable(name: "map_prog", scope: !841, file: !753, line: 647, type: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!857 = !DILocalVariable(name: "lc_messages", scope: !841, file: !753, line: 659, type: !55)
!858 = !DILocation(scope: !841, inlinedAt: !859)
!859 = distinct !DILocation(line: 1075, column: 7, scope: !749)
!860 = !DILocation(line: 636, column: 3, scope: !841, inlinedAt: !859)
!861 = !DILocation(line: 636, column: 67, scope: !841, inlinedAt: !859)
!862 = !DILocation(line: 647, column: 36, scope: !841, inlinedAt: !859)
!863 = !DILocation(line: 649, column: 3, scope: !841, inlinedAt: !859)
!864 = !DILocation(line: 649, column: 33, scope: !841, inlinedAt: !859)
!865 = !DILocation(line: 650, column: 13, scope: !841, inlinedAt: !859)
!866 = !DILocation(line: 649, column: 20, scope: !841, inlinedAt: !859)
!867 = !{!868, !745, i64 0}
!868 = !{!"infomap", !745, i64 0, !745, i64 8}
!869 = !DILocation(line: 649, column: 10, scope: !841, inlinedAt: !859)
!870 = !DILocation(line: 649, column: 28, scope: !841, inlinedAt: !859)
!871 = distinct !{!871, !863, !865, !872}
!872 = !{!"llvm.loop.mustprogress"}
!873 = !DILocation(line: 652, column: 17, scope: !874, inlinedAt: !859)
!874 = distinct !DILexicalBlock(scope: !841, file: !753, line: 652, column: 7)
!875 = !{!868, !745, i64 8}
!876 = !DILocation(line: 652, column: 7, scope: !874, inlinedAt: !859)
!877 = !DILocation(line: 652, column: 7, scope: !841, inlinedAt: !859)
!878 = !DILocation(line: 655, column: 3, scope: !841, inlinedAt: !859)
!879 = !DILocation(line: 659, column: 29, scope: !841, inlinedAt: !859)
!880 = !DILocation(line: 660, column: 7, scope: !881, inlinedAt: !859)
!881 = distinct !DILexicalBlock(scope: !841, file: !753, line: 660, column: 7)
!882 = !DILocation(line: 660, column: 19, scope: !881, inlinedAt: !859)
!883 = !DILocation(line: 660, column: 22, scope: !881, inlinedAt: !859)
!884 = !DILocation(line: 660, column: 7, scope: !841, inlinedAt: !859)
!885 = !DILocation(line: 666, column: 7, scope: !886, inlinedAt: !859)
!886 = distinct !DILexicalBlock(scope: !881, file: !753, line: 661, column: 5)
!887 = !DILocation(line: 668, column: 5, scope: !886, inlinedAt: !859)
!888 = !DILocation(line: 669, column: 3, scope: !841, inlinedAt: !859)
!889 = !DILocation(line: 671, column: 3, scope: !841, inlinedAt: !859)
!890 = !DILocation(line: 673, column: 1, scope: !841, inlinedAt: !859)
!891 = !DILocation(line: 1077, column: 3, scope: !733)
!892 = !DISubprogram(name: "dcgettext", scope: !893, file: !893, line: 51, type: !894, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !171)
!893 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!894 = !DISubroutineType(types: !895)
!895 = !{!46, !55, !55, !63}
!896 = !DISubprogram(name: "fputs_unlocked", scope: !897, file: !897, line: 667, type: !898, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !171)
!897 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!898 = !DISubroutineType(types: !899)
!899 = !{!63, !55, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !902, line: 49, size: 1728, elements: !903)
!902 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !919, !920, !921, !922, !926, !927, !929, !933, !936, !938, !941, !944, !945, !946, !947, !948}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !901, file: !902, line: 51, baseType: !63, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !901, file: !902, line: 54, baseType: !46, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !901, file: !902, line: 55, baseType: !46, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !901, file: !902, line: 56, baseType: !46, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !901, file: !902, line: 57, baseType: !46, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !901, file: !902, line: 58, baseType: !46, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !901, file: !902, line: 59, baseType: !46, size: 64, offset: 384)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !901, file: !902, line: 60, baseType: !46, size: 64, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !901, file: !902, line: 61, baseType: !46, size: 64, offset: 512)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !901, file: !902, line: 64, baseType: !46, size: 64, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !901, file: !902, line: 65, baseType: !46, size: 64, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !901, file: !902, line: 66, baseType: !46, size: 64, offset: 704)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !901, file: !902, line: 68, baseType: !917, size: 64, offset: 768)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !902, line: 36, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !901, file: !902, line: 70, baseType: !900, size: 64, offset: 832)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !901, file: !902, line: 72, baseType: !63, size: 32, offset: 896)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !901, file: !902, line: 73, baseType: !63, size: 32, offset: 928)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !901, file: !902, line: 74, baseType: !923, size: 64, offset: 960)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !924, line: 152, baseType: !925)
!924 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!925 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !901, file: !902, line: 77, baseType: !218, size: 16, offset: 1024)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !901, file: !902, line: 78, baseType: !928, size: 8, offset: 1040)
!928 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !901, file: !902, line: 79, baseType: !930, size: 8, offset: 1048)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 1)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !901, file: !902, line: 81, baseType: !934, size: 64, offset: 1088)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !902, line: 43, baseType: null)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !901, file: !902, line: 89, baseType: !937, size: 64, offset: 1152)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !924, line: 153, baseType: !925)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !901, file: !902, line: 91, baseType: !939, size: 64, offset: 1216)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !902, line: 37, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !901, file: !902, line: 92, baseType: !942, size: 64, offset: 1280)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !902, line: 38, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !901, file: !902, line: 93, baseType: !900, size: 64, offset: 1344)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !901, file: !902, line: 94, baseType: !48, size: 64, offset: 1408)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !901, file: !902, line: 95, baseType: !141, size: 64, offset: 1472)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !901, file: !902, line: 96, baseType: !63, size: 32, offset: 1536)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !901, file: !902, line: 98, baseType: !949, size: 160, offset: 1568)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 20)
!952 = !DISubprogram(name: "setlocale", scope: !953, file: !953, line: 122, type: !954, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !171)
!953 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!954 = !DISubroutineType(types: !955)
!955 = !{!46, !63, !55}
!956 = !DILocation(scope: !60)
!957 = !DILocation(line: 1278, column: 3, scope: !60)
!958 = !DILocation(line: 1279, column: 3, scope: !60)
!959 = !DILocation(line: 1287, column: 21, scope: !60)
!960 = !DILocation(line: 1287, column: 3, scope: !60)
!961 = !DILocation(line: 1288, column: 3, scope: !60)
!962 = !DILocation(line: 1289, column: 3, scope: !60)
!963 = !DILocation(line: 1290, column: 3, scope: !60)
!964 = !DILocation(line: 1292, column: 3, scope: !60)
!965 = !DILocation(line: 1299, column: 10, scope: !60)
!966 = !DILocation(line: 1308, column: 3, scope: !60)
!967 = !DILocation(line: 1295, column: 18, scope: !60)
!968 = !DILocation(line: 1296, column: 22, scope: !60)
!969 = !DILocation(line: 1282, column: 8, scope: !60)
!970 = !DILocation(line: 1283, column: 9, scope: !60)
!971 = !DILocation(line: 1294, column: 15, scope: !60)
!972 = !DILocation(line: 1308, column: 36, scope: !60)
!973 = !DILocation(line: 1308, column: 49, scope: !60)
!974 = !DILocation(line: 1308, column: 18, scope: !60)
!975 = !DILocation(line: 1322, column: 11, scope: !976)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 1313, column: 9)
!977 = distinct !DILexicalBlock(scope: !60, file: !3, line: 1311, column: 5)
!978 = !DILocation(line: 1325, column: 15, scope: !979)
!979 = distinct !DILexicalBlock(scope: !976, file: !3, line: 1325, column: 15)
!980 = !DILocation(line: 1325, column: 15, scope: !976)
!981 = !DILocation(line: 1326, column: 13, scope: !979)
!982 = !DILocation(line: 1327, column: 23, scope: !976)
!983 = !DILocation(line: 1328, column: 11, scope: !976)
!984 = !DILocation(line: 1330, column: 9, scope: !976)
!985 = !DILocation(line: 1332, column: 9, scope: !976)
!986 = !DILocation(line: 1337, column: 17, scope: !987)
!987 = distinct !DILexicalBlock(scope: !976, file: !3, line: 1337, column: 15)
!988 = !DILocation(line: 1338, column: 15, scope: !987)
!989 = !DILocation(line: 1338, column: 20, scope: !987)
!990 = !DILocation(line: 1337, column: 15, scope: !976)
!991 = !DILocation(line: 1347, column: 18, scope: !976)
!992 = !DILocation(line: 1349, column: 11, scope: !976)
!993 = !DILocation(line: 1353, column: 21, scope: !977)
!994 = !DILocation(line: 1353, column: 19, scope: !977)
!995 = !DILocation(line: 1353, column: 7, scope: !977)
!996 = !DILocation(line: 1354, column: 29, scope: !977)
!997 = distinct !{!997, !966, !998, !872}
!998 = !DILocation(line: 1355, column: 5, scope: !60)
!999 = !DILocation(line: 1358, column: 22, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !60, file: !3, line: 1358, column: 7)
!1001 = !DILocation(line: 1359, column: 5, scope: !1000)
!1002 = !DILocation(line: 1364, column: 8, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !60, file: !3, line: 1364, column: 7)
!1004 = !DILocation(line: 1364, column: 15, scope: !1003)
!1005 = !DILocation(line: 1365, column: 5, scope: !1003)
!1006 = !DILocation(line: 1368, column: 17, scope: !60)
!1007 = !DILocation(line: 1368, column: 41, scope: !60)
!1008 = !DILocation(line: 1370, column: 15, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !60, file: !3, line: 1370, column: 7)
!1010 = !DILocation(line: 1373, column: 7, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 1371, column: 5)
!1012 = !DILocation(line: 1375, column: 5, scope: !1011)
!1013 = !DILocation(line: 1377, column: 7, scope: !60)
!1014 = !DILocation(line: 1380, column: 11, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !81, file: !3, line: 1380, column: 11)
!1016 = !DILocation(line: 1380, column: 75, scope: !1015)
!1017 = !DILocation(line: 1380, column: 11, scope: !81)
!1018 = !DILocation(line: 1381, column: 9, scope: !1015)
!1019 = !DILocation(line: 1382, column: 22, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !81, file: !3, line: 1382, column: 11)
!1021 = !DILocation(scope: !81)
!1022 = !DILocation(line: 1382, column: 53, scope: !1020)
!1023 = !DILocation(line: 1383, column: 11, scope: !1020)
!1024 = !DILocation(line: 1383, column: 52, scope: !1020)
!1025 = !DILocation(line: 1383, column: 14, scope: !1020)
!1026 = !DILocation(line: 1383, column: 67, scope: !1020)
!1027 = !DILocation(line: 1382, column: 11, scope: !81)
!1028 = !DILocation(line: 1384, column: 9, scope: !1020)
!1029 = !DILocation(line: 1388, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !60, file: !3, line: 1388, column: 7)
!1031 = !DILocation(line: 1388, column: 7, scope: !60)
!1032 = !DILocation(line: 1389, column: 5, scope: !1030)
!1033 = !DILocation(line: 1391, column: 22, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !60, file: !3, line: 1391, column: 7)
!1035 = !DILocation(line: 1809, column: 3, scope: !1036, inlinedAt: !1051)
!1036 = distinct !DISubprogram(name: "screen_columns", scope: !3, file: !3, line: 1806, type: !1037, scopeLine: 1807, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1039)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!63}
!1039 = !{!1040, !1048, !1050}
!1040 = !DILocalVariable(name: "win", scope: !1036, file: !3, line: 1809, type: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !1042, line: 27, size: 64, elements: !1043)
!1042 = !DIFile(filename: "/usr/include/bits/ioctl-types.h", directory: "")
!1043 = !{!1044, !1045, !1046, !1047}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !1041, file: !1042, line: 29, baseType: !218, size: 16)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !1041, file: !1042, line: 30, baseType: !218, size: 16, offset: 16)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !1041, file: !1042, line: 31, baseType: !218, size: 16, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !1041, file: !1042, line: 32, baseType: !218, size: 16, offset: 48)
!1048 = !DILocalVariable(name: "col_string", scope: !1049, file: !3, line: 1822, type: !46)
!1049 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 1820, column: 3)
!1050 = !DILocalVariable(name: "n_columns", scope: !1049, file: !3, line: 1823, type: !925)
!1051 = distinct !DILocation(line: 1393, column: 17, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 1392, column: 5)
!1053 = !DILocation(line: 1809, column: 18, scope: !1036, inlinedAt: !1051)
!1054 = !DILocalVariable(name: "fd", arg: 1, scope: !1055, file: !3, line: 1713, type: !63)
!1055 = distinct !DISubprogram(name: "get_win_size", scope: !3, file: !3, line: 1713, type: !1056, scopeLine: 1714, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1059)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!63, !63, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1059 = !{!1054, !1060, !1061}
!1060 = !DILocalVariable(name: "win", arg: 2, scope: !1055, file: !3, line: 1713, type: !1058)
!1061 = !DILocalVariable(name: "err", scope: !1055, file: !3, line: 1715, type: !63)
!1062 = !DILocation(scope: !1055, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 1817, column: 7, scope: !1064, inlinedAt: !1051)
!1064 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 1817, column: 7)
!1065 = !DILocation(line: 1715, column: 13, scope: !1055, inlinedAt: !1063)
!1066 = !DILocation(line: 1817, column: 42, scope: !1064, inlinedAt: !1051)
!1067 = !DILocation(line: 1817, column: 47, scope: !1064, inlinedAt: !1051)
!1068 = !DILocation(line: 1817, column: 58, scope: !1064, inlinedAt: !1051)
!1069 = !{!1070, !1071, i64 2}
!1070 = !{!"winsize", !1071, i64 0, !1071, i64 2, !1071, i64 4, !1071, i64 6}
!1071 = !{!"short", !746, i64 0}
!1072 = !DILocation(line: 1817, column: 52, scope: !1064, inlinedAt: !1051)
!1073 = !DILocation(line: 1817, column: 7, scope: !1036, inlinedAt: !1051)
!1074 = !DILocation(line: 1817, column: 54, scope: !1064, inlinedAt: !1051)
!1075 = !DILocation(line: 1818, column: 5, scope: !1064, inlinedAt: !1051)
!1076 = !DILocation(line: 1822, column: 24, scope: !1049, inlinedAt: !1051)
!1077 = !DILocation(scope: !1049, inlinedAt: !1051)
!1078 = !DILocation(line: 1823, column: 5, scope: !1049, inlinedAt: !1051)
!1079 = !DILocation(line: 1824, column: 22, scope: !1080, inlinedAt: !1051)
!1080 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1824, column: 9)
!1081 = !DILocation(line: 1825, column: 11, scope: !1080, inlinedAt: !1051)
!1082 = !DILocation(line: 1825, column: 14, scope: !1080, inlinedAt: !1051)
!1083 = !DILocation(line: 1825, column: 60, scope: !1080, inlinedAt: !1051)
!1084 = !DILocation(line: 1826, column: 11, scope: !1080, inlinedAt: !1051)
!1085 = !DILocation(line: 1828, column: 7, scope: !1080, inlinedAt: !1051)
!1086 = !DILocation(line: 1829, column: 12, scope: !1049, inlinedAt: !1051)
!1087 = !DILocation(line: 1830, column: 3, scope: !1036, inlinedAt: !1051)
!1088 = !DILocation(scope: !1036, inlinedAt: !1051)
!1089 = !DILocation(line: 1831, column: 1, scope: !1036, inlinedAt: !1051)
!1090 = !DILocation(line: 1393, column: 15, scope: !1052)
!1091 = !DILocation(line: 1394, column: 19, scope: !1052)
!1092 = !DILocalVariable(name: "output_type", arg: 1, scope: !1093, file: !3, line: 1859, type: !5)
!1093 = distinct !DISubprogram(name: "display_settings", scope: !3, file: !3, line: 1859, type: !1094, scopeLine: 1861, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1097)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !5, !1096, !55}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!1097 = !{!1092, !1098, !1099}
!1098 = !DILocalVariable(name: "mode", arg: 2, scope: !1093, file: !3, line: 1859, type: !1096)
!1099 = !DILocalVariable(name: "device_name", arg: 3, scope: !1093, file: !3, line: 1860, type: !55)
!1100 = !DILocation(scope: !1093, inlinedAt: !1101)
!1101 = distinct !DILocation(line: 1395, column: 7, scope: !1052)
!1102 = !DILocation(line: 1862, column: 3, scope: !1093, inlinedAt: !1101)
!1103 = !DILocalVariable(name: "mode", arg: 1, scope: !1104, file: !3, line: 1879, type: !1096)
!1104 = distinct !DISubprogram(name: "display_changed", scope: !3, file: !3, line: 1879, type: !1105, scopeLine: 1880, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1107)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !1096}
!1107 = !{!1103, !1108, !1109, !1110, !1112, !1113}
!1108 = !DILocalVariable(name: "i", scope: !1104, file: !3, line: 1881, type: !63)
!1109 = !DILocalVariable(name: "empty_line", scope: !1104, file: !3, line: 1882, type: !73)
!1110 = !DILocalVariable(name: "bitsp", scope: !1104, file: !3, line: 1883, type: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!1112 = !DILocalVariable(name: "mask", scope: !1104, file: !3, line: 1884, type: !54)
!1113 = !DILocalVariable(name: "prev_type", scope: !1104, file: !3, line: 1885, type: !30)
!1114 = !DILocation(scope: !1104, inlinedAt: !1115)
!1115 = distinct !DILocation(line: 1865, column: 7, scope: !1116, inlinedAt: !1101)
!1116 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 1863, column: 5)
!1117 = !DILocation(line: 1887, column: 3, scope: !1104, inlinedAt: !1115)
!1118 = !DILocation(line: 1889, column: 30, scope: !1104, inlinedAt: !1115)
!1119 = !{!1120, !746, i64 16}
!1120 = !{!"termios", !776, i64 0, !776, i64 4, !776, i64 8, !776, i64 12, !746, i64 16, !746, i64 17, !776, i64 52, !776, i64 56}
!1121 = !DILocation(line: 1889, column: 24, scope: !1104, inlinedAt: !1115)
!1122 = !DILocation(line: 1889, column: 3, scope: !1104, inlinedAt: !1115)
!1123 = !DILocalVariable(name: "__c", arg: 1, scope: !1124, file: !1125, line: 108, type: !63)
!1124 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1125, file: !1125, line: 108, type: !1126, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1128)
!1125 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!63, !63}
!1128 = !{!1123}
!1129 = !DILocation(scope: !1124, inlinedAt: !1130)
!1130 = distinct !DILocation(line: 1891, column: 3, scope: !1104, inlinedAt: !1115)
!1131 = !DILocation(line: 110, column: 10, scope: !1124, inlinedAt: !1130)
!1132 = !{!1133, !745, i64 40}
!1133 = !{!"_IO_FILE", !776, i64 0, !745, i64 8, !745, i64 16, !745, i64 24, !745, i64 32, !745, i64 40, !745, i64 48, !745, i64 56, !745, i64 64, !745, i64 72, !745, i64 80, !745, i64 88, !745, i64 96, !745, i64 104, !776, i64 112, !776, i64 116, !1134, i64 120, !1071, i64 128, !746, i64 130, !746, i64 131, !745, i64 136, !1134, i64 144, !745, i64 152, !745, i64 160, !745, i64 168, !745, i64 176, !1134, i64 184, !776, i64 192, !746, i64 196}
!1134 = !{!"long", !746, i64 0}
!1135 = !{!1133, !745, i64 48}
!1136 = !{!"branch_weights", i32 2000, i32 1}
!1137 = !{!746, !746, i64 0}
!1138 = !DILocation(line: 1892, column: 15, scope: !1104, inlinedAt: !1115)
!1139 = !DILocation(line: 1895, column: 3, scope: !1140, inlinedAt: !1115)
!1140 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 1895, column: 3)
!1141 = !DILocation(line: 1897, column: 38, scope: !1142, inlinedAt: !1115)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 1897, column: 11)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 1896, column: 5)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 1895, column: 3)
!1145 = !{!1146, !1134, i64 16}
!1146 = !{!"control_info", !745, i64 0, !746, i64 8, !1134, i64 16}
!1147 = !DILocation(line: 1897, column: 11, scope: !1142, inlinedAt: !1115)
!1148 = !DILocation(line: 1897, column: 65, scope: !1142, inlinedAt: !1115)
!1149 = !{!1146, !746, i64 8}
!1150 = !DILocation(line: 1897, column: 46, scope: !1142, inlinedAt: !1115)
!1151 = !DILocation(line: 1897, column: 11, scope: !1143, inlinedAt: !1115)
!1152 = !DILocation(line: 1902, column: 11, scope: !1153, inlinedAt: !1115)
!1153 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 1902, column: 11)
!1154 = !DILocation(line: 1902, column: 11, scope: !1143, inlinedAt: !1115)
!1155 = !DILocation(scope: !158, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 1920, column: 14, scope: !1143, inlinedAt: !1115)
!1157 = !DILocation(line: 2272, column: 10, scope: !1158, inlinedAt: !1156)
!1158 = distinct !DILexicalBlock(scope: !158, file: !3, line: 2272, column: 7)
!1159 = !DILocation(line: 2272, column: 7, scope: !158, inlinedAt: !1156)
!1160 = !DILocation(line: 2275, column: 10, scope: !1161, inlinedAt: !1156)
!1161 = distinct !DILexicalBlock(scope: !158, file: !3, line: 2275, column: 7)
!1162 = !DILocation(line: 2275, column: 7, scope: !158, inlinedAt: !1156)
!1163 = !DILocation(line: 2277, column: 14, scope: !1164, inlinedAt: !1156)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 2277, column: 11)
!1165 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 2276, column: 5)
!1166 = !DILocation(line: 2277, column: 11, scope: !1165, inlinedAt: !1156)
!1167 = !DILocation(line: 2278, column: 18, scope: !1164, inlinedAt: !1156)
!1168 = !DILocation(line: 2278, column: 9, scope: !1164, inlinedAt: !1156)
!1169 = !DILocation(line: 2279, column: 19, scope: !1170, inlinedAt: !1156)
!1170 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 2279, column: 16)
!1171 = !DILocation(line: 2279, column: 16, scope: !1164, inlinedAt: !1156)
!1172 = !DILocation(line: 2281, column: 20, scope: !1173, inlinedAt: !1156)
!1173 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 2280, column: 9)
!1174 = !DILocation(line: 2282, column: 20, scope: !1173, inlinedAt: !1156)
!1175 = !DILocation(line: 2283, column: 9, scope: !1173, inlinedAt: !1156)
!1176 = !DILocation(line: 2286, column: 20, scope: !1177, inlinedAt: !1156)
!1177 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 2285, column: 9)
!1178 = !DILocation(line: 2287, column: 20, scope: !1177, inlinedAt: !1156)
!1179 = !DILocation(line: 2288, column: 18, scope: !1180, inlinedAt: !1156)
!1180 = distinct !DILexicalBlock(scope: !1177, file: !3, line: 2288, column: 15)
!1181 = !DILocation(line: 2288, column: 15, scope: !1177, inlinedAt: !1156)
!1182 = !DILocation(line: 2290, column: 22, scope: !1183, inlinedAt: !1156)
!1183 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 2290, column: 19)
!1184 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 2289, column: 13)
!1185 = !DILocation(line: 2290, column: 19, scope: !1184, inlinedAt: !1156)
!1186 = !DILocation(line: 2291, column: 31, scope: !1183, inlinedAt: !1156)
!1187 = !DILocation(line: 2291, column: 26, scope: !1183, inlinedAt: !1156)
!1188 = !DILocation(line: 2291, column: 17, scope: !1183, inlinedAt: !1156)
!1189 = !DILocation(line: 2294, column: 28, scope: !1190, inlinedAt: !1156)
!1190 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 2293, column: 17)
!1191 = !DILocation(line: 2295, column: 28, scope: !1190, inlinedAt: !1156)
!1192 = !DILocation(line: 2300, column: 24, scope: !1193, inlinedAt: !1156)
!1193 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 2299, column: 13)
!1194 = !DILocation(line: 2301, column: 35, scope: !1193, inlinedAt: !1156)
!1195 = !DILocation(line: 2301, column: 24, scope: !1193, inlinedAt: !1156)
!1196 = !DILocation(line: 2307, column: 16, scope: !1197, inlinedAt: !1156)
!1197 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 2306, column: 5)
!1198 = !DILocation(line: 2308, column: 21, scope: !1197, inlinedAt: !1156)
!1199 = !DILocation(line: 2308, column: 16, scope: !1197, inlinedAt: !1156)
!1200 = !DILocation(scope: !1161, inlinedAt: !1156)
!1201 = !DILocation(line: 2310, column: 10, scope: !158, inlinedAt: !1156)
!1202 = !DILocation(line: 2311, column: 3, scope: !158, inlinedAt: !1156)
!1203 = !DILocation(line: 1919, column: 7, scope: !1143, inlinedAt: !1115)
!1204 = !DILocation(line: 1921, column: 5, scope: !1143, inlinedAt: !1115)
