source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"Print checksum and block counts for each FILE.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 42, type: !70, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !51, nameTableKind: None)
!3 = !DIFile(filename: "src/sum.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 43, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/human.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!32 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!38 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!39 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!40 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!41 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!42 = !{!43, !45, !46, !47, !48}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !{!52, !53}
!52 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 44, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 1024, elements: !68)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !58, line: 50, size: 256, elements: !59)
!58 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!59 = !{!60, !63, !65, !67}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !58, line: 52, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !57, file: !58, line: 55, baseType: !64, size: 32, offset: 64)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !57, file: !58, line: 56, baseType: !66, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !57, file: !58, line: 57, baseType: !64, size: 32, offset: 192)
!68 = !{!69}
!69 = !DISubrange(count: 4)
!70 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "Version", scope: !73, file: !74, line: 2, type: !61, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !76, nameTableKind: None)
!74 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!75 = !{}
!76 = !{!71}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "file_name", scope: !79, file: !80, line: 46, type: !61, isLocal: true, isDefinition: true)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !81, nameTableKind: None)
!80 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!81 = !{!77, !82}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !79, file: !80, line: 56, type: !70, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "exit_failure", scope: !86, file: !87, line: 24, type: !89, isDefinition: true)
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !88, nameTableKind: None)
!87 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!88 = !{!84}
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !64)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "power_letter", scope: !92, file: !93, line: 36, type: !119, isLocal: true, isDefinition: true)
!92 = distinct !DICompileUnit(language: DW_LANG_C99, file: !93, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !94, retainedTypes: !103, globals: !106, nameTableKind: None)
!93 = !DIFile(filename: "lib/human.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !{!29, !95}
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !96, line: 25, baseType: !7, size: 32, elements: !97)
!96 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!101 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!102 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!106 = !{!90, !107, !113}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "block_size_args", scope: !92, file: !93, line: 398, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 192, elements: !111)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!111 = !{!112}
!112 = !DISubrange(count: 3)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !92, file: !93, line: 399, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !117)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!117 = !{!118}
!118 = !DISubrange(count: 2)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 72, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 9)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "program_name", scope: !124, file: !125, line: 33, type: !61, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !126, globals: !127, nameTableKind: None)
!125 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!126 = !{!45, !43}
!127 = !{!122}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !130, file: !131, line: 85, type: !192, isDefinition: true)
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !132, retainedTypes: !153, globals: !155, nameTableKind: None)
!131 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!132 = !{!5, !133, !138}
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!136 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!137 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !139, line: 46, baseType: !7, size: 32, elements: !140)
!139 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!141 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!142 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!143 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!144 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!145 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!146 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!147 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!148 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!149 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!150 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!151 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!152 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!153 = !{!64, !154, !48, !43}
!154 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!155 = !{!128, !156, !162, !174, !176, !181, !188, !190}
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !130, file: !131, line: 101, type: !158, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 320, elements: !160)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!160 = !{!161}
!161 = !DISubrange(count: 10)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !130, file: !131, line: 1052, type: !164, isDefinition: true)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !131, line: 65, size: 448, elements: !165)
!165 = !{!166, !167, !168, !172, !173}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !164, file: !131, line: 68, baseType: !5, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !164, file: !131, line: 71, baseType: !64, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !164, file: !131, line: 75, baseType: !169, size: 256, offset: 64)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 8)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !164, file: !131, line: 78, baseType: !61, size: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !164, file: !131, line: 81, baseType: !61, size: 64, offset: 384)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !130, file: !131, line: 116, type: !164, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "slot0", scope: !130, file: !131, line: 842, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 256)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "slotvec", scope: !130, file: !131, line: 845, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !131, line: 834, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !184, file: !131, line: 836, baseType: !48, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !184, file: !131, line: 837, baseType: !43, size: 64, offset: 64)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "nslots", scope: !130, file: !131, line: 843, type: !64, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "slotvec0", scope: !130, file: !131, line: 844, type: !184, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 704, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 11)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !197, file: !198, line: 26, type: !200, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !199, nameTableKind: None)
!198 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !{!195}
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 376, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 47)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !205, file: !206, line: 67, type: !210, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !207, retainedTypes: !208, globals: !209, nameTableKind: None)
!206 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !{!5}
!208 = !{!45, !61, !47}
!209 = !{!203}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !211, line: 61, baseType: !212)
!211 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null}
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !217, nameTableKind: None)
!216 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!217 = !{!20}
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !220, nameTableKind: None)
!219 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !{!221}
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 40, baseType: !7, size: 32, elements: !223)
!222 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = !{!224}
!224 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !227, retainedTypes: !231, nameTableKind: None)
!226 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!227 = !{!228}
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 40, baseType: !7, size: 32, elements: !229)
!229 = !{!230}
!230 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!231 = !{!45}
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !248, nameTableKind: None)
!233 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = !{!235}
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !237, file: !236, line: 186, baseType: !7, size: 32, elements: !246)
!236 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!237 = distinct !DISubprogram(name: "x2nrealloc", scope: !236, file: !236, line: 174, type: !238, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !232, retainedNodes: !241)
!238 = !DISubroutineType(types: !239)
!239 = !{!45, !45, !240, !48}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!241 = !{!242, !243, !244, !245}
!242 = !DILocalVariable(name: "p", arg: 1, scope: !237, file: !236, line: 174, type: !45)
!243 = !DILocalVariable(name: "pn", arg: 2, scope: !237, file: !236, line: 174, type: !240)
!244 = !DILocalVariable(name: "s", arg: 3, scope: !237, file: !236, line: 174, type: !48)
!245 = !DILocalVariable(name: "n", scope: !237, file: !236, line: 176, type: !48)
!246 = !{!247}
!247 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!248 = !{!48, !43, !45}
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, nameTableKind: None)
!250 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !253, retainedTypes: !254, nameTableKind: None)
!252 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !{!95, !138}
!254 = !{!64, !154}
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !231, nameTableKind: None)
!256 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, nameTableKind: None)
!258 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !231, nameTableKind: None)
!260 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !231, nameTableKind: None)
!262 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !265, nameTableKind: None)
!264 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !{!48}
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, nameTableKind: None)
!267 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, nameTableKind: None)
!269 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !272, retainedTypes: !231, nameTableKind: None)
!271 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !{!273}
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !274, line: 41, baseType: !7, size: 32, elements: !275)
!274 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!276 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!277 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!278 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!279 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!280 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!281 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!282 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!283 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!284 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!285 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!286 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!287 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!288 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!289 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!290 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!291 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!292 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!293 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!294 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!295 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!296 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!302 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!303 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!304 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!305 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!306 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!307 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!308 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!314 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!315 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!316 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!317 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!318 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!319 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!320 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!321 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!322 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!323 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!324 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!325 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!384 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!387 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!388 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!389 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!390 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!391 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!392 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!393 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!471 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!544 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!545 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!546 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!547 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!548 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!549 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!550 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!551 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!552 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!553 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!554 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!555 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!556 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!557 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!558 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!560 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!561 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!562 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!563 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!564 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!565 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!591 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!592 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!593 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!594 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!595 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!600 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!601 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!602 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!603 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !660, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !231, nameTableKind: None)
!660 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!661 = !{!"clang version 12.0.1"}
!662 = !{i32 7, !"Dwarf Version", i32 4}
!663 = !{i32 2, !"Debug Info Version", i32 3}
!664 = !{i32 1, !"wchar_size", i32 4}
!665 = !{i32 7, !"PIC Level", i32 2}
!666 = !{i32 7, !"PIE Level", i32 2}
!667 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !668, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !64}
!670 = !{!671}
!671 = !DILocalVariable(name: "status", arg: 1, scope: !667, file: !3, line: 53, type: !64)
!672 = !DILocation(scope: !667)
!673 = !DILocation(line: 55, column: 14, scope: !674)
!674 = distinct !DILexicalBlock(scope: !667, file: !3, line: 55, column: 7)
!675 = !DILocation(line: 55, column: 7, scope: !667)
!676 = !DILocation(line: 56, column: 5, scope: !677)
!677 = distinct !DILexicalBlock(scope: !674, file: !3, line: 56, column: 5)
!678 = !{!679, !679, i64 0}
!679 = !{!"any pointer", !680, i64 0}
!680 = !{!"omnipotent char", !681, i64 0}
!681 = !{!"Simple C/C++ TBAA"}
!682 = !DILocation(line: 59, column: 7, scope: !683)
!683 = distinct !DILexicalBlock(scope: !674, file: !3, line: 58, column: 5)
!684 = !DILocation(line: 63, column: 7, scope: !683)
!685 = !DILocation(line: 583, column: 3, scope: !686, inlinedAt: !688)
!686 = distinct !DISubprogram(name: "emit_stdin_note", scope: !687, file: !687, line: 581, type: !213, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !75)
!687 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!688 = distinct !DILocation(line: 67, column: 7, scope: !683)
!689 = !DILocation(line: 69, column: 7, scope: !683)
!690 = !DILocation(line: 74, column: 7, scope: !683)
!691 = !DILocation(line: 75, column: 7, scope: !683)
!692 = !DILocalVariable(name: "program", arg: 1, scope: !693, file: !687, line: 634, type: !61)
!693 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !687, file: !687, line: 634, type: !694, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !696)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !61}
!696 = !{!692, !697, !706, !707, !709}
!697 = !DILocalVariable(name: "infomap", scope: !693, file: !687, line: 636, type: !698)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 896, elements: !704)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !693, file: !687, line: 636, size: 128, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !700, file: !687, line: 636, baseType: !61, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !700, file: !687, line: 636, baseType: !61, size: 64, offset: 64)
!704 = !{!705}
!705 = !DISubrange(count: 7)
!706 = !DILocalVariable(name: "node", scope: !693, file: !687, line: 646, type: !61)
!707 = !DILocalVariable(name: "map_prog", scope: !693, file: !687, line: 647, type: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!709 = !DILocalVariable(name: "lc_messages", scope: !693, file: !687, line: 659, type: !61)
!710 = !DILocation(scope: !693, inlinedAt: !711)
!711 = distinct !DILocation(line: 76, column: 7, scope: !683)
!712 = !DILocation(line: 636, column: 3, scope: !693, inlinedAt: !711)
!713 = !DILocation(line: 636, column: 67, scope: !693, inlinedAt: !711)
!714 = !DILocation(line: 647, column: 36, scope: !693, inlinedAt: !711)
!715 = !DILocation(line: 649, column: 3, scope: !693, inlinedAt: !711)
!716 = !DILocation(line: 649, column: 33, scope: !693, inlinedAt: !711)
!717 = !DILocation(line: 650, column: 13, scope: !693, inlinedAt: !711)
!718 = !DILocation(line: 649, column: 20, scope: !693, inlinedAt: !711)
!719 = !{!720, !679, i64 0}
!720 = !{!"infomap", !679, i64 0, !679, i64 8}
!721 = !DILocation(line: 649, column: 10, scope: !693, inlinedAt: !711)
!722 = !DILocation(line: 649, column: 28, scope: !693, inlinedAt: !711)
!723 = distinct !{!723, !715, !717, !724}
!724 = !{!"llvm.loop.mustprogress"}
!725 = !DILocation(line: 652, column: 17, scope: !726, inlinedAt: !711)
!726 = distinct !DILexicalBlock(scope: !693, file: !687, line: 652, column: 7)
!727 = !{!720, !679, i64 8}
!728 = !DILocation(line: 652, column: 7, scope: !726, inlinedAt: !711)
!729 = !DILocation(line: 652, column: 7, scope: !693, inlinedAt: !711)
!730 = !DILocation(line: 655, column: 3, scope: !693, inlinedAt: !711)
!731 = !DILocation(line: 659, column: 29, scope: !693, inlinedAt: !711)
!732 = !DILocation(line: 660, column: 7, scope: !733, inlinedAt: !711)
!733 = distinct !DILexicalBlock(scope: !693, file: !687, line: 660, column: 7)
!734 = !DILocation(line: 660, column: 19, scope: !733, inlinedAt: !711)
!735 = !DILocation(line: 660, column: 22, scope: !733, inlinedAt: !711)
!736 = !DILocation(line: 660, column: 7, scope: !693, inlinedAt: !711)
!737 = !DILocation(line: 666, column: 7, scope: !738, inlinedAt: !711)
!738 = distinct !DILexicalBlock(scope: !733, file: !687, line: 661, column: 5)
!739 = !DILocation(line: 668, column: 5, scope: !738, inlinedAt: !711)
!740 = !DILocation(line: 669, column: 3, scope: !693, inlinedAt: !711)
!741 = !DILocation(line: 671, column: 3, scope: !693, inlinedAt: !711)
!742 = !DILocation(line: 673, column: 1, scope: !693, inlinedAt: !711)
!743 = !DILocation(line: 78, column: 3, scope: !667)
!744 = !DISubprogram(name: "dcgettext", scope: !745, file: !745, line: 51, type: !746, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!745 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!746 = !DISubroutineType(types: !747)
!747 = !{!43, !61, !61, !64}
!748 = !DISubprogram(name: "fputs_unlocked", scope: !749, file: !749, line: 667, type: !750, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!749 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!750 = !DISubroutineType(types: !751)
!751 = !{!64, !61, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !754, line: 49, size: 1728, elements: !755)
!754 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !771, !772, !773, !774, !778, !779, !781, !785, !788, !790, !793, !796, !797, !798, !799, !800}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !753, file: !754, line: 51, baseType: !64, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !753, file: !754, line: 54, baseType: !43, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !753, file: !754, line: 55, baseType: !43, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !753, file: !754, line: 56, baseType: !43, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !753, file: !754, line: 57, baseType: !43, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !753, file: !754, line: 58, baseType: !43, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !753, file: !754, line: 59, baseType: !43, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !753, file: !754, line: 60, baseType: !43, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !753, file: !754, line: 61, baseType: !43, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !753, file: !754, line: 64, baseType: !43, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !753, file: !754, line: 65, baseType: !43, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !753, file: !754, line: 66, baseType: !43, size: 64, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !753, file: !754, line: 68, baseType: !769, size: 64, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !754, line: 36, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !753, file: !754, line: 70, baseType: !752, size: 64, offset: 832)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !753, file: !754, line: 72, baseType: !64, size: 32, offset: 896)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !753, file: !754, line: 73, baseType: !64, size: 32, offset: 928)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !753, file: !754, line: 74, baseType: !775, size: 64, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !776, line: 152, baseType: !777)
!776 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!777 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !753, file: !754, line: 77, baseType: !154, size: 16, offset: 1024)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !753, file: !754, line: 78, baseType: !780, size: 8, offset: 1040)
!780 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !753, file: !754, line: 79, baseType: !782, size: 8, offset: 1048)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 1)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !753, file: !754, line: 81, baseType: !786, size: 64, offset: 1088)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !754, line: 43, baseType: null)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !753, file: !754, line: 89, baseType: !789, size: 64, offset: 1152)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !776, line: 153, baseType: !777)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !753, file: !754, line: 91, baseType: !791, size: 64, offset: 1216)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !754, line: 37, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !753, file: !754, line: 92, baseType: !794, size: 64, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !754, line: 38, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !753, file: !754, line: 93, baseType: !752, size: 64, offset: 1344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !753, file: !754, line: 94, baseType: !45, size: 64, offset: 1408)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !753, file: !754, line: 95, baseType: !48, size: 64, offset: 1472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !753, file: !754, line: 96, baseType: !64, size: 32, offset: 1536)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !753, file: !754, line: 98, baseType: !801, size: 160, offset: 1568)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 20)
!804 = !DISubprogram(name: "setlocale", scope: !805, file: !805, line: 122, type: !806, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!805 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!806 = !DISubroutineType(types: !807)
!807 = !{!43, !64, !61}
!808 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 221, type: !809, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !812)
!809 = !DISubroutineType(types: !810)
!810 = !{!64, !64, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!812 = !{!813, !814, !815, !816, !817, !818}
!813 = !DILocalVariable(name: "argc", arg: 1, scope: !808, file: !3, line: 221, type: !64)
!814 = !DILocalVariable(name: "argv", arg: 2, scope: !808, file: !3, line: 221, type: !811)
!815 = !DILocalVariable(name: "ok", scope: !808, file: !3, line: 223, type: !70)
!816 = !DILocalVariable(name: "optc", scope: !808, file: !3, line: 224, type: !64)
!817 = !DILocalVariable(name: "files_given", scope: !808, file: !3, line: 225, type: !64)
!818 = !DILocalVariable(name: "sum_func", scope: !808, file: !3, line: 226, type: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!70, !61, !64}
!822 = !DILocation(scope: !808)
!823 = !DILocation(line: 229, column: 21, scope: !808)
!824 = !DILocation(line: 229, column: 3, scope: !808)
!825 = !DILocation(line: 230, column: 3, scope: !808)
!826 = !DILocation(line: 231, column: 3, scope: !808)
!827 = !DILocation(line: 232, column: 3, scope: !808)
!828 = !DILocation(line: 234, column: 3, scope: !808)
!829 = !DILocation(line: 238, column: 12, scope: !808)
!830 = !DILocation(line: 238, column: 3, scope: !808)
!831 = !DILocation(line: 240, column: 19, scope: !808)
!832 = !DILocation(line: 242, column: 3, scope: !808)
!833 = !DILocation(line: 242, column: 18, scope: !808)
!834 = distinct !{!834, !832, !835, !724}
!835 = !DILocation(line: 261, column: 5, scope: !808)
!836 = !DILocation(line: 252, column: 11, scope: !837)
!837 = distinct !DILexicalBlock(scope: !838, file: !3, line: 245, column: 9)
!838 = distinct !DILexicalBlock(scope: !808, file: !3, line: 243, column: 5)
!839 = !DILocation(line: 254, column: 9, scope: !837)
!840 = !DILocation(line: 256, column: 9, scope: !837)
!841 = !DILocation(line: 259, column: 11, scope: !837)
!842 = !DILocation(line: 263, column: 24, scope: !808)
!843 = !{!844, !844, i64 0}
!844 = !{!"int", !680, i64 0}
!845 = !DILocation(line: 263, column: 22, scope: !808)
!846 = !DILocation(line: 264, column: 19, scope: !847)
!847 = distinct !DILexicalBlock(scope: !808, file: !3, line: 264, column: 7)
!848 = !DILocation(line: 264, column: 7, scope: !808)
!849 = !DILocation(line: 267, column: 28, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 267, column: 5)
!851 = distinct !DILexicalBlock(scope: !847, file: !3, line: 267, column: 5)
!852 = !DILocation(line: 267, column: 5, scope: !851)
!853 = !DILocation(line: 265, column: 10, scope: !847)
!854 = !{i1 (i8*, i32)* @bsd_sum_file, i1 (i8*, i32)* @sysv_sum_file}
!855 = !DILocation(line: 265, column: 8, scope: !847)
!856 = !DILocation(line: 265, column: 5, scope: !847)
!857 = !DILocation(line: 268, column: 23, scope: !850)
!858 = !DILocation(line: 268, column: 13, scope: !850)
!859 = !DILocation(line: 268, column: 10, scope: !850)
!860 = !DILocation(line: 267, column: 42, scope: !850)
!861 = distinct !{!861, !852, !862, !724}
!862 = !DILocation(line: 268, column: 48, scope: !851)
!863 = !DILocation(scope: !847)
!864 = !DILocation(line: 270, column: 7, scope: !865)
!865 = distinct !DILexicalBlock(scope: !808, file: !3, line: 270, column: 7)
!866 = !DILocation(line: 270, column: 23, scope: !865)
!867 = !DILocation(line: 270, column: 34, scope: !865)
!868 = !DILocation(line: 270, column: 26, scope: !865)
!869 = !DILocation(line: 270, column: 41, scope: !865)
!870 = !DILocation(line: 270, column: 7, scope: !808)
!871 = !DILocation(line: 271, column: 5, scope: !865)
!872 = !DILocation(line: 272, column: 10, scope: !808)
!873 = !DILocation(line: 273, column: 1, scope: !808)
!874 = distinct !DISubprogram(name: "bsd_sum_file", scope: !3, file: !3, line: 88, type: !820, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !875)
!875 = !{!876, !877, !878, !882, !883, !887, !888, !892}
!876 = !DILocalVariable(name: "file", arg: 1, scope: !874, file: !3, line: 88, type: !61)
!877 = !DILocalVariable(name: "print_name", arg: 2, scope: !874, file: !3, line: 88, type: !64)
!878 = !DILocalVariable(name: "fp", scope: !874, file: !3, line: 90, type: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !881, line: 7, baseType: !753)
!881 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!882 = !DILocalVariable(name: "checksum", scope: !874, file: !3, line: 91, type: !64)
!883 = !DILocalVariable(name: "total_bytes", scope: !874, file: !3, line: 92, type: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !885, line: 102, baseType: !886)
!885 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !776, line: 73, baseType: !50)
!887 = !DILocalVariable(name: "ch", scope: !874, file: !3, line: 93, type: !64)
!888 = !DILocalVariable(name: "hbuf", scope: !874, file: !3, line: 94, type: !889)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 5216, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 652)
!892 = !DILocalVariable(name: "is_stdin", scope: !874, file: !3, line: 95, type: !70)
!893 = !DILocation(scope: !874)
!894 = !DILocation(line: 94, column: 3, scope: !874)
!895 = !DILocation(line: 94, column: 8, scope: !874)
!896 = !DILocation(line: 95, column: 19, scope: !874)
!897 = !DILocation(line: 97, column: 7, scope: !874)
!898 = !DILocation(line: 99, column: 12, scope: !899)
!899 = distinct !DILexicalBlock(scope: !900, file: !3, line: 98, column: 5)
!900 = distinct !DILexicalBlock(scope: !874, file: !3, line: 97, column: 7)
!901 = !DILocation(line: 100, column: 23, scope: !899)
!902 = !DILocation(line: 102, column: 5, scope: !899)
!903 = !DILocation(line: 105, column: 12, scope: !904)
!904 = distinct !DILexicalBlock(scope: !900, file: !3, line: 104, column: 5)
!905 = !DILocation(line: 106, column: 14, scope: !906)
!906 = distinct !DILexicalBlock(scope: !904, file: !3, line: 106, column: 11)
!907 = !DILocation(line: 106, column: 11, scope: !904)
!908 = !DILocation(line: 108, column: 21, scope: !909)
!909 = distinct !DILexicalBlock(scope: !906, file: !3, line: 107, column: 9)
!910 = !DILocation(line: 108, column: 34, scope: !909)
!911 = !DILocation(line: 108, column: 11, scope: !909)
!912 = !DILocation(line: 109, column: 11, scope: !909)
!913 = !DILocation(scope: !900)
!914 = !DILocation(line: 113, column: 3, scope: !874)
!915 = !DILocation(line: 115, column: 3, scope: !874)
!916 = !DILocalVariable(name: "__fp", arg: 1, scope: !917, file: !918, line: 66, type: !879)
!917 = distinct !DISubprogram(name: "getc_unlocked", scope: !918, file: !918, line: 66, type: !919, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !921)
!918 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!919 = !DISubroutineType(types: !920)
!920 = !{!64, !879}
!921 = !{!916}
!922 = !DILocation(scope: !917, inlinedAt: !923)
!923 = distinct !DILocation(line: 115, column: 16, scope: !874)
!924 = !DILocation(line: 68, column: 10, scope: !917, inlinedAt: !923)
!925 = !{!926, !679, i64 8}
!926 = !{!"_IO_FILE", !844, i64 0, !679, i64 8, !679, i64 16, !679, i64 24, !679, i64 32, !679, i64 40, !679, i64 48, !679, i64 56, !679, i64 64, !679, i64 72, !679, i64 80, !679, i64 88, !679, i64 96, !679, i64 104, !844, i64 112, !844, i64 116, !927, i64 120, !928, i64 128, !680, i64 130, !680, i64 131, !679, i64 136, !927, i64 144, !679, i64 152, !679, i64 160, !679, i64 168, !679, i64 176, !927, i64 184, !844, i64 192, !680, i64 196}
!927 = !{!"long", !680, i64 0}
!928 = !{!"short", !680, i64 0}
!929 = !{!926, !679, i64 16}
!930 = !{!"branch_weights", i32 2000, i32 1}
!931 = !{!680, !680, i64 0}
!932 = !DILocation(line: 115, column: 27, scope: !874)
!933 = !DILocation(line: 117, column: 18, scope: !934)
!934 = distinct !DILexicalBlock(scope: !874, file: !3, line: 116, column: 5)
!935 = !DILocation(line: 118, column: 28, scope: !934)
!936 = !DILocation(line: 118, column: 52, scope: !934)
!937 = !DILocation(line: 118, column: 34, scope: !934)
!938 = !DILocation(line: 119, column: 16, scope: !934)
!939 = !DILocation(line: 120, column: 16, scope: !934)
!940 = distinct !{!940, !915, !941, !724}
!941 = !DILocation(line: 121, column: 5, scope: !874)
!942 = !DILocalVariable(name: "__stream", arg: 1, scope: !943, file: !918, line: 135, type: !879)
!943 = distinct !DISubprogram(name: "ferror_unlocked", scope: !918, file: !918, line: 135, type: !919, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!944 = !{!942}
!945 = !DILocation(scope: !943, inlinedAt: !946)
!946 = distinct !DILocation(line: 123, column: 7, scope: !947)
!947 = distinct !DILexicalBlock(scope: !874, file: !3, line: 123, column: 7)
!948 = !DILocation(line: 137, column: 10, scope: !943, inlinedAt: !946)
!949 = !{!926, !844, i64 0}
!950 = !DILocation(line: 123, column: 7, scope: !947)
!951 = !DILocation(line: 123, column: 7, scope: !874)
!952 = !DILocation(line: 125, column: 17, scope: !953)
!953 = distinct !DILexicalBlock(scope: !947, file: !3, line: 124, column: 5)
!954 = !DILocation(line: 125, column: 30, scope: !953)
!955 = !DILocation(line: 125, column: 7, scope: !953)
!956 = !DILocation(line: 126, column: 11, scope: !953)
!957 = !DILocation(line: 127, column: 9, scope: !958)
!958 = distinct !DILexicalBlock(scope: !953, file: !3, line: 126, column: 11)
!959 = !DILocation(line: 131, column: 17, scope: !960)
!960 = distinct !DILexicalBlock(scope: !874, file: !3, line: 131, column: 7)
!961 = !DILocation(line: 131, column: 20, scope: !960)
!962 = !DILocation(line: 131, column: 32, scope: !960)
!963 = !DILocation(line: 131, column: 7, scope: !874)
!964 = !DILocation(line: 133, column: 17, scope: !965)
!965 = distinct !DILexicalBlock(scope: !960, file: !3, line: 132, column: 5)
!966 = !DILocation(line: 133, column: 30, scope: !965)
!967 = !DILocation(line: 133, column: 7, scope: !965)
!968 = !DILocation(line: 134, column: 7, scope: !965)
!969 = !DILocation(line: 137, column: 3, scope: !874)
!970 = !DILocation(line: 139, column: 18, scope: !971)
!971 = distinct !DILexicalBlock(scope: !874, file: !3, line: 139, column: 7)
!972 = !DILocation(line: 139, column: 7, scope: !874)
!973 = !DILocation(line: 140, column: 5, scope: !971)
!974 = !DILocalVariable(name: "__c", arg: 1, scope: !975, file: !918, line: 108, type: !64)
!975 = distinct !DISubprogram(name: "putchar_unlocked", scope: !918, file: !918, line: 108, type: !976, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !978)
!976 = !DISubroutineType(types: !977)
!977 = !{!64, !64}
!978 = !{!974}
!979 = !DILocation(scope: !975, inlinedAt: !980)
!980 = distinct !DILocation(line: 141, column: 3, scope: !874)
!981 = !DILocation(line: 110, column: 10, scope: !975, inlinedAt: !980)
!982 = !{!926, !679, i64 40}
!983 = !{!926, !679, i64 48}
!984 = !DILocation(line: 144, column: 1, scope: !874)
!985 = !DISubprogram(name: "bindtextdomain", scope: !745, file: !745, line: 86, type: !986, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!986 = !DISubroutineType(types: !987)
!987 = !{!43, !61, !61}
!988 = !DISubprogram(name: "textdomain", scope: !745, file: !745, line: 82, type: !989, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!989 = !DISubroutineType(types: !990)
!990 = !{!43, !61}
!991 = !DISubprogram(name: "atexit", scope: !992, file: !992, line: 595, type: !993, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!992 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!993 = !DISubroutineType(types: !994)
!994 = !{!64, !212}
!995 = !DISubprogram(name: "setvbuf", scope: !749, file: !749, line: 308, type: !996, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!996 = !DISubroutineType(types: !997)
!997 = !{!64, !752, !43, !64, !50}
!998 = !DISubprogram(name: "getopt_long", scope: !58, file: !58, line: 66, type: !999, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!64, !64, !1001, !61, !1003, !66}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!1004 = distinct !DISubprogram(name: "sysv_sum_file", scope: !3, file: !3, line: 152, type: !820, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1021}
!1006 = !DILocalVariable(name: "file", arg: 1, scope: !1004, file: !3, line: 152, type: !61)
!1007 = !DILocalVariable(name: "print_name", arg: 2, scope: !1004, file: !3, line: 152, type: !64)
!1008 = !DILocalVariable(name: "fd", scope: !1004, file: !3, line: 154, type: !64)
!1009 = !DILocalVariable(name: "buf", scope: !1004, file: !3, line: 155, type: !1010)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 65536, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 8192)
!1013 = !DILocalVariable(name: "total_bytes", scope: !1004, file: !3, line: 156, type: !884)
!1014 = !DILocalVariable(name: "hbuf", scope: !1004, file: !3, line: 157, type: !889)
!1015 = !DILocalVariable(name: "r", scope: !1004, file: !3, line: 158, type: !64)
!1016 = !DILocalVariable(name: "checksum", scope: !1004, file: !3, line: 159, type: !64)
!1017 = !DILocalVariable(name: "s", scope: !1004, file: !3, line: 162, type: !7)
!1018 = !DILocalVariable(name: "is_stdin", scope: !1004, file: !3, line: 164, type: !70)
!1019 = !DILocalVariable(name: "bytes_read", scope: !1020, file: !3, line: 184, type: !48)
!1020 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 183, column: 5)
!1021 = !DILocalVariable(name: "i", scope: !1022, file: !3, line: 197, type: !48)
!1022 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 197, column: 7)
!1023 = !DILocation(scope: !1004)
!1024 = !DILocation(line: 155, column: 3, scope: !1004)
!1025 = !DILocation(line: 155, column: 17, scope: !1004)
!1026 = !DILocation(line: 157, column: 3, scope: !1004)
!1027 = !DILocation(line: 157, column: 8, scope: !1004)
!1028 = !DILocation(line: 164, column: 19, scope: !1004)
!1029 = !DILocation(line: 166, column: 7, scope: !1004)
!1030 = !DILocation(line: 169, column: 23, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 167, column: 5)
!1032 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 166, column: 7)
!1033 = !DILocation(line: 171, column: 5, scope: !1031)
!1034 = !DILocation(line: 174, column: 12, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 173, column: 5)
!1036 = !DILocation(line: 175, column: 14, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 175, column: 11)
!1038 = !DILocation(line: 175, column: 11, scope: !1035)
!1039 = !DILocation(line: 177, column: 21, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 176, column: 9)
!1041 = !DILocation(line: 177, column: 34, scope: !1040)
!1042 = !DILocation(line: 177, column: 11, scope: !1040)
!1043 = !DILocation(line: 178, column: 11, scope: !1040)
!1044 = !DILocation(scope: !1032)
!1045 = !DILocation(line: 182, column: 3, scope: !1004)
!1046 = !DILocation(line: 156, column: 13, scope: !1004)
!1047 = !DILocation(line: 162, column: 16, scope: !1004)
!1048 = !DILocation(line: 184, column: 27, scope: !1020)
!1049 = !DILocation(scope: !1020)
!1050 = !DILocation(line: 186, column: 11, scope: !1020)
!1051 = !DILocation(line: 197, column: 7, scope: !1022)
!1052 = !DILocation(line: 197, column: 43, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 197, column: 7)
!1054 = !DILocation(line: 198, column: 14, scope: !1053)
!1055 = !DILocation(line: 198, column: 11, scope: !1053)
!1056 = distinct !{!1056, !1051, !1057, !724, !1058}
!1057 = !DILocation(line: 198, column: 19, scope: !1022)
!1058 = !{!"llvm.loop.isvectorized", i32 1}
!1059 = !DILocation(line: 191, column: 21, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 190, column: 9)
!1061 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 189, column: 11)
!1062 = !DILocation(line: 191, column: 34, scope: !1060)
!1063 = !DILocation(line: 191, column: 11, scope: !1060)
!1064 = !DILocation(line: 192, column: 15, scope: !1060)
!1065 = !DILocation(line: 193, column: 13, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 192, column: 15)
!1067 = !DILocation(scope: !1022)
!1068 = !DILocation(line: 197, column: 28, scope: !1053)
!1069 = distinct !{!1069, !1051, !1057, !724, !1070, !1058}
!1070 = !{!"llvm.loop.unroll.runtime.disable"}
!1071 = !DILocation(line: 199, column: 19, scope: !1020)
!1072 = !DILocation(line: 202, column: 17, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 202, column: 7)
!1074 = !DILocation(line: 202, column: 20, scope: !1073)
!1075 = !DILocation(line: 202, column: 31, scope: !1073)
!1076 = !DILocation(line: 202, column: 7, scope: !1004)
!1077 = !DILocation(line: 204, column: 17, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 203, column: 5)
!1079 = !DILocation(line: 204, column: 30, scope: !1078)
!1080 = !DILocation(line: 204, column: 7, scope: !1078)
!1081 = !DILocation(line: 205, column: 7, scope: !1078)
!1082 = !DILocation(line: 208, column: 10, scope: !1004)
!1083 = !DILocation(line: 208, column: 40, scope: !1004)
!1084 = !DILocation(line: 208, column: 20, scope: !1004)
!1085 = !DILocation(line: 209, column: 17, scope: !1004)
!1086 = !DILocation(line: 209, column: 32, scope: !1004)
!1087 = !DILocation(line: 209, column: 27, scope: !1004)
!1088 = !DILocation(line: 211, column: 3, scope: !1004)
!1089 = !DILocation(line: 213, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 213, column: 7)
!1091 = !DILocation(line: 213, column: 7, scope: !1004)
!1092 = !DILocation(line: 214, column: 5, scope: !1090)
!1093 = !DILocation(scope: !975, inlinedAt: !1094)
!1094 = distinct !DILocation(line: 215, column: 3, scope: !1004)
!1095 = !DILocation(line: 110, column: 10, scope: !975, inlinedAt: !1094)
!1096 = !DILocation(line: 218, column: 1, scope: !1004)
!1097 = !DISubprogram(name: "error", scope: !1098, file: !1098, line: 52, type: !1099, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!1098 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1099 = !DISubroutineType(types: !1100)
!1100 = !{null, !64, !64, !61, null}
!1101 = !DISubprogram(name: "open", scope: !1102, file: !1102, line: 196, type: !1103, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!1102 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!64, !61, !64, null}
!1105 = !DISubprogram(name: "close", scope: !1106, file: !1106, line: 353, type: !976, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!1106 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!1107 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !80, file: !80, line: 51, type: !694, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1108)
!1108 = !{!1109}
!1109 = !DILocalVariable(name: "file", arg: 1, scope: !1107, file: !80, line: 51, type: !61)
!1110 = !DILocation(scope: !1107)
!1111 = !DILocation(line: 53, column: 13, scope: !1107)
!1112 = !DILocation(line: 54, column: 1, scope: !1107)
!1113 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !80, file: !80, line: 88, type: !1114, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1116)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{null, !70}
!1116 = !{!1117}
!1117 = !DILocalVariable(name: "ignore", arg: 1, scope: !1113, file: !80, line: 88, type: !70)
!1118 = !DILocation(scope: !1113)
!1119 = !DILocation(line: 90, column: 16, scope: !1113)
!1120 = !{!1121, !1121, i64 0}
!1121 = !{!"_Bool", !680, i64 0}
!1122 = !DILocation(line: 91, column: 1, scope: !1113)
!1123 = distinct !DISubprogram(name: "close_stdout", scope: !80, file: !80, line: 117, type: !213, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1124)
!1124 = !{!1125}
!1125 = !DILocalVariable(name: "write_error", scope: !1126, file: !80, line: 122, type: !61)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !80, line: 121, column: 5)
!1127 = distinct !DILexicalBlock(scope: !1123, file: !80, line: 119, column: 7)
!1128 = !DILocation(line: 119, column: 21, scope: !1127)
!1129 = !DILocation(line: 119, column: 7, scope: !1127)
!1130 = !DILocation(line: 119, column: 29, scope: !1127)
!1131 = !DILocation(line: 120, column: 7, scope: !1127)
!1132 = !DILocation(line: 120, column: 12, scope: !1127)
!1133 = !{i8 0, i8 2}
!1134 = !DILocation(line: 120, column: 25, scope: !1127)
!1135 = !DILocation(line: 120, column: 28, scope: !1127)
!1136 = !DILocation(line: 120, column: 34, scope: !1127)
!1137 = !DILocation(line: 119, column: 7, scope: !1123)
!1138 = !DILocation(line: 122, column: 33, scope: !1126)
!1139 = !DILocation(scope: !1126)
!1140 = !DILocation(line: 123, column: 11, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1126, file: !80, line: 123, column: 11)
!1142 = !DILocation(scope: !1141)
!1143 = !DILocation(line: 123, column: 11, scope: !1126)
!1144 = !DILocation(line: 124, column: 36, scope: !1141)
!1145 = !DILocation(line: 124, column: 9, scope: !1141)
!1146 = !DILocation(line: 127, column: 9, scope: !1141)
!1147 = !DILocation(line: 129, column: 14, scope: !1126)
!1148 = !DILocation(line: 129, column: 7, scope: !1126)
!1149 = !DILocation(line: 134, column: 42, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1123, file: !80, line: 134, column: 7)
!1151 = !DILocation(line: 134, column: 28, scope: !1150)
!1152 = !DILocation(line: 134, column: 50, scope: !1150)
!1153 = !DILocation(line: 134, column: 7, scope: !1123)
!1154 = !DILocation(line: 135, column: 12, scope: !1150)
!1155 = !DILocation(line: 135, column: 5, scope: !1150)
!1156 = !DILocation(line: 136, column: 1, scope: !1123)
!1157 = distinct !DISubprogram(name: "fdadvise", scope: !216, file: !216, line: 31, type: !1158, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !1162)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{null, !64, !1160, !1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !749, line: 63, baseType: !775)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !21, line: 52, baseType: !20)
!1162 = !{!1163, !1164, !1165, !1166, !1167}
!1163 = !DILocalVariable(name: "fd", arg: 1, scope: !1157, file: !216, line: 31, type: !64)
!1164 = !DILocalVariable(name: "offset", arg: 2, scope: !1157, file: !216, line: 31, type: !1160)
!1165 = !DILocalVariable(name: "len", arg: 3, scope: !1157, file: !216, line: 31, type: !1160)
!1166 = !DILocalVariable(name: "advice", arg: 4, scope: !1157, file: !216, line: 31, type: !1161)
!1167 = !DILocalVariable(name: "__x", scope: !1168, file: !216, line: 34, type: !64)
!1168 = distinct !DILexicalBlock(scope: !1157, file: !216, line: 34, column: 3)
!1169 = !DILocation(scope: !1157)
!1170 = !DILocation(line: 34, column: 3, scope: !1168)
!1171 = !DILocation(scope: !1168)
!1172 = !DILocation(line: 36, column: 1, scope: !1157)
!1173 = !DISubprogram(name: "posix_fadvise", scope: !1102, file: !1102, line: 288, type: !1174, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !75)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!64, !64, !777, !777, !64}
!1176 = distinct !DISubprogram(name: "fadvise", scope: !216, file: !216, line: 39, type: !1177, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !1213)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{null, !1179, !1161}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !881, line: 7, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !754, line: 49, size: 1728, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1181, file: !754, line: 51, baseType: !64, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1181, file: !754, line: 54, baseType: !43, size: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1181, file: !754, line: 55, baseType: !43, size: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1181, file: !754, line: 56, baseType: !43, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1181, file: !754, line: 57, baseType: !43, size: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1181, file: !754, line: 58, baseType: !43, size: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1181, file: !754, line: 59, baseType: !43, size: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1181, file: !754, line: 60, baseType: !43, size: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1181, file: !754, line: 61, baseType: !43, size: 64, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1181, file: !754, line: 64, baseType: !43, size: 64, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1181, file: !754, line: 65, baseType: !43, size: 64, offset: 640)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1181, file: !754, line: 66, baseType: !43, size: 64, offset: 704)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1181, file: !754, line: 68, baseType: !769, size: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1181, file: !754, line: 70, baseType: !1197, size: 64, offset: 832)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1181, file: !754, line: 72, baseType: !64, size: 32, offset: 896)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1181, file: !754, line: 73, baseType: !64, size: 32, offset: 928)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1181, file: !754, line: 74, baseType: !775, size: 64, offset: 960)
