source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"Print checksum and block counts for each FILE.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 42, type: !70, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !51)
!3 = !DIFile(filename: "src/sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 43, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!32 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!38 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!39 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!40 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!41 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!42 = !{!43, !45, !46, !47, !48}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 62, baseType: !50)
!49 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !{!52, !53}
!52 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 44, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 1024, elements: !68)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !58, line: 50, size: 256, elements: !59)
!58 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!59 = !{!60, !63, !65, !67}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !58, line: 52, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !57, file: !58, line: 55, baseType: !64, size: 32, offset: 64)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !57, file: !58, line: 56, baseType: !66, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !57, file: !58, line: 57, baseType: !64, size: 32, offset: 192)
!68 = !{!69}
!69 = !DISubrange(count: 4)
!70 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "Version", scope: !73, file: !74, line: 2, type: !61, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !76)
!74 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!75 = !{}
!76 = !{!71}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "file_name", scope: !79, file: !84, line: 46, type: !61, isLocal: true, isDefinition: true)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !81)
!80 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!81 = !{!77, !82}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !79, file: !84, line: 56, type: !70, isLocal: true, isDefinition: true)
!84 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "exit_failure", scope: !87, file: !90, line: 24, type: !91, isDefinition: true)
!87 = distinct !DICompileUnit(language: DW_LANG_C99, file: !88, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !89)
!88 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!89 = !{!85}
!90 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !64)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "power_letter", scope: !94, file: !109, line: 36, type: !120, isLocal: true, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !96, retainedTypes: !105, globals: !106)
!95 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!96 = !{!29, !97}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !98, line: 26, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!105 = !{!61}
!106 = !{!92, !107, !114}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "block_size_args", scope: !94, file: !109, line: 398, type: !110, isLocal: true, isDefinition: true)
!109 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 192, elements: !112)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!112 = !{!113}
!113 = !DISubrange(count: 3)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !94, file: !109, line: 399, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 64, elements: !118)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 72, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 9)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "program_name", scope: !125, file: !129, line: 33, type: !61, isDefinition: true)
!125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !126, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !127, globals: !128)
!126 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!127 = !{!45, !43}
!128 = !{!123}
!129 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !132, file: !160, line: 85, type: !195, isDefinition: true)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !134, retainedTypes: !155, globals: !157)
!133 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!134 = !{!5, !135, !140}
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !136)
!136 = !{!137, !138, !139}
!137 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!139 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 46, baseType: !7, size: 32, elements: !142)
!141 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!143 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!144 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!145 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!146 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!147 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!148 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!149 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!150 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!151 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!154 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!155 = !{!64, !156, !48, !43}
!156 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!157 = !{!130, !158, !165, !177, !179, !184, !191, !193}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !132, file: !160, line: 101, type: !161, isDefinition: true)
!160 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 320, elements: !163)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!163 = !{!164}
!164 = !DISubrange(count: 10)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !132, file: !160, line: 1052, type: !167, isDefinition: true)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !160, line: 65, size: 448, elements: !168)
!168 = !{!169, !170, !171, !175, !176}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !167, file: !160, line: 68, baseType: !5, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !160, line: 71, baseType: !64, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !167, file: !160, line: 75, baseType: !172, size: 256, offset: 64)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !167, file: !160, line: 78, baseType: !61, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !167, file: !160, line: 81, baseType: !61, size: 64, offset: 384)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !132, file: !160, line: 116, type: !167, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "slot0", scope: !132, file: !160, line: 842, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 256)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "slotvec", scope: !132, file: !160, line: 845, type: !186, isLocal: true, isDefinition: true)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !160, line: 834, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !187, file: !160, line: 836, baseType: !48, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !187, file: !160, line: 837, baseType: !43, size: 64, offset: 64)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "nslots", scope: !132, file: !160, line: 843, type: !64, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "slotvec0", scope: !132, file: !160, line: 844, type: !187, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 704, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 11)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !200, file: !203, line: 26, type: !204, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, globals: !202)
!201 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!202 = !{!198}
!203 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 376, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 47)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !209, file: !214, line: 69, type: !215, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !211, retainedTypes: !212, globals: !213)
!210 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!211 = !{!5}
!212 = !{!45, !47}
!213 = !{!207}
!214 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !216, line: 55, baseType: !217)
!216 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null}
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !222)
!221 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!222 = !{!20}
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !225)
!224 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!225 = !{!226}
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 40, baseType: !7, size: 32, elements: !228)
!227 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!228 = !{!229}
!229 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !232, retainedTypes: !237)
!231 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 41, baseType: !7, size: 32, elements: !235)
!234 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!235 = !{!236}
!236 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!237 = !{!45}
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !240, retainedTypes: !254)
!239 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!240 = !{!241}
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !243, file: !242, line: 186, baseType: !7, size: 32, elements: !252)
!242 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!243 = distinct !DISubprogram(name: "x2nrealloc", scope: !242, file: !242, line: 174, type: !244, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !238, retainedNodes: !247)
!244 = !DISubroutineType(types: !245)
!245 = !{!45, !45, !246, !48}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!247 = !{!248, !249, !250, !251}
!248 = !DILocalVariable(name: "p", arg: 1, scope: !243, file: !242, line: 174, type: !45)
!249 = !DILocalVariable(name: "pn", arg: 2, scope: !243, file: !242, line: 174, type: !246)
!250 = !DILocalVariable(name: "s", arg: 3, scope: !243, file: !242, line: 174, type: !48)
!251 = !DILocalVariable(name: "n", scope: !243, file: !242, line: 176, type: !48)
!252 = !{!253}
!253 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!254 = !{!48, !43, !45}
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75)
!256 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !259, retainedTypes: !260)
!258 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!259 = !{!97, !140}
!260 = !{!64, !156}
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !237)
!262 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75)
!264 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !237)
!266 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !237)
!268 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75, retainedTypes: !271)
!270 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!271 = !{!48}
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75)
!273 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !75)
!275 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !278, retainedTypes: !237)
!277 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!278 = !{!279}
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !280, line: 41, baseType: !7, size: 32, elements: !281)
!280 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!282 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!283 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!284 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!285 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!286 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!287 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!288 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!289 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!290 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!291 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!292 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!293 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!294 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!295 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!296 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!304 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!305 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!306 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!307 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!308 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!316 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!317 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!318 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!319 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!320 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!321 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!322 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!323 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!324 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!325 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!326 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!327 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!328 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!329 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!330 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!331 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!390 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!393 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!401 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!402 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!403 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!404 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!477 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!550 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!551 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!552 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!553 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!554 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!555 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!556 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!557 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!558 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!559 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!560 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!561 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!562 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!563 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!564 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!566 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!567 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!568 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!569 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!570 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!571 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!597 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!598 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!599 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!600 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!601 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!606 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!607 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!608 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!609 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!665 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!666 = !{i32 2, !"Dwarf Version", i32 4}
!667 = !{i32 2, !"Debug Info Version", i32 3}
!668 = !{i32 1, !"wchar_size", i32 4}
!669 = !{i32 7, !"PIC Level", i32 2}
!670 = !{i32 7, !"PIE Level", i32 2}
!671 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !672, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !64}
!674 = !{!675}
!675 = !DILocalVariable(name: "status", arg: 1, scope: !671, file: !3, line: 53, type: !64)
!676 = !DILocalVariable(name: "infomap", scope: !677, file: !678, line: 632, type: !692)
!677 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !678, file: !678, line: 630, type: !679, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !681)
!678 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!679 = !DISubroutineType(types: !680)
!680 = !{null, !61}
!681 = !{!682, !676, !683, !684, !691}
!682 = !DILocalVariable(name: "program", arg: 1, scope: !677, file: !678, line: 630, type: !61)
!683 = !DILocalVariable(name: "node", scope: !677, file: !678, line: 642, type: !61)
!684 = !DILocalVariable(name: "map_prog", scope: !677, file: !678, line: 643, type: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !677, file: !678, line: 632, size: 128, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !687, file: !678, line: 632, baseType: !61, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !687, file: !678, line: 632, baseType: !61, size: 64, offset: 64)
!691 = !DILocalVariable(name: "lc_messages", scope: !677, file: !678, line: 655, type: !61)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 896, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 7)
!695 = !DILocation(line: 632, column: 67, scope: !677, inlinedAt: !696)
!696 = distinct !DILocation(line: 76, column: 7, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !3, line: 58, column: 5)
!698 = distinct !DILexicalBlock(scope: !671, file: !3, line: 55, column: 7)
!699 = !DILocation(line: 53, column: 12, scope: !671)
!700 = !DILocation(line: 55, column: 14, scope: !698)
!701 = !DILocation(line: 55, column: 7, scope: !671)
!702 = !DILocation(line: 56, column: 5, scope: !703)
!703 = distinct !DILexicalBlock(scope: !698, file: !3, line: 56, column: 5)
!704 = !{!705, !705, i64 0}
!705 = !{!"any pointer", !706, i64 0}
!706 = !{!"omnipotent char", !707, i64 0}
!707 = !{!"Simple C/C++ TBAA"}
!708 = !DILocation(line: 59, column: 7, scope: !697)
!709 = !DILocation(line: 63, column: 7, scope: !697)
!710 = !DILocation(line: 580, column: 3, scope: !711, inlinedAt: !712)
!711 = distinct !DISubprogram(name: "emit_stdin_note", scope: !678, file: !678, line: 578, type: !218, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !75)
!712 = distinct !DILocation(line: 67, column: 7, scope: !697)
!713 = !DILocation(line: 69, column: 7, scope: !697)
!714 = !DILocation(line: 74, column: 7, scope: !697)
!715 = !DILocation(line: 75, column: 7, scope: !697)
!716 = !DILocation(line: 632, column: 3, scope: !677, inlinedAt: !696)
!717 = !DILocation(line: 643, column: 36, scope: !677, inlinedAt: !696)
!718 = !DILocation(line: 643, column: 25, scope: !677, inlinedAt: !696)
!719 = !DILocation(line: 645, column: 33, scope: !677, inlinedAt: !696)
!720 = !DILocation(line: 645, column: 3, scope: !677, inlinedAt: !696)
!721 = !DILocation(line: 646, column: 13, scope: !677, inlinedAt: !696)
!722 = !DILocation(line: 645, column: 20, scope: !677, inlinedAt: !696)
!723 = !{!724, !705, i64 0}
!724 = !{!"infomap", !705, i64 0, !705, i64 8}
!725 = !DILocation(line: 645, column: 10, scope: !677, inlinedAt: !696)
!726 = !DILocation(line: 645, column: 28, scope: !677, inlinedAt: !696)
!727 = distinct !{!727, !728, !729}
!728 = !DILocation(line: 645, column: 3, scope: !677)
!729 = !DILocation(line: 646, column: 13, scope: !677)
!730 = !DILocation(line: 648, column: 17, scope: !731, inlinedAt: !696)
!731 = distinct !DILexicalBlock(scope: !677, file: !678, line: 648, column: 7)
!732 = !{!724, !705, i64 8}
!733 = !DILocation(line: 648, column: 7, scope: !731, inlinedAt: !696)
!734 = !DILocation(line: 648, column: 7, scope: !677, inlinedAt: !696)
!735 = !DILocation(line: 642, column: 15, scope: !677, inlinedAt: !696)
!736 = !DILocation(line: 651, column: 3, scope: !677, inlinedAt: !696)
!737 = !DILocation(line: 655, column: 29, scope: !677, inlinedAt: !696)
!738 = !DILocation(line: 655, column: 15, scope: !677, inlinedAt: !696)
!739 = !DILocation(line: 656, column: 7, scope: !740, inlinedAt: !696)
!740 = distinct !DILexicalBlock(scope: !677, file: !678, line: 656, column: 7)
!741 = !DILocation(line: 656, column: 19, scope: !740, inlinedAt: !696)
!742 = !DILocation(line: 656, column: 22, scope: !740, inlinedAt: !696)
!743 = !DILocation(line: 656, column: 7, scope: !677, inlinedAt: !696)
!744 = !DILocation(line: 662, column: 7, scope: !745, inlinedAt: !696)
!745 = distinct !DILexicalBlock(scope: !740, file: !678, line: 657, column: 5)
!746 = !DILocation(line: 664, column: 5, scope: !745, inlinedAt: !696)
!747 = !DILocation(line: 665, column: 3, scope: !677, inlinedAt: !696)
!748 = !DILocation(line: 667, column: 3, scope: !677, inlinedAt: !696)
!749 = !DILocation(line: 669, column: 1, scope: !677, inlinedAt: !696)
!750 = !DILocation(line: 78, column: 3, scope: !671)
!751 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 221, type: !752, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !755)
!752 = !DISubroutineType(types: !753)
!753 = !{!64, !64, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!755 = !{!756, !757, !758, !759, !760, !761}
!756 = !DILocalVariable(name: "argc", arg: 1, scope: !751, file: !3, line: 221, type: !64)
!757 = !DILocalVariable(name: "argv", arg: 2, scope: !751, file: !3, line: 221, type: !754)
!758 = !DILocalVariable(name: "ok", scope: !751, file: !3, line: 223, type: !70)
!759 = !DILocalVariable(name: "optc", scope: !751, file: !3, line: 224, type: !64)
!760 = !DILocalVariable(name: "files_given", scope: !751, file: !3, line: 225, type: !64)
!761 = !DILocalVariable(name: "sum_func", scope: !751, file: !3, line: 226, type: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!70, !61, !64}
!765 = !DILocation(line: 221, column: 11, scope: !751)
!766 = !DILocation(line: 221, column: 24, scope: !751)
!767 = !DILocation(line: 226, column: 10, scope: !751)
!768 = !DILocation(line: 229, column: 21, scope: !751)
!769 = !DILocation(line: 229, column: 3, scope: !751)
!770 = !DILocation(line: 230, column: 3, scope: !751)
!771 = !DILocation(line: 231, column: 3, scope: !751)
!772 = !DILocation(line: 232, column: 3, scope: !751)
!773 = !DILocation(line: 234, column: 3, scope: !751)
!774 = !DILocation(line: 238, column: 12, scope: !751)
!775 = !DILocation(line: 238, column: 3, scope: !751)
!776 = !DILocation(line: 242, column: 3, scope: !751)
!777 = !DILocation(scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 245, column: 9)
!779 = distinct !DILexicalBlock(scope: !751, file: !3, line: 243, column: 5)
!780 = !DILocation(line: 242, column: 18, scope: !751)
!781 = !DILocation(line: 224, column: 7, scope: !751)
!782 = distinct !{!782, !776, !783}
!783 = !DILocation(line: 261, column: 5, scope: !751)
!784 = !DILocation(line: 252, column: 11, scope: !778)
!785 = !DILocation(line: 254, column: 9, scope: !778)
!786 = !DILocation(line: 256, column: 9, scope: !778)
!787 = !DILocation(line: 259, column: 11, scope: !778)
!788 = !DILocation(line: 263, column: 24, scope: !751)
!789 = !{!790, !790, i64 0}
!790 = !{!"int", !706, i64 0}
!791 = !DILocation(line: 263, column: 22, scope: !751)
!792 = !DILocation(line: 225, column: 7, scope: !751)
!793 = !DILocation(line: 264, column: 19, scope: !794)
!794 = distinct !DILexicalBlock(scope: !751, file: !3, line: 264, column: 7)
!795 = !DILocation(line: 264, column: 7, scope: !751)
!796 = !DILocation(line: 223, column: 8, scope: !751)
!797 = !DILocation(line: 267, column: 28, scope: !798)
!798 = distinct !DILexicalBlock(scope: !799, file: !3, line: 267, column: 5)
!799 = distinct !DILexicalBlock(scope: !794, file: !3, line: 267, column: 5)
!800 = !DILocation(line: 267, column: 5, scope: !799)
!801 = !DILocation(line: 265, column: 10, scope: !794)
!802 = !{i1 (i8*, i32)* @bsd_sum_file, i1 (i8*, i32)* @sysv_sum_file}
!803 = !DILocation(line: 265, column: 8, scope: !794)
!804 = !DILocation(line: 265, column: 5, scope: !794)
!805 = !DILocation(line: 268, column: 23, scope: !798)
!806 = !DILocation(line: 268, column: 13, scope: !798)
!807 = !DILocation(line: 268, column: 10, scope: !798)
!808 = !DILocation(line: 267, column: 42, scope: !798)
!809 = distinct !{!809, !800, !810}
!810 = !DILocation(line: 268, column: 48, scope: !799)
!811 = !DILocation(scope: !799)
!812 = !DILocation(line: 270, column: 23, scope: !813)
!813 = distinct !DILexicalBlock(scope: !751, file: !3, line: 270, column: 7)
!814 = !DILocation(line: 270, column: 34, scope: !813)
!815 = !DILocation(line: 270, column: 26, scope: !813)
!816 = !DILocation(line: 270, column: 41, scope: !813)
!817 = !DILocation(line: 270, column: 7, scope: !751)
!818 = !DILocation(line: 271, column: 5, scope: !813)
!819 = !DILocation(line: 272, column: 10, scope: !751)
!820 = !DILocation(line: 273, column: 1, scope: !751)
!821 = distinct !DISubprogram(name: "bsd_sum_file", scope: !3, file: !3, line: 88, type: !763, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !822)
!822 = !{!823, !824, !825, !881, !882, !886, !887, !891}
!823 = !DILocalVariable(name: "file", arg: 1, scope: !821, file: !3, line: 88, type: !61)
!824 = !DILocalVariable(name: "print_name", arg: 2, scope: !821, file: !3, line: 88, type: !64)
!825 = !DILocalVariable(name: "fp", scope: !821, file: !3, line: 90, type: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !828, line: 7, baseType: !829)
!828 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !830, line: 49, size: 1728, elements: !831)
!830 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !847, !849, !850, !851, !855, !856, !858, !862, !865, !867, !870, !873, !874, !875, !876, !877}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !829, file: !830, line: 51, baseType: !64, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !829, file: !830, line: 54, baseType: !43, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !829, file: !830, line: 55, baseType: !43, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !829, file: !830, line: 56, baseType: !43, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !829, file: !830, line: 57, baseType: !43, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !829, file: !830, line: 58, baseType: !43, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !829, file: !830, line: 59, baseType: !43, size: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !829, file: !830, line: 60, baseType: !43, size: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !829, file: !830, line: 61, baseType: !43, size: 64, offset: 512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !829, file: !830, line: 64, baseType: !43, size: 64, offset: 576)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !829, file: !830, line: 65, baseType: !43, size: 64, offset: 640)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !829, file: !830, line: 66, baseType: !43, size: 64, offset: 704)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !829, file: !830, line: 68, baseType: !845, size: 64, offset: 768)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !830, line: 36, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !829, file: !830, line: 70, baseType: !848, size: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !829, file: !830, line: 72, baseType: !64, size: 32, offset: 896)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !829, file: !830, line: 73, baseType: !64, size: 32, offset: 928)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !829, file: !830, line: 74, baseType: !852, size: 64, offset: 960)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !853, line: 150, baseType: !854)
!853 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!854 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !829, file: !830, line: 77, baseType: !156, size: 16, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !829, file: !830, line: 78, baseType: !857, size: 8, offset: 1040)
!857 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !829, file: !830, line: 79, baseType: !859, size: 8, offset: 1048)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 1)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !829, file: !830, line: 81, baseType: !863, size: 64, offset: 1088)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !830, line: 43, baseType: null)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !829, file: !830, line: 89, baseType: !866, size: 64, offset: 1152)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !853, line: 151, baseType: !854)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !829, file: !830, line: 91, baseType: !868, size: 64, offset: 1216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !830, line: 37, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !829, file: !830, line: 92, baseType: !871, size: 64, offset: 1280)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !830, line: 38, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !829, file: !830, line: 93, baseType: !848, size: 64, offset: 1344)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !829, file: !830, line: 94, baseType: !45, size: 64, offset: 1408)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !829, file: !830, line: 95, baseType: !48, size: 64, offset: 1472)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !829, file: !830, line: 96, baseType: !64, size: 32, offset: 1536)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !829, file: !830, line: 98, baseType: !878, size: 160, offset: 1568)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 20)
!881 = !DILocalVariable(name: "checksum", scope: !821, file: !3, line: 91, type: !64)
!882 = !DILocalVariable(name: "total_bytes", scope: !821, file: !3, line: 92, type: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !884, line: 102, baseType: !885)
!884 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !853, line: 72, baseType: !50)
!886 = !DILocalVariable(name: "ch", scope: !821, file: !3, line: 93, type: !64)
!887 = !DILocalVariable(name: "hbuf", scope: !821, file: !3, line: 94, type: !888)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 5216, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 652)
!891 = !DILocalVariable(name: "is_stdin", scope: !821, file: !3, line: 95, type: !70)
!892 = !DILocation(line: 88, column: 27, scope: !821)
!893 = !DILocation(line: 88, column: 37, scope: !821)
!894 = !DILocation(line: 91, column: 7, scope: !821)
!895 = !DILocation(line: 92, column: 13, scope: !821)
!896 = !DILocation(line: 94, column: 3, scope: !821)
!897 = !DILocation(line: 94, column: 8, scope: !821)
!898 = !DILocation(line: 95, column: 19, scope: !821)
!899 = !DILocation(line: 97, column: 7, scope: !821)
!900 = !DILocation(line: 99, column: 12, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !3, line: 98, column: 5)
!902 = distinct !DILexicalBlock(scope: !821, file: !3, line: 97, column: 7)
!903 = !DILocation(line: 90, column: 9, scope: !821)
!904 = !DILocation(line: 102, column: 5, scope: !901)
!905 = !DILocation(line: 105, column: 12, scope: !906)
!906 = distinct !DILexicalBlock(scope: !902, file: !3, line: 104, column: 5)
!907 = !DILocation(line: 106, column: 14, scope: !908)
!908 = distinct !DILexicalBlock(scope: !906, file: !3, line: 106, column: 11)
!909 = !DILocation(line: 106, column: 11, scope: !906)
!910 = !DILocation(line: 108, column: 21, scope: !911)
!911 = distinct !DILexicalBlock(scope: !908, file: !3, line: 107, column: 9)
!912 = !DILocation(line: 108, column: 34, scope: !911)
!913 = !DILocation(line: 108, column: 11, scope: !911)
!914 = !DILocation(line: 109, column: 11, scope: !911)
!915 = !DILocation(scope: !906)
!916 = !DILocation(line: 113, column: 3, scope: !821)
!917 = !DILocation(line: 115, column: 3, scope: !821)
!918 = !DILocation(scope: !919)
!919 = distinct !DILexicalBlock(scope: !821, file: !3, line: 116, column: 5)
!920 = !DILocalVariable(name: "__fp", arg: 1, scope: !921, file: !922, line: 66, type: !826)
!921 = distinct !DISubprogram(name: "getc_unlocked", scope: !922, file: !922, line: 66, type: !923, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !925)
!922 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!923 = !DISubroutineType(types: !924)
!924 = !{!64, !826}
!925 = !{!920}
!926 = !DILocation(line: 66, column: 22, scope: !921, inlinedAt: !927)
!927 = distinct !DILocation(line: 115, column: 16, scope: !821)
!928 = !DILocation(line: 68, column: 10, scope: !921, inlinedAt: !927)
!929 = !{!930, !705, i64 8}
!930 = !{!"_IO_FILE", !790, i64 0, !705, i64 8, !705, i64 16, !705, i64 24, !705, i64 32, !705, i64 40, !705, i64 48, !705, i64 56, !705, i64 64, !705, i64 72, !705, i64 80, !705, i64 88, !705, i64 96, !705, i64 104, !790, i64 112, !790, i64 116, !931, i64 120, !932, i64 128, !706, i64 130, !706, i64 131, !705, i64 136, !931, i64 144, !705, i64 152, !705, i64 160, !705, i64 168, !705, i64 176, !931, i64 184, !790, i64 192, !706, i64 196}
!931 = !{!"long", !706, i64 0}
!932 = !{!"short", !706, i64 0}
!933 = !{!930, !705, i64 16}
!934 = !{!"branch_weights", i32 2000, i32 1}
!935 = !{!706, !706, i64 0}
!936 = !DILocation(line: 93, column: 7, scope: !821)
!937 = !DILocation(line: 115, column: 27, scope: !821)
!938 = !DILocation(line: 117, column: 18, scope: !919)
!939 = !DILocation(line: 118, column: 28, scope: !919)
!940 = !DILocation(line: 118, column: 52, scope: !919)
!941 = !DILocation(line: 118, column: 34, scope: !919)
!942 = !DILocation(line: 119, column: 16, scope: !919)
!943 = !DILocation(line: 120, column: 16, scope: !919)
!944 = distinct !{!944, !917, !945}
!945 = !DILocation(line: 121, column: 5, scope: !821)
!946 = !DILocalVariable(name: "__stream", arg: 1, scope: !947, file: !922, line: 135, type: !826)
!947 = distinct !DISubprogram(name: "ferror_unlocked", scope: !922, file: !922, line: 135, type: !923, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !948)
!948 = !{!946}
!949 = !DILocation(line: 135, column: 1, scope: !947, inlinedAt: !950)
!950 = distinct !DILocation(line: 123, column: 7, scope: !951)
!951 = distinct !DILexicalBlock(scope: !821, file: !3, line: 123, column: 7)
!952 = !DILocation(line: 137, column: 10, scope: !947, inlinedAt: !950)
!953 = !{!930, !790, i64 0}
!954 = !DILocation(line: 123, column: 7, scope: !951)
!955 = !DILocation(line: 123, column: 7, scope: !821)
!956 = !DILocation(line: 125, column: 17, scope: !957)
!957 = distinct !DILexicalBlock(scope: !951, file: !3, line: 124, column: 5)
!958 = !DILocation(line: 125, column: 30, scope: !957)
!959 = !DILocation(line: 125, column: 7, scope: !957)
!960 = !DILocation(line: 126, column: 11, scope: !957)
!961 = !DILocation(line: 127, column: 9, scope: !962)
!962 = distinct !DILexicalBlock(scope: !957, file: !3, line: 126, column: 11)
!963 = !DILocation(line: 131, column: 17, scope: !964)
!964 = distinct !DILexicalBlock(scope: !821, file: !3, line: 131, column: 7)
!965 = !DILocation(line: 131, column: 20, scope: !964)
!966 = !DILocation(line: 131, column: 32, scope: !964)
!967 = !DILocation(line: 131, column: 7, scope: !821)
!968 = !DILocation(line: 133, column: 17, scope: !969)
!969 = distinct !DILexicalBlock(scope: !964, file: !3, line: 132, column: 5)
!970 = !DILocation(line: 133, column: 30, scope: !969)
!971 = !DILocation(line: 133, column: 7, scope: !969)
!972 = !DILocation(line: 134, column: 7, scope: !969)
!973 = !DILocation(line: 137, column: 3, scope: !821)
!974 = !DILocation(line: 139, column: 18, scope: !975)
!975 = distinct !DILexicalBlock(scope: !821, file: !3, line: 139, column: 7)
!976 = !DILocation(line: 139, column: 7, scope: !821)
!977 = !DILocation(line: 140, column: 5, scope: !975)
!978 = !DILocalVariable(name: "__c", arg: 1, scope: !979, file: !922, line: 108, type: !64)
!979 = distinct !DISubprogram(name: "putchar_unlocked", scope: !922, file: !922, line: 108, type: !980, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{!64, !64}
!982 = !{!978}
!983 = !DILocation(line: 108, column: 23, scope: !979, inlinedAt: !984)
!984 = distinct !DILocation(line: 141, column: 3, scope: !821)
!985 = !DILocation(line: 110, column: 10, scope: !979, inlinedAt: !984)
!986 = !{!930, !705, i64 40}
!987 = !{!930, !705, i64 48}
!988 = !DILocation(scope: !911)
!989 = !DILocation(line: 144, column: 1, scope: !821)
!990 = distinct !DISubprogram(name: "sysv_sum_file", scope: !3, file: !3, line: 152, type: !763, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !991)
!991 = !{!992, !993, !994, !995, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1007}
!992 = !DILocalVariable(name: "file", arg: 1, scope: !990, file: !3, line: 152, type: !61)
!993 = !DILocalVariable(name: "print_name", arg: 2, scope: !990, file: !3, line: 152, type: !64)
!994 = !DILocalVariable(name: "fd", scope: !990, file: !3, line: 154, type: !64)
!995 = !DILocalVariable(name: "buf", scope: !990, file: !3, line: 155, type: !996)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 65536, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 8192)
!999 = !DILocalVariable(name: "total_bytes", scope: !990, file: !3, line: 156, type: !883)
!1000 = !DILocalVariable(name: "hbuf", scope: !990, file: !3, line: 157, type: !888)
!1001 = !DILocalVariable(name: "r", scope: !990, file: !3, line: 158, type: !64)
!1002 = !DILocalVariable(name: "checksum", scope: !990, file: !3, line: 159, type: !64)
!1003 = !DILocalVariable(name: "s", scope: !990, file: !3, line: 162, type: !7)
!1004 = !DILocalVariable(name: "is_stdin", scope: !990, file: !3, line: 164, type: !70)
!1005 = !DILocalVariable(name: "bytes_read", scope: !1006, file: !3, line: 184, type: !48)
!1006 = distinct !DILexicalBlock(scope: !990, file: !3, line: 183, column: 5)
!1007 = !DILocalVariable(name: "i", scope: !1008, file: !3, line: 197, type: !48)
!1008 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 197, column: 7)
!1009 = !DILocation(line: 152, column: 28, scope: !990)
!1010 = !DILocation(line: 152, column: 38, scope: !990)
!1011 = !DILocation(line: 155, column: 3, scope: !990)
!1012 = !DILocation(line: 155, column: 17, scope: !990)
!1013 = !DILocation(line: 156, column: 13, scope: !990)
!1014 = !DILocation(line: 157, column: 3, scope: !990)
!1015 = !DILocation(line: 157, column: 8, scope: !990)
!1016 = !DILocation(line: 162, column: 16, scope: !990)
!1017 = !DILocation(line: 164, column: 19, scope: !990)
!1018 = !DILocation(line: 166, column: 7, scope: !990)
!1019 = !DILocation(line: 154, column: 7, scope: !990)
!1020 = !DILocation(line: 171, column: 5, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 167, column: 5)
!1022 = distinct !DILexicalBlock(scope: !990, file: !3, line: 166, column: 7)
!1023 = !DILocation(line: 174, column: 12, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 173, column: 5)
!1025 = !DILocation(line: 175, column: 14, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 175, column: 11)
!1027 = !DILocation(line: 175, column: 11, scope: !1024)
!1028 = !DILocation(line: 177, column: 21, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 176, column: 9)
!1030 = !DILocation(line: 177, column: 34, scope: !1029)
!1031 = !DILocation(line: 177, column: 11, scope: !1029)
!1032 = !DILocation(line: 178, column: 11, scope: !1029)
!1033 = !DILocation(scope: !1024)
!1034 = !DILocation(line: 182, column: 3, scope: !990)
!1035 = !DILocation(line: 184, column: 27, scope: !1006)
!1036 = !DILocation(line: 184, column: 14, scope: !1006)
!1037 = !DILocation(line: 186, column: 11, scope: !1006)
!1038 = !DILocation(line: 198, column: 14, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 197, column: 7)
!1040 = !DILocation(line: 197, column: 43, scope: !1039)
!1041 = !DILocation(line: 198, column: 11, scope: !1039)
!1042 = distinct !{!1042, !1043, !1044, !1045}
!1043 = !DILocation(line: 197, column: 7, scope: !1008)
!1044 = !DILocation(line: 198, column: 19, scope: !1008)
!1045 = !{!"llvm.loop.isvectorized", i32 1}
!1046 = !DILocation(line: 191, column: 21, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 190, column: 9)
!1048 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 189, column: 11)
!1049 = !DILocation(line: 191, column: 34, scope: !1047)
!1050 = !DILocation(line: 191, column: 11, scope: !1047)
!1051 = !DILocation(line: 192, column: 15, scope: !1047)
!1052 = !DILocation(line: 193, column: 13, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 192, column: 15)
!1054 = !DILocation(line: 197, column: 19, scope: !1008)
!1055 = !DILocation(line: 197, column: 28, scope: !1039)
!1056 = distinct !{!1056, !1043, !1044, !1057, !1045}
!1057 = !{!"llvm.loop.unroll.runtime.disable"}
!1058 = !DILocation(line: 199, column: 19, scope: !1006)
!1059 = !DILocation(line: 202, column: 17, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !990, file: !3, line: 202, column: 7)
!1061 = !DILocation(line: 202, column: 20, scope: !1060)
!1062 = !DILocation(line: 202, column: 31, scope: !1060)
!1063 = !DILocation(line: 202, column: 7, scope: !990)
!1064 = !DILocation(line: 204, column: 17, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 203, column: 5)
!1066 = !DILocation(line: 204, column: 30, scope: !1065)
!1067 = !DILocation(line: 204, column: 7, scope: !1065)
!1068 = !DILocation(line: 205, column: 7, scope: !1065)
!1069 = !DILocation(line: 208, column: 10, scope: !990)
!1070 = !DILocation(line: 208, column: 40, scope: !990)
!1071 = !DILocation(line: 208, column: 20, scope: !990)
!1072 = !DILocation(line: 158, column: 7, scope: !990)
!1073 = !DILocation(line: 209, column: 17, scope: !990)
!1074 = !DILocation(line: 209, column: 32, scope: !990)
!1075 = !DILocation(line: 209, column: 27, scope: !990)
!1076 = !DILocation(line: 159, column: 7, scope: !990)
!1077 = !DILocation(line: 211, column: 3, scope: !990)
!1078 = !DILocation(line: 213, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !990, file: !3, line: 213, column: 7)
!1080 = !DILocation(line: 213, column: 7, scope: !990)
!1081 = !DILocation(line: 214, column: 5, scope: !1079)
!1082 = !DILocation(line: 108, column: 23, scope: !979, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 215, column: 3, scope: !990)
!1084 = !DILocation(line: 110, column: 10, scope: !979, inlinedAt: !1083)
!1085 = !DILocation(line: 218, column: 1, scope: !990)
!1086 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !84, file: !84, line: 51, type: !679, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !79, retainedNodes: !1087)
!1087 = !{!1088}
!1088 = !DILocalVariable(name: "file", arg: 1, scope: !1086, file: !84, line: 51, type: !61)
!1089 = !DILocation(line: 51, column: 41, scope: !1086)
!1090 = !DILocation(line: 53, column: 13, scope: !1086)
!1091 = !DILocation(line: 54, column: 1, scope: !1086)
!1092 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !84, file: !84, line: 88, type: !1093, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !79, retainedNodes: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !70}
!1095 = !{!1096}
!1096 = !DILocalVariable(name: "ignore", arg: 1, scope: !1092, file: !84, line: 88, type: !70)
!1097 = !DILocation(line: 88, column: 37, scope: !1092)
!1098 = !DILocation(line: 90, column: 16, scope: !1092)
!1099 = !{!1100, !1100, i64 0}
!1100 = !{!"_Bool", !706, i64 0}
!1101 = !DILocation(line: 91, column: 1, scope: !1092)
!1102 = distinct !DISubprogram(name: "close_stdout", scope: !84, file: !84, line: 117, type: !218, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !79, retainedNodes: !1103)
!1103 = !{!1104}
!1104 = !DILocalVariable(name: "write_error", scope: !1105, file: !84, line: 122, type: !61)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !84, line: 121, column: 5)
!1106 = distinct !DILexicalBlock(scope: !1102, file: !84, line: 119, column: 7)
!1107 = !DILocation(line: 119, column: 21, scope: !1106)
!1108 = !DILocation(line: 119, column: 7, scope: !1106)
!1109 = !DILocation(line: 119, column: 29, scope: !1106)
!1110 = !DILocation(line: 120, column: 7, scope: !1106)
!1111 = !DILocation(line: 120, column: 12, scope: !1106)
!1112 = !{i8 0, i8 2}
!1113 = !DILocation(line: 120, column: 25, scope: !1106)
!1114 = !DILocation(line: 120, column: 28, scope: !1106)
!1115 = !DILocation(line: 120, column: 34, scope: !1106)
!1116 = !DILocation(line: 119, column: 7, scope: !1102)
!1117 = !DILocation(line: 122, column: 33, scope: !1105)
!1118 = !DILocation(line: 122, column: 19, scope: !1105)
!1119 = !DILocation(line: 123, column: 11, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1105, file: !84, line: 123, column: 11)
!1121 = !DILocation(scope: !1120)
!1122 = !DILocation(line: 123, column: 11, scope: !1105)
!1123 = !DILocation(line: 124, column: 36, scope: !1120)
!1124 = !DILocation(line: 124, column: 9, scope: !1120)
!1125 = !DILocation(line: 127, column: 9, scope: !1120)
!1126 = !DILocation(line: 129, column: 14, scope: !1105)
!1127 = !DILocation(line: 129, column: 7, scope: !1105)
!1128 = !DILocation(line: 134, column: 42, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1102, file: !84, line: 134, column: 7)
!1130 = !DILocation(line: 134, column: 28, scope: !1129)
!1131 = !DILocation(line: 134, column: 50, scope: !1129)
!1132 = !DILocation(line: 134, column: 7, scope: !1102)
!1133 = !DILocation(line: 135, column: 12, scope: !1129)
!1134 = !DILocation(line: 135, column: 5, scope: !1129)
!1135 = !DILocation(line: 136, column: 1, scope: !1102)
!1136 = distinct !DISubprogram(name: "fdadvise", scope: !1137, file: !1137, line: 31, type: !1138, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !220, retainedNodes: !1143)
!1137 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null, !64, !1140, !1140, !1142}
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1141, line: 63, baseType: !852)
!1141 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !21, line: 52, baseType: !20)
!1143 = !{!1144, !1145, !1146, !1147, !1148}
!1144 = !DILocalVariable(name: "fd", arg: 1, scope: !1136, file: !1137, line: 31, type: !64)
!1145 = !DILocalVariable(name: "offset", arg: 2, scope: !1136, file: !1137, line: 31, type: !1140)
!1146 = !DILocalVariable(name: "len", arg: 3, scope: !1136, file: !1137, line: 31, type: !1140)
!1147 = !DILocalVariable(name: "advice", arg: 4, scope: !1136, file: !1137, line: 31, type: !1142)
!1148 = !DILocalVariable(name: "__x", scope: !1149, file: !1137, line: 34, type: !64)
!1149 = distinct !DILexicalBlock(scope: !1136, file: !1137, line: 34, column: 3)
!1150 = !DILocation(line: 31, column: 15, scope: !1136)
!1151 = !DILocation(line: 31, column: 25, scope: !1136)
!1152 = !DILocation(line: 31, column: 39, scope: !1136)
!1153 = !DILocation(line: 31, column: 54, scope: !1136)
!1154 = !DILocation(line: 34, column: 3, scope: !1149)
!1155 = !DILocation(line: 36, column: 1, scope: !1136)
!1156 = distinct !DISubprogram(name: "fadvise", scope: !1137, file: !1137, line: 39, type: !1157, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !220, retainedNodes: !1193)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{null, !1159, !1142}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !828, line: 7, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !830, line: 49, size: 1728, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1161, file: !830, line: 51, baseType: !64, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1161, file: !830, line: 54, baseType: !43, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1161, file: !830, line: 55, baseType: !43, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1161, file: !830, line: 56, baseType: !43, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1161, file: !830, line: 57, baseType: !43, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1161, file: !830, line: 58, baseType: !43, size: 64, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1161, file: !830, line: 59, baseType: !43, size: 64, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1161, file: !830, line: 60, baseType: !43, size: 64, offset: 448)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1161, file: !830, line: 61, baseType: !43, size: 64, offset: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1161, file: !830, line: 64, baseType: !43, size: 64, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1161, file: !830, line: 65, baseType: !43, size: 64, offset: 640)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1161, file: !830, line: 66, baseType: !43, size: 64, offset: 704)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1161, file: !830, line: 68, baseType: !845, size: 64, offset: 768)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1161, file: !830, line: 70, baseType: !1177, size: 64, offset: 832)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1161, file: !830, line: 72, baseType: !64, size: 32, offset: 896)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1161, file: !830, line: 73, baseType: !64, size: 32, offset: 928)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1161, file: !830, line: 74, baseType: !852, size: 64, offset: 960)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1161, file: !830, line: 77, baseType: !156, size: 16, offset: 1024)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1161, file: !830, line: 78, baseType: !857, size: 8, offset: 1040)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1161, file: !830, line: 79, baseType: !859, size: 8, offset: 1048)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1161, file: !830, line: 81, baseType: !863, size: 64, offset: 1088)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1161, file: !830, line: 89, baseType: !866, size: 64, offset: 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1161, file: !830, line: 91, baseType: !868, size: 64, offset: 1216)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1161, file: !830, line: 92, baseType: !871, size: 64, offset: 1280)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1161, file: !830, line: 93, baseType: !1177, size: 64, offset: 1344)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1161, file: !830, line: 94, baseType: !45, size: 64, offset: 1408)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1161, file: !830, line: 95, baseType: !48, size: 64, offset: 1472)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1161, file: !830, line: 96, baseType: !64, size: 32, offset: 1536)
