source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"Print checksum and block counts for each FILE.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 42, type: !195, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !188, nameTableKind: None)
!3 = !DIFile(filename: "src/sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 43, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!32 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!38 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!39 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!40 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!41 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!42 = !{!43, !53, !114, !118, !122, !125, !128, !135, !138, !47, !104, !153, !157, !161, !164, !168, !171, !174, !175, !176, !180, !106, !184}
!43 = !DISubprogram(name: "dcgettext", scope: !44, file: !44, line: 51, type: !45, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!44 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !49, !49, !51}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !{}
!53 = !DISubprogram(name: "fputs_unlocked", scope: !54, file: !54, line: 662, type: !55, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!54 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!55 = !DISubroutineType(types: !56)
!56 = !{!51, !49, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !60)
!59 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !76, !77, !78, !79, !83, !85, !87, !91, !94, !96, !99, !102, !103, !105, !109, !110}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 51, baseType: !51, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 36, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 70, baseType: !57, size: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !81, line: 152, baseType: !82)
!81 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!82 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 43, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !81, line: 153, baseType: !82)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !58, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !59, line: 37, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !58, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !59, line: 38, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !58, file: !59, line: 93, baseType: !57, size: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !58, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 46, baseType: !108)
!107 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!108 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 20)
!114 = !DISubprogram(name: "set_program_name", scope: !115, file: !115, line: 37, type: !116, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!115 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!116 = !DISubroutineType(types: !117)
!117 = !{null, !49}
!118 = !DISubprogram(name: "setlocale", scope: !119, file: !119, line: 122, type: !120, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!119 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!120 = !DISubroutineType(types: !121)
!121 = !{!47, !51, !49}
!122 = !DISubprogram(name: "bindtextdomain", scope: !44, file: !44, line: 86, type: !123, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!123 = !DISubroutineType(types: !124)
!124 = !{!47, !49, !49}
!125 = !DISubprogram(name: "textdomain", scope: !44, file: !44, line: 82, type: !126, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!126 = !DISubroutineType(types: !127)
!127 = !{!47, !49}
!128 = !DISubprogram(name: "atexit", scope: !129, file: !129, line: 595, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!129 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!130 = !DISubroutineType(types: !131)
!131 = !{!51, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null}
!135 = !DISubprogram(name: "setvbuf", scope: !54, file: !54, line: 308, type: !136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!136 = !DISubroutineType(types: !137)
!137 = !{!51, !57, !47, !51, !108}
!138 = !DISubprogram(name: "getopt_long", scope: !139, file: !139, line: 66, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!139 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!140 = !DISubroutineType(types: !141)
!141 = !{!51, !51, !142, !49, !144, !151}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !139, line: 50, size: 256, elements: !147)
!147 = !{!148, !149, !150, !152}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !139, line: 52, baseType: !49, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !146, file: !139, line: 55, baseType: !51, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !139, line: 56, baseType: !151, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !146, file: !139, line: 57, baseType: !51, size: 32, offset: 192)
!153 = !DISubprogram(name: "version_etc", scope: !154, file: !154, line: 69, type: !155, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!154 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !DISubroutineType(types: !156)
!156 = !{null, !57, !49, !49, !49, null}
!157 = !DISubprogram(name: "rpl_fclose", scope: !158, file: !158, line: 672, type: !159, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!158 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!159 = !DISubroutineType(types: !160)
!160 = !{!51, !57}
!161 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !162, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!162 = !DISubroutineType(types: !163)
!163 = !{!47, !51, !5, !49}
!164 = !DISubprogram(name: "error", scope: !165, file: !165, line: 52, type: !166, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!165 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !DISubroutineType(types: !167)
!167 = !{null, !51, !51, !49, null}
!168 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !57, !20}
!171 = !DISubprogram(name: "human_readable", scope: !30, file: !30, line: 79, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!172 = !DISubroutineType(types: !173)
!173 = !{!47, !108, !47, !51, !108, !108}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!176 = !DISubprogram(name: "open", scope: !177, file: !177, line: 196, type: !178, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!177 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!178 = !DISubroutineType(types: !179)
!179 = !{!51, !49, !51, null}
!180 = !DISubprogram(name: "safe_read", scope: !181, file: !181, line: 42, type: !182, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!181 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!182 = !DISubroutineType(types: !183)
!183 = !{!108, !51, !104, !108}
!184 = !DISubprogram(name: "close", scope: !185, file: !185, line: 353, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!185 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!186 = !DISubroutineType(types: !187)
!187 = !{!51, !51}
!188 = !{!189, !190}
!189 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 44, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1024, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 4)
!195 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "Version", scope: !198, file: !199, line: 2, type: !49, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, globals: !200, nameTableKind: None)
!199 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !{!196}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !203, file: !204, line: 46, type: !49, isLocal: true, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !205, globals: !243, nameTableKind: None)
!204 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = !{!206, !43, !242, !164}
!206 = !DISubprogram(name: "close_stream", scope: !207, file: !207, line: 2, type: !208, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!207 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !DISubroutineType(types: !209)
!209 = !{!51, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !211, file: !59, line: 51, baseType: !51, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !211, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !211, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !211, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !211, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !211, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !211, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !211, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !211, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !211, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !211, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !211, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !211, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !211, file: !59, line: 70, baseType: !210, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !211, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !211, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !211, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !211, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !211, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !211, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !211, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !211, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !211, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !211, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !211, file: !59, line: 93, baseType: !210, size: 64, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !211, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !211, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !211, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !211, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!242 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !126, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!243 = !{!201, !244}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !203, file: !204, line: 56, type: !195, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "exit_failure", scope: !248, file: !249, line: 24, type: !251, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, globals: !250, nameTableKind: None)
!249 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = !{!246}
!251 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "power_letter", scope: !254, file: !255, line: 36, type: !322, isLocal: true, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !256, retainedTypes: !265, globals: !310, nameTableKind: None)
!255 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !{!29, !257}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !258, line: 25, baseType: !7, size: 32, elements: !259)
!258 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!265 = !{!266, !296, !297, !299, !305}
!266 = !DISubprogram(name: "localeconv", scope: !119, file: !119, line: 125, type: !267, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!267 = !DISubroutineType(types: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !119, line: 51, size: 768, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !270, file: !119, line: 55, baseType: !47, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !270, file: !119, line: 56, baseType: !47, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !270, file: !119, line: 62, baseType: !47, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !270, file: !119, line: 68, baseType: !47, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !270, file: !119, line: 69, baseType: !47, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !270, file: !119, line: 70, baseType: !47, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !270, file: !119, line: 71, baseType: !47, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !270, file: !119, line: 72, baseType: !47, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !270, file: !119, line: 73, baseType: !47, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !270, file: !119, line: 74, baseType: !47, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !270, file: !119, line: 75, baseType: !48, size: 8, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !270, file: !119, line: 76, baseType: !48, size: 8, offset: 648)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !270, file: !119, line: 78, baseType: !48, size: 8, offset: 656)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !270, file: !119, line: 80, baseType: !48, size: 8, offset: 664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !270, file: !119, line: 82, baseType: !48, size: 8, offset: 672)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !270, file: !119, line: 84, baseType: !48, size: 8, offset: 680)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !270, file: !119, line: 91, baseType: !48, size: 8, offset: 688)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !270, file: !119, line: 92, baseType: !48, size: 8, offset: 696)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !270, file: !119, line: 95, baseType: !48, size: 8, offset: 704)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !270, file: !119, line: 97, baseType: !48, size: 8, offset: 712)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !270, file: !119, line: 99, baseType: !48, size: 8, offset: 720)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !270, file: !119, line: 101, baseType: !48, size: 8, offset: 728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !270, file: !119, line: 108, baseType: !48, size: 8, offset: 736)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !270, file: !119, line: 109, baseType: !48, size: 8, offset: 744)
!296 = !DISubprogram(name: "getenv", scope: !129, file: !129, line: 634, type: !126, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!299 = !DISubprogram(name: "argmatch", scope: !300, file: !300, line: 52, type: !301, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!300 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !DISubroutineType(types: !302)
!302 = !{!82, !49, !303, !297, !108}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!305 = !DISubprogram(name: "xstrtoumax", scope: !258, file: !258, line: 48, type: !306, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!306 = !DISubroutineType(types: !307)
!307 = !{!257, !49, !308, !51, !309, !49}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!310 = !{!252, !311, !316}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "block_size_args", scope: !254, file: !255, line: 398, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 192, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 3)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !254, file: !255, line: 399, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !320)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!320 = !{!321}
!321 = !DISubrange(count: 2)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 72, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 9)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "program_name", scope: !327, file: !328, line: 33, type: !49, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !329, globals: !365, nameTableKind: None)
!328 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = !{!104, !330, !47}
!330 = !DISubprogram(name: "fputs", scope: !54, file: !54, line: 626, type: !331, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!331 = !DISubroutineType(types: !332)
!332 = !{!51, !49, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !334, file: !59, line: 51, baseType: !51, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !334, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !334, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !334, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !334, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !334, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !334, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !334, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !334, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !334, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !334, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !334, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !334, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !334, file: !59, line: 70, baseType: !333, size: 64, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !334, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !334, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !334, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !334, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !334, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !334, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !334, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !334, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !334, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !334, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !334, file: !59, line: 93, baseType: !333, size: 64, offset: 1344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !334, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !334, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !334, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !334, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!365 = !{!325}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !368, file: !369, line: 85, type: !484, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !370, retainedTypes: !391, globals: !457, nameTableKind: None)
!369 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{!5, !371, !376}
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !377, line: 46, baseType: !7, size: 32, elements: !378)
!377 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!379 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!380 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!381 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!382 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!383 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!384 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!385 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!386 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!387 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!389 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!390 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!391 = !{!392, !396, !411, !414, !51, !84, !417, !106, !432, !436, !43, !442, !446, !47, !450, !453, !454}
!392 = !DISubprogram(name: "xmemdup", scope: !393, file: !393, line: 62, type: !394, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!393 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!394 = !DISubroutineType(types: !395)
!395 = !{!104, !297, !108}
!396 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !397, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!397 = !DISubroutineType(types: !398)
!398 = !{!47, !49, !108, !309, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !369, line: 65, size: 448, elements: !402)
!402 = !{!403, !404, !405, !409, !410}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !401, file: !369, line: 68, baseType: !5, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !401, file: !369, line: 71, baseType: !51, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !401, file: !369, line: 75, baseType: !406, size: 256, offset: 64)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !401, file: !369, line: 78, baseType: !49, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !401, file: !369, line: 81, baseType: !49, size: 64, offset: 384)
!411 = !DISubprogram(name: "free", scope: !129, file: !129, line: 565, type: !412, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !104}
!414 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !415, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!415 = !DISubroutineType(types: !416)
!416 = !{!47, !51, !49, !49, !49, !108}
!417 = !DISubprogram(name: "rpl_mbrtowc", scope: !418, file: !418, line: 717, type: !419, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!418 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!419 = !DISubroutineType(types: !420)
!420 = !{!108, !151, !49, !108, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 13, size: 64, elements: !424)
!423 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !422, file: !423, line: 15, baseType: !51, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !422, file: !423, line: 20, baseType: !427, size: 32, offset: 32)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !422, file: !423, line: 16, size: 32, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !427, file: !423, line: 18, baseType: !7, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !427, file: !423, line: 19, baseType: !431, size: 32)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !193)
!432 = !DISubprogram(name: "iswprint", scope: !433, file: !433, line: 120, type: !434, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!433 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!434 = !DISubroutineType(types: !435)
!435 = !{!51, !7}
!436 = !DISubprogram(name: "mbsinit", scope: !437, file: !437, line: 292, type: !438, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!437 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!438 = !DISubroutineType(types: !439)
!439 = !{!51, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!442 = !DISubprogram(name: "locale_charset", scope: !443, file: !443, line: 35, type: !444, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!443 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!444 = !DISubroutineType(types: !445)
!445 = !{!49}
!446 = !DISubprogram(name: "c_strcasecmp", scope: !447, file: !447, line: 42, type: !448, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!447 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = !DISubroutineType(types: !449)
!449 = !{!51, !49, !49}
!450 = !DISubprogram(name: "xmalloc", scope: !393, file: !393, line: 53, type: !451, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!451 = !DISubroutineType(types: !452)
!452 = !{!104, !108}
!453 = !DISubprogram(name: "xalloc_die", scope: !393, file: !393, line: 51, type: !133, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !52)
!454 = !DISubprogram(name: "xrealloc", scope: !393, file: !393, line: 59, type: !455, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!455 = !DISubroutineType(types: !456)
!456 = !{!104, !104, !108}
!457 = !{!366, !458, !464, !466, !468, !473, !480, !482}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !368, file: !369, line: 101, type: !460, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 320, elements: !462)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!462 = !{!463}
!463 = !DISubrange(count: 10)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !368, file: !369, line: 1052, type: !401, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !368, file: !369, line: 116, type: !401, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "slot0", scope: !368, file: !369, line: 842, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 256)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "slotvec", scope: !368, file: !369, line: 845, type: !475, isLocal: true, isDefinition: true)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !369, line: 834, size: 128, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !476, file: !369, line: 836, baseType: !106, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !476, file: !369, line: 837, baseType: !47, size: 64, offset: 64)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "nslots", scope: !368, file: !369, line: 843, type: !51, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "slotvec0", scope: !368, file: !369, line: 844, type: !476, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 704, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 11)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !489, file: !490, line: 26, type: !492, isDefinition: true)
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, globals: !491, nameTableKind: None)
!490 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!491 = !{!487}
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 47)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !497, file: !498, line: 67, type: !548, isDefinition: true)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !499, retainedTypes: !500, globals: !547, nameTableKind: None)
!498 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!5}
!500 = !{!104, !49, !43, !501, !502, !164, !506, !541, !544, !175}
!501 = !DISubprogram(name: "quotearg_n_style", scope: !6, file: !6, line: 368, type: !162, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!502 = !DISubprogram(name: "quote_n", scope: !503, file: !503, line: 40, type: !504, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!503 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !DISubroutineType(types: !505)
!505 = !{!49, !51, !49}
!506 = !DISubprogram(name: "fputs_unlocked", scope: !54, file: !54, line: 662, type: !507, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!507 = !DISubroutineType(types: !508)
!508 = !{!51, !49, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !510, file: !59, line: 51, baseType: !51, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !510, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !510, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !510, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !510, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !510, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !510, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !510, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !510, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !510, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !510, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !510, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !510, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !510, file: !59, line: 70, baseType: !509, size: 64, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !510, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !510, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !510, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !510, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !510, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !510, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !510, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !510, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !510, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !510, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !510, file: !59, line: 93, baseType: !509, size: 64, offset: 1344)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !510, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !510, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !510, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !510, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!541 = !DISubprogram(name: "quote", scope: !503, file: !503, line: 44, type: !542, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!542 = !DISubroutineType(types: !543)
!543 = !{!49, !49}
!544 = !DISubprogram(name: "usage", scope: !498, file: !498, line: 56, type: !545, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !51}
!547 = !{!495}
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !300, line: 61, baseType: !132)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !551, retainedTypes: !552, nameTableKind: None)
!550 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!20}
!552 = !{!553, !556}
!553 = !DISubprogram(name: "posix_fadvise", scope: !177, file: !177, line: 288, type: !554, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!554 = !DISubroutineType(types: !555)
!555 = !{!51, !51, !82, !82, !51}
!556 = !DISubprogram(name: "fileno", scope: !54, file: !54, line: 786, type: !557, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!557 = !DISubroutineType(types: !558)
!558 = !{!51, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !560, file: !59, line: 51, baseType: !51, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !560, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !560, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !560, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !560, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !560, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !560, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !560, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !560, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !560, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !560, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !560, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !560, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !560, file: !59, line: 70, baseType: !559, size: 64, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !560, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !560, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !560, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !560, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !560, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !560, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !560, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !560, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !560, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !560, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !560, file: !59, line: 93, baseType: !559, size: 64, offset: 1344)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !560, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !560, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !560, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !560, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !593, nameTableKind: None)
!592 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = !{!594}
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !595, line: 40, baseType: !7, size: 32, elements: !596)
!595 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!596 = !{!597}
!597 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !600, retainedTypes: !604, nameTableKind: None)
!599 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!600 = !{!601}
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !599, line: 40, baseType: !7, size: 32, elements: !602)
!602 = !{!603}
!603 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!604 = !{!43, !605, !104}
!605 = !DISubprogram(name: "fputs_unlocked", scope: !54, file: !54, line: 662, type: !606, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!606 = !DISubroutineType(types: !607)
!607 = !{!51, !49, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !609, file: !59, line: 51, baseType: !51, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !609, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !609, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !609, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !609, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !609, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !609, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !609, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !609, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !609, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !609, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !609, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !609, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !609, file: !59, line: 70, baseType: !608, size: 64, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !609, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !609, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !609, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !609, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !609, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !609, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !609, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !609, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !609, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !609, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !609, file: !59, line: 93, baseType: !608, size: 64, offset: 1344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !609, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !609, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !609, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !609, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !642, retainedTypes: !655, nameTableKind: None)
!641 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!642 = !{!643}
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !644, file: !393, line: 186, baseType: !7, size: 32, elements: !653)
!644 = distinct !DISubprogram(name: "x2nrealloc", scope: !393, file: !393, line: 174, type: !645, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !640, retainedNodes: !648)
!645 = !DISubroutineType(types: !646)
!646 = !{!104, !104, !647, !106}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!648 = !{!649, !650, !651, !652}
!649 = !DILocalVariable(name: "p", arg: 1, scope: !644, file: !393, line: 174, type: !104)
!650 = !DILocalVariable(name: "pn", arg: 2, scope: !644, file: !393, line: 174, type: !647)
!651 = !DILocalVariable(name: "s", arg: 3, scope: !644, file: !393, line: 174, type: !106)
!652 = !DILocalVariable(name: "n", scope: !644, file: !393, line: 176, type: !106)
!653 = !{!654}
!654 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!655 = !{!106, !453, !450, !454, !47, !411, !104, !656, !659}
!656 = !DISubprogram(name: "xcalloc", scope: !393, file: !393, line: 57, type: !657, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!657 = !DISubroutineType(types: !658)
!658 = !{!104, !108, !108}
!659 = !DISubprogram(name: "rpl_calloc", scope: !660, file: !660, line: 688, type: !657, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!660 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !663, nameTableKind: None)
!662 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !{!43, !164}
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !666, retainedTypes: !667, nameTableKind: None)
!665 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!666 = !{!257, !376}
!667 = !{!51, !84}
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !670, nameTableKind: None)
!669 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!670 = !{!104}
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !673, nameTableKind: None)
!672 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!673 = !{!674, !709, !710, !713}
!674 = !DISubprogram(name: "fileno", scope: !54, file: !54, line: 786, type: !675, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!675 = !DISubroutineType(types: !676)
!676 = !{!51, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !678, file: !59, line: 51, baseType: !51, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !678, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !678, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !678, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !678, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !678, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !678, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !678, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !678, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !678, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !678, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !678, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !678, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !678, file: !59, line: 70, baseType: !677, size: 64, offset: 832)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !678, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !678, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !678, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !678, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !678, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !678, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !678, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !678, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !678, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !678, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !678, file: !59, line: 93, baseType: !677, size: 64, offset: 1344)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !678, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !678, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !678, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !678, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!709 = !DISubprogram(name: "fclose", scope: !54, file: !54, line: 213, type: !675, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!710 = !DISubprogram(name: "lseek", scope: !185, file: !185, line: 334, type: !711, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!711 = !DISubroutineType(types: !712)
!712 = !{!82, !51, !82, !51}
!713 = !DISubprogram(name: "rpl_fflush", scope: !158, file: !158, line: 718, type: !675, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !716, nameTableKind: None)
!715 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!716 = !{!104, !717, !752}
!717 = !DISubprogram(name: "fflush", scope: !54, file: !54, line: 218, type: !718, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!718 = !DISubroutineType(types: !719)
!719 = !{!51, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !721, file: !59, line: 51, baseType: !51, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !721, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !721, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !721, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !721, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !721, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !721, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !721, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !721, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !721, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !721, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !721, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !721, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !721, file: !59, line: 70, baseType: !720, size: 64, offset: 832)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !721, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !721, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !721, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !721, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !721, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !721, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !721, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !721, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !721, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !721, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !721, file: !59, line: 93, baseType: !720, size: 64, offset: 1344)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !721, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !721, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !721, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !721, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!752 = !DISubprogram(name: "rpl_fseeko", scope: !158, file: !158, line: 1034, type: !753, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!753 = !DISubroutineType(types: !754)
!754 = !{!51, !720, !82, !51}
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !757, nameTableKind: None)
!756 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!757 = !{!104, !758, !710, !793}
!758 = !DISubprogram(name: "fileno", scope: !54, file: !54, line: 786, type: !759, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!759 = !DISubroutineType(types: !760)
!760 = !{!51, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !762, file: !59, line: 51, baseType: !51, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !762, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !762, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !762, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !762, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !762, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !762, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !762, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !762, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !762, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !762, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !762, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !762, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !762, file: !59, line: 70, baseType: !761, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !762, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !762, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !762, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !762, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !762, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !762, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !762, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !762, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !762, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !762, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !762, file: !59, line: 93, baseType: !761, size: 64, offset: 1344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !762, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !762, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !762, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !762, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!793 = !DISubprogram(name: "fseeko", scope: !54, file: !54, line: 707, type: !794, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!794 = !DISubroutineType(types: !795)
!795 = !{!51, !761, !82, !51}
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !798, nameTableKind: None)
!797 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!798 = !{!799, !106, !811}
!799 = !DISubprogram(name: "mbrtowc", scope: !437, file: !437, line: 296, type: !800, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!800 = !DISubroutineType(types: !801)
!801 = !{!108, !151, !49, !108, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 13, size: 64, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !803, file: !423, line: 15, baseType: !51, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !803, file: !423, line: 20, baseType: !807, size: 32, offset: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !423, line: 16, size: 32, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !807, file: !423, line: 18, baseType: !7, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !807, file: !423, line: 19, baseType: !431, size: 32)
!811 = !DISubprogram(name: "hard_locale", scope: !812, file: !812, line: 26, type: !813, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!812 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!813 = !DISubroutineType(types: !814)
!814 = !{!195, !51}
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !817, nameTableKind: None)
!816 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!817 = !{!818}
!818 = !DISubprogram(name: "rpl_fclose", scope: !158, file: !158, line: 672, type: !819, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!819 = !DISubroutineType(types: !820)
!820 = !{!51, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !822, file: !59, line: 51, baseType: !51, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !822, file: !59, line: 54, baseType: !47, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !822, file: !59, line: 55, baseType: !47, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !822, file: !59, line: 56, baseType: !47, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !822, file: !59, line: 57, baseType: !47, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !822, file: !59, line: 58, baseType: !47, size: 64, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !822, file: !59, line: 59, baseType: !47, size: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !822, file: !59, line: 60, baseType: !47, size: 64, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !822, file: !59, line: 61, baseType: !47, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !822, file: !59, line: 64, baseType: !47, size: 64, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !822, file: !59, line: 65, baseType: !47, size: 64, offset: 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !822, file: !59, line: 66, baseType: !47, size: 64, offset: 704)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !822, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !822, file: !59, line: 70, baseType: !821, size: 64, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !822, file: !59, line: 72, baseType: !51, size: 32, offset: 896)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !822, file: !59, line: 73, baseType: !51, size: 32, offset: 928)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !822, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !822, file: !59, line: 77, baseType: !84, size: 16, offset: 1024)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !822, file: !59, line: 78, baseType: !86, size: 8, offset: 1040)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !822, file: !59, line: 79, baseType: !88, size: 8, offset: 1048)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !822, file: !59, line: 81, baseType: !92, size: 64, offset: 1088)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !822, file: !59, line: 89, baseType: !95, size: 64, offset: 1152)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !822, file: !59, line: 91, baseType: !97, size: 64, offset: 1216)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !822, file: !59, line: 92, baseType: !100, size: 64, offset: 1280)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !822, file: !59, line: 93, baseType: !821, size: 64, offset: 1344)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !822, file: !59, line: 94, baseType: !104, size: 64, offset: 1408)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !822, file: !59, line: 95, baseType: !106, size: 64, offset: 1472)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !822, file: !59, line: 96, baseType: !51, size: 32, offset: 1536)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !822, file: !59, line: 98, baseType: !111, size: 160, offset: 1568)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !52, retainedTypes: !855, nameTableKind: None)
!854 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!855 = !{!856}
!856 = !DISubprogram(name: "setlocale_null_r", scope: !857, file: !857, line: 64, type: !858, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!857 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!858 = !DISubroutineType(types: !859)
!859 = !{!51, !51, !47, !108}
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !862, retainedTypes: !1249, nameTableKind: None)
!861 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!862 = !{!863}
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !864, line: 41, baseType: !7, size: 32, elements: !865)
!864 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248}
!866 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!867 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!868 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!869 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!870 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!871 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!872 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!873 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!874 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!875 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!876 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!877 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!878 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!879 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!880 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!881 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!882 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!883 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!884 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!885 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!886 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!887 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!888 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!889 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!890 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!891 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!892 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!893 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!894 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!895 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!896 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!897 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!898 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!899 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!900 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!901 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!902 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!903 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!904 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!905 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!906 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!907 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!908 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!909 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!910 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!911 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!912 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!913 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!914 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!915 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
