source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION] [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [137 x i8] c"Synchronize cached writes to persistent storage\0A\0AIf one or more files are specified, sync only them,\0Aor their containing file systems.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 48, type: !162, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !161, nameTableKind: None)
!3 = !DIFile(filename: "src/sync.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sync_mode", file: !3, line: 40, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODE_FILE", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "MODE_DATA", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "MODE_FILE_SYSTEM", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "MODE_SYNC", value: 3, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 32, baseType: !6, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!26 = !{!27, !37, !98, !102, !106, !109, !112, !119, !31, !88, !134, !138, !142, !144, !148, !151, !155, !158, !159, !160}
!27 = !DISubprogram(name: "dcgettext", scope: !28, file: !28, line: 51, type: !29, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!28 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !33, !33, !35}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !{}
!37 = !DISubprogram(name: "fputs_unlocked", scope: !38, file: !38, line: 662, type: !39, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!35, !33, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !44)
!43 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !60, !61, !62, !63, !67, !69, !71, !75, !78, !80, !83, !86, !87, !89, !93, !94}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !43, line: 51, baseType: !35, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !42, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !42, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !42, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !42, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !42, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !42, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !42, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !42, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !42, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !42, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !42, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !42, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !43, line: 36, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !42, file: !43, line: 70, baseType: !41, size: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !42, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !42, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !42, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 152, baseType: !66)
!65 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !42, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !42, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!70 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !42, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !42, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !43, line: 43, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !65, line: 153, baseType: !66)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !42, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !43, line: 37, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !42, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !43, line: 38, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !42, file: !43, line: 93, baseType: !41, size: 64, offset: 1344)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !42, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !42, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!92 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !42, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !42, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 20)
!98 = !DISubprogram(name: "set_program_name", scope: !99, file: !99, line: 37, type: !100, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!99 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!100 = !DISubroutineType(types: !101)
!101 = !{null, !33}
!102 = !DISubprogram(name: "setlocale", scope: !103, file: !103, line: 122, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!103 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!104 = !DISubroutineType(types: !105)
!105 = !{!31, !35, !33}
!106 = !DISubprogram(name: "bindtextdomain", scope: !28, file: !28, line: 86, type: !107, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!107 = !DISubroutineType(types: !108)
!108 = !{!31, !33, !33}
!109 = !DISubprogram(name: "textdomain", scope: !28, file: !28, line: 82, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!110 = !DISubroutineType(types: !111)
!111 = !{!31, !33}
!112 = !DISubprogram(name: "atexit", scope: !113, file: !113, line: 595, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!113 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!114 = !DISubroutineType(types: !115)
!115 = !{!35, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null}
!119 = !DISubprogram(name: "getopt_long", scope: !120, file: !120, line: 66, type: !121, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!120 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!121 = !DISubroutineType(types: !122)
!122 = !{!35, !35, !123, !33, !125, !132}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !120, line: 50, size: 256, elements: !128)
!128 = !{!129, !130, !131, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !120, line: 52, baseType: !33, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !127, file: !120, line: 55, baseType: !35, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !127, file: !120, line: 56, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !127, file: !120, line: 57, baseType: !35, size: 32, offset: 192)
!134 = !DISubprogram(name: "version_etc", scope: !135, file: !135, line: 69, type: !136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!135 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !DISubroutineType(types: !137)
!137 = !{null, !41, !33, !33, !33, null}
!138 = !DISubprogram(name: "error", scope: !139, file: !139, line: 52, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!139 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !DISubroutineType(types: !141)
!141 = !{null, !35, !35, !33, null}
!142 = !DISubprogram(name: "sync", scope: !143, file: !143, line: 970, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!143 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!144 = !DISubprogram(name: "open", scope: !145, file: !145, line: 196, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!145 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!146 = !DISubroutineType(types: !147)
!147 = !{!35, !33, !35, null}
!148 = !DISubprogram(name: "quotearg_style", scope: !13, file: !13, line: 377, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!149 = !DISubroutineType(types: !150)
!150 = !{!31, !12, !33}
!151 = !DISubprogram(name: "rpl_fcntl", scope: !152, file: !152, line: 588, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!152 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{!35, !35, !35, null}
!155 = !DISubprogram(name: "fdatasync", scope: !143, file: !143, line: 1115, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!156 = !DISubroutineType(types: !157)
!157 = !{!35, !35}
!158 = !DISubprogram(name: "fsync", scope: !143, file: !143, line: 954, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!159 = !DISubprogram(name: "syncfs", scope: !143, file: !143, line: 960, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!160 = !DISubprogram(name: "close", scope: !143, file: !143, line: 353, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!161 = !{!0}
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1280, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 5)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "Version", scope: !167, file: !168, line: 2, type: !33, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, globals: !169, nameTableKind: None)
!168 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !{!165}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "file_name", scope: !172, file: !173, line: 46, type: !33, isLocal: true, isDefinition: true)
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !174, globals: !212, nameTableKind: None)
!173 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!174 = !{!175, !27, !211, !138}
!175 = !DISubprogram(name: "close_stream", scope: !176, file: !176, line: 2, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!176 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !DISubroutineType(types: !178)
!178 = !{!35, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !180, file: !43, line: 51, baseType: !35, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !180, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !180, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !180, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !180, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !180, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !180, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !180, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !180, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !180, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !180, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !180, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !180, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !180, file: !43, line: 70, baseType: !179, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !180, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !180, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !180, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !180, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !180, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !180, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !180, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !180, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !180, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !180, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !180, file: !43, line: 93, baseType: !179, size: 64, offset: 1344)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !180, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !180, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !180, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !180, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!211 = !DISubprogram(name: "quotearg_colon", scope: !13, file: !13, line: 391, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!212 = !{!170, !213}
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !172, file: !173, line: 56, type: !215, isLocal: true, isDefinition: true)
!215 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "exit_failure", scope: !218, file: !219, line: 24, type: !221, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, globals: !220, nameTableKind: None)
!219 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !{!216}
!221 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "program_name", scope: !224, file: !225, line: 33, type: !33, isDefinition: true)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !226, globals: !262, nameTableKind: None)
!225 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!226 = !{!88, !227, !31}
!227 = !DISubprogram(name: "fputs", scope: !38, file: !38, line: 626, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!228 = !DISubroutineType(types: !229)
!229 = !{!35, !33, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !231, file: !43, line: 51, baseType: !35, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !231, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !231, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !231, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !231, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !231, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !231, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !231, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !231, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !231, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !231, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !231, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !231, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !231, file: !43, line: 70, baseType: !230, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !231, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !231, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !231, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !231, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !231, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !231, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !231, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !231, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !231, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !231, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !231, file: !43, line: 93, baseType: !230, size: 64, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !231, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !231, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !231, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !231, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!262 = !{!222}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !265, file: !266, line: 85, type: !386, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !267, retainedTypes: !288, globals: !359, nameTableKind: None)
!266 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!267 = !{!12, !268, !273}
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !6, size: 32, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!271 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!272 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !274, line: 46, baseType: !6, size: 32, elements: !275)
!274 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!276 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!277 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!278 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!279 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!280 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!281 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!282 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!283 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!284 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!288 = !{!289, !295, !311, !314, !35, !68, !317, !90, !334, !338, !27, !344, !348, !31, !352, !355, !356}
!289 = !DISubprogram(name: "xmemdup", scope: !290, file: !290, line: 62, type: !291, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!290 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!291 = !DISubroutineType(types: !292)
!292 = !{!88, !293, !92}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!295 = !DISubprogram(name: "quotearg_alloc_mem", scope: !13, file: !13, line: 342, type: !296, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!296 = !DISubroutineType(types: !297)
!297 = !{!31, !33, !92, !298, !299}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !266, line: 65, size: 448, elements: !302)
!302 = !{!303, !304, !305, !309, !310}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !301, file: !266, line: 68, baseType: !12, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !301, file: !266, line: 71, baseType: !35, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !301, file: !266, line: 75, baseType: !306, size: 256, offset: 64)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 8)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !301, file: !266, line: 78, baseType: !33, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !301, file: !266, line: 81, baseType: !33, size: 64, offset: 384)
!311 = !DISubprogram(name: "free", scope: !113, file: !113, line: 565, type: !312, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !88}
!314 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !13, file: !13, line: 408, type: !315, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!315 = !DISubroutineType(types: !316)
!316 = !{!31, !35, !33, !33, !33, !92}
!317 = !DISubprogram(name: "rpl_mbrtowc", scope: !318, file: !318, line: 717, type: !319, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!318 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !DISubroutineType(types: !320)
!320 = !{!92, !132, !33, !92, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 13, size: 64, elements: !324)
!323 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !322, file: !323, line: 15, baseType: !35, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !322, file: !323, line: 20, baseType: !327, size: 32, offset: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !322, file: !323, line: 16, size: 32, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !327, file: !323, line: 18, baseType: !6, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !327, file: !323, line: 19, baseType: !331, size: 32)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 4)
!334 = !DISubprogram(name: "iswprint", scope: !335, file: !335, line: 120, type: !336, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!335 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!336 = !DISubroutineType(types: !337)
!337 = !{!35, !6}
!338 = !DISubprogram(name: "mbsinit", scope: !339, file: !339, line: 292, type: !340, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!339 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!340 = !DISubroutineType(types: !341)
!341 = !{!35, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!344 = !DISubprogram(name: "locale_charset", scope: !345, file: !345, line: 35, type: !346, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!345 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!346 = !DISubroutineType(types: !347)
!347 = !{!33}
!348 = !DISubprogram(name: "c_strcasecmp", scope: !349, file: !349, line: 42, type: !350, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!349 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !DISubroutineType(types: !351)
!351 = !{!35, !33, !33}
!352 = !DISubprogram(name: "xmalloc", scope: !290, file: !290, line: 53, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!353 = !DISubroutineType(types: !354)
!354 = !{!88, !92}
!355 = !DISubprogram(name: "xalloc_die", scope: !290, file: !290, line: 51, type: !117, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !36)
!356 = !DISubprogram(name: "xrealloc", scope: !290, file: !290, line: 59, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!357 = !DISubroutineType(types: !358)
!358 = !{!88, !88, !92}
!359 = !{!263, !360, !366, !368, !370, !375, !382, !384}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !265, file: !266, line: 101, type: !362, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 320, elements: !364)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!364 = !{!365}
!365 = !DISubrange(count: 10)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !265, file: !266, line: 1052, type: !301, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !265, file: !266, line: 116, type: !301, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "slot0", scope: !265, file: !266, line: 842, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 256)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "slotvec", scope: !265, file: !266, line: 845, type: !377, isLocal: true, isDefinition: true)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !266, line: 834, size: 128, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !378, file: !266, line: 836, baseType: !90, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !378, file: !266, line: 837, baseType: !31, size: 64, offset: 64)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "nslots", scope: !265, file: !266, line: 843, type: !35, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "slotvec0", scope: !265, file: !266, line: 844, type: !378, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 704, elements: !388)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!388 = !{!389}
!389 = !DISubrange(count: 11)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !392, file: !393, line: 26, type: !395, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, globals: !394, nameTableKind: None)
!393 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!394 = !{!390}
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 376, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 47)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !400, file: !401, line: 507, type: !35, isLocal: true, isDefinition: true)
!400 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !401, file: !401, line: 488, type: !402, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !408)
!401 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!402 = !DISubroutineType(types: !403)
!403 = !{!35, !35, !35}
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !405, globals: !407, nameTableKind: None)
!405 = !{!406, !160}
!406 = !DISubprogram(name: "fcntl", scope: !145, file: !145, line: 176, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!407 = !{!398}
!408 = !{!409, !410, !411, !412, !415}
!409 = !DILocalVariable(name: "fd", arg: 1, scope: !400, file: !401, line: 488, type: !35)
!410 = !DILocalVariable(name: "target", arg: 2, scope: !400, file: !401, line: 488, type: !35)
!411 = !DILocalVariable(name: "result", scope: !400, file: !401, line: 490, type: !35)
!412 = !DILocalVariable(name: "flags", scope: !413, file: !401, line: 531, type: !35)
!413 = distinct !DILexicalBlock(scope: !414, file: !401, line: 530, column: 5)
!414 = distinct !DILexicalBlock(scope: !400, file: !401, line: 529, column: 7)
!415 = !DILocalVariable(name: "saved_errno", scope: !416, file: !401, line: 534, type: !35)
!416 = distinct !DILexicalBlock(scope: !417, file: !401, line: 533, column: 9)
!417 = distinct !DILexicalBlock(scope: !413, file: !401, line: 532, column: 11)
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !420, retainedTypes: !424, nameTableKind: None)
!419 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!420 = !{!421}
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !419, line: 40, baseType: !6, size: 32, elements: !422)
!422 = !{!423}
!423 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!424 = !{!27, !425, !88}
!425 = !DISubprogram(name: "fputs_unlocked", scope: !38, file: !38, line: 662, type: !426, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!426 = !DISubroutineType(types: !427)
!427 = !{!35, !33, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !429, file: !43, line: 51, baseType: !35, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !429, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !429, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !429, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !429, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !429, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !429, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !429, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !429, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !429, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !429, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !429, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !429, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !429, file: !43, line: 70, baseType: !428, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !429, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !429, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !429, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !429, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !429, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !429, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !429, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !429, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !429, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !429, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !429, file: !43, line: 93, baseType: !428, size: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !429, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !429, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !429, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !429, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !462, retainedTypes: !475, nameTableKind: None)
!461 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!462 = !{!463}
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !464, file: !290, line: 186, baseType: !6, size: 32, elements: !473)
!464 = distinct !DISubprogram(name: "x2nrealloc", scope: !290, file: !290, line: 174, type: !465, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !460, retainedNodes: !468)
!465 = !DISubroutineType(types: !466)
!466 = !{!88, !88, !467, !90}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!468 = !{!469, !470, !471, !472}
!469 = !DILocalVariable(name: "p", arg: 1, scope: !464, file: !290, line: 174, type: !88)
!470 = !DILocalVariable(name: "pn", arg: 2, scope: !464, file: !290, line: 174, type: !467)
!471 = !DILocalVariable(name: "s", arg: 3, scope: !464, file: !290, line: 174, type: !90)
!472 = !DILocalVariable(name: "n", scope: !464, file: !290, line: 176, type: !90)
!473 = !{!474}
!474 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!475 = !{!90, !355, !352, !356, !31, !311, !88, !476, !479}
!476 = !DISubprogram(name: "xcalloc", scope: !290, file: !290, line: 57, type: !477, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!477 = !DISubroutineType(types: !478)
!478 = !{!88, !92, !92}
!479 = !DISubprogram(name: "rpl_calloc", scope: !480, file: !480, line: 688, type: !477, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!480 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !483, nameTableKind: None)
!482 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!483 = !{!27, !138}
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !486, nameTableKind: None)
!485 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!486 = !{!88}
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !489, nameTableKind: None)
!488 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!489 = !{!490, !90, !502}
!490 = !DISubprogram(name: "mbrtowc", scope: !339, file: !339, line: 296, type: !491, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!491 = !DISubroutineType(types: !492)
!492 = !{!92, !132, !33, !92, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 13, size: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !494, file: !323, line: 15, baseType: !35, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !494, file: !323, line: 20, baseType: !498, size: 32, offset: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !494, file: !323, line: 16, size: 32, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !498, file: !323, line: 18, baseType: !6, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !498, file: !323, line: 19, baseType: !331, size: 32)
!502 = !DISubprogram(name: "hard_locale", scope: !503, file: !503, line: 26, type: !504, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!503 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !DISubroutineType(types: !505)
!505 = !{!215, !35}
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !508, nameTableKind: None)
!507 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !{!509}
!509 = !DISubprogram(name: "rpl_fclose", scope: !510, file: !510, line: 672, type: !511, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!510 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !DISubroutineType(types: !512)
!512 = !{!35, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !514, file: !43, line: 51, baseType: !35, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !514, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !514, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !514, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !514, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !514, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !514, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !514, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !514, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !514, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !514, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !514, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !514, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !514, file: !43, line: 70, baseType: !513, size: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !514, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !514, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !514, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !514, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !514, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !514, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !514, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !514, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !514, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !514, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !514, file: !43, line: 93, baseType: !513, size: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !514, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !514, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !514, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !514, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !547, nameTableKind: None)
!546 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = !{!548}
!548 = !DISubprogram(name: "setlocale_null_r", scope: !549, file: !549, line: 64, type: !550, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!549 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!550 = !DISubroutineType(types: !551)
!551 = !{!35, !35, !31, !92}
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !554, retainedTypes: !941, nameTableKind: None)
!553 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!555}
!555 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !556, line: 41, baseType: !6, size: 32, elements: !557)
!556 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!558 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!559 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!560 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!561 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!562 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!563 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!564 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!565 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!566 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!567 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!568 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!569 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!570 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!571 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!572 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!573 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!574 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!575 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!576 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!577 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!578 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!579 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!580 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!581 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!582 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!583 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!584 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!585 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!586 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!587 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!588 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!589 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!590 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!591 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!592 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!593 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!594 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!595 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!596 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!597 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!598 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!599 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!600 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!601 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!602 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!603 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!604 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!605 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!606 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!607 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!666 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!669 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!670 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!671 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!672 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!673 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!674 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!675 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!676 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!677 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!678 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!679 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!680 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!753 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!826 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!827 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!828 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!829 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!830 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!831 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!832 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!833 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!834 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!835 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!836 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!837 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!838 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!839 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!840 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!842 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!843 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!844 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!845 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!846 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!847 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!873 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!874 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!875 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!876 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!877 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!882 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!883 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!884 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!885 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!941 = !{!942, !88}
!942 = !DISubprogram(name: "nl_langinfo", scope: !556, file: !556, line: 661, type: !943, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!943 = !DISubroutineType(types: !944)
!944 = !{!31, !35}
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !947, nameTableKind: None)
!946 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!947 = !{!88, !102}
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !950, nameTableKind: None)
!949 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!950 = !{!951, !986, !987, !990}
!951 = !DISubprogram(name: "fileno", scope: !38, file: !38, line: 786, type: !952, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!952 = !DISubroutineType(types: !953)
!953 = !{!35, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !955, file: !43, line: 51, baseType: !35, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !955, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !955, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !955, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !955, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !955, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !955, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !955, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !955, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !955, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !955, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !955, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !955, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !955, file: !43, line: 70, baseType: !954, size: 64, offset: 832)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !955, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !955, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !955, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !955, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !955, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !955, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !955, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !955, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !955, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !955, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !955, file: !43, line: 93, baseType: !954, size: 64, offset: 1344)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !955, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !955, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !955, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !955, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!986 = !DISubprogram(name: "fclose", scope: !38, file: !38, line: 213, type: !952, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!987 = !DISubprogram(name: "lseek", scope: !143, file: !143, line: 334, type: !988, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!988 = !DISubroutineType(types: !989)
!989 = !{!66, !35, !66, !35}
!990 = !DISubprogram(name: "rpl_fflush", scope: !510, file: !510, line: 718, type: !952, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !993, nameTableKind: None)
!992 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!993 = !{!88, !994, !1029}
!994 = !DISubprogram(name: "fflush", scope: !38, file: !38, line: 218, type: !995, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!995 = !DISubroutineType(types: !996)
!996 = !{!35, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !998, file: !43, line: 51, baseType: !35, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !998, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !998, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !998, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !998, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !998, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !998, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !998, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !998, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !998, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !998, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !998, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !998, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !998, file: !43, line: 70, baseType: !997, size: 64, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !998, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
