source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.bin_tree_storage_t = type { %struct.bin_tree_storage_t*, [15 x %struct.bin_tree_t] }
%struct.bin_tree_t = type { %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.re_token_t, i64 }
%struct.bracket_elem_t = type { i32, %union.anon.1 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.re_backref_cache_entry = type { i64, i64, i64, i64, i64, i8 }
%struct.re_charset_t = type { i32*, i32*, i32*, i64*, i8, i64, i64, i64, i64, i64 }

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !23, !24, !28, !26, !31}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 46, baseType: !30)
!29 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33, !0, !55, !57, !59, !61, !63, !65, !67, !91, !96, !110, !183, !185, !198, !217, !219}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "default_file_list", scope: !35, file: !3, line: 612, type: !52, isLocal: true, isDefinition: true)
!35 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 603, type: !36, scopeLine: 604, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !40)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !38, !39}
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!40 = !{!41, !42, !43, !44, !45, !47, !48, !49}
!41 = !DILocalVariable(name: "argc", arg: 1, scope: !35, file: !3, line: 603, type: !38)
!42 = !DILocalVariable(name: "argv", arg: 2, scope: !35, file: !3, line: 603, type: !39)
!43 = !DILocalVariable(name: "error_message", scope: !35, file: !3, line: 605, type: !26)
!44 = !DILocalVariable(name: "optc", scope: !35, file: !3, line: 606, type: !38)
!45 = !DILocalVariable(name: "ok", scope: !35, file: !3, line: 607, type: !46)
!46 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!47 = !DILocalVariable(name: "half_buffer_size", scope: !35, file: !3, line: 608, type: !28)
!48 = !DILocalVariable(name: "file", scope: !35, file: !3, line: 613, type: !24)
!49 = !DILocalVariable(name: "i", scope: !50, file: !3, line: 694, type: !28)
!50 = distinct !DILexicalBlock(scope: !51, file: !3, line: 694, column: 5)
!51 = distinct !DILexicalBlock(scope: !35, file: !3, line: 692, column: 3)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 2)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "separator_ends_record", scope: !2, file: !3, line: 87, type: !46, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "sentinel_length", scope: !2, file: !3, line: 92, type: !28, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "match_length", scope: !2, file: !3, line: 97, type: !28, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "G_buffer", scope: !2, file: !3, line: 100, type: !21, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "read_size", scope: !2, file: !3, line: 103, type: !28, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "G_buffer_size", scope: !2, file: !3, line: 108, type: !28, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "compiled_separator", scope: !2, file: !3, line: 111, type: !69, isLocal: true, isDefinition: true)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !70, line: 413, size: 512, elements: !71)
!70 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!71 = !{!72, !75, !77, !78, !80, !81, !83, !84, !85, !86, !87, !88, !89, !90}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !69, file: !70, line: 417, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !70, line: 417, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !69, file: !70, line: 420, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !70, line: 49, baseType: !28)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !69, file: !70, line: 423, baseType: !76, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !69, file: !70, line: 426, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !70, line: 72, baseType: !30)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !69, file: !70, line: 431, baseType: !21, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !69, file: !70, line: 437, baseType: !82, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !69, file: !70, line: 440, baseType: !28, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !69, file: !70, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !69, file: !70, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !69, file: !70, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !69, file: !70, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !69, file: !70, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !69, file: !70, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !69, file: !70, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "compiled_separator_fastmap", scope: !2, file: !3, line: 112, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 256)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 115, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 1536, elements: !108)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !101, line: 50, size: 256, elements: !102)
!101 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!102 = !{!103, !104, !105, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !101, line: 52, baseType: !26, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !100, file: !101, line: 55, baseType: !38, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !100, file: !101, line: 56, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !100, file: !101, line: 57, baseType: !38, size: 32, offset: 192)
!108 = !{!109}
!109 = !DISubrange(count: 6)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "tempfile", scope: !112, file: !3, line: 433, type: !21, isLocal: true, isDefinition: true)
!112 = distinct !DISubprogram(name: "temp_stream", scope: !3, file: !3, line: 431, type: !113, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !172)
!113 = !DISubroutineType(types: !114)
!114 = !{!46, !115, !39}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !118, line: 7, baseType: !119)
!118 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !120, line: 49, size: 1728, elements: !121)
!120 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !137, !139, !140, !141, !145, !147, !149, !153, !156, !158, !161, !164, !165, !166, !167, !168}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !119, file: !120, line: 51, baseType: !38, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !119, file: !120, line: 54, baseType: !21, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !119, file: !120, line: 55, baseType: !21, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !119, file: !120, line: 56, baseType: !21, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !119, file: !120, line: 57, baseType: !21, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !119, file: !120, line: 58, baseType: !21, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !119, file: !120, line: 59, baseType: !21, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !119, file: !120, line: 60, baseType: !21, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !119, file: !120, line: 61, baseType: !21, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !119, file: !120, line: 64, baseType: !21, size: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !119, file: !120, line: 65, baseType: !21, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !119, file: !120, line: 66, baseType: !21, size: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !119, file: !120, line: 68, baseType: !135, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !120, line: 36, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !119, file: !120, line: 70, baseType: !138, size: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !119, file: !120, line: 72, baseType: !38, size: 32, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !119, file: !120, line: 73, baseType: !38, size: 32, offset: 928)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !119, file: !120, line: 74, baseType: !142, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !143, line: 152, baseType: !144)
!143 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!144 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !119, file: !120, line: 77, baseType: !146, size: 16, offset: 1024)
!146 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !119, file: !120, line: 78, baseType: !148, size: 8, offset: 1040)
!148 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !119, file: !120, line: 79, baseType: !150, size: 8, offset: 1048)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !119, file: !120, line: 81, baseType: !154, size: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !120, line: 43, baseType: null)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !119, file: !120, line: 89, baseType: !157, size: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !143, line: 153, baseType: !144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !119, file: !120, line: 91, baseType: !159, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !120, line: 37, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !119, file: !120, line: 92, baseType: !162, size: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !120, line: 38, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !119, file: !120, line: 93, baseType: !138, size: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !119, file: !120, line: 94, baseType: !23, size: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !119, file: !120, line: 95, baseType: !28, size: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !119, file: !120, line: 96, baseType: !38, size: 32, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !119, file: !120, line: 98, baseType: !169, size: 160, offset: 1568)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 20)
!172 = !{!173, !174, !175, !178, !179, !180}
!173 = !DILocalVariable(name: "fp", arg: 1, scope: !112, file: !3, line: 431, type: !115)
!174 = !DILocalVariable(name: "file_name", arg: 2, scope: !112, file: !3, line: 431, type: !39)
!175 = !DILocalVariable(name: "t", scope: !176, file: !3, line: 437, type: !26)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 436, column: 5)
!177 = distinct !DILexicalBlock(scope: !112, file: !3, line: 435, column: 7)
!178 = !DILocalVariable(name: "tempdir", scope: !176, file: !3, line: 438, type: !26)
!179 = !DILocalVariable(name: "fd", scope: !176, file: !3, line: 455, type: !38)
!180 = !DILabel(scope: !181, name: "Reset", file: !3, line: 470)
!181 = distinct !DILexicalBlock(scope: !182, file: !3, line: 465, column: 9)
!182 = distinct !DILexicalBlock(scope: !176, file: !3, line: 464, column: 11)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !112, file: !3, line: 434, type: !116, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "regs", scope: !2, file: !3, line: 113, type: !187, isLocal: true, isDefinition: true)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !70, line: 497, size: 192, elements: !188)
!188 = !{!189, !191, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !187, file: !70, line: 499, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !70, line: 45, baseType: !28)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !187, file: !70, line: 500, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !70, line: 486, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !195, line: 77, baseType: !196)
!195 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !143, line: 194, baseType: !144)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !187, file: !70, line: 501, baseType: !192, size: 64, offset: 128)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "buffer", scope: !200, file: !3, line: 161, type: !214, isLocal: true, isDefinition: true)
!200 = distinct !DISubprogram(name: "output", scope: !3, file: !3, line: 159, type: !201, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !203)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !26, !26}
!203 = !{!204, !205, !206, !207, !208, !212, !213}
!204 = !DILocalVariable(name: "start", arg: 1, scope: !200, file: !3, line: 159, type: !26)
!205 = !DILocalVariable(name: "past_end", arg: 2, scope: !200, file: !3, line: 159, type: !26)
!206 = !DILocalVariable(name: "bytes_to_add", scope: !200, file: !3, line: 163, type: !28)
!207 = !DILocalVariable(name: "bytes_available", scope: !200, file: !3, line: 164, type: !28)
!208 = !DILocalVariable(name: "__ptr", scope: !209, file: !3, line: 168, type: !26)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 168, column: 7)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 167, column: 5)
!211 = distinct !DILexicalBlock(scope: !200, file: !3, line: 166, column: 7)
!212 = !DILocalVariable(name: "__stream", scope: !209, file: !3, line: 168, type: !116)
!213 = !DILocalVariable(name: "__cnt", scope: !209, file: !3, line: 168, type: !28)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 65536, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 8192)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "bytes_in_buffer", scope: !200, file: !3, line: 162, type: !28, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 83, type: !46, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!222 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "Version", scope: !225, file: !226, line: 2, type: !26, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !227, globals: !228, nameTableKind: None)
!226 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!227 = !{}
!228 = !{!223}
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "file_name", scope: !231, file: !232, line: 46, type: !26, isLocal: true, isDefinition: true)
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !227, globals: !233, nameTableKind: None)
!232 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!233 = !{!229, !234}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !231, file: !232, line: 56, type: !46, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "exit_failure", scope: !238, file: !239, line: 24, type: !241, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !227, globals: !240, nameTableKind: None)
!239 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !{!236}
!241 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "program_name", scope: !244, file: !245, line: 33, type: !26, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !227, retainedTypes: !246, globals: !247, nameTableKind: None)
!245 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !{!23, !21}
!247 = !{!242}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !250, file: !251, line: 85, type: !308, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !252, retainedTypes: !273, globals: !274, nameTableKind: None)
!251 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = !{!5, !253, !258}
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!256 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!257 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !259, line: 46, baseType: !7, size: 32, elements: !260)
!259 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!261 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!262 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!263 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!264 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!265 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!266 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!267 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!268 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!269 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!272 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!273 = !{!38, !146, !28, !21}
!274 = !{!248, !275, !281, !293, !295, !297, !304, !306}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !250, file: !251, line: 101, type: !277, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 320, elements: !279)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!279 = !{!280}
!280 = !DISubrange(count: 10)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !250, file: !251, line: 1052, type: !283, isDefinition: true)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !251, line: 65, size: 448, elements: !284)
!284 = !{!285, !286, !287, !291, !292}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !283, file: !251, line: 68, baseType: !5, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !283, file: !251, line: 71, baseType: !38, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !283, file: !251, line: 75, baseType: !288, size: 256, offset: 64)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 8)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !283, file: !251, line: 78, baseType: !26, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !283, file: !251, line: 81, baseType: !26, size: 64, offset: 384)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !250, file: !251, line: 116, type: !283, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "slot0", scope: !250, file: !251, line: 842, type: !93, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "slotvec", scope: !250, file: !251, line: 845, type: !299, isLocal: true, isDefinition: true)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !251, line: 834, size: 128, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !300, file: !251, line: 836, baseType: !28, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !300, file: !251, line: 837, baseType: !21, size: 64, offset: 64)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "nslots", scope: !250, file: !251, line: 843, type: !38, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "slotvec0", scope: !250, file: !251, line: 844, type: !300, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 704, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 11)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !313, file: !314, line: 26, type: !316, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !227, globals: !315, nameTableKind: None)
!314 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!315 = !{!311}
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 376, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 47)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "rpl_re_syntax_options", scope: !321, file: !1054, line: 243, type: !79, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !323, retainedTypes: !786, globals: !1051, nameTableKind: None)
!322 = !DIFile(filename: "lib/regex.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = !{!324, !337, !373, !393, !258, !779}
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 206, baseType: !7, size: 32, elements: !326)
!325 = !DIFile(filename: "./lib/regex_internal.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!327 = !DIEnumerator(name: "INSIDE_WORD", value: 5, isUnsigned: true)
!328 = !DIEnumerator(name: "WORD_FIRST", value: 6, isUnsigned: true)
!329 = !DIEnumerator(name: "WORD_LAST", value: 9, isUnsigned: true)
!330 = !DIEnumerator(name: "INSIDE_NOTWORD", value: 10, isUnsigned: true)
!331 = !DIEnumerator(name: "LINE_FIRST", value: 16, isUnsigned: true)
!332 = !DIEnumerator(name: "LINE_LAST", value: 32, isUnsigned: true)
!333 = !DIEnumerator(name: "BUF_FIRST", value: 64, isUnsigned: true)
!334 = !DIEnumerator(name: "BUF_LAST", value: 128, isUnsigned: true)
!335 = !DIEnumerator(name: "WORD_DELIM", value: 256, isUnsigned: true)
!336 = !DIEnumerator(name: "NOT_WORD_DELIM", value: 512, isUnsigned: true)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 227, baseType: !7, size: 32, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!339 = !DIEnumerator(name: "NON_TYPE", value: 0, isUnsigned: true)
!340 = !DIEnumerator(name: "CHARACTER", value: 1, isUnsigned: true)
!341 = !DIEnumerator(name: "END_OF_RE", value: 2, isUnsigned: true)
!342 = !DIEnumerator(name: "SIMPLE_BRACKET", value: 3, isUnsigned: true)
!343 = !DIEnumerator(name: "OP_BACK_REF", value: 4, isUnsigned: true)
!344 = !DIEnumerator(name: "OP_PERIOD", value: 5, isUnsigned: true)
!345 = !DIEnumerator(name: "COMPLEX_BRACKET", value: 6, isUnsigned: true)
!346 = !DIEnumerator(name: "OP_UTF8_PERIOD", value: 7, isUnsigned: true)
!347 = !DIEnumerator(name: "OP_OPEN_SUBEXP", value: 8, isUnsigned: true)
!348 = !DIEnumerator(name: "OP_CLOSE_SUBEXP", value: 9, isUnsigned: true)
!349 = !DIEnumerator(name: "OP_ALT", value: 10, isUnsigned: true)
!350 = !DIEnumerator(name: "OP_DUP_ASTERISK", value: 11, isUnsigned: true)
!351 = !DIEnumerator(name: "ANCHOR", value: 12, isUnsigned: true)
!352 = !DIEnumerator(name: "CONCAT", value: 16, isUnsigned: true)
!353 = !DIEnumerator(name: "SUBEXP", value: 17, isUnsigned: true)
!354 = !DIEnumerator(name: "OP_DUP_PLUS", value: 18, isUnsigned: true)
!355 = !DIEnumerator(name: "OP_DUP_QUESTION", value: 19, isUnsigned: true)
!356 = !DIEnumerator(name: "OP_OPEN_BRACKET", value: 20, isUnsigned: true)
!357 = !DIEnumerator(name: "OP_CLOSE_BRACKET", value: 21, isUnsigned: true)
!358 = !DIEnumerator(name: "OP_CHARSET_RANGE", value: 22, isUnsigned: true)
!359 = !DIEnumerator(name: "OP_OPEN_DUP_NUM", value: 23, isUnsigned: true)
!360 = !DIEnumerator(name: "OP_CLOSE_DUP_NUM", value: 24, isUnsigned: true)
!361 = !DIEnumerator(name: "OP_NON_MATCH_LIST", value: 25, isUnsigned: true)
!362 = !DIEnumerator(name: "OP_OPEN_COLL_ELEM", value: 26, isUnsigned: true)
!363 = !DIEnumerator(name: "OP_CLOSE_COLL_ELEM", value: 27, isUnsigned: true)
!364 = !DIEnumerator(name: "OP_OPEN_EQUIV_CLASS", value: 28, isUnsigned: true)
!365 = !DIEnumerator(name: "OP_CLOSE_EQUIV_CLASS", value: 29, isUnsigned: true)
!366 = !DIEnumerator(name: "OP_OPEN_CHAR_CLASS", value: 30, isUnsigned: true)
!367 = !DIEnumerator(name: "OP_CLOSE_CHAR_CLASS", value: 31, isUnsigned: true)
!368 = !DIEnumerator(name: "OP_WORD", value: 32, isUnsigned: true)
!369 = !DIEnumerator(name: "OP_NOTWORD", value: 33, isUnsigned: true)
!370 = !DIEnumerator(name: "OP_SPACE", value: 34, isUnsigned: true)
!371 = !DIEnumerator(name: "OP_NOTSPACE", value: 35, isUnsigned: true)
!372 = !DIEnumerator(name: "BACK_SLASH", value: 36, isUnsigned: true)
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 346, baseType: !38, size: 32, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!375 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!376 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!377 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!378 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!379 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!380 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!381 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!382 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!383 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!384 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!385 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!386 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!387 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!388 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!389 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!390 = !DIEnumerator(name: "_REG_EEND", value: 14)
!391 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!392 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 41, baseType: !7, size: 32, elements: !395)
!394 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!396 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!397 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!398 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!399 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!400 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!401 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!402 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!403 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!404 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!405 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!406 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!407 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!408 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!409 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!410 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!411 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!412 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!413 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!414 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!415 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!416 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!417 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!418 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!419 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!420 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!421 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!422 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!423 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!424 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!425 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!426 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!427 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!428 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!429 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!430 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!431 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!432 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!433 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!434 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!435 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!436 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!437 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!438 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!439 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!440 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!441 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!442 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!443 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!444 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!445 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!504 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!507 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!508 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!509 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!510 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!511 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!512 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!513 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!514 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!515 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!516 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!517 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!518 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!591 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!664 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!665 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!666 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!667 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!668 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!669 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!670 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!671 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!672 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!673 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!674 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!675 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!676 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!677 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!678 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!680 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!681 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!682 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!683 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!684 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!685 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!711 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!712 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!713 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!714 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!715 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!720 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!721 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!722 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!723 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 699, baseType: !7, size: 32, elements: !780)
!780 = !{!781, !782, !783, !784, !785}
!781 = !DIEnumerator(name: "SB_CHAR", value: 0, isUnsigned: true)
!782 = !DIEnumerator(name: "MB_CHAR", value: 1, isUnsigned: true)
!783 = !DIEnumerator(name: "EQUIV_CLASS", value: 2, isUnsigned: true)
!784 = !DIEnumerator(name: "COLL_SYM", value: 3, isUnsigned: true)
!785 = !DIEnumerator(name: "CHAR_CLASS", value: 4, isUnsigned: true)
!786 = !{!30, !38, !21, !23, !26, !28, !787, !82, !788, !793, !802, !929, !931, !842, !811, !146, !932, !899, !805, !810, !815, !934, !845, !936, !862, !861, !955, !961, !31, !190, !962, !971, !989, !997, !1044}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_word_t", file: !325, line: 182, baseType: !30)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfa_t", file: !325, line: 416, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !325, line: 645, size: 1856, elements: !791)
!791 = !{!792, !839, !840, !841, !843, !844, !852, !853, !854, !881, !882, !883, !884, !885, !898, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !927, !928}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !790, file: !325, line: 647, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_t", file: !325, line: 353, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 326, size: 128, elements: !796)
!796 = !{!797, !831, !833, !834, !835, !836, !837, !838}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "opr", scope: !795, file: !325, line: 337, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !795, file: !325, line: 328, size: 64, elements: !799)
!799 = !{!800, !801, !804, !828, !829}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !798, file: !325, line: 330, baseType: !31, size: 8)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sbcset", scope: !798, file: !325, line: 331, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_bitset_ptr_t", file: !325, line: 192, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mbcset", scope: !798, file: !325, line: 333, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_charset_t", file: !325, line: 323, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 279, size: 640, elements: !808)
!808 = !{!809, !812, !813, !814, !818, !819, !824, !825, !826, !827}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mbchars", scope: !807, file: !325, line: 282, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !29, line: 74, baseType: !38)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "range_starts", scope: !807, file: !325, line: 299, baseType: !810, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "range_ends", scope: !807, file: !325, line: 300, baseType: !810, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "char_classes", scope: !807, file: !325, line: 304, baseType: !815, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !817, line: 38, baseType: !30)
!817 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!818 = !DIDerivedType(tag: DW_TAG_member, name: "non_match", scope: !807, file: !325, line: 307, baseType: !7, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "nmbchars", scope: !807, file: !325, line: 310, baseType: !820, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "Idx", file: !325, line: 170, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !70, line: 486, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !823, line: 108, baseType: !196)
!823 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ncoll_syms", scope: !807, file: !325, line: 313, baseType: !820, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nequiv_classes", scope: !807, file: !325, line: 316, baseType: !820, size: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nranges", scope: !807, file: !325, line: 319, baseType: !820, size: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "nchar_classes", scope: !807, file: !325, line: 322, baseType: !820, size: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !798, file: !325, line: 335, baseType: !820, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_type", scope: !798, file: !325, line: 336, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_context_type", file: !325, line: 218, baseType: !324)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !795, file: !325, line: 339, baseType: !832, size: 8, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_type_t", file: !325, line: 276, baseType: !337)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "constraint", scope: !795, file: !325, line: 343, baseType: !7, size: 10, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "duplicated", scope: !795, file: !325, line: 344, baseType: !7, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "opt_subexp", scope: !795, file: !325, line: 345, baseType: !7, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mb", scope: !795, file: !325, line: 347, baseType: !7, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partial", scope: !795, file: !325, line: 350, baseType: !7, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "word_char", scope: !795, file: !325, line: 352, baseType: !7, size: 1, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "nodes_alloc", scope: !790, file: !325, line: 648, baseType: !28, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nodes_len", scope: !790, file: !325, line: 649, baseType: !28, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "nexts", scope: !790, file: !325, line: 650, baseType: !842, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "org_indices", scope: !790, file: !325, line: 651, baseType: !842, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "edests", scope: !790, file: !325, line: 652, baseType: !845, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_node_set", file: !325, line: 225, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 220, size: 192, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !847, file: !325, line: 222, baseType: !820, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !847, file: !325, line: 223, baseType: !820, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !847, file: !325, line: 224, baseType: !842, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "eclosures", scope: !790, file: !325, line: 653, baseType: !845, size: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "inveclosures", scope: !790, file: !325, line: 654, baseType: !845, size: 64, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "state_table", scope: !790, file: !325, line: 655, baseType: !855, size: 64, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_state_table_entry", file: !325, line: 549, size: 192, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !856, file: !325, line: 551, baseType: !820, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !856, file: !325, line: 552, baseType: !820, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !856, file: !325, line: 553, baseType: !861, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfastate_t", file: !325, line: 547, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfastate_t", file: !325, line: 529, size: 896, elements: !865)
!865 = !{!866, !868, !869, !870, !871, !872, !875, !876, !877, !878, !879, !880}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !864, file: !325, line: 531, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_hashval_t", file: !325, line: 178, baseType: !190)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !864, file: !325, line: 532, baseType: !846, size: 192, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "non_eps_nodes", scope: !864, file: !325, line: 533, baseType: !846, size: 192, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "inveclosure", scope: !864, file: !325, line: 534, baseType: !846, size: 192, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "entrance_nodes", scope: !864, file: !325, line: 535, baseType: !845, size: 64, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "trtable", scope: !864, file: !325, line: 536, baseType: !873, size: 64, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "word_trtable", scope: !864, file: !325, line: 536, baseType: !873, size: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !864, file: !325, line: 537, baseType: !7, size: 4, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "halt", scope: !864, file: !325, line: 538, baseType: !7, size: 1, offset: 836, flags: DIFlagBitField, extraData: i64 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mb", scope: !864, file: !325, line: 542, baseType: !7, size: 1, offset: 837, flags: DIFlagBitField, extraData: i64 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "has_backref", scope: !864, file: !325, line: 544, baseType: !7, size: 1, offset: 838, flags: DIFlagBitField, extraData: i64 832)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "has_constraint", scope: !864, file: !325, line: 545, baseType: !7, size: 1, offset: 839, flags: DIFlagBitField, extraData: i64 832)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !790, file: !325, line: 656, baseType: !862, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_word", scope: !790, file: !325, line: 657, baseType: !862, size: 64, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_nl", scope: !790, file: !325, line: 658, baseType: !862, size: 64, offset: 704)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_begbuf", scope: !790, file: !325, line: 659, baseType: !862, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree", scope: !790, file: !325, line: 660, baseType: !886, size: 64, offset: 832)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_tree_t", file: !325, line: 489, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_tree_t", file: !325, line: 475, size: 512, elements: !889)
!889 = !{!890, !892, !893, !894, !895, !896, !897}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !888, file: !325, line: 477, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !888, file: !325, line: 478, baseType: !891, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !888, file: !325, line: 479, baseType: !891, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !888, file: !325, line: 480, baseType: !891, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !888, file: !325, line: 481, baseType: !891, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !888, file: !325, line: 483, baseType: !794, size: 128, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "node_idx", scope: !888, file: !325, line: 487, baseType: !820, size: 64, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree_storage", scope: !790, file: !325, line: 661, baseType: !899, size: 64, offset: 896)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_tree_storage_t", file: !325, line: 499, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_tree_storage_t", file: !325, line: 494, size: 7744, elements: !902)
!902 = !{!903, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !325, line: 496, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !901, file: !325, line: 497, baseType: !906, size: 7680, offset: 64)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 7680, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 15)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sb_char", scope: !790, file: !325, line: 662, baseType: !802, size: 64, offset: 960)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree_storage_idx", scope: !790, file: !325, line: 663, baseType: !38, size: 32, offset: 1024)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "state_hash_mask", scope: !790, file: !325, line: 666, baseType: !867, size: 64, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "init_node", scope: !790, file: !325, line: 667, baseType: !820, size: 64, offset: 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nbackref", scope: !790, file: !325, line: 668, baseType: !820, size: 64, offset: 1216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "used_bkref_map", scope: !790, file: !325, line: 671, baseType: !787, size: 64, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "completed_bkref_map", scope: !790, file: !325, line: 672, baseType: !787, size: 64, offset: 1344)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "has_plural_match", scope: !790, file: !325, line: 674, baseType: !7, size: 1, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "has_mb_node", scope: !790, file: !325, line: 678, baseType: !7, size: 1, offset: 1409, flags: DIFlagBitField, extraData: i64 1408)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "is_utf8", scope: !790, file: !325, line: 679, baseType: !7, size: 1, offset: 1410, flags: DIFlagBitField, extraData: i64 1408)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "map_notascii", scope: !790, file: !325, line: 680, baseType: !7, size: 1, offset: 1411, flags: DIFlagBitField, extraData: i64 1408)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "word_ops_used", scope: !790, file: !325, line: 681, baseType: !7, size: 1, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !790, file: !325, line: 682, baseType: !38, size: 32, offset: 1440)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "word_char", scope: !790, file: !325, line: 683, baseType: !923, size: 256, offset: 1472)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_t", file: !325, line: 191, baseType: !924)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 256, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 4)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !790, file: !325, line: 684, baseType: !79, size: 64, offset: 1728)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_map", scope: !790, file: !325, line: 685, baseType: !842, size: 64, offset: 1792)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !933, line: 20, baseType: !7)
!933 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "")
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !935, line: 90, baseType: !30)
!935 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !70, line: 478, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !70, line: 413, size: 512, elements: !939)
!939 = !{!940, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !938, file: !70, line: 417, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !938, file: !70, line: 420, baseType: !76, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !938, file: !70, line: 423, baseType: !76, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !938, file: !70, line: 426, baseType: !79, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !938, file: !70, line: 431, baseType: !21, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !938, file: !70, line: 437, baseType: !82, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !938, file: !70, line: 440, baseType: !28, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !938, file: !70, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !938, file: !70, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !938, file: !70, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !938, file: !70, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !938, file: !70, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !938, file: !70, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !938, file: !70, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_t", file: !70, line: 521, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 517, size: 128, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rm_so", scope: !957, file: !70, line: 519, baseType: !821, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rm_eo", scope: !957, file: !70, line: 520, baseType: !821, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_backref_cache_entry", file: !325, line: 588, size: 384, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !963, file: !325, line: 590, baseType: !820, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !963, file: !325, line: 591, baseType: !820, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_from", scope: !963, file: !325, line: 592, baseType: !820, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_to", scope: !963, file: !325, line: 593, baseType: !820, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "eps_reachable_subexps_map", scope: !963, file: !325, line: 594, baseType: !787, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "more", scope: !963, file: !325, line: 595, baseType: !22, size: 8, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_sub_match_top_t", file: !325, line: 586, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 578, size: 384, elements: !975)
!975 = !{!976, !977, !978, !986, !987, !988}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !974, file: !325, line: 580, baseType: !820, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !974, file: !325, line: 581, baseType: !820, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !974, file: !325, line: 582, baseType: !979, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "state_array_t", file: !325, line: 563, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 558, size: 192, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next_idx", scope: !981, file: !325, line: 560, baseType: !820, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !981, file: !325, line: 561, baseType: !820, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !981, file: !325, line: 562, baseType: !861, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "alasts", scope: !974, file: !325, line: 583, baseType: !820, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "nlasts", scope: !974, file: !325, line: 584, baseType: !820, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lasts", scope: !974, file: !325, line: 585, baseType: !989, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_sub_match_last_t", file: !325, line: 572, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 567, size: 320, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !992, file: !325, line: 569, baseType: !820, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !992, file: !325, line: 570, baseType: !820, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !992, file: !325, line: 571, baseType: !980, size: 192, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dests_alloc", scope: !1000, file: !999, line: 3271, size: 114688, elements: !1039)
!999 = !DIFile(filename: "./lib/regexec.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1000 = distinct !DISubprogram(name: "build_trtable", scope: !999, file: !999, line: 3255, type: !1001, scopeLine: 3256, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !321, retainedNodes: !1005)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!46, !1003, !862}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!1005 = !{!1006, !1007, !1008, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1027, !1028, !1029, !1030, !1034}
!1006 = !DILocalVariable(name: "dfa", arg: 1, scope: !1000, file: !999, line: 3255, type: !1003)
!1007 = !DILocalVariable(name: "state", arg: 2, scope: !1000, file: !999, line: 3255, type: !862)
!1008 = !DILocalVariable(name: "err", scope: !1000, file: !999, line: 3257, type: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_errcode_t", file: !70, line: 371, baseType: !373)
!1010 = !DILocalVariable(name: "i", scope: !1000, file: !999, line: 3258, type: !820)
!1011 = !DILocalVariable(name: "j", scope: !1000, file: !999, line: 3258, type: !820)
!1012 = !DILocalVariable(name: "ch", scope: !1000, file: !999, line: 3259, type: !38)
!1013 = !DILocalVariable(name: "need_word_trtable", scope: !1000, file: !999, line: 3260, type: !46)
!1014 = !DILocalVariable(name: "elem", scope: !1000, file: !999, line: 3261, type: !787)
!1015 = !DILocalVariable(name: "mask", scope: !1000, file: !999, line: 3261, type: !787)
!1016 = !DILocalVariable(name: "dests_node_malloced", scope: !1000, file: !999, line: 3262, type: !46)
!1017 = !DILocalVariable(name: "dest_states_malloced", scope: !1000, file: !999, line: 3263, type: !46)
!1018 = !DILocalVariable(name: "ndests", scope: !1000, file: !999, line: 3264, type: !820)
!1019 = !DILocalVariable(name: "trtable", scope: !1000, file: !999, line: 3265, type: !861)
!1020 = !DILocalVariable(name: "dest_states", scope: !1000, file: !999, line: 3266, type: !861)
!1021 = !DILocalVariable(name: "dest_states_word", scope: !1000, file: !999, line: 3266, type: !861)
!1022 = !DILocalVariable(name: "dest_states_nl", scope: !1000, file: !999, line: 3266, type: !861)
!1023 = !DILocalVariable(name: "follows", scope: !1000, file: !999, line: 3267, type: !846)
!1024 = !DILocalVariable(name: "dests_node", scope: !1000, file: !999, line: 3267, type: !845)
!1025 = !DILocalVariable(name: "dests_ch", scope: !1000, file: !999, line: 3268, type: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!1027 = !DILocalVariable(name: "acceptable", scope: !1000, file: !999, line: 3269, type: !923)
!1028 = !DILocalVariable(name: "dests_alloc", scope: !1000, file: !999, line: 3275, type: !997)
!1029 = !DILocalVariable(name: "ndests_max", scope: !1000, file: !999, line: 3320, type: !28)
!1030 = !DILocalVariable(name: "next_node", scope: !1031, file: !999, line: 3354, type: !820)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !999, line: 3353, column: 5)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !999, line: 3352, column: 3)
!1033 = distinct !DILexicalBlock(scope: !1000, file: !999, line: 3352, column: 3)
!1034 = !DILabel(scope: !1035, name: "out_free", file: !999, line: 3335)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !999, line: 3334, column: 2)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !999, line: 3333, column: 11)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !999, line: 3331, column: 5)
!1038 = distinct !DILexicalBlock(scope: !1000, file: !999, line: 3326, column: 7)
!1039 = !{!1040, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "dests_node", scope: !998, file: !999, line: 3273, baseType: !1041, size: 49152)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 49152, elements: !94)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "dests_ch", scope: !998, file: !999, line: 3274, baseType: !1043, size: 65536, offset: 49152)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 65536, elements: !94)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_fail_stack_ent_t", file: !325, line: 630, size: 384, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1045, file: !325, line: 632, baseType: !820, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1045, file: !325, line: 633, baseType: !820, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !1045, file: !325, line: 634, baseType: !955, size: 64, offset: 128)
