source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.re_dfa_t = type opaque
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_registers = type { i32, i32*, i32* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [54 x i8] c"Write each FILE to standard output, last line first.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!3 = !DIFile(filename: "src/tac.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !23, !24, !28}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 62, baseType: !30)
!29 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!32, !0, !54, !56, !58, !60, !62, !64, !66, !91, !96, !110, !180, !182, !192, !205, !207}
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "default_file_list", scope: !34, file: !3, line: 612, type: !51, isLocal: true, isDefinition: true)
!34 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 603, type: !35, isDefinition: true, scopeLine: 604, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !39)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !37, !38}
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!39 = !{!40, !41, !42, !43, !44, !46, !47, !48}
!40 = !DILocalVariable(name: "argc", arg: 1, scope: !34, file: !3, line: 603, type: !37)
!41 = !DILocalVariable(name: "argv", arg: 2, scope: !34, file: !3, line: 603, type: !38)
!42 = !DILocalVariable(name: "error_message", scope: !34, file: !3, line: 605, type: !26)
!43 = !DILocalVariable(name: "optc", scope: !34, file: !3, line: 606, type: !37)
!44 = !DILocalVariable(name: "ok", scope: !34, file: !3, line: 607, type: !45)
!45 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!46 = !DILocalVariable(name: "half_buffer_size", scope: !34, file: !3, line: 608, type: !28)
!47 = !DILocalVariable(name: "file", scope: !34, file: !3, line: 613, type: !24)
!48 = !DILocalVariable(name: "i", scope: !49, file: !3, line: 694, type: !28)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 694, column: 5)
!50 = distinct !DILexicalBlock(scope: !34, file: !3, line: 692, column: 3)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 2)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "separator_ends_record", scope: !2, file: !3, line: 87, type: !45, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "sentinel_length", scope: !2, file: !3, line: 92, type: !28, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "match_length", scope: !2, file: !3, line: 97, type: !28, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "G_buffer", scope: !2, file: !3, line: 100, type: !21, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "read_size", scope: !2, file: !3, line: 103, type: !28, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "G_buffer_size", scope: !2, file: !3, line: 108, type: !28, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "compiled_separator", scope: !2, file: !3, line: 111, type: !68, isLocal: true, isDefinition: true)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !69, line: 414, size: 512, elements: !70)
!69 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!70 = !{!71, !74, !76, !77, !79, !80, !83, !84, !85, !86, !87, !88, !89, !90}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !68, file: !69, line: 418, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !69, line: 418, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !68, file: !69, line: 421, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !69, line: 57, baseType: !30)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !68, file: !69, line: 424, baseType: !75, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !68, file: !69, line: 427, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !69, line: 73, baseType: !30)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !68, file: !69, line: 432, baseType: !21, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !68, file: !69, line: 438, baseType: !81, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !68, file: !69, line: 441, baseType: !28, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !68, file: !69, line: 447, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !68, file: !69, line: 458, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !68, file: !69, line: 462, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !68, file: !69, line: 466, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !68, file: !69, line: 470, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !68, file: !69, line: 473, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !68, file: !69, line: 476, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "compiled_separator_fastmap", scope: !2, file: !3, line: 112, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 256)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 115, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 1536, elements: !108)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !101, line: 50, size: 256, elements: !102)
!101 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!102 = !{!103, !104, !105, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !101, line: 52, baseType: !26, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !100, file: !101, line: 55, baseType: !37, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !100, file: !101, line: 56, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !100, file: !101, line: 57, baseType: !37, size: 32, offset: 192)
!108 = !{!109}
!109 = !DISubrange(count: 6)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "tempfile", scope: !112, file: !3, line: 433, type: !21, isLocal: true, isDefinition: true)
!112 = distinct !DISubprogram(name: "temp_stream", scope: !3, file: !3, line: 431, type: !113, isLocal: true, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !172)
!113 = !DISubroutineType(types: !114)
!114 = !{!45, !115, !38}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !118, line: 7, baseType: !119)
!118 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !120, line: 49, size: 1728, elements: !121)
!120 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !137, !139, !140, !141, !145, !147, !149, !153, !156, !158, !161, !164, !165, !166, !167, !168}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !119, file: !120, line: 51, baseType: !37, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !119, file: !120, line: 54, baseType: !21, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !119, file: !120, line: 55, baseType: !21, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !119, file: !120, line: 56, baseType: !21, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !119, file: !120, line: 57, baseType: !21, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !119, file: !120, line: 58, baseType: !21, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !119, file: !120, line: 59, baseType: !21, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !119, file: !120, line: 60, baseType: !21, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !119, file: !120, line: 61, baseType: !21, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !119, file: !120, line: 64, baseType: !21, size: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !119, file: !120, line: 65, baseType: !21, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !119, file: !120, line: 66, baseType: !21, size: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !119, file: !120, line: 68, baseType: !135, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !120, line: 36, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !119, file: !120, line: 70, baseType: !138, size: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !119, file: !120, line: 72, baseType: !37, size: 32, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !119, file: !120, line: 73, baseType: !37, size: 32, offset: 928)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !119, file: !120, line: 74, baseType: !142, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !143, line: 150, baseType: !144)
!143 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!144 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !119, file: !120, line: 77, baseType: !146, size: 16, offset: 1024)
!146 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !119, file: !120, line: 78, baseType: !148, size: 8, offset: 1040)
!148 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !119, file: !120, line: 79, baseType: !150, size: 8, offset: 1048)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !119, file: !120, line: 81, baseType: !154, size: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !120, line: 43, baseType: null)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !119, file: !120, line: 89, baseType: !157, size: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !143, line: 151, baseType: !144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !119, file: !120, line: 91, baseType: !159, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !120, line: 37, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !119, file: !120, line: 92, baseType: !162, size: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !120, line: 38, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !119, file: !120, line: 93, baseType: !138, size: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !119, file: !120, line: 94, baseType: !23, size: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !119, file: !120, line: 95, baseType: !28, size: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !119, file: !120, line: 96, baseType: !37, size: 32, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !119, file: !120, line: 98, baseType: !169, size: 160, offset: 1568)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 20)
!172 = !{!173, !174, !175, !178, !179}
!173 = !DILocalVariable(name: "fp", arg: 1, scope: !112, file: !3, line: 431, type: !115)
!174 = !DILocalVariable(name: "file_name", arg: 2, scope: !112, file: !3, line: 431, type: !38)
!175 = !DILocalVariable(name: "t", scope: !176, file: !3, line: 437, type: !26)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 436, column: 5)
!177 = distinct !DILexicalBlock(scope: !112, file: !3, line: 435, column: 7)
!178 = !DILocalVariable(name: "tempdir", scope: !176, file: !3, line: 438, type: !26)
!179 = !DILocalVariable(name: "fd", scope: !176, file: !3, line: 455, type: !37)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !112, file: !3, line: 434, type: !116, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "regs", scope: !2, file: !3, line: 113, type: !184, isLocal: true, isDefinition: true)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !69, line: 498, size: 192, elements: !185)
!185 = !{!186, !188, !191}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !184, file: !69, line: 500, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !69, line: 56, baseType: !7)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !184, file: !69, line: 501, baseType: !189, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !69, line: 491, baseType: !37)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !184, file: !69, line: 502, baseType: !189, size: 64, offset: 128)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "buffer", scope: !194, file: !3, line: 161, type: !202, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "output", scope: !3, file: !3, line: 159, type: !195, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !197)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !26, !26}
!197 = !{!198, !199, !200, !201}
!198 = !DILocalVariable(name: "start", arg: 1, scope: !194, file: !3, line: 159, type: !26)
!199 = !DILocalVariable(name: "past_end", arg: 2, scope: !194, file: !3, line: 159, type: !26)
!200 = !DILocalVariable(name: "bytes_to_add", scope: !194, file: !3, line: 163, type: !28)
!201 = !DILocalVariable(name: "bytes_available", scope: !194, file: !3, line: 164, type: !28)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 65536, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 8192)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "bytes_in_buffer", scope: !194, file: !3, line: 162, type: !28, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 83, type: !45, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!210 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "Version", scope: !213, file: !214, line: 2, type: !26, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, globals: !216)
!214 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!215 = !{}
!216 = !{!211}
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "file_name", scope: !219, file: !224, line: 46, type: !26, isLocal: true, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, globals: !221)
!220 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!221 = !{!217, !222}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !219, file: !224, line: 56, type: !45, isLocal: true, isDefinition: true)
!224 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "exit_failure", scope: !227, file: !230, line: 24, type: !231, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, globals: !229)
!228 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!229 = !{!225}
!230 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!231 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "program_name", scope: !234, file: !238, line: 33, type: !26, isDefinition: true)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !236, globals: !237)
!235 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!236 = !{!23, !21}
!237 = !{!232}
!238 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !241, file: !268, line: 85, type: !300, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !264, globals: !265)
!242 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!243 = !{!5, !244, !249}
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!247 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!248 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !250, line: 46, baseType: !7, size: 32, elements: !251)
!250 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!252 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!253 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!254 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!255 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!256 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!257 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!258 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!259 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!260 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!261 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!262 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!263 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!264 = !{!37, !146, !28, !21}
!265 = !{!239, !266, !273, !285, !287, !289, !296, !298}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !241, file: !268, line: 101, type: !269, isDefinition: true)
!268 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 320, elements: !271)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!271 = !{!272}
!272 = !DISubrange(count: 10)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !241, file: !268, line: 1052, type: !275, isDefinition: true)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !268, line: 65, size: 448, elements: !276)
!276 = !{!277, !278, !279, !283, !284}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !275, file: !268, line: 68, baseType: !5, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !275, file: !268, line: 71, baseType: !37, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !275, file: !268, line: 75, baseType: !280, size: 256, offset: 64)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !275, file: !268, line: 78, baseType: !26, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !275, file: !268, line: 81, baseType: !26, size: 64, offset: 384)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !241, file: !268, line: 116, type: !275, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "slot0", scope: !241, file: !268, line: 842, type: !93, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "slotvec", scope: !241, file: !268, line: 845, type: !291, isLocal: true, isDefinition: true)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !268, line: 834, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !292, file: !268, line: 836, baseType: !28, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !292, file: !268, line: 837, baseType: !21, size: 64, offset: 64)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "nslots", scope: !241, file: !268, line: 843, type: !37, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "slotvec0", scope: !241, file: !268, line: 844, type: !292, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 704, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 11)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !305, file: !308, line: 26, type: !309, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, globals: !307)
!306 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!307 = !{!303}
!308 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 376, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 47)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !314, file: !315, line: 339, type: !37, isLocal: true, isDefinition: true)
!314 = distinct !DISubprogram(name: "rpl_fcntl", scope: !315, file: !315, line: 276, type: !316, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !318, retainedNodes: !321)
!315 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!316 = !DISubroutineType(types: !317)
!317 = !{!37, !37, !37, null}
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, globals: !320)
!319 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!320 = !{!312}
!321 = !{!322, !323, !324, !335, !336, !339, !342, !345}
!322 = !DILocalVariable(name: "fd", arg: 1, scope: !314, file: !315, line: 276, type: !37)
!323 = !DILocalVariable(name: "action", arg: 2, scope: !314, file: !315, line: 276, type: !37)
!324 = !DILocalVariable(name: "arg", scope: !314, file: !315, line: 278, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !326, line: 30, baseType: !327)
!326 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !319, line: 278, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 192, elements: !151)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !319, line: 278, size: 192, elements: !330)
!330 = !{!331, !332, !333, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !329, file: !319, line: 278, baseType: !7, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !329, file: !319, line: 278, baseType: !7, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !329, file: !319, line: 278, baseType: !23, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !329, file: !319, line: 278, baseType: !23, size: 64, offset: 128)
!335 = !DILocalVariable(name: "result", scope: !314, file: !315, line: 279, type: !37)
!336 = !DILocalVariable(name: "target", scope: !337, file: !315, line: 326, type: !37)
!337 = distinct !DILexicalBlock(scope: !338, file: !315, line: 325, column: 7)
!338 = distinct !DILexicalBlock(scope: !314, file: !315, line: 282, column: 5)
!339 = !DILocalVariable(name: "flags", scope: !340, file: !315, line: 363, type: !37)
!340 = distinct !DILexicalBlock(scope: !341, file: !315, line: 362, column: 11)
!341 = distinct !DILexicalBlock(scope: !337, file: !315, line: 361, column: 13)
!342 = !DILocalVariable(name: "saved_errno", scope: !343, file: !315, line: 366, type: !37)
!343 = distinct !DILexicalBlock(scope: !344, file: !315, line: 365, column: 15)
!344 = distinct !DILexicalBlock(scope: !340, file: !315, line: 364, column: 17)
!345 = !DILocalVariable(name: "p", scope: !346, file: !315, line: 408, type: !23)
!346 = distinct !DILexicalBlock(scope: !338, file: !315, line: 406, column: 7)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !349)
!348 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!349 = !{!23}
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !352)
!351 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!352 = !{!353}
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 40, baseType: !7, size: 32, elements: !355)
!354 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!355 = !{!356}
!356 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!358 = !DIFile(filename: "./lib/mkstemp-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!360 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !363, retainedTypes: !349)
!362 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!363 = !{!364}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 41, baseType: !7, size: 32, elements: !366)
!365 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!366 = !{!367}
!367 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !370, retainedTypes: !384)
!369 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!370 = !{!371}
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !373, file: !372, line: 186, baseType: !7, size: 32, elements: !382)
!372 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!373 = distinct !DISubprogram(name: "x2nrealloc", scope: !372, file: !372, line: 174, type: !374, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !368, retainedNodes: !377)
!374 = !DISubroutineType(types: !375)
!375 = !{!23, !23, !376, !28}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!377 = !{!378, !379, !380, !381}
!378 = !DILocalVariable(name: "p", arg: 1, scope: !373, file: !372, line: 174, type: !23)
!379 = !DILocalVariable(name: "pn", arg: 2, scope: !373, file: !372, line: 174, type: !376)
!380 = !DILocalVariable(name: "s", arg: 3, scope: !373, file: !372, line: 174, type: !28)
!381 = !DILocalVariable(name: "n", scope: !373, file: !372, line: 176, type: !28)
!382 = !{!383}
!383 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!384 = !{!28, !21, !23}
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!386 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !349)
!388 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !349)
!390 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !393)
!392 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!393 = !{!28}
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!395 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !398)
!397 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!398 = !{!21}
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!400 = !DIFile(filename: "./lib/fd-safer-flag.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!402 = !DIFile(filename: "./lib/dup-safer-flag.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!404 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !407, retainedTypes: !349)
!406 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!407 = !{!408}
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !409, line: 41, baseType: !7, size: 32, elements: !410)
!409 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!411 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!412 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!413 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!414 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!415 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!416 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!417 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!418 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!419 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!420 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!421 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!422 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!423 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!424 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!425 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!426 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!427 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!428 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!429 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!430 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!431 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!432 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!433 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!434 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!435 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!436 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!437 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!438 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!439 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!440 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!441 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!442 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!443 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!444 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!445 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!446 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!447 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!448 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!449 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!450 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!451 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!452 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!453 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!454 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!455 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!456 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!457 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!458 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!459 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!460 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!519 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!522 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!523 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!524 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!525 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!526 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!527 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!528 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!529 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!530 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!531 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!532 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!533 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!606 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!679 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!680 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!681 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!682 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!683 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!684 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!685 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!686 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!687 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!688 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!689 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!690 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!691 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!692 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!693 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!695 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!696 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!697 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!698 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!699 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!700 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!726 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!727 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!728 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!729 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!730 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!735 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!736 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!737 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!738 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!795 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215)
!797 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !349)
!799 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!800 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!801 = !{i32 2, !"Dwarf Version", i32 4}
!802 = !{i32 2, !"Debug Info Version", i32 3}
!803 = !{i32 1, !"wchar_size", i32 4}
!804 = !{i32 7, !"PIC Level", i32 2}
!805 = !{i32 7, !"PIE Level", i32 2}
!806 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 126, type: !807, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !37}
!809 = !{!810}
!810 = !DILocalVariable(name: "status", arg: 1, scope: !806, file: !3, line: 126, type: !37)
!811 = !DILocalVariable(name: "infomap", scope: !812, file: !813, line: 632, type: !827)
!812 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !813, file: !813, line: 630, type: !814, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !816)
!813 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!814 = !DISubroutineType(types: !815)
!815 = !{null, !26}
!816 = !{!817, !811, !818, !819, !826}
!817 = !DILocalVariable(name: "program", arg: 1, scope: !812, file: !813, line: 630, type: !26)
!818 = !DILocalVariable(name: "node", scope: !812, file: !813, line: 642, type: !26)
!819 = !DILocalVariable(name: "map_prog", scope: !812, file: !813, line: 643, type: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !812, file: !813, line: 632, size: 128, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !822, file: !813, line: 632, baseType: !26, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !822, file: !813, line: 632, baseType: !26, size: 64, offset: 64)
!826 = !DILocalVariable(name: "lc_messages", scope: !812, file: !813, line: 655, type: !26)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 896, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 7)
!830 = !DILocation(line: 632, column: 67, scope: !812, inlinedAt: !831)
!831 = distinct !DILocation(line: 150, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !833, file: !3, line: 131, column: 5)
!833 = distinct !DILexicalBlock(scope: !806, file: !3, line: 128, column: 7)
!834 = !DILocation(line: 126, column: 12, scope: !806)
!835 = !DILocation(line: 128, column: 14, scope: !833)
!836 = !DILocation(line: 128, column: 7, scope: !806)
!837 = !DILocation(line: 129, column: 5, scope: !838)
!838 = distinct !DILexicalBlock(scope: !833, file: !3, line: 129, column: 5)
!839 = !{!840, !840, i64 0}
!840 = !{!"any pointer", !841, i64 0}
!841 = !{!"omnipotent char", !842, i64 0}
!842 = !{!"Simple C/C++ TBAA"}
!843 = !DILocation(line: 132, column: 7, scope: !832)
!844 = !DILocation(line: 136, column: 7, scope: !832)
!845 = !DILocation(line: 580, column: 3, scope: !846, inlinedAt: !849)
!846 = distinct !DISubprogram(name: "emit_stdin_note", scope: !813, file: !813, line: 578, type: !847, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !215)
!847 = !DISubroutineType(types: !848)
!848 = !{null}
!849 = distinct !DILocation(line: 140, column: 7, scope: !832)
!850 = !DILocation(line: 587, column: 3, scope: !851, inlinedAt: !852)
!851 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !813, file: !813, line: 585, type: !847, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !215)
!852 = distinct !DILocation(line: 141, column: 7, scope: !832)
!853 = !DILocation(line: 143, column: 7, scope: !832)
!854 = !DILocation(line: 148, column: 7, scope: !832)
!855 = !DILocation(line: 149, column: 7, scope: !832)
!856 = !DILocation(line: 632, column: 3, scope: !812, inlinedAt: !831)
!857 = !DILocation(line: 643, column: 36, scope: !812, inlinedAt: !831)
!858 = !DILocation(line: 643, column: 25, scope: !812, inlinedAt: !831)
!859 = !DILocation(line: 645, column: 33, scope: !812, inlinedAt: !831)
!860 = !DILocation(line: 645, column: 3, scope: !812, inlinedAt: !831)
!861 = !DILocation(line: 646, column: 13, scope: !812, inlinedAt: !831)
!862 = !DILocation(line: 645, column: 20, scope: !812, inlinedAt: !831)
!863 = !{!864, !840, i64 0}
!864 = !{!"infomap", !840, i64 0, !840, i64 8}
!865 = !DILocation(line: 645, column: 10, scope: !812, inlinedAt: !831)
!866 = !DILocation(line: 645, column: 28, scope: !812, inlinedAt: !831)
!867 = distinct !{!867, !868, !869}
!868 = !DILocation(line: 645, column: 3, scope: !812)
!869 = !DILocation(line: 646, column: 13, scope: !812)
!870 = !DILocation(line: 648, column: 17, scope: !871, inlinedAt: !831)
!871 = distinct !DILexicalBlock(scope: !812, file: !813, line: 648, column: 7)
!872 = !{!864, !840, i64 8}
!873 = !DILocation(line: 648, column: 7, scope: !871, inlinedAt: !831)
!874 = !DILocation(line: 648, column: 7, scope: !812, inlinedAt: !831)
!875 = !DILocation(line: 642, column: 15, scope: !812, inlinedAt: !831)
!876 = !DILocation(line: 651, column: 3, scope: !812, inlinedAt: !831)
!877 = !DILocation(line: 655, column: 29, scope: !812, inlinedAt: !831)
!878 = !DILocation(line: 655, column: 15, scope: !812, inlinedAt: !831)
!879 = !DILocation(line: 656, column: 7, scope: !880, inlinedAt: !831)
!880 = distinct !DILexicalBlock(scope: !812, file: !813, line: 656, column: 7)
!881 = !DILocation(line: 656, column: 19, scope: !880, inlinedAt: !831)
!882 = !DILocation(line: 656, column: 22, scope: !880, inlinedAt: !831)
!883 = !DILocation(line: 656, column: 7, scope: !812, inlinedAt: !831)
!884 = !DILocation(line: 662, column: 7, scope: !885, inlinedAt: !831)
!885 = distinct !DILexicalBlock(scope: !880, file: !813, line: 657, column: 5)
!886 = !DILocation(line: 664, column: 5, scope: !885, inlinedAt: !831)
!887 = !DILocation(line: 665, column: 3, scope: !812, inlinedAt: !831)
!888 = !DILocation(line: 667, column: 3, scope: !812, inlinedAt: !831)
!889 = !DILocation(line: 669, column: 1, scope: !812, inlinedAt: !831)
!890 = !DILocation(line: 152, column: 3, scope: !806)
!891 = !DILocation(line: 603, column: 11, scope: !34)
!892 = !DILocation(line: 603, column: 24, scope: !34)
!893 = !DILocation(line: 616, column: 21, scope: !34)
!894 = !DILocation(line: 616, column: 3, scope: !34)
!895 = !DILocation(line: 617, column: 3, scope: !34)
!896 = !DILocation(line: 618, column: 3, scope: !34)
!897 = !DILocation(line: 619, column: 3, scope: !34)
!898 = !DILocation(line: 621, column: 3, scope: !34)
!899 = !DILocation(line: 623, column: 13, scope: !34)
!900 = !DILocation(line: 624, column: 19, scope: !34)
!901 = !{!902, !902, i64 0}
!902 = !{!"long", !841, i64 0}
!903 = !DILocation(line: 627, column: 3, scope: !34)
!904 = !DILocation(line: 627, column: 18, scope: !34)
!905 = !DILocation(line: 606, column: 7, scope: !34)
!906 = !DILocation(line: 633, column: 11, scope: !907)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 630, column: 9)
!908 = distinct !DILexicalBlock(scope: !34, file: !3, line: 628, column: 5)
!909 = !DILocation(line: 635, column: 27, scope: !907)
!910 = !DILocation(line: 636, column: 11, scope: !907)
!911 = !DILocation(line: 638, column: 23, scope: !907)
!912 = !DILocation(line: 638, column: 21, scope: !907)
!913 = !DILocation(line: 639, column: 11, scope: !907)
!914 = distinct !{!914, !903, !915}
!915 = !DILocation(line: 645, column: 5, scope: !34)
!916 = !DILocation(line: 640, column: 9, scope: !907)
!917 = !DILocation(line: 641, column: 9, scope: !907)
!918 = !DILocation(line: 643, column: 11, scope: !907)
!919 = !DILocation(line: 647, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !34, file: !3, line: 647, column: 7)
!921 = !DILocation(line: 647, column: 23, scope: !920)
!922 = !DILocation(scope: !920)
!923 = !{!841, !841, i64 0}
!924 = !DILocation(line: 647, column: 7, scope: !34)
!925 = !DILocation(line: 649, column: 11, scope: !926)
!926 = distinct !DILexicalBlock(scope: !920, file: !3, line: 648, column: 5)
!927 = !DILocation(line: 650, column: 9, scope: !928)
!928 = distinct !DILexicalBlock(scope: !926, file: !3, line: 649, column: 11)
!929 = !DILocation(line: 653, column: 36, scope: !926)
!930 = !DILocation(line: 654, column: 34, scope: !926)
!931 = !DILocation(line: 656, column: 54, scope: !926)
!932 = !DILocation(line: 656, column: 23, scope: !926)
!933 = !DILocation(line: 605, column: 15, scope: !34)
!934 = !DILocation(line: 658, column: 11, scope: !935)
!935 = distinct !DILexicalBlock(scope: !926, file: !3, line: 658, column: 11)
!936 = !DILocation(line: 658, column: 11, scope: !926)
!937 = !DILocation(line: 665, column: 10, scope: !34)
!938 = !DILocation(line: 659, column: 9, scope: !935)
!939 = !DILocation(line: 662, column: 38, scope: !920)
!940 = !DILocation(line: 662, column: 51, scope: !920)
!941 = !DILocation(line: 662, column: 36, scope: !920)
!942 = !DILocation(line: 662, column: 18, scope: !920)
!943 = !DILocation(scope: !944)
!944 = distinct !DILexicalBlock(scope: !34, file: !3, line: 666, column: 5)
!945 = !DILocation(line: 665, column: 26, scope: !34)
!946 = !DILocation(line: 665, column: 3, scope: !34)
!947 = !DILocation(line: 667, column: 24, scope: !948)
!948 = distinct !DILexicalBlock(scope: !944, file: !3, line: 667, column: 11)
!949 = !DILocation(line: 667, column: 11, scope: !944)
!950 = !DILocation(line: 668, column: 9, scope: !948)
!951 = !DILocation(line: 669, column: 17, scope: !944)
!952 = !DILocation(line: 665, column: 39, scope: !34)
!953 = distinct !{!953, !946, !954}
!954 = !DILocation(line: 670, column: 5, scope: !34)
!955 = !DILocation(line: 671, column: 32, scope: !34)
!956 = !DILocation(line: 671, column: 50, scope: !34)
!957 = !DILocation(line: 608, column: 10, scope: !34)
!958 = !DILocation(line: 672, column: 21, scope: !34)
!959 = !DILocation(line: 672, column: 17, scope: !34)
!960 = !DILocation(line: 673, column: 20, scope: !961)
!961 = distinct !DILexicalBlock(scope: !34, file: !3, line: 673, column: 7)
!962 = !DILocation(line: 673, column: 59, scope: !961)
!963 = !DILocation(line: 673, column: 39, scope: !961)
!964 = !DILocation(line: 674, column: 5, scope: !961)
!965 = !DILocation(line: 675, column: 14, scope: !34)
!966 = !DILocation(line: 675, column: 12, scope: !34)
!967 = !DILocation(line: 676, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !34, file: !3, line: 676, column: 7)
!969 = !DILocation(line: 676, column: 7, scope: !34)
!970 = !DILocation(line: 678, column: 25, scope: !971)
!971 = distinct !DILexicalBlock(scope: !968, file: !3, line: 677, column: 5)
!972 = !DILocation(line: 678, column: 52, scope: !971)
!973 = !DILocation(line: 678, column: 7, scope: !971)
!974 = !DILocation(line: 680, column: 5, scope: !971)
!975 = !DILocation(scope: !971)
!976 = !DILocation(line: 686, column: 11, scope: !34)
!977 = !{!978, !978, i64 0}
!978 = !{!"int", !841, i64 0}
!979 = !DILocation(line: 686, column: 18, scope: !34)
!980 = !DILocation(line: 687, column: 36, scope: !34)
!981 = !DILocation(line: 613, column: 22, scope: !34)
!982 = !DILocation(line: 607, column: 8, scope: !34)
!983 = !DILocation(line: 694, column: 17, scope: !49)
!984 = !DILocation(line: 694, column: 24, scope: !985)
!985 = distinct !DILexicalBlock(scope: !49, file: !3, line: 694, column: 5)
!986 = !DILocation(line: 694, column: 5, scope: !49)
!987 = !DILocation(scope: !985)
!988 = !DILocation(line: 159, column: 21, scope: !194, inlinedAt: !989)
!989 = distinct !DILocation(line: 699, column: 3, scope: !34)
!990 = !DILocation(line: 159, column: 40, scope: !194, inlinedAt: !989)
!991 = !DILocation(line: 163, column: 10, scope: !194, inlinedAt: !989)
!992 = !DILocation(line: 164, column: 40, scope: !194, inlinedAt: !989)
!993 = !DILocation(line: 168, column: 7, scope: !994, inlinedAt: !989)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 167, column: 5)
!995 = distinct !DILexicalBlock(scope: !194, file: !3, line: 166, column: 7)
!996 = !DILocation(scope: !994, inlinedAt: !989)
!997 = !DILocation(line: 701, column: 23, scope: !998)
!998 = distinct !DILexicalBlock(scope: !34, file: !3, line: 701, column: 7)
!999 = !DILocalVariable(name: "filename", arg: 1, scope: !1000, file: !3, line: 563, type: !26)
!1000 = distinct !DISubprogram(name: "tac_file", scope: !3, file: !3, line: 563, type: !1001, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!45, !26}
!1003 = !{!999, !1004, !1005, !1008, !1009}
!1004 = !DILocalVariable(name: "ok", scope: !1000, file: !3, line: 565, type: !45)
!1005 = !DILocalVariable(name: "file_size", scope: !1000, file: !3, line: 566, type: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1007, line: 63, baseType: !142)
!1007 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1008 = !DILocalVariable(name: "fd", scope: !1000, file: !3, line: 567, type: !37)
!1009 = !DILocalVariable(name: "is_stdin", scope: !1000, file: !3, line: 568, type: !45)
!1010 = !DILocation(line: 563, column: 23, scope: !1000, inlinedAt: !1011)
!1011 = distinct !DILocation(line: 695, column: 13, scope: !985)
!1012 = !DILocation(line: 568, column: 19, scope: !1000, inlinedAt: !1011)
!1013 = !DILocation(line: 570, column: 7, scope: !1000, inlinedAt: !1011)
!1014 = !DILocation(line: 567, column: 7, scope: !1000, inlinedAt: !1011)
!1015 = !DILocation(line: 574, column: 18, scope: !1016, inlinedAt: !1011)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 571, column: 5)
!1017 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 570, column: 7)
!1018 = !DILocation(line: 576, column: 5, scope: !1016, inlinedAt: !1011)
!1019 = !DILocation(line: 579, column: 12, scope: !1020, inlinedAt: !1011)
!1020 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 578, column: 5)
!1021 = !DILocation(line: 580, column: 14, scope: !1022, inlinedAt: !1011)
!1022 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 580, column: 11)
!1023 = !DILocation(line: 580, column: 11, scope: !1020, inlinedAt: !1011)
!1024 = !DILocation(line: 582, column: 21, scope: !1025, inlinedAt: !1011)
!1025 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 581, column: 9)
!1026 = !DILocation(line: 582, column: 28, scope: !1025, inlinedAt: !1011)
!1027 = !DILocation(line: 583, column: 18, scope: !1025, inlinedAt: !1011)
!1028 = !DILocation(line: 582, column: 11, scope: !1025, inlinedAt: !1011)
!1029 = !DILocation(line: 584, column: 11, scope: !1025, inlinedAt: !1011)
!1030 = !DILocation(scope: !1020, inlinedAt: !1011)
!1031 = !DILocation(line: 588, column: 15, scope: !1000, inlinedAt: !1011)
!1032 = !DILocation(line: 566, column: 9, scope: !1000, inlinedAt: !1011)
!1033 = !DILocation(line: 590, column: 19, scope: !1000, inlinedAt: !1011)
!1034 = !DILocation(line: 590, column: 23, scope: !1000, inlinedAt: !1011)
!1035 = !DILocation(line: 590, column: 26, scope: !1000, inlinedAt: !1011)
!1036 = !DILocation(line: 590, column: 9, scope: !1000, inlinedAt: !1011)
!1037 = !DILocalVariable(name: "input_fd", arg: 1, scope: !1038, file: !3, line: 546, type: !37)
!1038 = distinct !DISubprogram(name: "tac_nonseekable", scope: !3, file: !3, line: 546, type: !1039, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1041)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!45, !37, !26}
!1041 = !{!1037, !1042, !1043, !1044, !1045, !1046}
!1042 = !DILocalVariable(name: "file", arg: 2, scope: !1038, file: !3, line: 546, type: !26)
!1043 = !DILocalVariable(name: "tmp_stream", scope: !1038, file: !3, line: 548, type: !116)
!1044 = !DILocalVariable(name: "tmp_file", scope: !1038, file: !3, line: 549, type: !21)
!1045 = !DILocalVariable(name: "bytes_copied", scope: !1038, file: !3, line: 550, type: !1006)
!1046 = !DILocalVariable(name: "ok", scope: !1038, file: !3, line: 554, type: !45)
!1047 = !DILocation(line: 546, column: 22, scope: !1038, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 591, column: 11, scope: !1000, inlinedAt: !1011)
!1049 = !DILocation(line: 546, column: 44, scope: !1038, inlinedAt: !1048)
!1050 = !DILocation(line: 548, column: 9, scope: !1038, inlinedAt: !1048)
!1051 = !DILocation(line: 549, column: 9, scope: !1038, inlinedAt: !1048)
!1052 = !DILocalVariable(name: "g_tmp", arg: 1, scope: !1053, file: !3, line: 500, type: !115)
!1053 = distinct !DISubprogram(name: "copy_to_temp", scope: !3, file: !3, line: 500, type: !1054, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1056)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1006, !115, !38, !37, !26}
!1056 = !{!1052, !1057, !1058, !1059, !1060, !1061, !1062, !1066}
!1057 = !DILocalVariable(name: "g_tempfile", arg: 2, scope: !1053, file: !3, line: 500, type: !38)
!1058 = !DILocalVariable(name: "input_fd", arg: 3, scope: !1053, file: !3, line: 500, type: !37)
!1059 = !DILocalVariable(name: "file", arg: 4, scope: !1053, file: !3, line: 500, type: !26)
!1060 = !DILocalVariable(name: "fp", scope: !1053, file: !3, line: 502, type: !116)
!1061 = !DILocalVariable(name: "file_name", scope: !1053, file: !3, line: 503, type: !21)
!1062 = !DILocalVariable(name: "bytes_copied", scope: !1053, file: !3, line: 504, type: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1064, line: 102, baseType: !1065)
!1064 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !143, line: 72, baseType: !30)
!1066 = !DILocalVariable(name: "bytes_read", scope: !1067, file: !3, line: 510, type: !28)
!1067 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 509, column: 5)
!1068 = !DILocation(line: 500, column: 22, scope: !1053, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 550, column: 24, scope: !1038, inlinedAt: !1048)
!1070 = !DILocation(line: 500, column: 36, scope: !1053, inlinedAt: !1069)
!1071 = !DILocation(line: 500, column: 52, scope: !1053, inlinedAt: !1069)
!1072 = !DILocation(line: 500, column: 74, scope: !1053, inlinedAt: !1069)
!1073 = !DILocation(line: 504, column: 13, scope: !1053, inlinedAt: !1069)
!1074 = !DILocation(line: 502, column: 9, scope: !1053, inlinedAt: !1069)
!1075 = !DILocation(line: 503, column: 9, scope: !1053, inlinedAt: !1069)
!1076 = !DILocation(line: 431, column: 21, scope: !112, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 505, column: 8, scope: !1078, inlinedAt: !1069)
!1078 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 505, column: 7)
!1079 = !DILocation(line: 431, column: 32, scope: !112, inlinedAt: !1077)
!1080 = !DILocation(line: 435, column: 7, scope: !177, inlinedAt: !1077)
!1081 = !DILocation(line: 435, column: 16, scope: !177, inlinedAt: !1077)
!1082 = !DILocation(line: 435, column: 7, scope: !112, inlinedAt: !1077)
!1083 = !DILocation(line: 437, column: 23, scope: !176, inlinedAt: !1077)
!1084 = !DILocation(line: 437, column: 19, scope: !176, inlinedAt: !1077)
!1085 = !DILocation(line: 438, column: 29, scope: !176, inlinedAt: !1077)
!1086 = !DILocation(line: 438, column: 19, scope: !176, inlinedAt: !1077)
!1087 = !DILocation(line: 439, column: 18, scope: !176, inlinedAt: !1077)
!1088 = !DILocation(line: 439, column: 16, scope: !176, inlinedAt: !1077)
!1089 = !DILocation(line: 455, column: 16, scope: !176, inlinedAt: !1077)
!1090 = !DILocation(line: 455, column: 11, scope: !176, inlinedAt: !1077)
!1091 = !DILocation(line: 456, column: 14, scope: !1092, inlinedAt: !1077)
!1092 = distinct !DILexicalBlock(scope: !176, file: !3, line: 456, column: 11)
!1093 = !DILocation(line: 456, column: 11, scope: !176, inlinedAt: !1077)
!1094 = !DILocation(line: 458, column: 21, scope: !1095, inlinedAt: !1077)
!1095 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 457, column: 9)
!1096 = !DILocation(line: 458, column: 28, scope: !1095, inlinedAt: !1077)
!1097 = !DILocation(line: 459, column: 18, scope: !1095, inlinedAt: !1077)
!1098 = !DILocation(line: 458, column: 11, scope: !1095, inlinedAt: !1077)
!1099 = !DILocation(line: 460, column: 11, scope: !1095, inlinedAt: !1077)
!1100 = !DILocation(line: 463, column: 16, scope: !176, inlinedAt: !1077)
!1101 = !DILocation(line: 463, column: 14, scope: !176, inlinedAt: !1077)
!1102 = !DILocation(line: 464, column: 13, scope: !1103, inlinedAt: !1077)
!1103 = distinct !DILexicalBlock(scope: !176, file: !3, line: 464, column: 11)
!1104 = !DILocation(line: 464, column: 11, scope: !176, inlinedAt: !1077)
!1105 = !DILocation(line: 466, column: 21, scope: !1106, inlinedAt: !1077)
!1106 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 465, column: 9)
!1107 = !DILocation(line: 466, column: 28, scope: !1106, inlinedAt: !1077)
!1108 = !DILocation(line: 467, column: 18, scope: !1106, inlinedAt: !1077)
!1109 = !DILocation(line: 466, column: 11, scope: !1106, inlinedAt: !1077)
!1110 = !DILocation(line: 468, column: 11, scope: !1106, inlinedAt: !1077)
!1111 = !DILocation(line: 469, column: 19, scope: !1106, inlinedAt: !1077)
!1112 = !DILocation(line: 469, column: 11, scope: !1106, inlinedAt: !1077)
!1113 = !DILocation(line: 476, column: 34, scope: !176, inlinedAt: !1077)
!1114 = !DILocalVariable(name: "fn", arg: 1, scope: !1115, file: !3, line: 420, type: !26)
!1115 = distinct !DISubprogram(name: "record_or_unlink_tempfile", scope: !3, file: !3, line: 420, type: !1116, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1118)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !26, !116}
!1118 = !{!1114, !1119}
!1119 = !DILocalVariable(name: "fp", arg: 2, scope: !1115, file: !3, line: 420, type: !116)
!1120 = !DILocation(line: 420, column: 40, scope: !1115, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 476, column: 7, scope: !176, inlinedAt: !1077)
!1122 = !DILocation(line: 420, column: 50, scope: !1115, inlinedAt: !1121)
!1123 = !DILocation(line: 422, column: 3, scope: !1115, inlinedAt: !1121)
!1124 = !DILocation(line: 471, column: 17, scope: !1106, inlinedAt: !1077)
!1125 = !DILocation(line: 471, column: 11, scope: !1106, inlinedAt: !1077)
!1126 = !DILocation(line: 472, column: 20, scope: !1106, inlinedAt: !1077)
!1127 = !DILocation(line: 480, column: 7, scope: !1128, inlinedAt: !1077)
!1128 = distinct !DILexicalBlock(scope: !177, file: !3, line: 479, column: 5)
!1129 = !DILocation(line: 481, column: 19, scope: !1130, inlinedAt: !1077)
!1130 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 481, column: 11)
!1131 = !DILocation(line: 481, column: 11, scope: !1130, inlinedAt: !1077)
!1132 = !DILocation(line: 481, column: 40, scope: !1130, inlinedAt: !1077)
!1133 = !DILocation(line: 482, column: 11, scope: !1130, inlinedAt: !1077)
!1134 = !DILocation(line: 482, column: 33, scope: !1130, inlinedAt: !1077)
!1135 = !DILocation(line: 482, column: 25, scope: !1130, inlinedAt: !1077)
!1136 = !DILocation(line: 482, column: 14, scope: !1130, inlinedAt: !1077)
!1137 = !DILocation(line: 482, column: 45, scope: !1130, inlinedAt: !1077)
!1138 = !DILocation(line: 481, column: 11, scope: !1128, inlinedAt: !1077)
!1139 = !DILocation(line: 484, column: 21, scope: !1140, inlinedAt: !1077)
!1140 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 483, column: 9)
!1141 = !DILocation(line: 484, column: 28, scope: !1140, inlinedAt: !1077)
!1142 = !DILocation(line: 485, column: 18, scope: !1140, inlinedAt: !1077)
!1143 = !DILocation(line: 484, column: 11, scope: !1140, inlinedAt: !1077)
