source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.bin_tree_storage_t = type { %struct.bin_tree_storage_t*, [15 x %struct.bin_tree_t] }
%struct.bin_tree_t = type { %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.re_token_t, i64 }
%struct.bracket_elem_t = type { i32, %union.anon.1 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.re_backref_cache_entry = type { i64, i64, i64, i64, i64, i8 }
%struct.re_charset_t = type { i32*, i32*, i32*, i64*, i8, i64, i64, i64, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "separator", scope: !2, file: !3, line: 80, type: !27, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !247, nameTableKind: None)
!3 = !DIFile(filename: "src/tac.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !31, !92, !96, !100, !103, !106, !113, !25, !82, !128, !132, !136, !163, !165, !168, !170, !174, !178, !181, !184, !185, !188, !191, !84, !27, !195, !200, !201, !202, !207, !211, !214, !217, !220, !223, !227, !154, !230, !244}
!21 = !DISubprogram(name: "dcgettext", scope: !22, file: !22, line: 51, type: !23, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!22 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !27, !27, !29}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !{}
!31 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !33, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!29, !27, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !38)
!37 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !54, !55, !56, !57, !61, !63, !65, !69, !72, !74, !77, !80, !81, !83, !87, !88}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !36, file: !37, line: 51, baseType: !29, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !36, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !36, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !36, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !36, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !36, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !36, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !36, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !36, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !36, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !36, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !36, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !36, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !37, line: 36, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !36, file: !37, line: 70, baseType: !35, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !36, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !36, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !36, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !59, line: 152, baseType: !60)
!59 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !36, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !36, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !36, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !36, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !37, line: 43, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !36, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !59, line: 153, baseType: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !36, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !37, line: 37, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !36, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !37, line: 38, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !36, file: !37, line: 93, baseType: !35, size: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !36, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !36, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!86 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !36, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !36, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DISubprogram(name: "set_program_name", scope: !93, file: !93, line: 37, type: !94, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!93 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !DISubroutineType(types: !95)
!95 = !{null, !27}
!96 = !DISubprogram(name: "setlocale", scope: !97, file: !97, line: 122, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!97 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{!25, !29, !27}
!100 = !DISubprogram(name: "bindtextdomain", scope: !22, file: !22, line: 86, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!101 = !DISubroutineType(types: !102)
!102 = !{!25, !27, !27}
!103 = !DISubprogram(name: "textdomain", scope: !22, file: !22, line: 82, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!104 = !DISubroutineType(types: !105)
!105 = !{!25, !27}
!106 = !DISubprogram(name: "atexit", scope: !107, file: !107, line: 595, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!107 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!29, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DISubprogram(name: "getopt_long", scope: !114, file: !114, line: 66, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!114 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!29, !29, !117, !27, !119, !126}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !114, line: 50, size: 256, elements: !122)
!122 = !{!123, !124, !125, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !114, line: 52, baseType: !27, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !121, file: !114, line: 55, baseType: !29, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !114, line: 56, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !114, line: 57, baseType: !29, size: 32, offset: 192)
!128 = !DISubprogram(name: "version_etc", scope: !129, file: !129, line: 69, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!129 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !35, !27, !27, !27, null}
!132 = !DISubprogram(name: "error", scope: !133, file: !133, line: 52, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!133 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !29, !29, !27, null}
!136 = !DISubprogram(name: "rpl_re_compile_pattern", scope: !137, file: !137, line: 538, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!137 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!138 = !DISubroutineType(types: !139)
!139 = !{!27, !27, !86, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !137, line: 413, size: 512, elements: !142)
!142 = !{!143, !146, !148, !149, !151, !152, !155, !156, !157, !158, !159, !160, !161, !162}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !141, file: !137, line: 417, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !137, line: 417, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !141, file: !137, line: 420, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !137, line: 49, baseType: !84)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !141, file: !137, line: 423, baseType: !147, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !141, file: !137, line: 426, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !137, line: 72, baseType: !86)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !141, file: !137, line: 431, baseType: !25, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !141, file: !137, line: 437, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !141, file: !137, line: 440, baseType: !84, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !141, file: !137, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !141, file: !137, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !141, file: !137, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !141, file: !137, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !141, file: !137, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !141, file: !137, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !141, file: !137, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!163 = !DISubprogram(name: "xalloc_die", scope: !164, file: !164, line: 51, type: !111, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!164 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubprogram(name: "xmalloc", scope: !164, file: !164, line: 53, type: !166, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!166 = !DISubroutineType(types: !167)
!167 = !{!82, !86}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!170 = !DISubprogram(name: "close", scope: !171, file: !171, line: 353, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!171 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!172 = !DISubroutineType(types: !173)
!173 = !{!29, !29}
!174 = !DISubprogram(name: "open", scope: !175, file: !175, line: 196, type: !176, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!175 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!176 = !DISubroutineType(types: !177)
!177 = !{!29, !27, !29, null}
!178 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !179, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!179 = !DISubroutineType(types: !180)
!180 = !{!25, !5, !27}
!181 = !DISubprogram(name: "lseek", scope: !171, file: !171, line: 334, type: !182, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!182 = !DISubroutineType(types: !183)
!183 = !{!60, !29, !60, !29}
!184 = !DISubprogram(name: "isatty", scope: !171, file: !171, line: 779, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!185 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!186 = !DISubroutineType(types: !187)
!187 = !{!25, !29, !5, !27}
!188 = !DISubprogram(name: "fileno", scope: !32, file: !32, line: 786, type: !189, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!189 = !DISubroutineType(types: !190)
!190 = !{!29, !35}
!191 = !DISubprogram(name: "safe_read", scope: !192, file: !192, line: 42, type: !193, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!192 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = !DISubroutineType(types: !194)
!194 = !{!86, !29, !82, !86}
!195 = !DISubprogram(name: "fwrite_unlocked", scope: !32, file: !32, line: 675, type: !196, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!196 = !DISubroutineType(types: !197)
!197 = !{!86, !198, !86, !86, !35}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DISubprogram(name: "fflush_unlocked", scope: !32, file: !32, line: 227, type: !189, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!201 = !DISubprogram(name: "getenv", scope: !107, file: !107, line: 634, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!202 = !DISubprogram(name: "mfile_name_concat", scope: !203, file: !203, line: 26, type: !204, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!203 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !DISubroutineType(types: !205)
!205 = !{!25, !27, !27, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!207 = !DISubprogram(name: "mkstemp_safer", scope: !208, file: !208, line: 20, type: !209, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!208 = !DIFile(filename: "./lib/stdlib-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !DISubroutineType(types: !210)
!210 = !{!29, !25}
!211 = !DISubprogram(name: "fdopen", scope: !32, file: !32, line: 279, type: !212, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!212 = !DISubroutineType(types: !213)
!213 = !{!35, !29, !27}
!214 = !DISubprogram(name: "unlink", scope: !171, file: !171, line: 825, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!215 = !DISubroutineType(types: !216)
!216 = !{!29, !27}
!217 = !DISubprogram(name: "free", scope: !107, file: !107, line: 565, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !82}
!220 = !DISubprogram(name: "clearerr_unlocked", scope: !32, file: !32, line: 765, type: !221, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !35}
!223 = !DISubprogram(name: "rpl_fseeko", scope: !224, file: !224, line: 1034, type: !225, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!224 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !DISubroutineType(types: !226)
!226 = !{!29, !35, !60, !29}
!227 = !DISubprogram(name: "ftruncate", scope: !171, file: !171, line: 1014, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!228 = !DISubroutineType(types: !229)
!229 = !{!29, !29, !60}
!230 = !DISubprogram(name: "rpl_re_search", scope: !137, file: !137, line: 553, type: !231, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!231 = !DISubroutineType(types: !232)
!232 = !{!60, !140, !27, !60, !60, !60, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !137, line: 497, size: 192, elements: !235)
!235 = !{!236, !238, !243}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !234, file: !137, line: 499, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !137, line: 45, baseType: !84)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !234, file: !137, line: 500, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !137, line: 486, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !32, line: 77, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !59, line: 193, baseType: !60)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !234, file: !137, line: 501, baseType: !239, size: 64, offset: 128)
!244 = !DISubprogram(name: "xrealloc", scope: !164, file: !164, line: 59, type: !245, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!245 = !DISubroutineType(types: !246)
!246 = !{!82, !82, !86}
!247 = !{!248, !0, !268, !270, !272, !274, !276, !278, !280, !282, !287, !292, !312, !314, !316, !335, !337}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "default_file_list", scope: !250, file: !3, line: 612, type: !265, isLocal: true, isDefinition: true)
!250 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 603, type: !251, scopeLine: 604, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !253)
!251 = !DISubroutineType(types: !252)
!252 = !{!29, !29, !206}
!253 = !{!254, !255, !256, !257, !258, !260, !261, !262}
!254 = !DILocalVariable(name: "argc", arg: 1, scope: !250, file: !3, line: 603, type: !29)
!255 = !DILocalVariable(name: "argv", arg: 2, scope: !250, file: !3, line: 603, type: !206)
!256 = !DILocalVariable(name: "error_message", scope: !250, file: !3, line: 605, type: !27)
!257 = !DILocalVariable(name: "optc", scope: !250, file: !3, line: 606, type: !29)
!258 = !DILocalVariable(name: "ok", scope: !250, file: !3, line: 607, type: !259)
!259 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!260 = !DILocalVariable(name: "half_buffer_size", scope: !250, file: !3, line: 608, type: !84)
!261 = !DILocalVariable(name: "file", scope: !250, file: !3, line: 613, type: !168)
!262 = !DILocalVariable(name: "i", scope: !263, file: !3, line: 694, type: !84)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 694, column: 5)
!264 = distinct !DILexicalBlock(scope: !250, file: !3, line: 692, column: 3)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 2)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "separator_ends_record", scope: !2, file: !3, line: 87, type: !259, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "sentinel_length", scope: !2, file: !3, line: 92, type: !84, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "match_length", scope: !2, file: !3, line: 97, type: !84, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "G_buffer", scope: !2, file: !3, line: 100, type: !25, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "read_size", scope: !2, file: !3, line: 103, type: !84, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "G_buffer_size", scope: !2, file: !3, line: 108, type: !84, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "compiled_separator", scope: !2, file: !3, line: 111, type: !141, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "compiled_separator_fastmap", scope: !2, file: !3, line: 112, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 256)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 115, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 1536, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 6)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "tempfile", scope: !294, file: !3, line: 433, type: !25, isLocal: true, isDefinition: true)
!294 = distinct !DISubprogram(name: "temp_stream", scope: !3, file: !3, line: 431, type: !295, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !301)
!295 = !DISubroutineType(types: !296)
!296 = !{!259, !297, !206}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !300, line: 7, baseType: !36)
!300 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!301 = !{!302, !303, !304, !307, !308, !309}
!302 = !DILocalVariable(name: "fp", arg: 1, scope: !294, file: !3, line: 431, type: !297)
!303 = !DILocalVariable(name: "file_name", arg: 2, scope: !294, file: !3, line: 431, type: !206)
!304 = !DILocalVariable(name: "t", scope: !305, file: !3, line: 437, type: !27)
!305 = distinct !DILexicalBlock(scope: !306, file: !3, line: 436, column: 5)
!306 = distinct !DILexicalBlock(scope: !294, file: !3, line: 435, column: 7)
!307 = !DILocalVariable(name: "tempdir", scope: !305, file: !3, line: 438, type: !27)
!308 = !DILocalVariable(name: "fd", scope: !305, file: !3, line: 455, type: !29)
!309 = !DILabel(scope: !310, name: "Reset", file: !3, line: 470)
!310 = distinct !DILexicalBlock(scope: !311, file: !3, line: 465, column: 9)
!311 = distinct !DILexicalBlock(scope: !305, file: !3, line: 464, column: 11)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !294, file: !3, line: 434, type: !298, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "regs", scope: !2, file: !3, line: 113, type: !234, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "buffer", scope: !318, file: !3, line: 161, type: !332, isLocal: true, isDefinition: true)
!318 = distinct !DISubprogram(name: "output", scope: !3, file: !3, line: 159, type: !319, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !321)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !27, !27}
!321 = !{!322, !323, !324, !325, !326, !330, !331}
!322 = !DILocalVariable(name: "start", arg: 1, scope: !318, file: !3, line: 159, type: !27)
!323 = !DILocalVariable(name: "past_end", arg: 2, scope: !318, file: !3, line: 159, type: !27)
!324 = !DILocalVariable(name: "bytes_to_add", scope: !318, file: !3, line: 163, type: !84)
!325 = !DILocalVariable(name: "bytes_available", scope: !318, file: !3, line: 164, type: !84)
!326 = !DILocalVariable(name: "__ptr", scope: !327, file: !3, line: 168, type: !27)
!327 = distinct !DILexicalBlock(scope: !328, file: !3, line: 168, column: 7)
!328 = distinct !DILexicalBlock(scope: !329, file: !3, line: 167, column: 5)
!329 = distinct !DILexicalBlock(scope: !318, file: !3, line: 166, column: 7)
!330 = !DILocalVariable(name: "__stream", scope: !327, file: !3, line: 168, type: !298)
!331 = !DILocalVariable(name: "__cnt", scope: !327, file: !3, line: 168, type: !84)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 65536, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 8192)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "bytes_in_buffer", scope: !318, file: !3, line: 162, type: !84, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 83, type: !259, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!340 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "Version", scope: !343, file: !344, line: 2, type: !27, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !345, nameTableKind: None)
!344 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!345 = !{!341}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "file_name", scope: !348, file: !349, line: 46, type: !27, isLocal: true, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !350, globals: !388, nameTableKind: None)
!349 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !{!351, !21, !387, !132}
!351 = !DISubprogram(name: "close_stream", scope: !352, file: !352, line: 2, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!352 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!353 = !DISubroutineType(types: !354)
!354 = !{!29, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !356, file: !37, line: 51, baseType: !29, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !356, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !356, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !356, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !356, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !356, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !356, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !356, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !356, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !356, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !356, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !356, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !356, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !356, file: !37, line: 70, baseType: !355, size: 64, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !356, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !356, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !356, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !356, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !356, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !356, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !356, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !356, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !356, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !356, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !356, file: !37, line: 93, baseType: !355, size: 64, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !356, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !356, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !356, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !356, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!387 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!388 = !{!346, !389}
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !348, file: !349, line: 56, type: !259, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "exit_failure", scope: !393, file: !394, line: 24, type: !396, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !395, nameTableKind: None)
!394 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!395 = !{!391}
!396 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "program_name", scope: !399, file: !400, line: 33, type: !27, isDefinition: true)
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !401, globals: !437, nameTableKind: None)
!400 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!401 = !{!82, !402, !25}
!402 = !DISubprogram(name: "fputs", scope: !32, file: !32, line: 626, type: !403, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!403 = !DISubroutineType(types: !404)
!404 = !{!29, !27, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !406, file: !37, line: 51, baseType: !29, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !406, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !406, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !406, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !406, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !406, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !406, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !406, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !406, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !406, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !406, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !406, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !406, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !406, file: !37, line: 70, baseType: !405, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !406, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !406, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !406, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !406, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !406, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !406, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !406, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !406, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !406, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !406, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !406, file: !37, line: 93, baseType: !405, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !406, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !406, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !406, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !406, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!437 = !{!397}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !440, file: !441, line: 85, type: !545, isDefinition: true)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !442, retainedTypes: !463, globals: !521, nameTableKind: None)
!441 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!5, !443, !448}
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!446 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!447 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 46, baseType: !7, size: 32, elements: !450)
!449 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!451 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!452 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!453 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!454 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!455 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!456 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!457 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!458 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!459 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!460 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!461 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!462 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!463 = !{!464, !467, !217, !483, !29, !62, !486, !84, !503, !507, !21, !513, !517, !25, !165, !163, !244}
!464 = !DISubprogram(name: "xmemdup", scope: !164, file: !164, line: 62, type: !465, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!465 = !DISubroutineType(types: !466)
!466 = !{!82, !198, !86}
!467 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !468, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!468 = !DISubroutineType(types: !469)
!469 = !{!25, !27, !86, !470, !471}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !441, line: 65, size: 448, elements: !474)
!474 = !{!475, !476, !477, !481, !482}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !473, file: !441, line: 68, baseType: !5, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !441, line: 71, baseType: !29, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !473, file: !441, line: 75, baseType: !478, size: 256, offset: 64)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !473, file: !441, line: 78, baseType: !27, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !473, file: !441, line: 81, baseType: !27, size: 64, offset: 384)
!483 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !484, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!484 = !DISubroutineType(types: !485)
!485 = !{!25, !29, !27, !27, !27, !86}
!486 = !DISubprogram(name: "rpl_mbrtowc", scope: !487, file: !487, line: 717, type: !488, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!487 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !DISubroutineType(types: !489)
!489 = !{!86, !126, !27, !86, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 13, size: 64, elements: !493)
!492 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !491, file: !492, line: 15, baseType: !29, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !491, file: !492, line: 20, baseType: !496, size: 32, offset: 32)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !491, file: !492, line: 16, size: 32, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !496, file: !492, line: 18, baseType: !7, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !496, file: !492, line: 19, baseType: !500, size: 32)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 4)
!503 = !DISubprogram(name: "iswprint", scope: !504, file: !504, line: 120, type: !505, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!504 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!505 = !DISubroutineType(types: !506)
!506 = !{!29, !7}
!507 = !DISubprogram(name: "mbsinit", scope: !508, file: !508, line: 292, type: !509, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!508 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!509 = !DISubroutineType(types: !510)
!510 = !{!29, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!513 = !DISubprogram(name: "locale_charset", scope: !514, file: !514, line: 35, type: !515, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!514 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!515 = !DISubroutineType(types: !516)
!516 = !{!27}
!517 = !DISubprogram(name: "c_strcasecmp", scope: !518, file: !518, line: 42, type: !519, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!518 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !DISubroutineType(types: !520)
!520 = !{!29, !27, !27}
!521 = !{!438, !522, !528, !530, !532, !534, !541, !543}
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !440, file: !441, line: 101, type: !524, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 320, elements: !526)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!526 = !{!527}
!527 = !DISubrange(count: 10)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !440, file: !441, line: 1052, type: !473, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !440, file: !441, line: 116, type: !473, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "slot0", scope: !440, file: !441, line: 842, type: !284, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "slotvec", scope: !440, file: !441, line: 845, type: !536, isLocal: true, isDefinition: true)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !441, line: 834, size: 128, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !537, file: !441, line: 836, baseType: !84, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !537, file: !441, line: 837, baseType: !25, size: 64, offset: 64)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "nslots", scope: !440, file: !441, line: 843, type: !29, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "slotvec0", scope: !440, file: !441, line: 844, type: !537, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 704, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 11)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !550, file: !551, line: 26, type: !553, isDefinition: true)
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !552, nameTableKind: None)
!551 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = !{!548}
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 376, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 47)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "rpl_re_syntax_options", scope: !558, file: !1323, line: 243, type: !150, isDefinition: true)
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !560, retainedTypes: !1023, globals: !1320, nameTableKind: None)
!559 = !DIFile(filename: "lib/regex.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!560 = !{!561, !574, !610, !630, !448, !1016}
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 206, baseType: !7, size: 32, elements: !563)
!562 = !DIFile(filename: "./lib/regex_internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!564 = !DIEnumerator(name: "INSIDE_WORD", value: 5, isUnsigned: true)
!565 = !DIEnumerator(name: "WORD_FIRST", value: 6, isUnsigned: true)
!566 = !DIEnumerator(name: "WORD_LAST", value: 9, isUnsigned: true)
!567 = !DIEnumerator(name: "INSIDE_NOTWORD", value: 10, isUnsigned: true)
!568 = !DIEnumerator(name: "LINE_FIRST", value: 16, isUnsigned: true)
!569 = !DIEnumerator(name: "LINE_LAST", value: 32, isUnsigned: true)
!570 = !DIEnumerator(name: "BUF_FIRST", value: 64, isUnsigned: true)
!571 = !DIEnumerator(name: "BUF_LAST", value: 128, isUnsigned: true)
!572 = !DIEnumerator(name: "WORD_DELIM", value: 256, isUnsigned: true)
!573 = !DIEnumerator(name: "NOT_WORD_DELIM", value: 512, isUnsigned: true)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 227, baseType: !7, size: 32, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!576 = !DIEnumerator(name: "NON_TYPE", value: 0, isUnsigned: true)
!577 = !DIEnumerator(name: "CHARACTER", value: 1, isUnsigned: true)
!578 = !DIEnumerator(name: "END_OF_RE", value: 2, isUnsigned: true)
!579 = !DIEnumerator(name: "SIMPLE_BRACKET", value: 3, isUnsigned: true)
!580 = !DIEnumerator(name: "OP_BACK_REF", value: 4, isUnsigned: true)
!581 = !DIEnumerator(name: "OP_PERIOD", value: 5, isUnsigned: true)
!582 = !DIEnumerator(name: "COMPLEX_BRACKET", value: 6, isUnsigned: true)
!583 = !DIEnumerator(name: "OP_UTF8_PERIOD", value: 7, isUnsigned: true)
!584 = !DIEnumerator(name: "OP_OPEN_SUBEXP", value: 8, isUnsigned: true)
!585 = !DIEnumerator(name: "OP_CLOSE_SUBEXP", value: 9, isUnsigned: true)
!586 = !DIEnumerator(name: "OP_ALT", value: 10, isUnsigned: true)
!587 = !DIEnumerator(name: "OP_DUP_ASTERISK", value: 11, isUnsigned: true)
!588 = !DIEnumerator(name: "ANCHOR", value: 12, isUnsigned: true)
!589 = !DIEnumerator(name: "CONCAT", value: 16, isUnsigned: true)
!590 = !DIEnumerator(name: "SUBEXP", value: 17, isUnsigned: true)
!591 = !DIEnumerator(name: "OP_DUP_PLUS", value: 18, isUnsigned: true)
!592 = !DIEnumerator(name: "OP_DUP_QUESTION", value: 19, isUnsigned: true)
!593 = !DIEnumerator(name: "OP_OPEN_BRACKET", value: 20, isUnsigned: true)
!594 = !DIEnumerator(name: "OP_CLOSE_BRACKET", value: 21, isUnsigned: true)
!595 = !DIEnumerator(name: "OP_CHARSET_RANGE", value: 22, isUnsigned: true)
!596 = !DIEnumerator(name: "OP_OPEN_DUP_NUM", value: 23, isUnsigned: true)
!597 = !DIEnumerator(name: "OP_CLOSE_DUP_NUM", value: 24, isUnsigned: true)
!598 = !DIEnumerator(name: "OP_NON_MATCH_LIST", value: 25, isUnsigned: true)
!599 = !DIEnumerator(name: "OP_OPEN_COLL_ELEM", value: 26, isUnsigned: true)
!600 = !DIEnumerator(name: "OP_CLOSE_COLL_ELEM", value: 27, isUnsigned: true)
!601 = !DIEnumerator(name: "OP_OPEN_EQUIV_CLASS", value: 28, isUnsigned: true)
!602 = !DIEnumerator(name: "OP_CLOSE_EQUIV_CLASS", value: 29, isUnsigned: true)
!603 = !DIEnumerator(name: "OP_OPEN_CHAR_CLASS", value: 30, isUnsigned: true)
!604 = !DIEnumerator(name: "OP_CLOSE_CHAR_CLASS", value: 31, isUnsigned: true)
!605 = !DIEnumerator(name: "OP_WORD", value: 32, isUnsigned: true)
!606 = !DIEnumerator(name: "OP_NOTWORD", value: 33, isUnsigned: true)
!607 = !DIEnumerator(name: "OP_SPACE", value: 34, isUnsigned: true)
!608 = !DIEnumerator(name: "OP_NOTSPACE", value: 35, isUnsigned: true)
!609 = !DIEnumerator(name: "BACK_SLASH", value: 36, isUnsigned: true)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 346, baseType: !29, size: 32, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!612 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!613 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!614 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!615 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!616 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!617 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!618 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!619 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!620 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!621 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!622 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!623 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!624 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!625 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!626 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!627 = !DIEnumerator(name: "_REG_EEND", value: 14)
!628 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!629 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !631, line: 41, baseType: !7, size: 32, elements: !632)
!631 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!633 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!634 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!635 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!636 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!637 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!638 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!639 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!640 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!641 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!642 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!643 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!644 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!645 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!646 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!647 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!648 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!649 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!650 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!651 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!652 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!653 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!654 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!655 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!656 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!657 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!658 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!659 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!660 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!661 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!662 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!663 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!664 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!665 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!666 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!667 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!668 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!669 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!670 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!671 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!672 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!673 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!674 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!675 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!676 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!677 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!678 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!679 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!680 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!681 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!682 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!741 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!744 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!745 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!746 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!747 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!748 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!749 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!750 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!751 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!752 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!753 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!754 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!755 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!828 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!901 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!902 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!903 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!904 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!905 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!906 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!907 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!908 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!909 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!910 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!911 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!912 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!913 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!914 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!915 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!917 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!918 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!919 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!920 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!921 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!922 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!948 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!949 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!950 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!951 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!952 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!957 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!958 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!959 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!960 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1016 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 699, baseType: !7, size: 32, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022}
!1018 = !DIEnumerator(name: "SB_CHAR", value: 0, isUnsigned: true)
!1019 = !DIEnumerator(name: "MB_CHAR", value: 1, isUnsigned: true)
!1020 = !DIEnumerator(name: "EQUIV_CLASS", value: 2, isUnsigned: true)
!1021 = !DIEnumerator(name: "COLL_SYM", value: 3, isUnsigned: true)
!1022 = !DIEnumerator(name: "CHAR_CLASS", value: 4, isUnsigned: true)
!1023 = !{!86, !29, !21, !25, !82, !217, !27, !1024, !1036, !84, !1039, !153, !1040, !1045, !1178, !1182, !1054, !1185, !1187, !1093, !1190, !1063, !1195, !1196, !62, !1188, !1150, !1057, !1062, !1067, !1197, !1200, !1096, !1202, !1113, !1112, !1221, !1227, !154, !237, !1228, !1237, !1263, !1255, !1266, !1313}
!1024 = !DISubprogram(name: "rpl_mbrtowc", scope: !487, file: !487, line: 717, type: !1025, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!86, !126, !27, !86, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 13, size: 64, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1028, file: !492, line: 15, baseType: !29, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1028, file: !492, line: 20, baseType: !1032, size: 32, offset: 32)
!1032 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !492, line: 16, size: 32, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1032, file: !492, line: 18, baseType: !7, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1032, file: !492, line: 19, baseType: !500, size: 32)
!1036 = !DISubprogram(name: "towlower", scope: !504, file: !504, line: 166, type: !1037, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!7, !7}
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_word_t", file: !562, line: 182, baseType: !86)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfa_t", file: !562, line: 416, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !562, line: 645, size: 1856, elements: !1043)
!1043 = !{!1044, !1090, !1091, !1092, !1094, !1095, !1103, !1104, !1105, !1132, !1133, !1134, !1135, !1136, !1149, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1176, !1177}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1042, file: !562, line: 647, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_t", file: !562, line: 353, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 326, size: 128, elements: !1048)
!1048 = !{!1049, !1082, !1084, !1085, !1086, !1087, !1088, !1089}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "opr", scope: !1047, file: !562, line: 337, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1047, file: !562, line: 328, size: 64, elements: !1051)
!1051 = !{!1052, !1053, !1056, !1079, !1080}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1050, file: !562, line: 330, baseType: !154, size: 8)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "sbcset", scope: !1050, file: !562, line: 331, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_bitset_ptr_t", file: !562, line: 192, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "mbcset", scope: !1050, file: !562, line: 333, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_charset_t", file: !562, line: 323, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 279, size: 640, elements: !1060)
!1060 = !{!1061, !1064, !1065, !1066, !1069, !1070, !1075, !1076, !1077, !1078}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mbchars", scope: !1059, file: !562, line: 282, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !85, line: 74, baseType: !29)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "range_starts", scope: !1059, file: !562, line: 299, baseType: !1062, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "range_ends", scope: !1059, file: !562, line: 300, baseType: !1062, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "char_classes", scope: !1059, file: !562, line: 304, baseType: !1067, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !504, line: 38, baseType: !86)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "non_match", scope: !1059, file: !562, line: 307, baseType: !7, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nmbchars", scope: !1059, file: !562, line: 310, baseType: !1071, size: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "Idx", file: !562, line: 170, baseType: !1072)
