; ModuleID = 'coreutils-8.32/src/tail.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.timeval = type { i64, i64 }
%struct.fd_set = type { [16 x i64] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timeval, %struct.timeval, %struct.timeval, [3 x i64] }
%struct.File_spec = type { i8*, i64, %struct.timeval, i64, i64, i32, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct.linebuffer = type { [8192 x i8], i64, i64, %struct.linebuffer* }
%struct.charbuffer = type { [8192 x i8], i64, %struct.charbuffer* }

!20 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!25 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!26 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!28 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !30, line: 25, baseType: !6, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 42, baseType: !6, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40}
!40 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!41 = !{!6, !42, !43, !45, !50, !52, !55, !57, !58, !62, !65, !49}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !46, line: 97, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !48, line: 154, baseType: !49)
!48 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !59, line: 63, baseType: !60)
!59 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !48, line: 152, baseType: !61)
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !63, line: 7, baseType: !64)
!63 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !48, line: 160, baseType: !61)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !66, line: 49, baseType: !61)
!66 = !DIFile(filename: "/usr/include/sys/select.h", directory: "")
!67 = !{!68, !160, !162, !164, !166, !168, !170, !172, !174, !175, !177, !191, !193, !199, !203, !205, !207, !209}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !70, file: !3, line: 2386, type: !50, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2331, type: !71, scopeLine: 2332, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !74)
!71 = !DISubroutineType(types: !72)
!72 = !{!49, !49, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!74 = !{!75, !76, !77, !78, !80, !84, !85, !86, !118, !119, !120, !122, !124, !153, !154, !157}
!75 = !DILocalVariable(name: "argc", arg: 1, scope: !70, file: !3, line: 2331, type: !49)
!76 = !DILocalVariable(name: "argv", arg: 2, scope: !70, file: !3, line: 2331, type: !73)
!77 = !DILocalVariable(name: "header_mode", scope: !70, file: !3, line: 2333, type: !5)
!78 = !DILocalVariable(name: "ok", scope: !70, file: !3, line: 2334, type: !79)
!79 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!80 = !DILocalVariable(name: "n_units", scope: !70, file: !3, line: 2338, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !82, line: 102, baseType: !83)
!82 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !48, line: 73, baseType: !54)
!84 = !DILocalVariable(name: "n_files", scope: !70, file: !3, line: 2339, type: !52)
!85 = !DILocalVariable(name: "file", scope: !70, file: !3, line: 2340, type: !73)
!86 = !DILocalVariable(name: "F", scope: !70, file: !3, line: 2341, type: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !3, line: 118, size: 768, elements: !89)
!89 = !{!90, !91, !92, !99, !102, !105, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !3, line: 121, baseType: !50, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !3, line: 124, baseType: !58, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !88, file: !3, line: 125, baseType: !93, size: 128, offset: 128)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !94, line: 10, size: 128, elements: !95)
!94 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !93, file: !94, line: 12, baseType: !64, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !93, file: !94, line: 16, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !48, line: 197, baseType: !61)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !88, file: !3, line: 126, baseType: !100, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !46, line: 59, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !48, line: 145, baseType: !54)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !88, file: !3, line: 127, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !46, line: 47, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !48, line: 148, baseType: !54)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !88, file: !3, line: 128, baseType: !106, size: 32, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !46, line: 69, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !48, line: 150, baseType: !6)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !88, file: !3, line: 133, baseType: !79, size: 8, offset: 416)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !88, file: !3, line: 136, baseType: !79, size: 8, offset: 424)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !88, file: !3, line: 140, baseType: !79, size: 8, offset: 432)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !88, file: !3, line: 143, baseType: !49, size: 32, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !88, file: !3, line: 146, baseType: !49, size: 32, offset: 480)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !88, file: !3, line: 149, baseType: !49, size: 32, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !88, file: !3, line: 153, baseType: !49, size: 32, offset: 544)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !88, file: !3, line: 157, baseType: !49, size: 32, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !88, file: !3, line: 160, baseType: !52, size: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !88, file: !3, line: 164, baseType: !81, size: 64, offset: 704)
!118 = !DILocalVariable(name: "i", scope: !70, file: !3, line: 2342, type: !52)
!119 = !DILocalVariable(name: "obsolete_option", scope: !70, file: !3, line: 2343, type: !79)
!120 = !DILocalVariable(name: "sleep_interval", scope: !70, file: !3, line: 2348, type: !121)
!121 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!122 = !DILocalVariable(name: "found_hyphen", scope: !123, file: !3, line: 2392, type: !79)
!123 = distinct !DILexicalBlock(scope: !70, file: !3, line: 2391, column: 3)
!124 = !DILocalVariable(name: "in_stat", scope: !125, file: !3, line: 2408, type: !127)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 2407, column: 7)
!126 = distinct !DILexicalBlock(scope: !123, file: !3, line: 2406, column: 9)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !128, line: 26, size: 1152, elements: !129)
!128 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!129 = !{!130, !131, !132, !134, !135, !137, !139, !140, !141, !142, !144, !146, !147, !148, !149}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !127, file: !128, line: 28, baseType: !101, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !127, file: !128, line: 33, baseType: !104, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !127, file: !128, line: 41, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !48, line: 151, baseType: !54)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !127, file: !128, line: 42, baseType: !107, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !127, file: !128, line: 44, baseType: !136, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !48, line: 146, baseType: !6)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !127, file: !128, line: 45, baseType: !138, size: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !48, line: 147, baseType: !6)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !127, file: !128, line: 47, baseType: !49, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !127, file: !128, line: 49, baseType: !101, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !127, file: !128, line: 54, baseType: !60, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !127, file: !128, line: 58, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !48, line: 175, baseType: !61)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !127, file: !128, line: 60, baseType: !145, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !48, line: 180, baseType: !61)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !127, file: !128, line: 71, baseType: !93, size: 128, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !127, file: !128, line: 72, baseType: !93, size: 128, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !127, file: !128, line: 73, baseType: !93, size: 128, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !127, file: !128, line: 86, baseType: !150, size: 192, offset: 960)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 3)
!153 = !DILocalVariable(name: "blocking_stdin", scope: !125, file: !3, line: 2409, type: !79)
!154 = !DILocalVariable(name: "out_stat", scope: !155, file: !3, line: 2442, type: !127)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 2438, column: 5)
!156 = distinct !DILexicalBlock(scope: !70, file: !3, line: 2437, column: 7)
!157 = !DILocalVariable(name: "wd", scope: !158, file: !3, line: 2500, type: !49)
!158 = distinct !DILexicalBlock(scope: !159, file: !3, line: 2499, column: 9)
!159 = distinct !DILexicalBlock(scope: !155, file: !3, line: 2498, column: 11)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "count_lines", scope: !2, file: !3, line: 173, type: !79, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "forever", scope: !2, file: !3, line: 180, type: !79, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "monitor_output", scope: !2, file: !3, line: 183, type: !79, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "from_start", scope: !2, file: !3, line: 186, type: !79, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 189, type: !79, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 192, type: !51, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "pid", scope: !2, file: !3, line: 211, type: !45, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !2, file: !3, line: 222, type: !79, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 236, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 4096, elements: !189)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !182, line: 50, size: 256, elements: !183)
!182 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!183 = !{!184, !185, !186, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !182, line: 52, baseType: !55, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !181, file: !182, line: 55, baseType: !49, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !182, line: 56, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !181, file: !182, line: 57, baseType: !49, size: 32, offset: 192)
!189 = !{!190}
!190 = !DISubrange(count: 16)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !2, file: !3, line: 169, type: !79, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !2, file: !3, line: 113, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 64, elements: !197)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!197 = !{!198}
!198 = !DISubrange(count: 2)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !2, file: !3, line: 108, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 192, elements: !151)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !2, file: !3, line: 206, type: !81, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 219, type: !79, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "follow_mode", scope: !2, file: !3, line: 177, type: !11, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "first_file", scope: !211, file: !3, line: 423, type: !79, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 421, type: !212, scopeLine: 422, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !214)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !55}
!214 = !{!215}
!215 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !211, file: !3, line: 421, type: !55)
!216 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!217 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 10, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!218 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!219 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!220 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!221 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "Version", scope: !224, file: !225, line: 2, type: !55, isLocal: false, isDefinition: true)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, globals: !227, splitDebugInlining: false, nameTableKind: None)
!225 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!226 = !{}
!227 = !{!222}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !230, file: !231, line: 67, type: !235, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !233, globals: !234, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!232 = !{!15}
!233 = !{!42, !55, !57}
!234 = !{!228}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !236, line: 61, baseType: !237)
!236 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null}
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "file_name", scope: !242, file: !243, line: 46, type: !55, isLocal: true, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, globals: !244, splitDebugInlining: false, nameTableKind: None)
!243 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!244 = !{!240, !245}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !242, file: !243, line: 56, type: !79, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "exit_failure", scope: !249, file: !250, line: 24, type: !252, isLocal: false, isDefinition: true)
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, globals: !251, splitDebugInlining: false, nameTableKind: None)
!250 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !{!247}
!252 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "default_tuning", scope: !255, file: !256, line: 130, type: !259, isLocal: true, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !257, globals: !258, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = !{!54, !42, !52}
!258 = !{!253}
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !261, line: 65, baseType: !262)
!261 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !261, line: 53, size: 160, elements: !263)
!263 = !{!264, !266, !267, !268, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !262, file: !261, line: 58, baseType: !265, size: 32)
!265 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !262, file: !261, line: 59, baseType: !265, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !262, file: !261, line: 60, baseType: !265, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !262, file: !261, line: 61, baseType: !265, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !262, file: !261, line: 62, baseType: !79, size: 8, offset: 128)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "program_name", scope: !272, file: !273, line: 33, type: !55, isLocal: false, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !274, globals: !275, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = !{!42, !50}
!275 = !{!270}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !278, file: !279, line: 85, type: !340, isLocal: false, isDefinition: true)
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !280, retainedTypes: !301, globals: !303, splitDebugInlining: false, nameTableKind: None)
!279 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!280 = !{!15, !281, !286}
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !16, line: 242, baseType: !6, size: 32, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !287, line: 46, baseType: !6, size: 32, elements: !288)
!287 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!289 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!290 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!291 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!292 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!293 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!294 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!295 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!296 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!297 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!300 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!301 = !{!49, !302, !52, !50}
!302 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!303 = !{!276, !304, !310, !322, !324, !329, !336, !338}
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !278, file: !279, line: 101, type: !306, isLocal: false, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 320, elements: !308)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!308 = !{!309}
!309 = !DISubrange(count: 10)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !278, file: !279, line: 1052, type: !312, isLocal: false, isDefinition: true)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !279, line: 65, size: 448, elements: !313)
!313 = !{!314, !315, !316, !320, !321}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !312, file: !279, line: 68, baseType: !15, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !279, line: 71, baseType: !49, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !312, file: !279, line: 75, baseType: !317, size: 256, offset: 64)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !312, file: !279, line: 78, baseType: !55, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !312, file: !279, line: 81, baseType: !55, size: 64, offset: 384)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !278, file: !279, line: 116, type: !312, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "slot0", scope: !278, file: !279, line: 842, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 256)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "slotvec", scope: !278, file: !279, line: 845, type: !331, isLocal: true, isDefinition: true)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !279, line: 834, size: 128, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !332, file: !279, line: 836, baseType: !52, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !332, file: !279, line: 837, baseType: !50, size: 64, offset: 64)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "nslots", scope: !278, file: !279, line: 843, type: !49, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "slotvec0", scope: !278, file: !279, line: 844, type: !332, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 704, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 11)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !345, file: !346, line: 26, type: !348, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, globals: !347, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = !{!343}
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 47)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !353, file: !354, line: 507, type: !49, isLocal: true, isDefinition: true)
!353 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !354, file: !354, line: 488, type: !355, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !357, retainedNodes: !359)
!354 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!355 = !DISubroutineType(types: !356)
!356 = !{!49, !49, !49}
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, globals: !358, splitDebugInlining: false, nameTableKind: None)
!358 = !{!351}
!359 = !{!360, !361, !362, !363, !366}
!360 = !DILocalVariable(name: "fd", arg: 1, scope: !353, file: !354, line: 488, type: !49)
!361 = !DILocalVariable(name: "target", arg: 2, scope: !353, file: !354, line: 488, type: !49)
!362 = !DILocalVariable(name: "result", scope: !353, file: !354, line: 490, type: !49)
!363 = !DILocalVariable(name: "flags", scope: !364, file: !354, line: 531, type: !49)
!364 = distinct !DILexicalBlock(scope: !365, file: !354, line: 530, column: 5)
!365 = distinct !DILexicalBlock(scope: !353, file: !354, line: 529, column: 7)
!366 = !DILocalVariable(name: "saved_errno", scope: !367, file: !354, line: 534, type: !49)
!367 = distinct !DILexicalBlock(scope: !368, file: !354, line: 533, column: 9)
!368 = distinct !DILexicalBlock(scope: !364, file: !354, line: 532, column: 11)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !371, file: !372, line: 50, type: !397, isLocal: true, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !373, globals: !396, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !{!50, !374}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !375, line: 24, baseType: !376)
!375 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !377, line: 42, baseType: !378)
!377 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !377, line: 28, size: 1856, elements: !380)
!380 = !{!381, !387, !390, !393, !394}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !379, file: !377, line: 31, baseType: !382, size: 832)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 832, elements: !385)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !377, line: 31, flags: DIFlagFwdDecl)
!385 = !{!386}
!386 = !DISubrange(count: 13)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !379, file: !377, line: 34, baseType: !388, size: 64, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !379, file: !377, line: 35, baseType: !391, size: 64, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !379, file: !377, line: 36, baseType: !391, size: 64, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !379, file: !377, line: 39, baseType: !395, size: 832, offset: 1024)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 832, elements: !385)
!396 = !{!369}
!397 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !374)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "lib/cl-strtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !404, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!404 = !{!50}
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!408 = !DIFile(filename: "lib/offtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !46, line: 85, baseType: !60)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/posixver.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !415, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!415 = !{!416}
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !417, line: 40, baseType: !6, size: 32, elements: !418)
!417 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!419}
!419 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!424 = !{!425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 40, baseType: !6, size: 32, elements: !426)
!426 = !{!427}
!427 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!428 = !{!42}
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !431, retainedTypes: !445, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!431 = !{!432}
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !434, file: !433, line: 186, baseType: !6, size: 32, elements: !443)
!433 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!434 = distinct !DISubprogram(name: "x2nrealloc", scope: !433, file: !433, line: 174, type: !435, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !429, retainedNodes: !438)
!435 = !DISubroutineType(types: !436)
!436 = !{!42, !42, !437, !52}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!438 = !{!439, !440, !441, !442}
!439 = !DILocalVariable(name: "p", arg: 1, scope: !434, file: !433, line: 174, type: !42)
!440 = !DILocalVariable(name: "pn", arg: 2, scope: !434, file: !433, line: 174, type: !437)
!441 = !DILocalVariable(name: "s", arg: 3, scope: !434, file: !433, line: 174, type: !52)
!442 = !DILocalVariable(name: "n", scope: !434, file: !433, line: 176, type: !52)
!443 = !{!444}
!444 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!445 = !{!52, !50, !42}
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !450, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!450 = !{!29}
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "lib/xnanosleep.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!453 = !{!62}
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/xstrtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !458, retainedTypes: !459, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = !{!29, !286}
!459 = !{!49, !302}
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !464, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!464 = !{!52}
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !467, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/nanosleep.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!468}
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !466, line: 41, baseType: !6, size: 32, elements: !469)
!469 = !{!470}
!470 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !475, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "lib/dtotimespec.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!475 = !{!37}
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !480, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!480 = !{!481}
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !482, line: 41, baseType: !6, size: 32, elements: !483)
!482 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!484 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!485 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!486 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!487 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!488 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!489 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!490 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!491 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!492 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!493 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!494 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!495 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!496 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!497 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!498 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!499 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!500 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!501 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!502 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!503 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!504 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!505 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!506 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!507 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!508 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!509 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!510 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!511 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!512 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!513 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!514 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!515 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!516 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!517 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!518 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!519 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!520 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!521 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!522 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!523 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!524 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!525 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!526 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!527 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!528 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!529 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!530 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!531 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!532 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!533 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!592 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!595 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!596 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!597 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!598 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!599 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!600 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!601 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!602 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!603 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!604 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!605 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!606 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!679 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!752 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!753 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!754 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!755 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!756 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!757 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!758 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!759 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!760 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!761 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!762 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!763 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!764 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!765 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!766 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!768 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!769 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!770 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!771 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!772 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!773 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!799 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!800 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!801 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!802 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!803 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!808 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!809 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!810 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!811 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, splitDebugInlining: false, nameTableKind: None)
!872 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!874 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!877 = !{!"clang version 12.0.1"}
!878 = !{i32 7, !"Dwarf Version", i32 4}
!879 = !{i32 2, !"Debug Info Version", i32 3}
!880 = !{i32 1, !"wchar_size", i32 4}
!881 = !{i32 7, !"PIC Level", i32 2}
!882 = !{i32 7, !"PIE Level", i32 2}
!883 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 259, type: !884, scopeLine: 260, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !886)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !49}
!886 = !{!887}
!887 = !DILocalVariable(name: "status", arg: 1, scope: !883, file: !3, line: 259, type: !49)
!888 = !DILocation(line: 0, scope: !883)
!889 = !DILocation(line: 261, column: 14, scope: !890)
!890 = distinct !DILexicalBlock(scope: !883, file: !3, line: 261, column: 7)
!891 = !DILocation(line: 261, column: 7, scope: !883)
!892 = !DILocation(line: 262, column: 5, scope: !893)
!893 = distinct !DILexicalBlock(scope: !890, file: !3, line: 262, column: 5)
!894 = !{!895, !895, i64 0}
!895 = !{!"any pointer", !896, i64 0}
!896 = !{!"omnipotent char", !897, i64 0}
!897 = !{!"Simple C/C++ TBAA"}
!898 = !DILocation(line: 265, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !890, file: !3, line: 264, column: 5)
!900 = !DILocation(line: 269, column: 7, scope: !899)
!901 = !DILocation(line: 583, column: 3, scope: !902, inlinedAt: !904)
!902 = distinct !DISubprogram(name: "emit_stdin_note", scope: !903, file: !903, line: 581, type: !238, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!903 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!904 = distinct !DILocation(line: 274, column: 7, scope: !899)
!905 = !DILocation(line: 590, column: 3, scope: !906, inlinedAt: !907)
!906 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !903, file: !903, line: 588, type: !238, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!907 = distinct !DILocation(line: 275, column: 7, scope: !899)
!908 = !DILocation(line: 277, column: 6, scope: !899)
!909 = !DILocation(line: 281, column: 6, scope: !899)
!910 = !DILocation(line: 287, column: 6, scope: !899)
!911 = !DILocation(line: 300, column: 6, scope: !899)
!912 = !DILocation(line: 305, column: 6, scope: !899)
!913 = !DILocation(line: 312, column: 6, scope: !899)
!914 = !DILocation(line: 315, column: 6, scope: !899)
!915 = !DILocation(line: 316, column: 6, scope: !899)
!916 = !DILocation(line: 317, column: 6, scope: !899)
!917 = !DILocation(line: 325, column: 6, scope: !899)
!918 = !DILocalVariable(name: "program", arg: 1, scope: !919, file: !903, line: 634, type: !55)
!919 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !903, file: !903, line: 634, type: !212, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !920)
!920 = !{!918, !921, !930, !931, !933}
!921 = !DILocalVariable(name: "infomap", scope: !919, file: !903, line: 636, type: !922)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 896, elements: !928)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !919, file: !903, line: 636, size: 128, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !924, file: !903, line: 636, baseType: !55, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !924, file: !903, line: 636, baseType: !55, size: 64, offset: 64)
!928 = !{!929}
!929 = !DISubrange(count: 7)
!930 = !DILocalVariable(name: "node", scope: !919, file: !903, line: 646, type: !55)
!931 = !DILocalVariable(name: "map_prog", scope: !919, file: !903, line: 647, type: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!933 = !DILocalVariable(name: "lc_messages", scope: !919, file: !903, line: 659, type: !55)
!934 = !DILocation(line: 0, scope: !919, inlinedAt: !935)
!935 = distinct !DILocation(line: 333, column: 7, scope: !899)
!936 = !DILocation(line: 636, column: 3, scope: !919, inlinedAt: !935)
!937 = !DILocation(line: 636, column: 67, scope: !919, inlinedAt: !935)
!938 = !DILocation(line: 647, column: 36, scope: !919, inlinedAt: !935)
!939 = !DILocation(line: 649, column: 3, scope: !919, inlinedAt: !935)
!940 = !DILocation(line: 649, column: 33, scope: !919, inlinedAt: !935)
!941 = !DILocation(line: 650, column: 13, scope: !919, inlinedAt: !935)
!942 = !DILocation(line: 649, column: 20, scope: !919, inlinedAt: !935)
!943 = !{!944, !895, i64 0}
!944 = !{!"infomap", !895, i64 0, !895, i64 8}
!945 = !DILocation(line: 649, column: 10, scope: !919, inlinedAt: !935)
!946 = !DILocation(line: 649, column: 28, scope: !919, inlinedAt: !935)
!947 = distinct !{!947, !939, !941, !948}
!948 = !{!"llvm.loop.mustprogress"}
!949 = !DILocation(line: 652, column: 17, scope: !950, inlinedAt: !935)
!950 = distinct !DILexicalBlock(scope: !919, file: !903, line: 652, column: 7)
!951 = !{!944, !895, i64 8}
!952 = !DILocation(line: 652, column: 7, scope: !950, inlinedAt: !935)
!953 = !DILocation(line: 652, column: 7, scope: !919, inlinedAt: !935)
!954 = !DILocation(line: 655, column: 3, scope: !919, inlinedAt: !935)
!955 = !DILocation(line: 659, column: 29, scope: !919, inlinedAt: !935)
!956 = !DILocation(line: 660, column: 7, scope: !957, inlinedAt: !935)
!957 = distinct !DILexicalBlock(scope: !919, file: !903, line: 660, column: 7)
!958 = !DILocation(line: 660, column: 19, scope: !957, inlinedAt: !935)
!959 = !DILocation(line: 660, column: 22, scope: !957, inlinedAt: !935)
!960 = !DILocation(line: 660, column: 7, scope: !919, inlinedAt: !935)
!961 = !DILocation(line: 666, column: 7, scope: !962, inlinedAt: !935)
!962 = distinct !DILexicalBlock(scope: !957, file: !903, line: 661, column: 5)
!963 = !DILocation(line: 668, column: 5, scope: !962, inlinedAt: !935)
!964 = !DILocation(line: 669, column: 3, scope: !919, inlinedAt: !935)
!965 = !DILocation(line: 671, column: 3, scope: !919, inlinedAt: !935)
!966 = !DILocation(line: 673, column: 1, scope: !919, inlinedAt: !935)
!967 = !DILocation(line: 335, column: 3, scope: !883)
!968 = !DISubprogram(name: "dcgettext", scope: !969, file: !969, line: 51, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !226)
!969 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!970 = !DISubroutineType(types: !971)
!971 = !{!50, !55, !55, !49}
!972 = !DISubprogram(name: "fputs_unlocked", scope: !59, file: !59, line: 667, type: !973, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !226)
!973 = !DISubroutineType(types: !974)
!974 = !{!49, !55, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !977, line: 49, size: 1728, elements: !978)
!977 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !994, !995, !996, !997, !998, !999, !1001, !1005, !1008, !1010, !1013, !1016, !1017, !1018, !1019, !1020}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !976, file: !977, line: 51, baseType: !49, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !976, file: !977, line: 54, baseType: !50, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !976, file: !977, line: 55, baseType: !50, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !976, file: !977, line: 56, baseType: !50, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !976, file: !977, line: 57, baseType: !50, size: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !976, file: !977, line: 58, baseType: !50, size: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !976, file: !977, line: 59, baseType: !50, size: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !976, file: !977, line: 60, baseType: !50, size: 64, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !976, file: !977, line: 61, baseType: !50, size: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !976, file: !977, line: 64, baseType: !50, size: 64, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !976, file: !977, line: 65, baseType: !50, size: 64, offset: 640)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !976, file: !977, line: 66, baseType: !50, size: 64, offset: 704)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !976, file: !977, line: 68, baseType: !992, size: 64, offset: 768)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !977, line: 36, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !976, file: !977, line: 70, baseType: !975, size: 64, offset: 832)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !976, file: !977, line: 72, baseType: !49, size: 32, offset: 896)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !976, file: !977, line: 73, baseType: !49, size: 32, offset: 928)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !976, file: !977, line: 74, baseType: !60, size: 64, offset: 960)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !976, file: !977, line: 77, baseType: !302, size: 16, offset: 1024)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !976, file: !977, line: 78, baseType: !1000, size: 8, offset: 1040)
!1000 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !976, file: !977, line: 79, baseType: !1002, size: 8, offset: 1048)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 1)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !976, file: !977, line: 81, baseType: !1006, size: 64, offset: 1088)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !977, line: 43, baseType: null)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !976, file: !977, line: 89, baseType: !1009, size: 64, offset: 1152)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !48, line: 153, baseType: !61)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !976, file: !977, line: 91, baseType: !1011, size: 64, offset: 1216)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !977, line: 37, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !976, file: !977, line: 92, baseType: !1014, size: 64, offset: 1280)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !977, line: 38, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !976, file: !977, line: 93, baseType: !975, size: 64, offset: 1344)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !976, file: !977, line: 94, baseType: !42, size: 64, offset: 1408)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !976, file: !977, line: 95, baseType: !52, size: 64, offset: 1472)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !976, file: !977, line: 96, baseType: !49, size: 32, offset: 1536)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !976, file: !977, line: 98, baseType: !1021, size: 160, offset: 1568)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 160, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 20)
!1024 = !DISubprogram(name: "setlocale", scope: !1025, file: !1025, line: 122, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !226)
!1025 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!50, !49, !55}
!1028 = !DILocation(line: 0, scope: !70)
!1029 = !DILocation(line: 2338, column: 3, scope: !70)
!1030 = !DILocation(line: 2338, column: 13, scope: !70)
!1031 = !{!1032, !1032, i64 0}
!1032 = !{!"long", !896, i64 0}
!1033 = !DILocation(line: 2351, column: 21, scope: !70)
!1034 = !DILocation(line: 2351, column: 3, scope: !70)
!1035 = !DILocation(line: 2352, column: 3, scope: !70)
!1036 = !DILocation(line: 2353, column: 3, scope: !70)
!1037 = !DILocation(line: 2354, column: 3, scope: !70)
!1038 = !DILocation(line: 2356, column: 3, scope: !70)
!1039 = !DILocation(line: 2358, column: 19, scope: !70)
!1040 = !DILocation(line: 2360, column: 15, scope: !70)
!1041 = !{!1042, !1042, i64 0}
!1042 = !{!"_Bool", !896, i64 0}
!1043 = !DILocation(line: 2361, column: 40, scope: !70)
!1044 = !DILocation(line: 2361, column: 24, scope: !70)
!1045 = !DILocation(line: 2361, column: 11, scope: !70)
!1046 = !DILocation(line: 2362, column: 12, scope: !70)
!1047 = !DILocalVariable(name: "argc", arg: 1, scope: !1048, file: !3, line: 2090, type: !49)
!1048 = distinct !DISubprogram(name: "parse_obsolete_option", scope: !3, file: !3, line: 2090, type: !1049, scopeLine: 2091, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1054)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!79, !49, !1051, !1053}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!1054 = !{!1047, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1055 = !DILocalVariable(name: "argv", arg: 2, scope: !1048, file: !3, line: 2090, type: !1051)
!1056 = !DILocalVariable(name: "n_units", arg: 3, scope: !1048, file: !3, line: 2090, type: !1053)
!1057 = !DILocalVariable(name: "p", scope: !1048, file: !3, line: 2092, type: !55)
!1058 = !DILocalVariable(name: "n_string", scope: !1048, file: !3, line: 2093, type: !55)
!1059 = !DILocalVariable(name: "n_string_end", scope: !1048, file: !3, line: 2094, type: !55)
!1060 = !DILocalVariable(name: "default_count", scope: !1048, file: !3, line: 2095, type: !49)
!1061 = !DILocalVariable(name: "t_from_start", scope: !1048, file: !3, line: 2096, type: !79)
!1062 = !DILocalVariable(name: "t_count_lines", scope: !1048, file: !3, line: 2097, type: !79)
!1063 = !DILocalVariable(name: "t_forever", scope: !1048, file: !3, line: 2098, type: !79)
!1064 = !DILocalVariable(name: "posix_ver", scope: !1048, file: !3, line: 2107, type: !49)
!1065 = !DILocalVariable(name: "obsolete_usage", scope: !1048, file: !3, line: 2108, type: !79)
!1066 = !DILocalVariable(name: "traditional_usage", scope: !1048, file: !3, line: 2109, type: !79)
!1067 = !DILocation(line: 0, scope: !1048, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 2363, column: 21, scope: !70)
!1069 = !DILocation(line: 2103, column: 10, scope: !1070, inlinedAt: !1068)
!1070 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 2102, column: 7)
!1071 = !DILocation(line: 2103, column: 30, scope: !1070, inlinedAt: !1068)
!1072 = !{!896, !896, i64 0}
!1073 = !DILocation(line: 2103, column: 41, scope: !1070, inlinedAt: !1068)
!1074 = !DILocation(line: 2103, column: 48, scope: !1070, inlinedAt: !1068)
!1075 = !DILocation(line: 2103, column: 51, scope: !1070, inlinedAt: !1068)
!1076 = !DILocation(line: 2104, column: 10, scope: !1070, inlinedAt: !1068)
!1077 = !DILocation(line: 2104, column: 24, scope: !1070, inlinedAt: !1068)
!1078 = !DILocation(line: 2104, column: 40, scope: !1070, inlinedAt: !1068)
!1079 = !DILocation(line: 2102, column: 7, scope: !1048, inlinedAt: !1068)
!1080 = !DILocation(line: 2107, column: 19, scope: !1048, inlinedAt: !1068)
!1081 = !DILocation(line: 2110, column: 7, scope: !1048, inlinedAt: !1068)
!1082 = !DILocation(line: 2112, column: 11, scope: !1048, inlinedAt: !1068)
!1083 = !DILocation(line: 2112, column: 3, scope: !1048, inlinedAt: !1068)
!1084 = !DILocation(line: 2109, column: 43, scope: !1048, inlinedAt: !1068)
!1085 = !DILocation(line: 2119, column: 11, scope: !1086, inlinedAt: !1068)
!1086 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 2113, column: 5)
