source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.File_spec = type { i8*, i64, %struct.timeval, i64, i64, i32, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__locale_data = type opaque
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.charbuffer = type { [8192 x i8], i64, %struct.charbuffer* }
%struct.fd_set = type { [16 x i64] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.linebuffer = type { [8192 x i8], i64, i64, %struct.linebuffer* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }

!23 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!25 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!26 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!28 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !30, line: 26, baseType: !6, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 41, baseType: !6, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!39 = !{!40}
!40 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000, isUnsigned: true)
!41 = !{!6, !42, !43, !46, !51, !52, !55, !59, !62, !50}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !47, line: 97, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !49, line: 152, baseType: !50)
!49 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 62, baseType: !54)
!53 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !56, line: 63, baseType: !57)
!56 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 150, baseType: !58)
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !60, line: 7, baseType: !61)
!60 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !49, line: 158, baseType: !58)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !63, line: 49, baseType: !58)
!63 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!64 = !{!65, !157, !159, !161, !163, !165, !167, !169, !171, !172, !174, !188, !190, !196, !200, !202, !204, !206}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !67, file: !3, line: 2362, type: !51, isLocal: true, isDefinition: true)
!67 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2307, type: !68, isDefinition: true, scopeLine: 2308, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !71)
!68 = !DISubroutineType(types: !69)
!69 = !{!50, !50, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!71 = !{!72, !73, !74, !75, !77, !81, !82, !83, !115, !116, !117, !119, !121, !150, !151, !154}
!72 = !DILocalVariable(name: "argc", arg: 1, scope: !67, file: !3, line: 2307, type: !50)
!73 = !DILocalVariable(name: "argv", arg: 2, scope: !67, file: !3, line: 2307, type: !70)
!74 = !DILocalVariable(name: "header_mode", scope: !67, file: !3, line: 2309, type: !5)
!75 = !DILocalVariable(name: "ok", scope: !67, file: !3, line: 2310, type: !76)
!76 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!77 = !DILocalVariable(name: "n_units", scope: !67, file: !3, line: 2314, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !79, line: 102, baseType: !80)
!79 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !49, line: 72, baseType: !54)
!81 = !DILocalVariable(name: "n_files", scope: !67, file: !3, line: 2315, type: !52)
!82 = !DILocalVariable(name: "file", scope: !67, file: !3, line: 2316, type: !70)
!83 = !DILocalVariable(name: "F", scope: !67, file: !3, line: 2317, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !3, line: 114, size: 768, elements: !86)
!86 = !{!87, !88, !89, !96, !99, !102, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !3, line: 117, baseType: !51, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !3, line: 120, baseType: !55, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !85, file: !3, line: 121, baseType: !90, size: 128, offset: 128)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !91, line: 9, size: 128, elements: !92)
!91 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !90, file: !91, line: 11, baseType: !61, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !90, file: !91, line: 12, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !49, line: 194, baseType: !58)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !85, file: !3, line: 122, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !47, line: 59, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !49, line: 143, baseType: !54)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !85, file: !3, line: 123, baseType: !100, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !47, line: 47, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !49, line: 146, baseType: !54)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !85, file: !3, line: 124, baseType: !103, size: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !47, line: 69, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !49, line: 148, baseType: !6)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !85, file: !3, line: 129, baseType: !76, size: 8, offset: 416)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !85, file: !3, line: 132, baseType: !76, size: 8, offset: 424)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !85, file: !3, line: 136, baseType: !76, size: 8, offset: 432)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !85, file: !3, line: 139, baseType: !50, size: 32, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !85, file: !3, line: 142, baseType: !50, size: 32, offset: 480)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !85, file: !3, line: 145, baseType: !50, size: 32, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !85, file: !3, line: 149, baseType: !50, size: 32, offset: 544)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !85, file: !3, line: 153, baseType: !50, size: 32, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !85, file: !3, line: 156, baseType: !52, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !85, file: !3, line: 160, baseType: !78, size: 64, offset: 704)
!115 = !DILocalVariable(name: "i", scope: !67, file: !3, line: 2318, type: !52)
!116 = !DILocalVariable(name: "obsolete_option", scope: !67, file: !3, line: 2319, type: !76)
!117 = !DILocalVariable(name: "sleep_interval", scope: !67, file: !3, line: 2324, type: !118)
!118 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!119 = !DILocalVariable(name: "found_hyphen", scope: !120, file: !3, line: 2368, type: !76)
!120 = distinct !DILexicalBlock(scope: !67, file: !3, line: 2367, column: 3)
!121 = !DILocalVariable(name: "in_stat", scope: !122, file: !3, line: 2384, type: !124)
!122 = distinct !DILexicalBlock(scope: !123, file: !3, line: 2383, column: 7)
!123 = distinct !DILexicalBlock(scope: !120, file: !3, line: 2382, column: 9)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !125, line: 46, size: 1152, elements: !126)
!125 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!126 = !{!127, !128, !129, !131, !132, !134, !136, !137, !138, !139, !141, !143, !144, !145, !146}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !124, file: !125, line: 48, baseType: !98, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !124, file: !125, line: 53, baseType: !101, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !124, file: !125, line: 61, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !49, line: 149, baseType: !54)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !124, file: !125, line: 62, baseType: !104, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !124, file: !125, line: 64, baseType: !133, size: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !49, line: 144, baseType: !6)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !124, file: !125, line: 65, baseType: !135, size: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !49, line: 145, baseType: !6)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !124, file: !125, line: 67, baseType: !50, size: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !124, file: !125, line: 69, baseType: !98, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !124, file: !125, line: 74, baseType: !57, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !124, file: !125, line: 78, baseType: !140, size: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !49, line: 172, baseType: !58)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !124, file: !125, line: 80, baseType: !142, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !49, line: 177, baseType: !58)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !124, file: !125, line: 91, baseType: !90, size: 128, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !124, file: !125, line: 92, baseType: !90, size: 128, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !124, file: !125, line: 93, baseType: !90, size: 128, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !124, file: !125, line: 106, baseType: !147, size: 192, offset: 960)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 192, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 3)
!150 = !DILocalVariable(name: "blocking_stdin", scope: !122, file: !3, line: 2385, type: !76)
!151 = !DILocalVariable(name: "out_stat", scope: !152, file: !3, line: 2418, type: !124)
!152 = distinct !DILexicalBlock(scope: !153, file: !3, line: 2414, column: 5)
!153 = distinct !DILexicalBlock(scope: !67, file: !3, line: 2413, column: 7)
!154 = !DILocalVariable(name: "wd", scope: !155, file: !3, line: 2476, type: !50)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 2475, column: 9)
!156 = distinct !DILexicalBlock(scope: !152, file: !3, line: 2474, column: 11)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "count_lines", scope: !2, file: !3, line: 169, type: !76, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "forever", scope: !2, file: !3, line: 176, type: !76, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "monitor_output", scope: !2, file: !3, line: 179, type: !76, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "from_start", scope: !2, file: !3, line: 182, type: !76, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 185, type: !76, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 188, type: !45, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "pid", scope: !2, file: !3, line: 207, type: !46, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !2, file: !3, line: 218, type: !76, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 232, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 4096, elements: !186)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !179, line: 50, size: 256, elements: !180)
!179 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!180 = !{!181, !182, !183, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !179, line: 52, baseType: !43, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !178, file: !179, line: 55, baseType: !50, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !178, file: !179, line: 56, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !178, file: !179, line: 57, baseType: !50, size: 32, offset: 192)
!186 = !{!187}
!187 = !DISubrange(count: 16)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !2, file: !3, line: 165, type: !76, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !2, file: !3, line: 109, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !194)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!194 = !{!195}
!195 = !DISubrange(count: 2)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !2, file: !3, line: 104, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 192, elements: !148)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !2, file: !3, line: 202, type: !78, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 215, type: !76, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "follow_mode", scope: !2, file: !3, line: 173, type: !11, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "first_file", scope: !208, file: !3, line: 400, type: !76, isLocal: true, isDefinition: true)
!208 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 398, type: !209, isLocal: true, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !43}
!211 = !{!212}
!212 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !208, file: !3, line: 398, type: !43)
!213 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!214 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 10, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!215 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!216 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!217 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!218 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "Version", scope: !221, file: !222, line: 2, type: !43, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, globals: !224)
!222 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!223 = !{}
!224 = !{!219}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !227, file: !233, line: 69, type: !234, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !229, retainedTypes: !230, globals: !232)
!228 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!229 = !{!15}
!230 = !{!42, !231}
!231 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!232 = !{!225}
!233 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !235, line: 55, baseType: !236)
!235 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !241, file: !268, line: 51, type: !269, isLocal: true, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !243, globals: !267)
!242 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!243 = !{!51, !244}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !245, line: 24, baseType: !246)
!245 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !247, line: 42, baseType: !248)
!247 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !247, line: 28, size: 1856, elements: !250)
!250 = !{!251, !257, !261, !264, !265}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !249, file: !247, line: 31, baseType: !252, size: 832)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 832, elements: !255)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !247, line: 31, flags: DIFlagFwdDecl)
!255 = !{!256}
!256 = !DISubrange(count: 13)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !249, file: !247, line: 34, baseType: !258, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !249, file: !247, line: 35, baseType: !262, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !249, file: !247, line: 36, baseType: !262, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !249, file: !247, line: 39, baseType: !266, size: 832, offset: 1024)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 832, elements: !255)
!267 = !{!239}
!268 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!269 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "file_name", scope: !272, file: !277, line: 46, type: !43, isLocal: true, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, globals: !274)
!273 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!274 = !{!270, !275}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !272, file: !277, line: 56, type: !76, isLocal: true, isDefinition: true)
!277 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "exit_failure", scope: !280, file: !283, line: 24, type: !284, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, globals: !282)
!281 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!282 = !{!278}
!283 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!284 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "default_tuning", scope: !287, file: !291, line: 130, type: !292, isLocal: true, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !289, globals: !290)
!288 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!289 = !{!54, !42, !52}
!290 = !{!285}
!291 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !294, line: 65, baseType: !295)
!294 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !294, line: 53, size: 160, elements: !296)
!296 = !{!297, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !295, file: !294, line: 58, baseType: !298, size: 32)
!298 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !295, file: !294, line: 59, baseType: !298, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !295, file: !294, line: 60, baseType: !298, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !295, file: !294, line: 61, baseType: !298, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !295, file: !294, line: 62, baseType: !76, size: 8, offset: 128)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "program_name", scope: !305, file: !309, line: 33, type: !43, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !307, globals: !308)
!306 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!307 = !{!42, !51}
!308 = !{!303}
!309 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !312, file: !339, line: 85, type: !374, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !314, retainedTypes: !335, globals: !336)
!313 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!314 = !{!15, !315, !320}
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !16, line: 242, baseType: !6, size: 32, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!319 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 46, baseType: !6, size: 32, elements: !322)
!321 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!323 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!324 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!325 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!326 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!327 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!328 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!329 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!330 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!331 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!332 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!333 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!334 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!335 = !{!50, !260, !52, !51}
!336 = !{!310, !337, !344, !356, !358, !363, !370, !372}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !312, file: !339, line: 101, type: !340, isDefinition: true)
!339 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 320, elements: !342)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!342 = !{!343}
!343 = !DISubrange(count: 10)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !312, file: !339, line: 1052, type: !346, isDefinition: true)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !339, line: 65, size: 448, elements: !347)
!347 = !{!348, !349, !350, !354, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !346, file: !339, line: 68, baseType: !15, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !339, line: 71, baseType: !50, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !346, file: !339, line: 75, baseType: !351, size: 256, offset: 64)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !346, file: !339, line: 78, baseType: !43, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !346, file: !339, line: 81, baseType: !43, size: 64, offset: 384)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !312, file: !339, line: 116, type: !346, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "slot0", scope: !312, file: !339, line: 842, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 256)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "slotvec", scope: !312, file: !339, line: 845, type: !365, isLocal: true, isDefinition: true)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !339, line: 834, size: 128, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !339, line: 836, baseType: !52, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !366, file: !339, line: 837, baseType: !51, size: 64, offset: 64)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "nslots", scope: !312, file: !339, line: 843, type: !50, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "slotvec0", scope: !312, file: !339, line: 844, type: !366, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 704, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 11)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !379, file: !382, line: 26, type: !383, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, globals: !381)
!380 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!381 = !{!377}
!382 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 376, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 47)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !388, file: !389, line: 339, type: !50, isLocal: true, isDefinition: true)
!388 = distinct !DISubprogram(name: "rpl_fcntl", scope: !389, file: !389, line: 276, type: !390, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !392, retainedNodes: !395)
!389 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!390 = !DISubroutineType(types: !391)
!391 = !{!50, !50, !50, null}
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, globals: !394)
!393 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!394 = !{!386}
!395 = !{!396, !397, !398, !411, !412, !415, !418, !421}
!396 = !DILocalVariable(name: "fd", arg: 1, scope: !388, file: !389, line: 276, type: !50)
!397 = !DILocalVariable(name: "action", arg: 2, scope: !388, file: !389, line: 276, type: !50)
!398 = !DILocalVariable(name: "arg", scope: !388, file: !389, line: 278, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !400, line: 30, baseType: !401)
!400 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !393, line: 278, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 192, elements: !409)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !393, line: 278, size: 192, elements: !404)
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !403, file: !393, line: 278, baseType: !6, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !403, file: !393, line: 278, baseType: !6, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !403, file: !393, line: 278, baseType: !42, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !403, file: !393, line: 278, baseType: !42, size: 64, offset: 128)
!409 = !{!410}
!410 = !DISubrange(count: 1)
!411 = !DILocalVariable(name: "result", scope: !388, file: !389, line: 279, type: !50)
!412 = !DILocalVariable(name: "target", scope: !413, file: !389, line: 326, type: !50)
!413 = distinct !DILexicalBlock(scope: !414, file: !389, line: 325, column: 7)
!414 = distinct !DILexicalBlock(scope: !388, file: !389, line: 282, column: 5)
!415 = !DILocalVariable(name: "flags", scope: !416, file: !389, line: 363, type: !50)
!416 = distinct !DILexicalBlock(scope: !417, file: !389, line: 362, column: 11)
!417 = distinct !DILexicalBlock(scope: !413, file: !389, line: 361, column: 13)
!418 = !DILocalVariable(name: "saved_errno", scope: !419, file: !389, line: 366, type: !50)
!419 = distinct !DILexicalBlock(scope: !420, file: !389, line: 365, column: 15)
!420 = distinct !DILexicalBlock(scope: !416, file: !389, line: 364, column: 17)
!421 = !DILocalVariable(name: "p", scope: !422, file: !389, line: 408, type: !42)
!422 = distinct !DILexicalBlock(scope: !414, file: !389, line: 406, column: 7)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!424 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !427)
!426 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!427 = !{!51}
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!429 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !432)
!431 = !DIFile(filename: "./lib/offtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !47, line: 85, baseType: !57)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!435 = !DIFile(filename: "./lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !438)
!437 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!438 = !{!439}
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !440, line: 40, baseType: !6, size: 32, elements: !441)
!440 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!441 = !{!442}
!442 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!444 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !447, retainedTypes: !452)
!446 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!447 = !{!448}
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 41, baseType: !6, size: 32, elements: !450)
!449 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!450 = !{!451}
!451 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!452 = !{!42}
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !469)
!454 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!455 = !{!456}
!456 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !458, file: !457, line: 186, baseType: !6, size: 32, elements: !467)
!457 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!458 = distinct !DISubprogram(name: "x2nrealloc", scope: !457, file: !457, line: 174, type: !459, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !453, retainedNodes: !462)
!459 = !DISubroutineType(types: !460)
!460 = !{!42, !42, !461, !52}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!462 = !{!463, !464, !465, !466}
!463 = !DILocalVariable(name: "p", arg: 1, scope: !458, file: !457, line: 174, type: !42)
!464 = !DILocalVariable(name: "pn", arg: 2, scope: !458, file: !457, line: 174, type: !461)
!465 = !DILocalVariable(name: "s", arg: 3, scope: !458, file: !457, line: 174, type: !52)
!466 = !DILocalVariable(name: "n", scope: !458, file: !457, line: 176, type: !52)
!467 = !{!468}
!468 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!469 = !{!52, !51, !42}
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!471 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !474)
!473 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!474 = !{!29}
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!476 = !DIFile(filename: "./lib/xnanosleep.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !452)
!478 = !DIFile(filename: "./lib/xstrtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !481, retainedTypes: !482)
!480 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!481 = !{!29, !320}
!482 = !{!50, !260}
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !452)
!484 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !487)
!486 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!487 = !{!52}
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !490)
!489 = !DIFile(filename: "./lib/nanosleep.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!490 = !{!491}
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !492, line: 41, baseType: !6, size: 32, elements: !493)
!492 = !DIFile(filename: "lib/nanosleep.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!493 = !{!494}
!494 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!496 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !499, retainedTypes: !500)
!498 = !DIFile(filename: "./lib/dtotimespec.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!499 = !{!37}
!500 = !{!59}
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!502 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !505, retainedTypes: !452)
!504 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!505 = !{!506}
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !507, line: 41, baseType: !6, size: 32, elements: !508)
!507 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!509 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!510 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!511 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!512 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!513 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!514 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!515 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!516 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!517 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!518 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!519 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!520 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!521 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!522 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!523 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!524 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!525 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!526 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!527 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!528 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!529 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!530 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!531 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!532 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!533 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!534 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!535 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!536 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!537 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!538 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!539 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!540 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!541 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!542 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!543 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!544 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!545 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!546 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!547 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!548 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!549 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!550 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!551 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!552 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!553 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!554 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!555 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!556 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!557 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!558 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!617 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!620 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!621 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!622 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!623 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!624 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!625 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!626 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!627 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!628 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!629 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!630 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!631 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!704 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!777 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!778 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!779 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!780 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!781 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!782 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!783 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!784 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!785 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!786 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!787 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!788 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!789 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!790 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!791 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!793 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!794 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!795 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!796 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!797 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!798 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!824 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!825 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!826 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!827 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!828 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!833 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!834 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!835 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!836 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!893 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223)
!895 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !452)
!897 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !452)
!899 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!900 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!901 = !{i32 2, !"Dwarf Version", i32 4}
!902 = !{i32 2, !"Debug Info Version", i32 3}
!903 = !{i32 1, !"wchar_size", i32 4}
!904 = !{i32 7, !"PIC Level", i32 2}
!905 = !{i32 7, !"PIE Level", i32 2}
!906 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 255, type: !907, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !50}
!909 = !{!910}
!910 = !DILocalVariable(name: "status", arg: 1, scope: !906, file: !3, line: 255, type: !50)
!911 = !DILocalVariable(name: "infomap", scope: !912, file: !913, line: 632, type: !925)
!912 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !913, file: !913, line: 630, type: !209, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !914)
!913 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!914 = !{!915, !911, !916, !917, !924}
!915 = !DILocalVariable(name: "program", arg: 1, scope: !912, file: !913, line: 630, type: !43)
!916 = !DILocalVariable(name: "node", scope: !912, file: !913, line: 642, type: !43)
!917 = !DILocalVariable(name: "map_prog", scope: !912, file: !913, line: 643, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !912, file: !913, line: 632, size: 128, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !920, file: !913, line: 632, baseType: !43, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !920, file: !913, line: 632, baseType: !43, size: 64, offset: 64)
!924 = !DILocalVariable(name: "lc_messages", scope: !912, file: !913, line: 655, type: !43)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 896, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 7)
!928 = !DILocation(line: 632, column: 67, scope: !912, inlinedAt: !929)
!929 = distinct !DILocation(line: 328, column: 7, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 260, column: 5)
!931 = distinct !DILexicalBlock(scope: !906, file: !3, line: 257, column: 7)
!932 = !DILocation(line: 255, column: 12, scope: !906)
!933 = !DILocation(line: 257, column: 14, scope: !931)
!934 = !DILocation(line: 257, column: 7, scope: !906)
!935 = !DILocation(line: 258, column: 5, scope: !936)
!936 = distinct !DILexicalBlock(scope: !931, file: !3, line: 258, column: 5)
!937 = !{!938, !938, i64 0}
!938 = !{!"any pointer", !939, i64 0}
!939 = !{!"omnipotent char", !940, i64 0}
!940 = !{!"Simple C/C++ TBAA"}
!941 = !DILocation(line: 261, column: 7, scope: !930)
!942 = !DILocation(line: 265, column: 7, scope: !930)
!943 = !DILocation(line: 580, column: 3, scope: !944, inlinedAt: !945)
!944 = distinct !DISubprogram(name: "emit_stdin_note", scope: !913, file: !913, line: 578, type: !237, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !223)
!945 = distinct !DILocation(line: 270, column: 7, scope: !930)
!946 = !DILocation(line: 587, column: 3, scope: !947, inlinedAt: !948)
!947 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !913, file: !913, line: 585, type: !237, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !223)
!948 = distinct !DILocation(line: 271, column: 7, scope: !930)
!949 = !DILocation(line: 273, column: 6, scope: !930)
!950 = !DILocation(line: 277, column: 6, scope: !930)
!951 = !DILocation(line: 283, column: 6, scope: !930)
!952 = !DILocation(line: 296, column: 6, scope: !930)
!953 = !DILocation(line: 301, column: 6, scope: !930)
!954 = !DILocation(line: 308, column: 6, scope: !930)
!955 = !DILocation(line: 311, column: 6, scope: !930)
!956 = !DILocation(line: 312, column: 6, scope: !930)
!957 = !DILocation(line: 313, column: 6, scope: !930)
!958 = !DILocation(line: 320, column: 6, scope: !930)
!959 = !DILocation(line: 632, column: 3, scope: !912, inlinedAt: !929)
!960 = !DILocation(line: 643, column: 36, scope: !912, inlinedAt: !929)
!961 = !DILocation(line: 643, column: 25, scope: !912, inlinedAt: !929)
!962 = !DILocation(line: 645, column: 33, scope: !912, inlinedAt: !929)
!963 = !DILocation(line: 645, column: 3, scope: !912, inlinedAt: !929)
!964 = !DILocation(line: 646, column: 13, scope: !912, inlinedAt: !929)
!965 = !DILocation(line: 645, column: 20, scope: !912, inlinedAt: !929)
!966 = !{!967, !938, i64 0}
!967 = !{!"infomap", !938, i64 0, !938, i64 8}
!968 = !DILocation(line: 645, column: 10, scope: !912, inlinedAt: !929)
!969 = !DILocation(line: 645, column: 28, scope: !912, inlinedAt: !929)
!970 = distinct !{!970, !971, !972}
!971 = !DILocation(line: 645, column: 3, scope: !912)
!972 = !DILocation(line: 646, column: 13, scope: !912)
!973 = !DILocation(line: 648, column: 17, scope: !974, inlinedAt: !929)
!974 = distinct !DILexicalBlock(scope: !912, file: !913, line: 648, column: 7)
!975 = !{!967, !938, i64 8}
!976 = !DILocation(line: 648, column: 7, scope: !974, inlinedAt: !929)
!977 = !DILocation(line: 648, column: 7, scope: !912, inlinedAt: !929)
!978 = !DILocation(line: 642, column: 15, scope: !912, inlinedAt: !929)
!979 = !DILocation(line: 651, column: 3, scope: !912, inlinedAt: !929)
!980 = !DILocation(line: 655, column: 29, scope: !912, inlinedAt: !929)
!981 = !DILocation(line: 655, column: 15, scope: !912, inlinedAt: !929)
!982 = !DILocation(line: 656, column: 7, scope: !983, inlinedAt: !929)
!983 = distinct !DILexicalBlock(scope: !912, file: !913, line: 656, column: 7)
!984 = !DILocation(line: 656, column: 19, scope: !983, inlinedAt: !929)
!985 = !DILocation(line: 656, column: 22, scope: !983, inlinedAt: !929)
!986 = !DILocation(line: 656, column: 7, scope: !912, inlinedAt: !929)
!987 = !DILocation(line: 662, column: 7, scope: !988, inlinedAt: !929)
!988 = distinct !DILexicalBlock(scope: !983, file: !913, line: 657, column: 5)
!989 = !DILocation(line: 664, column: 5, scope: !988, inlinedAt: !929)
!990 = !DILocation(line: 665, column: 3, scope: !912, inlinedAt: !929)
!991 = !DILocation(line: 667, column: 3, scope: !912, inlinedAt: !929)
!992 = !DILocation(line: 669, column: 1, scope: !912, inlinedAt: !929)
!993 = !DILocation(line: 330, column: 3, scope: !906)
!994 = !DILocalVariable(name: "buffer", scope: !995, file: !3, line: 843, type: !1009)
!995 = distinct !DISubprogram(name: "start_bytes", scope: !3, file: !3, line: 840, type: !996, isLocal: true, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !999)
!996 = !DISubroutineType(types: !997)
!997 = !{!50, !43, !50, !78, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!999 = !{!1000, !1001, !1002, !1003, !994, !1004, !1006}
!1000 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !995, file: !3, line: 840, type: !43)
!1001 = !DILocalVariable(name: "fd", arg: 2, scope: !995, file: !3, line: 840, type: !50)
!1002 = !DILocalVariable(name: "n_bytes", arg: 3, scope: !995, file: !3, line: 840, type: !78)
!1003 = !DILocalVariable(name: "read_pos", arg: 4, scope: !995, file: !3, line: 841, type: !998)
!1004 = !DILocalVariable(name: "bytes_read", scope: !1005, file: !3, line: 847, type: !52)
!1005 = distinct !DILexicalBlock(scope: !995, file: !3, line: 846, column: 5)
!1006 = !DILocalVariable(name: "n_remaining", scope: !1007, file: !3, line: 860, type: !52)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 859, column: 9)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 856, column: 11)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 65536, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 8192)
!1012 = !DILocation(line: 843, column: 8, scope: !995, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 1840, column: 19, scope: !1014, inlinedAt: !1034)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 1839, column: 9)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 1833, column: 11)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 1832, column: 5)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 1831, column: 7)
!1018 = distinct !DISubprogram(name: "tail_bytes", scope: !3, file: !3, line: 1820, type: !1019, isLocal: true, isDefinition: true, scopeLine: 1822, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1021)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!76, !43, !50, !78, !998}
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1030, !1031}
!1022 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !1018, file: !3, line: 1820, type: !43)
!1023 = !DILocalVariable(name: "fd", arg: 2, scope: !1018, file: !3, line: 1820, type: !50)
!1024 = !DILocalVariable(name: "n_bytes", arg: 3, scope: !1018, file: !3, line: 1820, type: !78)
!1025 = !DILocalVariable(name: "read_pos", arg: 4, scope: !1018, file: !3, line: 1821, type: !998)
!1026 = !DILocalVariable(name: "stats", scope: !1018, file: !3, line: 1823, type: !124)
!1027 = !DILocalVariable(name: "t", scope: !1014, file: !3, line: 1840, type: !50)
!1028 = !DILocalVariable(name: "end_pos", scope: !1029, file: !3, line: 1848, type: !55)
!1029 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 1847, column: 5)
!1030 = !DILocalVariable(name: "current_pos", scope: !1029, file: !3, line: 1849, type: !55)
!1031 = !DILocalVariable(name: "bytes_remaining", scope: !1032, file: !3, line: 1864, type: !55)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1863, column: 9)
!1033 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 1862, column: 11)
!1034 = distinct !DILocation(line: 1952, column: 12, scope: !1035, inlinedAt: !1042)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 1949, column: 7)
!1036 = distinct !DISubprogram(name: "tail", scope: !3, file: !3, line: 1945, type: !1019, isLocal: true, isDefinition: true, scopeLine: 1947, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1037)
!1037 = !{!1038, !1039, !1040, !1041}
!1038 = !DILocalVariable(name: "filename", arg: 1, scope: !1036, file: !3, line: 1945, type: !43)
!1039 = !DILocalVariable(name: "fd", arg: 2, scope: !1036, file: !3, line: 1945, type: !50)
!1040 = !DILocalVariable(name: "n_units", arg: 3, scope: !1036, file: !3, line: 1945, type: !78)
!1041 = !DILocalVariable(name: "read_pos", arg: 4, scope: !1036, file: !3, line: 1946, type: !998)
!1042 = distinct !DILocation(line: 1997, column: 12, scope: !1043, inlinedAt: !1058)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 1992, column: 5)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 1977, column: 7)
!1045 = distinct !DISubprogram(name: "tail_file", scope: !3, file: !3, line: 1959, type: !1046, isLocal: true, isDefinition: true, scopeLine: 1960, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!76, !84, !78}
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1049 = !DILocalVariable(name: "f", arg: 1, scope: !1045, file: !3, line: 1959, type: !84)
!1050 = !DILocalVariable(name: "n_units", arg: 2, scope: !1045, file: !3, line: 1959, type: !78)
!1051 = !DILocalVariable(name: "fd", scope: !1045, file: !3, line: 1961, type: !50)
!1052 = !DILocalVariable(name: "ok", scope: !1045, file: !3, line: 1962, type: !76)
!1053 = !DILocalVariable(name: "is_stdin", scope: !1045, file: !3, line: 1964, type: !76)
!1054 = !DILocalVariable(name: "read_pos", scope: !1043, file: !3, line: 1993, type: !78)
!1055 = !DILocalVariable(name: "stats", scope: !1056, file: !3, line: 2000, type: !124)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 1999, column: 9)
!1057 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 1998, column: 11)
!1058 = distinct !DILocation(line: 2411, column: 11, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 2410, column: 3)
!1060 = distinct !DILexicalBlock(scope: !67, file: !3, line: 2410, column: 3)
!1061 = !DILocalVariable(name: "buffer", scope: !1062, file: !3, line: 883, type: !1009)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 882, column: 5)
!1063 = distinct !DISubprogram(name: "start_lines", scope: !3, file: !3, line: 875, type: !996, isLocal: true, isDefinition: true, scopeLine: 877, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1061, !1069, !1070, !1071}
!1065 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !1063, file: !3, line: 875, type: !43)
!1066 = !DILocalVariable(name: "fd", arg: 2, scope: !1063, file: !3, line: 875, type: !50)
!1067 = !DILocalVariable(name: "n_lines", arg: 3, scope: !1063, file: !3, line: 875, type: !78)
!1068 = !DILocalVariable(name: "read_pos", arg: 4, scope: !1063, file: !3, line: 876, type: !998)
!1069 = !DILocalVariable(name: "bytes_read", scope: !1062, file: !3, line: 884, type: !52)
!1070 = !DILocalVariable(name: "buffer_end", scope: !1062, file: !3, line: 893, type: !51)
!1071 = !DILocalVariable(name: "p", scope: !1062, file: !3, line: 897, type: !51)
!1072 = !DILocation(line: 883, column: 12, scope: !1062, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 1896, column: 15, scope: !1074, inlinedAt: !1087)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 1895, column: 5)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 1894, column: 7)
!1076 = distinct !DISubprogram(name: "tail_lines", scope: !3, file: !3, line: 1883, type: !1019, isLocal: true, isDefinition: true, scopeLine: 1885, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1086}
!1078 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !1076, file: !3, line: 1883, type: !43)
!1079 = !DILocalVariable(name: "fd", arg: 2, scope: !1076, file: !3, line: 1883, type: !50)
!1080 = !DILocalVariable(name: "n_lines", arg: 3, scope: !1076, file: !3, line: 1883, type: !78)
!1081 = !DILocalVariable(name: "read_pos", arg: 4, scope: !1076, file: !3, line: 1884, type: !998)
!1082 = !DILocalVariable(name: "stats", scope: !1076, file: !3, line: 1886, type: !124)
!1083 = !DILocalVariable(name: "t", scope: !1074, file: !3, line: 1896, type: !50)
!1084 = !DILocalVariable(name: "start_pos", scope: !1085, file: !3, line: 1903, type: !55)
!1085 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 1902, column: 5)
!1086 = !DILocalVariable(name: "end_pos", scope: !1085, file: !3, line: 1904, type: !55)
!1087 = distinct !DILocation(line: 1950, column: 12, scope: !1035, inlinedAt: !1042)
!1088 = !DILocalVariable(name: "buffer", scope: !1089, file: !3, line: 515, type: !1009)
!1089 = distinct !DISubprogram(name: "file_lines", scope: !3, file: !3, line: 512, type: !1090, isLocal: true, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1092)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!76, !43, !50, !78, !55, !55, !998}
!1092 = !{!1093, !1094, !1095, !1096, !1097, !1098, !1088, !1099, !1100, !1101, !1103}
!1093 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !1089, file: !3, line: 512, type: !43)
!1094 = !DILocalVariable(name: "fd", arg: 2, scope: !1089, file: !3, line: 512, type: !50)
!1095 = !DILocalVariable(name: "n_lines", arg: 3, scope: !1089, file: !3, line: 512, type: !78)
!1096 = !DILocalVariable(name: "start_pos", arg: 4, scope: !1089, file: !3, line: 513, type: !55)
!1097 = !DILocalVariable(name: "end_pos", arg: 5, scope: !1089, file: !3, line: 513, type: !55)
!1098 = !DILocalVariable(name: "read_pos", arg: 6, scope: !1089, file: !3, line: 513, type: !998)
!1099 = !DILocalVariable(name: "bytes_read", scope: !1089, file: !3, line: 516, type: !52)
