source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.File_spec = type { i8*, i64, %struct.timeval, i64, i64, i32, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__locale_data = type opaque
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.charbuffer = type { [8192 x i8], i64, %struct.charbuffer* }
%struct.fd_set = type { [16 x i64] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.linebuffer = type { [8192 x i8], i64, i64, %struct.linebuffer* }
%struct.option = type { i8*, i32, i32*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 214, type: !195, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !41, globals: !359, nameTableKind: None)
!3 = !DIFile(filename: "src/tail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !15, !29, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "header_mode", file: !3, line: 195, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "multiple_files", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "always", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "never", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Follow_mode", file: !3, line: 91, baseType: !6, size: 32, elements: !12)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "Follow_name", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "Follow_descriptor", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !16, line: 32, baseType: !6, size: 32, elements: !17)
!16 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!18 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!25 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!26 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!28 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !30, line: 25, baseType: !6, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 42, baseType: !6, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40}
!40 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!41 = !{!42, !52, !113, !117, !121, !124, !127, !134, !137, !141, !145, !149, !152, !155, !156, !6, !158, !163, !167, !182, !103, !186, !188, !191, !46, !202, !206, !105, !208, !210, !213, !217, !220, !223, !48, !227, !230, !233, !234, !238, !242, !245, !246, !279, !302, !306, !307, !310, !313, !316, !321, !324, !50, !326, !343, !346, !347, !350, !351, !355}
!42 = !DISubprogram(name: "dcgettext", scope: !43, file: !43, line: 51, type: !44, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!43 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !48, !48, !50}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !{}
!52 = !DISubprogram(name: "fputs_unlocked", scope: !53, file: !53, line: 662, type: !54, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!53 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!54 = !DISubroutineType(types: !55)
!55 = !{!50, !48, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !58, line: 49, size: 1728, elements: !59)
!58 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !75, !76, !77, !78, !82, !84, !86, !90, !93, !95, !98, !101, !102, !104, !108, !109}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !57, file: !58, line: 51, baseType: !50, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !57, file: !58, line: 54, baseType: !46, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !57, file: !58, line: 55, baseType: !46, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !57, file: !58, line: 56, baseType: !46, size: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !57, file: !58, line: 57, baseType: !46, size: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !57, file: !58, line: 58, baseType: !46, size: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !57, file: !58, line: 59, baseType: !46, size: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !57, file: !58, line: 60, baseType: !46, size: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !57, file: !58, line: 61, baseType: !46, size: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !57, file: !58, line: 64, baseType: !46, size: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !57, file: !58, line: 65, baseType: !46, size: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !57, file: !58, line: 66, baseType: !46, size: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !57, file: !58, line: 68, baseType: !73, size: 64, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !58, line: 36, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !57, file: !58, line: 70, baseType: !56, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !57, file: !58, line: 72, baseType: !50, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !57, file: !58, line: 73, baseType: !50, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !57, file: !58, line: 74, baseType: !79, size: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 152, baseType: !81)
!80 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !57, file: !58, line: 77, baseType: !83, size: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !57, file: !58, line: 78, baseType: !85, size: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !57, file: !58, line: 79, baseType: !87, size: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !57, file: !58, line: 81, baseType: !91, size: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !58, line: 43, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !57, file: !58, line: 89, baseType: !94, size: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !80, line: 153, baseType: !81)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !57, file: !58, line: 91, baseType: !96, size: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !58, line: 37, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !57, file: !58, line: 92, baseType: !99, size: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !58, line: 38, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !57, file: !58, line: 93, baseType: !56, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !57, file: !58, line: 94, baseType: !103, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !57, file: !58, line: 95, baseType: !105, size: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 46, baseType: !107)
!106 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !57, file: !58, line: 96, baseType: !50, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !57, file: !58, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DISubprogram(name: "set_program_name", scope: !114, file: !114, line: 37, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!114 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!115 = !DISubroutineType(types: !116)
!116 = !{null, !48}
!117 = !DISubprogram(name: "setlocale", scope: !118, file: !118, line: 122, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!118 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!119 = !DISubroutineType(types: !120)
!120 = !{!46, !50, !48}
!121 = !DISubprogram(name: "bindtextdomain", scope: !43, file: !43, line: 86, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!122 = !DISubroutineType(types: !123)
!123 = !{!46, !48, !48}
!124 = !DISubprogram(name: "textdomain", scope: !43, file: !43, line: 82, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!125 = !DISubroutineType(types: !126)
!126 = !{!46, !48}
!127 = !DISubprogram(name: "atexit", scope: !128, file: !128, line: 595, type: !129, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!128 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!50, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DISubprogram(name: "quotearg_style", scope: !16, file: !16, line: 377, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!135 = !DISubroutineType(types: !136)
!136 = !{!46, !15, !48}
!137 = !DISubprogram(name: "error", scope: !138, file: !138, line: 52, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!138 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{null, !50, !50, !48, null}
!141 = !DISubprogram(name: "isatty", scope: !142, file: !142, line: 779, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!142 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!143 = !DISubroutineType(types: !144)
!144 = !{!50, !50}
!145 = !DISubprogram(name: "inotify_init", scope: !146, file: !146, line: 85, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!146 = !DIFile(filename: "/usr/include/sys/inotify.h", directory: "")
!147 = !DISubroutineType(types: !148)
!148 = !{!50}
!149 = !DISubprogram(name: "fflush_unlocked", scope: !53, file: !53, line: 227, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!150 = !DISubroutineType(types: !151)
!151 = !{!50, !56}
!152 = !DISubprogram(name: "inotify_rm_watch", scope: !146, file: !146, line: 96, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!153 = !DISubroutineType(types: !154)
!154 = !{!50, !50, !50}
!155 = !DISubprogram(name: "close", scope: !142, file: !142, line: 353, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!156 = !DISubprogram(name: "posix2_version", scope: !157, file: !157, line: 1, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!157 = !DIFile(filename: "./lib/posixver.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubprogram(name: "xstrtoumax", scope: !30, file: !30, line: 48, type: !159, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!159 = !DISubroutineType(types: !160)
!160 = !{!29, !48, !161, !50, !162, !48}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!163 = !DISubprogram(name: "quote", scope: !164, file: !164, line: 44, type: !165, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!164 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubroutineType(types: !166)
!166 = !{!48, !48}
!167 = !DISubprogram(name: "getopt_long", scope: !168, file: !168, line: 66, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!168 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!169 = !DISubroutineType(types: !170)
!170 = !{!50, !50, !171, !48, !173, !180}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !168, line: 50, size: 256, elements: !176)
!176 = !{!177, !178, !179, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !168, line: 52, baseType: !48, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !175, file: !168, line: 55, baseType: !50, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !168, line: 56, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !175, file: !168, line: 57, baseType: !50, size: 32, offset: 192)
!182 = !DISubprogram(name: "xdectoumax", scope: !183, file: !183, line: 31, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!183 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!107, !48, !107, !107, !48, !48, !50}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !189, line: 97, baseType: !190)
!189 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !80, line: 154, baseType: !50)
!191 = !DISubprogram(name: "xstrtod", scope: !192, file: !192, line: 26, type: !193, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!192 = !DIFile(filename: "./lib/xstrtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !48, !196, !197, !199}
!195 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!198, !48, !161}
!202 = !DISubprogram(name: "version_etc", scope: !203, file: !203, line: 69, type: !204, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!203 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !DISubroutineType(types: !205)
!205 = !{null, !56, !48, !48, !48, null}
!206 = !DISubprogram(name: "kill", scope: !207, file: !207, line: 112, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!207 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!208 = !DISubprogram(name: "xalloc_die", scope: !209, file: !209, line: 51, type: !132, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !51)
!209 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !DISubprogram(name: "xmalloc", scope: !209, file: !209, line: 53, type: !211, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!211 = !DISubroutineType(types: !212)
!212 = !{!103, !107}
!213 = !DISubprogram(name: "open_safer", scope: !214, file: !214, line: 22, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!214 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !DISubroutineType(types: !216)
!216 = !{!50, !48, !50, null}
!217 = !DISubprogram(name: "quotearg_n_style_colon", scope: !16, file: !16, line: 397, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!218 = !DISubroutineType(types: !219)
!219 = !{!46, !50, !15, !48}
!220 = !DISubprogram(name: "lseek", scope: !142, file: !142, line: 334, type: !221, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!221 = !DISubroutineType(types: !222)
!222 = !{!81, !50, !81, !50}
!223 = !DISubprogram(name: "safe_read", scope: !224, file: !224, line: 42, type: !225, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!224 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !DISubroutineType(types: !226)
!226 = !{!107, !50, !103, !107}
!227 = !DISubprogram(name: "fwrite_unlocked", scope: !53, file: !53, line: 675, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!228 = !DISubroutineType(types: !229)
!229 = !{!107, !186, !107, !107, !56}
!230 = !DISubprogram(name: "clearerr_unlocked", scope: !53, file: !53, line: 765, type: !231, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !56}
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DISubprogram(name: "memrchr", scope: !235, file: !235, line: 115, type: !236, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!235 = !DIFile(filename: "/usr/include/string.h", directory: "")
!236 = !DISubroutineType(types: !237)
!237 = !{!103, !186, !50, !107}
!238 = !DISubprogram(name: "offtostr", scope: !239, file: !239, line: 44, type: !240, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!239 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !DISubroutineType(types: !241)
!241 = !{!46, !81, !46}
!242 = !DISubprogram(name: "free", scope: !128, file: !128, line: 565, type: !243, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !103}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !53, line: 63, baseType: !79)
!246 = !DISubprogram(name: "fstatfs", scope: !247, file: !247, line: 50, type: !248, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!247 = !DIFile(filename: "/usr/include/sys/statfs.h", directory: "")
!248 = !DISubroutineType(types: !249)
!249 = !{!50, !50, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !252, line: 24, size: 960, elements: !253)
!252 = !DIFile(filename: "/usr/include/bits/statfs.h", directory: "")
!253 = !{!254, !256, !257, !259, !260, !261, !263, !264, !272, !273, !274, !275}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !251, file: !252, line: 26, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !80, line: 191, baseType: !81)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !251, file: !252, line: 27, baseType: !255, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !251, file: !252, line: 29, baseType: !258, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !80, line: 183, baseType: !107)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !251, file: !252, line: 30, baseType: !258, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !251, file: !252, line: 31, baseType: !258, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !251, file: !252, line: 32, baseType: !262, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !80, line: 187, baseType: !107)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !251, file: !252, line: 33, baseType: !262, size: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !251, file: !252, line: 41, baseType: !265, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !80, line: 155, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 155, size: 64, elements: !267)
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !266, file: !80, line: 155, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 2)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !251, file: !252, line: 42, baseType: !255, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !251, file: !252, line: 43, baseType: !255, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !251, file: !252, line: 44, baseType: !255, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !251, file: !252, line: 45, baseType: !276, size: 256, offset: 704)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 256, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 4)
!279 = !DISubprogram(name: "hash_initialize", scope: !280, file: !280, line: 89, type: !281, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!280 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !107, !285, !295, !298, !301}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !280, line: 67, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !280, line: 53, size: 160, elements: !288)
!288 = !{!289, !291, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !287, file: !280, line: 58, baseType: !290, size: 32)
!290 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !287, file: !280, line: 59, baseType: !290, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !287, file: !280, line: 60, baseType: !290, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !287, file: !280, line: 61, baseType: !290, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !287, file: !280, line: 62, baseType: !195, size: 8, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!107, !186, !107}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!195, !186, !186}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!302 = !DISubprogram(name: "dir_len", scope: !303, file: !303, line: 45, type: !304, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!303 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!304 = !DISubroutineType(types: !305)
!305 = !{!107, !48}
!306 = !DISubprogram(name: "last_component", scope: !303, file: !303, line: 46, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!307 = !DISubprogram(name: "inotify_add_watch", scope: !146, file: !146, line: 92, type: !308, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!308 = !DISubroutineType(types: !309)
!309 = !{!50, !50, !48, !6}
!310 = !DISubprogram(name: "hash_insert", scope: !280, file: !280, line: 100, type: !311, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!311 = !DISubroutineType(types: !312)
!312 = !{!103, !283, !186}
!313 = !DISubprogram(name: "hash_free", scope: !280, file: !280, line: 96, type: !314, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !283}
!316 = !DISubprogram(name: "hash_get_n_entries", scope: !280, file: !280, line: 74, type: !317, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!317 = !DISubroutineType(types: !318)
!318 = !{!107, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !322, line: 7, baseType: !323)
!322 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !80, line: 160, baseType: !81)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !325, line: 49, baseType: !81)
!325 = !DIFile(filename: "/usr/include/sys/select.h", directory: "")
!326 = !DISubprogram(name: "select", scope: !325, file: !325, line: 101, type: !327, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!327 = !DISubroutineType(types: !328)
!328 = !{!50, !50, !329, !329, !329, !336}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 59, size: 1024, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !330, file: !325, line: 64, baseType: !333, size: 1024)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 1024, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 16)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !338, line: 8, size: 128, elements: !339)
!338 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "")
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !337, file: !338, line: 10, baseType: !323, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !337, file: !338, line: 11, baseType: !342, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !80, line: 162, baseType: !81)
!343 = !DISubprogram(name: "xrealloc", scope: !209, file: !209, line: 59, type: !344, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!344 = !DISubroutineType(types: !345)
!345 = !{!103, !103, !107}
!346 = !DISubprogram(name: "hash_delete", scope: !280, file: !280, line: 104, type: !311, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!347 = !DISubprogram(name: "hash_lookup", scope: !280, file: !280, line: 78, type: !348, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!348 = !DISubroutineType(types: !349)
!349 = !{!103, !319, !186}
!350 = !DISubprogram(name: "raise", scope: !207, file: !207, line: 123, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!351 = !DISubprogram(name: "rpl_fcntl", scope: !352, file: !352, line: 588, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!352 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!353 = !DISubroutineType(types: !354)
!354 = !{!50, !50, !50, null}
!355 = !DISubprogram(name: "xnanosleep", scope: !356, file: !356, line: 1, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!356 = !DIFile(filename: "./lib/xnanosleep.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!357 = !DISubroutineType(types: !358)
!358 = !{!50, !198}
!359 = !{!360, !449, !451, !453, !455, !457, !459, !461, !463, !464, !466, !469, !471, !475, !479, !481, !483, !485}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !362, file: !3, line: 2386, type: !46, isLocal: true, isDefinition: true)
!362 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2331, type: !363, scopeLine: 2332, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !365)
!363 = !DISubroutineType(types: !364)
!364 = !{!50, !50, !161}
!365 = !{!366, !367, !368, !369, !370, !374, !375, !376, !408, !409, !410, !411, !413, !442, !443, !446}
!366 = !DILocalVariable(name: "argc", arg: 1, scope: !362, file: !3, line: 2331, type: !50)
!367 = !DILocalVariable(name: "argv", arg: 2, scope: !362, file: !3, line: 2331, type: !161)
!368 = !DILocalVariable(name: "header_mode", scope: !362, file: !3, line: 2333, type: !5)
!369 = !DILocalVariable(name: "ok", scope: !362, file: !3, line: 2334, type: !195)
!370 = !DILocalVariable(name: "n_units", scope: !362, file: !3, line: 2338, type: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !372, line: 102, baseType: !373)
!372 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !80, line: 73, baseType: !107)
!374 = !DILocalVariable(name: "n_files", scope: !362, file: !3, line: 2339, type: !105)
!375 = !DILocalVariable(name: "file", scope: !362, file: !3, line: 2340, type: !161)
!376 = !DILocalVariable(name: "F", scope: !362, file: !3, line: 2341, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !3, line: 118, size: 768, elements: !379)
!379 = !{!380, !381, !382, !389, !392, !395, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !378, file: !3, line: 121, baseType: !46, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !378, file: !3, line: 124, baseType: !245, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !378, file: !3, line: 125, baseType: !383, size: 128, offset: 128)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !384, line: 10, size: 128, elements: !385)
!384 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !383, file: !384, line: 12, baseType: !323, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !383, file: !384, line: 16, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !80, line: 196, baseType: !81)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !378, file: !3, line: 126, baseType: !390, size: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !189, line: 59, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !80, line: 145, baseType: !107)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !378, file: !3, line: 127, baseType: !393, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !189, line: 47, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !80, line: 148, baseType: !107)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !378, file: !3, line: 128, baseType: !396, size: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !189, line: 69, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !80, line: 150, baseType: !6)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !378, file: !3, line: 133, baseType: !195, size: 8, offset: 416)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !378, file: !3, line: 136, baseType: !195, size: 8, offset: 424)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !378, file: !3, line: 140, baseType: !195, size: 8, offset: 432)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !378, file: !3, line: 143, baseType: !50, size: 32, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !378, file: !3, line: 146, baseType: !50, size: 32, offset: 480)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !378, file: !3, line: 149, baseType: !50, size: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !378, file: !3, line: 153, baseType: !50, size: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !378, file: !3, line: 157, baseType: !50, size: 32, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !378, file: !3, line: 160, baseType: !105, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !378, file: !3, line: 164, baseType: !371, size: 64, offset: 704)
!408 = !DILocalVariable(name: "i", scope: !362, file: !3, line: 2342, type: !105)
!409 = !DILocalVariable(name: "obsolete_option", scope: !362, file: !3, line: 2343, type: !195)
!410 = !DILocalVariable(name: "sleep_interval", scope: !362, file: !3, line: 2348, type: !198)
!411 = !DILocalVariable(name: "found_hyphen", scope: !412, file: !3, line: 2392, type: !195)
!412 = distinct !DILexicalBlock(scope: !362, file: !3, line: 2391, column: 3)
!413 = !DILocalVariable(name: "in_stat", scope: !414, file: !3, line: 2408, type: !416)
!414 = distinct !DILexicalBlock(scope: !415, file: !3, line: 2407, column: 7)
!415 = distinct !DILexicalBlock(scope: !412, file: !3, line: 2406, column: 9)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !417, line: 46, size: 1152, elements: !418)
!417 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!418 = !{!419, !420, !421, !423, !424, !426, !428, !429, !430, !431, !433, !435, !436, !437, !438}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !416, file: !417, line: 48, baseType: !391, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !416, file: !417, line: 53, baseType: !394, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !416, file: !417, line: 61, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !80, line: 151, baseType: !107)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !416, file: !417, line: 62, baseType: !397, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !416, file: !417, line: 64, baseType: !425, size: 32, offset: 224)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !80, line: 146, baseType: !6)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !416, file: !417, line: 65, baseType: !427, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !80, line: 147, baseType: !6)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !416, file: !417, line: 67, baseType: !50, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !416, file: !417, line: 69, baseType: !391, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !416, file: !417, line: 74, baseType: !79, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !416, file: !417, line: 78, baseType: !432, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !80, line: 174, baseType: !81)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !416, file: !417, line: 80, baseType: !434, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !80, line: 179, baseType: !81)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !416, file: !417, line: 91, baseType: !383, size: 128, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !416, file: !417, line: 92, baseType: !383, size: 128, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !416, file: !417, line: 93, baseType: !383, size: 128, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !416, file: !417, line: 106, baseType: !439, size: 192, offset: 960)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 192, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 3)
!442 = !DILocalVariable(name: "blocking_stdin", scope: !414, file: !3, line: 2409, type: !195)
!443 = !DILocalVariable(name: "out_stat", scope: !444, file: !3, line: 2442, type: !416)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 2438, column: 5)
!445 = distinct !DILexicalBlock(scope: !362, file: !3, line: 2437, column: 7)
!446 = !DILocalVariable(name: "wd", scope: !447, file: !3, line: 2500, type: !50)
!447 = distinct !DILexicalBlock(scope: !448, file: !3, line: 2499, column: 9)
!448 = distinct !DILexicalBlock(scope: !444, file: !3, line: 2498, column: 11)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "count_lines", scope: !2, file: !3, line: 173, type: !195, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "forever", scope: !2, file: !3, line: 180, type: !195, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "monitor_output", scope: !2, file: !3, line: 183, type: !195, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "from_start", scope: !2, file: !3, line: 186, type: !195, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 189, type: !195, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 192, type: !47, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "pid", scope: !2, file: !3, line: 211, type: !188, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !2, file: !3, line: 222, type: !195, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 236, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 4096, elements: !334)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !2, file: !3, line: 169, type: !195, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !2, file: !3, line: 113, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 64, elements: !270)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !2, file: !3, line: 108, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 192, elements: !440)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !2, file: !3, line: 206, type: !371, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 219, type: !195, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "follow_mode", scope: !2, file: !3, line: 177, type: !11, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "first_file", scope: !487, file: !3, line: 423, type: !195, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 421, type: !115, scopeLine: 422, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !488)
!488 = !{!489}
!489 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !487, file: !3, line: 421, type: !48)
!490 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!491 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 10, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!492 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!493 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!494 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!495 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "Version", scope: !498, file: !499, line: 2, type: !48, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, globals: !500, nameTableKind: None)
!499 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = !{!496}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !503, file: !504, line: 67, type: !550, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !505, retainedTypes: !506, globals: !549, nameTableKind: None)
!504 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = !{!15}
!506 = !{!103, !48, !42, !507, !508, !137, !511, !163, !546, !233}
!507 = !DISubprogram(name: "quotearg_n_style", scope: !16, file: !16, line: 368, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!508 = !DISubprogram(name: "quote_n", scope: !164, file: !164, line: 40, type: !509, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!509 = !DISubroutineType(types: !510)
!510 = !{!48, !50, !48}
!511 = !DISubprogram(name: "fputs_unlocked", scope: !53, file: !53, line: 662, type: !512, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!512 = !DISubroutineType(types: !513)
!513 = !{!50, !48, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !58, line: 49, size: 1728, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !515, file: !58, line: 51, baseType: !50, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !515, file: !58, line: 54, baseType: !46, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !515, file: !58, line: 55, baseType: !46, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !515, file: !58, line: 56, baseType: !46, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !515, file: !58, line: 57, baseType: !46, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !515, file: !58, line: 58, baseType: !46, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !515, file: !58, line: 59, baseType: !46, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !515, file: !58, line: 60, baseType: !46, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !515, file: !58, line: 61, baseType: !46, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !515, file: !58, line: 64, baseType: !46, size: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !515, file: !58, line: 65, baseType: !46, size: 64, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !515, file: !58, line: 66, baseType: !46, size: 64, offset: 704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !515, file: !58, line: 68, baseType: !73, size: 64, offset: 768)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !515, file: !58, line: 70, baseType: !514, size: 64, offset: 832)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !515, file: !58, line: 72, baseType: !50, size: 32, offset: 896)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !515, file: !58, line: 73, baseType: !50, size: 32, offset: 928)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !515, file: !58, line: 74, baseType: !79, size: 64, offset: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !515, file: !58, line: 77, baseType: !83, size: 16, offset: 1024)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !515, file: !58, line: 78, baseType: !85, size: 8, offset: 1040)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !515, file: !58, line: 79, baseType: !87, size: 8, offset: 1048)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !515, file: !58, line: 81, baseType: !91, size: 64, offset: 1088)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !515, file: !58, line: 89, baseType: !94, size: 64, offset: 1152)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !515, file: !58, line: 91, baseType: !96, size: 64, offset: 1216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !515, file: !58, line: 92, baseType: !99, size: 64, offset: 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !515, file: !58, line: 93, baseType: !514, size: 64, offset: 1344)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !515, file: !58, line: 94, baseType: !103, size: 64, offset: 1408)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !515, file: !58, line: 95, baseType: !105, size: 64, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !515, file: !58, line: 96, baseType: !50, size: 32, offset: 1536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !515, file: !58, line: 98, baseType: !110, size: 160, offset: 1568)
!546 = !DISubprogram(name: "usage", scope: !504, file: !504, line: 56, type: !547, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !50}
!549 = !{!501}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !551, line: 61, baseType: !131)
!551 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "file_name", scope: !554, file: !555, line: 46, type: !48, isLocal: true, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !556, globals: !594, nameTableKind: None)
!555 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!556 = !{!557, !42, !593, !137}
!557 = !DISubprogram(name: "close_stream", scope: !558, file: !558, line: 2, type: !559, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!558 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!559 = !DISubroutineType(types: !560)
!560 = !{!50, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !58, line: 49, size: 1728, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !562, file: !58, line: 51, baseType: !50, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !562, file: !58, line: 54, baseType: !46, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !562, file: !58, line: 55, baseType: !46, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !562, file: !58, line: 56, baseType: !46, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !562, file: !58, line: 57, baseType: !46, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !562, file: !58, line: 58, baseType: !46, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !562, file: !58, line: 59, baseType: !46, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !562, file: !58, line: 60, baseType: !46, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !562, file: !58, line: 61, baseType: !46, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !562, file: !58, line: 64, baseType: !46, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !562, file: !58, line: 65, baseType: !46, size: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !562, file: !58, line: 66, baseType: !46, size: 64, offset: 704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !562, file: !58, line: 68, baseType: !73, size: 64, offset: 768)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !562, file: !58, line: 70, baseType: !561, size: 64, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !562, file: !58, line: 72, baseType: !50, size: 32, offset: 896)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !562, file: !58, line: 73, baseType: !50, size: 32, offset: 928)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !562, file: !58, line: 74, baseType: !79, size: 64, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !562, file: !58, line: 77, baseType: !83, size: 16, offset: 1024)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !562, file: !58, line: 78, baseType: !85, size: 8, offset: 1040)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !562, file: !58, line: 79, baseType: !87, size: 8, offset: 1048)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !562, file: !58, line: 81, baseType: !91, size: 64, offset: 1088)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !562, file: !58, line: 89, baseType: !94, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !562, file: !58, line: 91, baseType: !96, size: 64, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !562, file: !58, line: 92, baseType: !99, size: 64, offset: 1280)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !562, file: !58, line: 93, baseType: !561, size: 64, offset: 1344)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !562, file: !58, line: 94, baseType: !103, size: 64, offset: 1408)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !562, file: !58, line: 95, baseType: !105, size: 64, offset: 1472)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !562, file: !58, line: 96, baseType: !50, size: 32, offset: 1536)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !562, file: !58, line: 98, baseType: !110, size: 160, offset: 1568)
!593 = !DISubprogram(name: "quotearg_colon", scope: !16, file: !16, line: 391, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!594 = !{!552, !595}
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !554, file: !555, line: 56, type: !195, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "exit_failure", scope: !599, file: !600, line: 24, type: !602, isDefinition: true)
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, globals: !601, nameTableKind: None)
!600 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!601 = !{!597}
!602 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "default_tuning", scope: !605, file: !606, line: 130, type: !613, isLocal: true, isDefinition: true)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !607, globals: !612, nameTableKind: None)
!606 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!607 = !{!107, !103, !608, !242, !105}
!608 = !DISubprogram(name: "rpl_calloc", scope: !609, file: !609, line: 688, type: !610, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!609 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!610 = !DISubroutineType(types: !611)
!611 = !{!103, !107, !107}
!612 = !{!603}
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !280, line: 65, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !280, line: 53, size: 160, elements: !616)
!616 = !{!617, !618, !619, !620, !621}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !615, file: !280, line: 58, baseType: !290, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !615, file: !280, line: 59, baseType: !290, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !615, file: !280, line: 60, baseType: !290, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !615, file: !280, line: 61, baseType: !290, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !615, file: !280, line: 62, baseType: !195, size: 8, offset: 128)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "program_name", scope: !624, file: !625, line: 33, type: !48, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !626, globals: !662, nameTableKind: None)
!625 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!626 = !{!103, !627, !46}
!627 = !DISubprogram(name: "fputs", scope: !53, file: !53, line: 626, type: !628, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!628 = !DISubroutineType(types: !629)
!629 = !{!50, !48, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !58, line: 49, size: 1728, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !631, file: !58, line: 51, baseType: !50, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !631, file: !58, line: 54, baseType: !46, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !631, file: !58, line: 55, baseType: !46, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !631, file: !58, line: 56, baseType: !46, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !631, file: !58, line: 57, baseType: !46, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !631, file: !58, line: 58, baseType: !46, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !631, file: !58, line: 59, baseType: !46, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !631, file: !58, line: 60, baseType: !46, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !631, file: !58, line: 61, baseType: !46, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !631, file: !58, line: 64, baseType: !46, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !631, file: !58, line: 65, baseType: !46, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !631, file: !58, line: 66, baseType: !46, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !631, file: !58, line: 68, baseType: !73, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !631, file: !58, line: 70, baseType: !630, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !631, file: !58, line: 72, baseType: !50, size: 32, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !631, file: !58, line: 73, baseType: !50, size: 32, offset: 928)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !631, file: !58, line: 74, baseType: !79, size: 64, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !631, file: !58, line: 77, baseType: !83, size: 16, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !631, file: !58, line: 78, baseType: !85, size: 8, offset: 1040)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !631, file: !58, line: 79, baseType: !87, size: 8, offset: 1048)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !631, file: !58, line: 81, baseType: !91, size: 64, offset: 1088)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !631, file: !58, line: 89, baseType: !94, size: 64, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !631, file: !58, line: 91, baseType: !96, size: 64, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !631, file: !58, line: 92, baseType: !99, size: 64, offset: 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !631, file: !58, line: 93, baseType: !630, size: 64, offset: 1344)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !631, file: !58, line: 94, baseType: !103, size: 64, offset: 1408)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !631, file: !58, line: 95, baseType: !105, size: 64, offset: 1472)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !631, file: !58, line: 96, baseType: !50, size: 32, offset: 1536)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !631, file: !58, line: 98, baseType: !110, size: 160, offset: 1568)
!662 = !{!622}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !665, file: !666, line: 85, type: !770, isDefinition: true)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !667, retainedTypes: !688, globals: !743, nameTableKind: None)
!666 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!667 = !{!15, !668, !673}
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !16, line: 242, baseType: !6, size: 32, elements: !669)
!669 = !{!670, !671, !672}
!670 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!671 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!672 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 46, baseType: !6, size: 32, elements: !675)
!674 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!676 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!677 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!678 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!679 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!680 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!681 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!682 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!683 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!684 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!685 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!686 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!687 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!688 = !{!689, !692, !242, !707, !50, !83, !710, !105, !725, !729, !42, !735, !739, !46, !210, !208, !343}
!689 = !DISubprogram(name: "xmemdup", scope: !209, file: !209, line: 62, type: !690, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!690 = !DISubroutineType(types: !691)
!691 = !{!103, !186, !107}
!692 = !DISubprogram(name: "quotearg_alloc_mem", scope: !16, file: !16, line: 342, type: !693, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!693 = !DISubroutineType(types: !694)
!694 = !{!46, !48, !107, !162, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !666, line: 65, size: 448, elements: !698)
!698 = !{!699, !700, !701, !705, !706}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !697, file: !666, line: 68, baseType: !15, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !697, file: !666, line: 71, baseType: !50, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !697, file: !666, line: 75, baseType: !702, size: 256, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !697, file: !666, line: 78, baseType: !48, size: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !697, file: !666, line: 81, baseType: !48, size: 64, offset: 384)
!707 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !16, file: !16, line: 408, type: !708, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!708 = !DISubroutineType(types: !709)
!709 = !{!46, !50, !48, !48, !48, !107}
!710 = !DISubprogram(name: "rpl_mbrtowc", scope: !711, file: !711, line: 717, type: !712, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!711 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!712 = !DISubroutineType(types: !713)
!713 = !{!107, !180, !48, !107, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 13, size: 64, elements: !717)
!716 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !715, file: !716, line: 15, baseType: !50, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !715, file: !716, line: 20, baseType: !720, size: 32, offset: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !716, line: 16, size: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !720, file: !716, line: 18, baseType: !6, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !720, file: !716, line: 19, baseType: !724, size: 32)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !277)
!725 = !DISubprogram(name: "iswprint", scope: !726, file: !726, line: 120, type: !727, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!726 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!727 = !DISubroutineType(types: !728)
!728 = !{!50, !6}
!729 = !DISubprogram(name: "mbsinit", scope: !730, file: !730, line: 292, type: !731, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!730 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!731 = !DISubroutineType(types: !732)
!732 = !{!50, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!735 = !DISubprogram(name: "locale_charset", scope: !736, file: !736, line: 35, type: !737, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!736 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!737 = !DISubroutineType(types: !738)
!738 = !{!48}
!739 = !DISubprogram(name: "c_strcasecmp", scope: !740, file: !740, line: 42, type: !741, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!740 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!741 = !DISubroutineType(types: !742)
!742 = !{!50, !48, !48}
!743 = !{!663, !744, !750, !752, !754, !759, !766, !768}
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !665, file: !666, line: 101, type: !746, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 320, elements: !748)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!748 = !{!749}
!749 = !DISubrange(count: 10)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !665, file: !666, line: 1052, type: !697, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !665, file: !666, line: 116, type: !697, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "slot0", scope: !665, file: !666, line: 842, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 256)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "slotvec", scope: !665, file: !666, line: 845, type: !761, isLocal: true, isDefinition: true)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !666, line: 834, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !762, file: !666, line: 836, baseType: !105, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !762, file: !666, line: 837, baseType: !46, size: 64, offset: 64)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "nslots", scope: !665, file: !666, line: 843, type: !50, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "slotvec0", scope: !665, file: !666, line: 844, type: !762, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 704, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 11)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !775, file: !776, line: 26, type: !778, isDefinition: true)
!775 = distinct !DICompileUnit(language: DW_LANG_C99, file: !776, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, globals: !777, nameTableKind: None)
!776 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!777 = !{!773}
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 376, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 47)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !783, file: !784, line: 507, type: !50, isLocal: true, isDefinition: true)
!783 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !784, file: !784, line: 488, type: !153, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !785, retainedNodes: !790)
!784 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !786, globals: !789, nameTableKind: None)
!786 = !{!787, !155}
!787 = !DISubprogram(name: "fcntl", scope: !788, file: !788, line: 176, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!788 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!789 = !{!781}
!790 = !{!791, !792, !793, !794, !797}
!791 = !DILocalVariable(name: "fd", arg: 1, scope: !783, file: !784, line: 488, type: !50)
!792 = !DILocalVariable(name: "target", arg: 2, scope: !783, file: !784, line: 488, type: !50)
!793 = !DILocalVariable(name: "result", scope: !783, file: !784, line: 490, type: !50)
!794 = !DILocalVariable(name: "flags", scope: !795, file: !784, line: 531, type: !50)
!795 = distinct !DILexicalBlock(scope: !796, file: !784, line: 530, column: 5)
!796 = distinct !DILexicalBlock(scope: !783, file: !784, line: 529, column: 7)
!797 = !DILocalVariable(name: "saved_errno", scope: !798, file: !784, line: 534, type: !50)
!798 = distinct !DILexicalBlock(scope: !799, file: !784, line: 533, column: 9)
!799 = distinct !DILexicalBlock(scope: !795, file: !784, line: 532, column: 11)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !802, file: !803, line: 50, type: !834, isLocal: true, isDefinition: true)
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !804, globals: !833, nameTableKind: None)
!803 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!804 = !{!46, !805, !827, !830}
!805 = !DISubprogram(name: "strtod_l", scope: !128, file: !128, line: 295, type: !806, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!806 = !DISubroutineType(types: !807)
!807 = !{!198, !48, !161, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !810, line: 28, size: 1856, elements: !811)
!810 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!811 = !{!812, !818, !821, !824, !825}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !809, file: !810, line: 31, baseType: !813, size: 832)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 832, elements: !816)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !810, line: 31, flags: DIFlagFwdDecl)
!816 = !{!817}
!817 = !DISubrange(count: 13)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !809, file: !810, line: 34, baseType: !819, size: 64, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !809, file: !810, line: 35, baseType: !822, size: 64, offset: 896)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !809, file: !810, line: 36, baseType: !822, size: 64, offset: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !809, file: !810, line: 39, baseType: !826, size: 832, offset: 1024)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 832, elements: !816)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !828, line: 24, baseType: !829)
!828 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !810, line: 42, baseType: !808)
!830 = !DISubprogram(name: "newlocale", scope: !118, file: !118, line: 141, type: !831, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!831 = !DISubroutineType(types: !832)
!832 = !{!808, !50, !48, !808}
!833 = !{!800}
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !827)
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !837, nameTableKind: None)
!836 = !DIFile(filename: "lib/cl-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!837 = !{!838}
!838 = !DISubprogram(name: "c_strtod", scope: !839, file: !839, line: 40, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!839 = !DIFile(filename: "./lib/c-strtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !842, nameTableKind: None)
!841 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!842 = !{!306}
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !845, nameTableKind: None)
!844 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!845 = !{!46}
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !848, nameTableKind: None)
!847 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!848 = !{!849, !850}
!849 = !DISubprogram(name: "open", scope: !788, file: !788, line: 196, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!850 = !DISubprogram(name: "fd_safer", scope: !851, file: !851, line: 21, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!851 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !854, nameTableKind: None)
!853 = !DIFile(filename: "lib/offtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !189, line: 85, baseType: !79)
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !858, nameTableKind: None)
!857 = !DIFile(filename: "lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!858 = !{!859}
!859 = !DISubprogram(name: "getenv", scope: !128, file: !128, line: 634, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !862, nameTableKind: None)
!861 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!862 = !{!863}
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !864, line: 40, baseType: !6, size: 32, elements: !865)
!864 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!865 = !{!866}
!866 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !869, nameTableKind: None)
!868 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!869 = !{!870, !155}
!870 = !DISubprogram(name: "dup_safer", scope: !851, file: !851, line: 20, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !873, retainedTypes: !877, nameTableKind: None)
!872 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!873 = !{!874}
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !872, line: 40, baseType: !6, size: 32, elements: !875)
!875 = !{!876}
!876 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!877 = !{!42, !878, !103}
!878 = !DISubprogram(name: "fputs_unlocked", scope: !53, file: !53, line: 662, type: !879, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!879 = !DISubroutineType(types: !880)
!880 = !{!50, !48, !881}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !58, line: 49, size: 1728, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !882, file: !58, line: 51, baseType: !50, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !882, file: !58, line: 54, baseType: !46, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !882, file: !58, line: 55, baseType: !46, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !882, file: !58, line: 56, baseType: !46, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !882, file: !58, line: 57, baseType: !46, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !882, file: !58, line: 58, baseType: !46, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !882, file: !58, line: 59, baseType: !46, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !882, file: !58, line: 60, baseType: !46, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !882, file: !58, line: 61, baseType: !46, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !882, file: !58, line: 64, baseType: !46, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !882, file: !58, line: 65, baseType: !46, size: 64, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !882, file: !58, line: 66, baseType: !46, size: 64, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !882, file: !58, line: 68, baseType: !73, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !882, file: !58, line: 70, baseType: !881, size: 64, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !882, file: !58, line: 72, baseType: !50, size: 32, offset: 896)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !882, file: !58, line: 73, baseType: !50, size: 32, offset: 928)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !882, file: !58, line: 74, baseType: !79, size: 64, offset: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !882, file: !58, line: 77, baseType: !83, size: 16, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !882, file: !58, line: 78, baseType: !85, size: 8, offset: 1040)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !882, file: !58, line: 79, baseType: !87, size: 8, offset: 1048)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !882, file: !58, line: 81, baseType: !91, size: 64, offset: 1088)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !882, file: !58, line: 89, baseType: !94, size: 64, offset: 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !882, file: !58, line: 91, baseType: !96, size: 64, offset: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !882, file: !58, line: 92, baseType: !99, size: 64, offset: 1280)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !882, file: !58, line: 93, baseType: !881, size: 64, offset: 1344)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !882, file: !58, line: 94, baseType: !103, size: 64, offset: 1408)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !882, file: !58, line: 95, baseType: !105, size: 64, offset: 1472)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !882, file: !58, line: 96, baseType: !50, size: 32, offset: 1536)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !882, file: !58, line: 98, baseType: !110, size: 160, offset: 1568)
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !915, retainedTypes: !928, nameTableKind: None)
!914 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!915 = !{!916}
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !917, file: !209, line: 186, baseType: !6, size: 32, elements: !926)
!917 = distinct !DISubprogram(name: "x2nrealloc", scope: !209, file: !209, line: 174, type: !918, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !913, retainedNodes: !921)
!918 = !DISubroutineType(types: !919)
!919 = !{!103, !103, !920, !105}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!921 = !{!922, !923, !924, !925}
!922 = !DILocalVariable(name: "p", arg: 1, scope: !917, file: !209, line: 174, type: !103)
!923 = !DILocalVariable(name: "pn", arg: 2, scope: !917, file: !209, line: 174, type: !920)
!924 = !DILocalVariable(name: "s", arg: 3, scope: !917, file: !209, line: 174, type: !105)
!925 = !DILocalVariable(name: "n", scope: !917, file: !209, line: 176, type: !105)
!926 = !{!927}
!927 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!928 = !{!105, !208, !210, !343, !46, !242, !103, !929, !608}
!929 = !DISubprogram(name: "xcalloc", scope: !209, file: !209, line: 57, type: !610, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !932, nameTableKind: None)
!931 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!932 = !{!42, !137}
!933 = distinct !DICompileUnit(language: DW_LANG_C99, file: !934, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !935, retainedTypes: !936, nameTableKind: None)
!934 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!935 = !{!29}
!936 = !{!158, !163, !137}
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !939, nameTableKind: None)
!938 = !DIFile(filename: "lib/xnanosleep.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!939 = !{!321, !940, !941, !948}
!940 = !DISubprogram(name: "pause", scope: !142, file: !142, line: 469, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!941 = !DISubprogram(name: "dtotimespec", scope: !38, file: !38, line: 116, type: !942, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!942 = !DISubroutineType(types: !943)
!943 = !{!944, !198}
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !384, line: 10, size: 128, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !944, file: !384, line: 12, baseType: !323, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !944, file: !384, line: 16, baseType: !388, size: 64, offset: 64)
!948 = !DISubprogram(name: "rpl_nanosleep", scope: !949, file: !949, line: 583, type: !950, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!949 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!950 = !DISubroutineType(types: !951)
!951 = !{!50, !952, !954}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !957, nameTableKind: None)
!956 = !DIFile(filename: "lib/xstrtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!957 = !{!103}
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !960, retainedTypes: !961, nameTableKind: None)
!959 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!960 = !{!29, !673}
!961 = !{!50, !83}
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !963, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !957, nameTableKind: None)
!963 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !966, nameTableKind: None)
!965 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!966 = !{!967, !105, !979}
!967 = !DISubprogram(name: "mbrtowc", scope: !730, file: !730, line: 296, type: !968, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!968 = !DISubroutineType(types: !969)
!969 = !{!107, !180, !48, !107, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 13, size: 64, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !971, file: !716, line: 15, baseType: !50, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !971, file: !716, line: 20, baseType: !975, size: 32, offset: 32)
