source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [190 x i8] c"Copy standard input to each FILE, and also to standard output.\0A\0A  -a, --append              append to the given FILEs, do not overwrite\0A  -i, --ignore-interrupts   ignore interrupt signals\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "append", scope: !2, file: !3, line: 43, type: !202, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !36, globals: !198, nameTableKind: None)
!3 = !DIFile(filename: "src/tee.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13, !22}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "output_error", file: !3, line: 48, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "output_error_sigpipe", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "output_error_warn", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "output_error_warn_nopipe", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "output_error_exit", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "output_error_exit_nopipe", value: 4, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 45, baseType: !6, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20, !21}
!16 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !23, line: 32, baseType: !6, size: 32, elements: !24)
!23 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!25 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!29 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!31 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!32 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!33 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!34 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!35 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!36 = !{!37, !47, !108, !112, !116, !119, !122, !129, !144, !41, !98, !146, !150, !155, !158, !162, !166, !169, !172, !176, !100, !43, !179, !182, !185, !189, !192, !194, !197}
!37 = !DISubprogram(name: "dcgettext", scope: !38, file: !38, line: 51, type: !39, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!38 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !43, !43, !45}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !{}
!47 = !DISubprogram(name: "fputs_unlocked", scope: !48, file: !48, line: 662, type: !49, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!48 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!49 = !DISubroutineType(types: !50)
!50 = !{!45, !43, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !54)
!53 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !70, !71, !72, !73, !77, !79, !81, !85, !88, !90, !93, !96, !97, !99, !103, !104}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 51, baseType: !45, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 36, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 70, baseType: !51, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 152, baseType: !76)
!75 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!76 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!80 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 43, baseType: null)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !75, line: 153, baseType: !76)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !52, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !53, line: 37, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !52, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !53, line: 38, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !52, file: !53, line: 93, baseType: !51, size: 64, offset: 1344)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !52, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 46, baseType: !102)
!101 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!102 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DISubprogram(name: "set_program_name", scope: !109, file: !109, line: 37, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!109 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!110 = !DISubroutineType(types: !111)
!111 = !{null, !43}
!112 = !DISubprogram(name: "setlocale", scope: !113, file: !113, line: 122, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!113 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!114 = !DISubroutineType(types: !115)
!115 = !{!41, !45, !43}
!116 = !DISubprogram(name: "bindtextdomain", scope: !38, file: !38, line: 86, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!117 = !DISubroutineType(types: !118)
!118 = !{!41, !43, !43}
!119 = !DISubprogram(name: "textdomain", scope: !38, file: !38, line: 82, type: !120, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!120 = !DISubroutineType(types: !121)
!121 = !{!41, !43}
!122 = !DISubprogram(name: "atexit", scope: !123, file: !123, line: 595, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!123 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!124 = !DISubroutineType(types: !125)
!125 = !{!45, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null}
!129 = !DISubprogram(name: "getopt_long", scope: !130, file: !130, line: 66, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!130 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!131 = !DISubroutineType(types: !132)
!132 = !{!45, !45, !133, !43, !135, !142}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !130, line: 50, size: 256, elements: !138)
!138 = !{!139, !140, !141, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !130, line: 52, baseType: !43, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !137, file: !130, line: 55, baseType: !45, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !137, file: !130, line: 56, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !137, file: !130, line: 57, baseType: !45, size: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!146 = !DISubprogram(name: "version_etc", scope: !147, file: !147, line: 69, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!147 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!148 = !DISubroutineType(types: !149)
!149 = !{null, !51, !43, !43, !43, null}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !151, line: 72, baseType: !152)
!151 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !45}
!155 = !DISubprogram(name: "signal", scope: !151, file: !151, line: 88, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!156 = !DISubroutineType(types: !157)
!157 = !{!152, !45, !152}
!158 = !DISubprogram(name: "close", scope: !159, file: !159, line: 353, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!159 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!160 = !DISubroutineType(types: !161)
!161 = !{!45, !45}
!162 = !DISubprogram(name: "error", scope: !163, file: !163, line: 52, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!163 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!164 = !DISubroutineType(types: !165)
!165 = !{null, !45, !45, !43, null}
!166 = !DISubprogram(name: "fadvise", scope: !14, file: !14, line: 72, type: !167, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !51, !13}
!169 = !DISubprogram(name: "setvbuf", scope: !48, file: !48, line: 308, type: !170, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!170 = !DISubroutineType(types: !171)
!171 = !{!45, !51, !41, !45, !102}
!172 = !DISubprogram(name: "fopen_safer", scope: !173, file: !173, line: 23, type: !174, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!173 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!174 = !DISubroutineType(types: !175)
!175 = !{!51, !43, !43}
!176 = !DISubprogram(name: "quotearg_n_style_colon", scope: !23, file: !23, line: 397, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!177 = !DISubroutineType(types: !178)
!178 = !{!41, !45, !22, !43}
!179 = !DISubprogram(name: "fwrite_unlocked", scope: !48, file: !48, line: 675, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!180 = !DISubroutineType(types: !181)
!181 = !{!102, !144, !102, !102, !51}
!182 = !DISubprogram(name: "clearerr_unlocked", scope: !48, file: !48, line: 765, type: !183, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !51}
!185 = !DISubprogram(name: "rpl_fclose", scope: !186, file: !186, line: 672, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!186 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !DISubroutineType(types: !188)
!188 = !{!45, !51}
!189 = !DISubprogram(name: "free", scope: !123, file: !123, line: 565, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !98}
!192 = !DISubprogram(name: "xalloc_die", scope: !193, file: !193, line: 51, type: !127, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !46)
!193 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!194 = !DISubprogram(name: "xmalloc", scope: !193, file: !193, line: 53, type: !195, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!195 = !DISubroutineType(types: !196)
!196 = !{!98, !102}
!197 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!198 = !{!199, !200, !203, !205, !210, !216}
!199 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "ignore_interrupts", scope: !2, file: !3, line: 46, type: !202, isLocal: true, isDefinition: true)
!202 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "output_error", scope: !2, file: !3, line: 57, type: !5, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1536, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 6)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "output_error_types", scope: !2, file: !3, line: 73, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !214)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!214 = !{!215}
!215 = !DISubrange(count: 4)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "output_error_args", scope: !2, file: !3, line: 69, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 320, elements: !220)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!220 = !{!221}
!221 = !DISubrange(count: 5)
!222 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "Version", scope: !225, file: !226, line: 2, type: !43, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, globals: !227, nameTableKind: None)
!226 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!227 = !{!223}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !230, file: !231, line: 67, type: !279, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !232, retainedTypes: !233, globals: !278, nameTableKind: None)
!231 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!232 = !{!22}
!233 = !{!98, !43, !37, !234, !235, !162, !239, !274, !277, !197}
!234 = !DISubprogram(name: "quotearg_n_style", scope: !23, file: !23, line: 368, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!235 = !DISubprogram(name: "quote_n", scope: !236, file: !236, line: 40, type: !237, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!236 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!237 = !DISubroutineType(types: !238)
!238 = !{!43, !45, !43}
!239 = !DISubprogram(name: "fputs_unlocked", scope: !48, file: !48, line: 662, type: !240, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!240 = !DISubroutineType(types: !241)
!241 = !{!45, !43, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !243, file: !53, line: 51, baseType: !45, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !243, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !243, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !243, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !243, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !243, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !243, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !243, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !243, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !243, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !243, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !243, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !243, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !243, file: !53, line: 70, baseType: !242, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !243, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !243, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !243, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !243, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !243, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !243, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !243, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !243, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !243, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !243, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !243, file: !53, line: 93, baseType: !242, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !243, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !243, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !243, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !243, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!274 = !DISubprogram(name: "quote", scope: !236, file: !236, line: 44, type: !275, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!275 = !DISubroutineType(types: !276)
!276 = !{!43, !43}
!277 = !DISubprogram(name: "usage", scope: !231, file: !231, line: 56, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!278 = !{!228}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !280, line: 61, baseType: !126)
!280 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "file_name", scope: !283, file: !284, line: 46, type: !43, isLocal: true, isDefinition: true)
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !285, globals: !323, nameTableKind: None)
!284 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!285 = !{!286, !37, !322, !162}
!286 = !DISubprogram(name: "close_stream", scope: !287, file: !287, line: 2, type: !288, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!287 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!288 = !DISubroutineType(types: !289)
!289 = !{!45, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !291, file: !53, line: 51, baseType: !45, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !291, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !291, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !291, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !291, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !291, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !291, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !291, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !291, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !291, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !291, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !291, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !291, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !291, file: !53, line: 70, baseType: !290, size: 64, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !291, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !291, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !291, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !291, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !291, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !291, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !291, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !291, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !291, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !291, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !291, file: !53, line: 93, baseType: !290, size: 64, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !291, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !291, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !291, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !291, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!322 = !DISubprogram(name: "quotearg_colon", scope: !23, file: !23, line: 391, type: !120, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!323 = !{!281, !324}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !283, file: !284, line: 56, type: !202, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "exit_failure", scope: !328, file: !329, line: 24, type: !331, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, globals: !330, nameTableKind: None)
!329 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!330 = !{!326}
!331 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "program_name", scope: !334, file: !335, line: 33, type: !43, isDefinition: true)
!334 = distinct !DICompileUnit(language: DW_LANG_C99, file: !335, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !336, globals: !372, nameTableKind: None)
!335 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!336 = !{!98, !337, !41}
!337 = !DISubprogram(name: "fputs", scope: !48, file: !48, line: 626, type: !338, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!338 = !DISubroutineType(types: !339)
!339 = !{!45, !43, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !341, file: !53, line: 51, baseType: !45, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !341, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !341, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !341, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !341, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !341, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !341, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !341, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !341, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !341, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !341, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !341, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !341, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !341, file: !53, line: 70, baseType: !340, size: 64, offset: 832)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !341, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !341, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !341, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !341, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !341, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !341, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !341, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !341, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !341, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !341, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !341, file: !53, line: 93, baseType: !340, size: 64, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !341, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !341, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !341, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !341, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!372 = !{!332}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !375, file: !376, line: 85, type: !484, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !377, retainedTypes: !398, globals: !457, nameTableKind: None)
!376 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!377 = !{!22, !378, !383}
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !23, line: 242, baseType: !6, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!381 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!382 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 46, baseType: !6, size: 32, elements: !385)
!384 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!386 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!387 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!388 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!389 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!390 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!391 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!392 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!393 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!394 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!396 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!397 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!398 = !{!399, !402, !189, !418, !45, !78, !421, !100, !436, !440, !37, !446, !450, !41, !194, !192, !454}
!399 = !DISubprogram(name: "xmemdup", scope: !193, file: !193, line: 62, type: !400, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!400 = !DISubroutineType(types: !401)
!401 = !{!98, !144, !102}
!402 = !DISubprogram(name: "quotearg_alloc_mem", scope: !23, file: !23, line: 342, type: !403, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!403 = !DISubroutineType(types: !404)
!404 = !{!41, !43, !102, !405, !406}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !376, line: 65, size: 448, elements: !409)
!409 = !{!410, !411, !412, !416, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !408, file: !376, line: 68, baseType: !22, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !376, line: 71, baseType: !45, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !408, file: !376, line: 75, baseType: !413, size: 256, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !408, file: !376, line: 78, baseType: !43, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !408, file: !376, line: 81, baseType: !43, size: 64, offset: 384)
!418 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !23, file: !23, line: 408, type: !419, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!419 = !DISubroutineType(types: !420)
!420 = !{!41, !45, !43, !43, !43, !102}
!421 = !DISubprogram(name: "rpl_mbrtowc", scope: !422, file: !422, line: 717, type: !423, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!422 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!423 = !DISubroutineType(types: !424)
!424 = !{!102, !142, !43, !102, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 13, size: 64, elements: !428)
!427 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !426, file: !427, line: 15, baseType: !45, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !426, file: !427, line: 20, baseType: !431, size: 32, offset: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !427, line: 16, size: 32, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !431, file: !427, line: 18, baseType: !6, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !431, file: !427, line: 19, baseType: !435, size: 32)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, elements: !214)
!436 = !DISubprogram(name: "iswprint", scope: !437, file: !437, line: 120, type: !438, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!437 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!438 = !DISubroutineType(types: !439)
!439 = !{!45, !6}
!440 = !DISubprogram(name: "mbsinit", scope: !441, file: !441, line: 292, type: !442, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!441 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!442 = !DISubroutineType(types: !443)
!443 = !{!45, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!446 = !DISubprogram(name: "locale_charset", scope: !447, file: !447, line: 35, type: !448, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!447 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = !DISubroutineType(types: !449)
!449 = !{!43}
!450 = !DISubprogram(name: "c_strcasecmp", scope: !451, file: !451, line: 42, type: !452, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!451 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!452 = !DISubroutineType(types: !453)
!453 = !{!45, !43, !43}
!454 = !DISubprogram(name: "xrealloc", scope: !193, file: !193, line: 59, type: !455, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!455 = !DISubroutineType(types: !456)
!456 = !{!98, !98, !102}
!457 = !{!373, !458, !464, !466, !468, !473, !480, !482}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !375, file: !376, line: 101, type: !460, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 320, elements: !462)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!462 = !{!463}
!463 = !DISubrange(count: 10)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !375, file: !376, line: 1052, type: !408, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !375, file: !376, line: 116, type: !408, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "slot0", scope: !375, file: !376, line: 842, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 2048, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 256)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "slotvec", scope: !375, file: !376, line: 845, type: !475, isLocal: true, isDefinition: true)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !376, line: 834, size: 128, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !476, file: !376, line: 836, baseType: !100, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !476, file: !376, line: 837, baseType: !41, size: 64, offset: 64)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "nslots", scope: !375, file: !376, line: 843, type: !45, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "slotvec0", scope: !375, file: !376, line: 844, type: !476, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 704, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 11)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !489, file: !490, line: 26, type: !492, isDefinition: true)
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, globals: !491, nameTableKind: None)
!490 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!491 = !{!487}
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 376, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 47)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !497, file: !498, line: 507, type: !45, isLocal: true, isDefinition: true)
!497 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !498, file: !498, line: 488, type: !499, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !501, retainedNodes: !508)
!498 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !DISubroutineType(types: !500)
!500 = !{!45, !45, !45}
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !502, globals: !507, nameTableKind: None)
!502 = !{!503, !158}
!503 = !DISubprogram(name: "fcntl", scope: !504, file: !504, line: 176, type: !505, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!504 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!505 = !DISubroutineType(types: !506)
!506 = !{!45, !45, !45, null}
!507 = !{!495}
!508 = !{!509, !510, !511, !512, !515}
!509 = !DILocalVariable(name: "fd", arg: 1, scope: !497, file: !498, line: 488, type: !45)
!510 = !DILocalVariable(name: "target", arg: 2, scope: !497, file: !498, line: 488, type: !45)
!511 = !DILocalVariable(name: "result", scope: !497, file: !498, line: 490, type: !45)
!512 = !DILocalVariable(name: "flags", scope: !513, file: !498, line: 531, type: !45)
!513 = distinct !DILexicalBlock(scope: !514, file: !498, line: 530, column: 5)
!514 = distinct !DILexicalBlock(scope: !497, file: !498, line: 529, column: 7)
!515 = !DILocalVariable(name: "saved_errno", scope: !516, file: !498, line: 534, type: !45)
!516 = distinct !DILexicalBlock(scope: !517, file: !498, line: 533, column: 9)
!517 = distinct !DILexicalBlock(scope: !513, file: !498, line: 532, column: 11)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !520, retainedTypes: !521, nameTableKind: None)
!519 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!520 = !{!13}
!521 = !{!522, !525}
!522 = !DISubprogram(name: "posix_fadvise", scope: !504, file: !504, line: 288, type: !523, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!523 = !DISubroutineType(types: !524)
!524 = !{!45, !45, !76, !76, !45}
!525 = !DISubprogram(name: "fileno", scope: !48, file: !48, line: 786, type: !526, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!526 = !DISubroutineType(types: !527)
!527 = !{!45, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !529, file: !53, line: 51, baseType: !45, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !529, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !529, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !529, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !529, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !529, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !529, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !529, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !529, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !529, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !529, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !529, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !529, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !529, file: !53, line: 70, baseType: !528, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !529, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !529, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !529, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !529, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !529, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !529, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !529, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !529, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !529, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !529, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !529, file: !53, line: 93, baseType: !528, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !529, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !529, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !529, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !529, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !562, nameTableKind: None)
!561 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!562 = !{!563, !598, !600, !601, !158}
!563 = !DISubprogram(name: "fileno", scope: !48, file: !48, line: 786, type: !564, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!564 = !DISubroutineType(types: !565)
!565 = !{!45, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !567, file: !53, line: 51, baseType: !45, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !567, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !567, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !567, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !567, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !567, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !567, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !567, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !567, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !567, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !567, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !567, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !567, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !567, file: !53, line: 70, baseType: !566, size: 64, offset: 832)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !567, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !567, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !567, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !567, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !567, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !567, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !567, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !567, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !567, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !567, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !567, file: !53, line: 93, baseType: !566, size: 64, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !567, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !567, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !567, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !567, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!598 = !DISubprogram(name: "dup_safer", scope: !599, file: !599, line: 20, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!599 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!600 = !DISubprogram(name: "rpl_fclose", scope: !186, file: !186, line: 672, type: !564, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!601 = !DISubprogram(name: "fdopen", scope: !48, file: !48, line: 279, type: !602, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!602 = !DISubroutineType(types: !603)
!603 = !{!566, !45, !43}
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !606, nameTableKind: None)
!605 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!606 = !{!607}
!607 = !DISubprogram(name: "rpl_fcntl", scope: !608, file: !608, line: 588, type: !505, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!608 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !611, retainedTypes: !615, nameTableKind: None)
!610 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!611 = !{!612}
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !610, line: 40, baseType: !6, size: 32, elements: !613)
!613 = !{!614}
!614 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!615 = !{!37, !616, !98}
!616 = !DISubprogram(name: "fputs_unlocked", scope: !48, file: !48, line: 662, type: !617, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!617 = !DISubroutineType(types: !618)
!618 = !{!45, !43, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !620, file: !53, line: 51, baseType: !45, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !620, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !620, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !620, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !620, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !620, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !620, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !620, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !620, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !620, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !620, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !620, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !620, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !620, file: !53, line: 70, baseType: !619, size: 64, offset: 832)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !620, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !620, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !620, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !620, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !620, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !620, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !620, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !620, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !620, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !620, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !620, file: !53, line: 93, baseType: !619, size: 64, offset: 1344)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !620, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !620, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !620, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !620, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !653, retainedTypes: !666, nameTableKind: None)
!652 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !655, file: !193, line: 186, baseType: !6, size: 32, elements: !664)
!655 = distinct !DISubprogram(name: "x2nrealloc", scope: !193, file: !193, line: 174, type: !656, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !651, retainedNodes: !659)
!656 = !DISubroutineType(types: !657)
!657 = !{!98, !98, !658, !100}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(name: "p", arg: 1, scope: !655, file: !193, line: 174, type: !98)
!661 = !DILocalVariable(name: "pn", arg: 2, scope: !655, file: !193, line: 174, type: !658)
!662 = !DILocalVariable(name: "s", arg: 3, scope: !655, file: !193, line: 174, type: !100)
!663 = !DILocalVariable(name: "n", scope: !655, file: !193, line: 176, type: !100)
!664 = !{!665}
!665 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!666 = !{!100, !192, !194, !454, !41, !189, !98, !667, !670}
!667 = !DISubprogram(name: "xcalloc", scope: !193, file: !193, line: 57, type: !668, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!668 = !DISubroutineType(types: !669)
!669 = !{!98, !102, !102}
!670 = !DISubprogram(name: "rpl_calloc", scope: !671, file: !671, line: 688, type: !668, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!671 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !674, nameTableKind: None)
!673 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = !{!37, !162}
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !677, nameTableKind: None)
!676 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!677 = !{!98}
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !680, nameTableKind: None)
!679 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!680 = !{!681, !716, !717, !720}
!681 = !DISubprogram(name: "fileno", scope: !48, file: !48, line: 786, type: !682, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!682 = !DISubroutineType(types: !683)
!683 = !{!45, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !685, file: !53, line: 51, baseType: !45, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !685, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !685, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !685, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !685, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !685, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !685, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !685, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !685, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !685, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !685, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !685, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !685, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !685, file: !53, line: 70, baseType: !684, size: 64, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !685, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !685, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !685, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !685, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !685, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !685, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !685, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !685, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !685, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !685, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !685, file: !53, line: 93, baseType: !684, size: 64, offset: 1344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !685, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !685, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !685, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !685, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!716 = !DISubprogram(name: "fclose", scope: !48, file: !48, line: 213, type: !682, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!717 = !DISubprogram(name: "lseek", scope: !159, file: !159, line: 334, type: !718, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!718 = !DISubroutineType(types: !719)
!719 = !{!76, !45, !76, !45}
!720 = !DISubprogram(name: "rpl_fflush", scope: !186, file: !186, line: 718, type: !682, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !723, nameTableKind: None)
!722 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = !{!98, !724, !759}
!724 = !DISubprogram(name: "fflush", scope: !48, file: !48, line: 218, type: !725, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!725 = !DISubroutineType(types: !726)
!726 = !{!45, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !728, file: !53, line: 51, baseType: !45, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !728, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !728, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !728, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !728, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !728, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !728, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !728, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !728, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !728, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !728, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !728, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !728, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !728, file: !53, line: 70, baseType: !727, size: 64, offset: 832)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !728, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !728, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !728, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !728, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !728, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !728, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !728, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !728, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !728, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !728, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !728, file: !53, line: 93, baseType: !727, size: 64, offset: 1344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !728, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !728, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !728, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !728, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!759 = !DISubprogram(name: "rpl_fseeko", scope: !186, file: !186, line: 1034, type: !760, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!760 = !DISubroutineType(types: !761)
!761 = !{!45, !727, !76, !45}
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !764, nameTableKind: None)
!763 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!764 = !{!98, !765, !717, !800}
!765 = !DISubprogram(name: "fileno", scope: !48, file: !48, line: 786, type: !766, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!766 = !DISubroutineType(types: !767)
!767 = !{!45, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !769, file: !53, line: 51, baseType: !45, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !769, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !769, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !769, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !769, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !769, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !769, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !769, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !769, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !769, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !769, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !769, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !769, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !769, file: !53, line: 70, baseType: !768, size: 64, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !769, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !769, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !769, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !769, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !769, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !769, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !769, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !769, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !769, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !769, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !769, file: !53, line: 93, baseType: !768, size: 64, offset: 1344)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !769, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !769, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !769, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !769, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!800 = !DISubprogram(name: "fseeko", scope: !48, file: !48, line: 707, type: !801, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!801 = !DISubroutineType(types: !802)
!802 = !{!45, !768, !76, !45}
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !804, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !805, nameTableKind: None)
!804 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!805 = !{!806, !100, !818}
!806 = !DISubprogram(name: "mbrtowc", scope: !441, file: !441, line: 296, type: !807, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!807 = !DISubroutineType(types: !808)
!808 = !{!102, !142, !43, !102, !809}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 13, size: 64, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !810, file: !427, line: 15, baseType: !45, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !810, file: !427, line: 20, baseType: !814, size: 32, offset: 32)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !810, file: !427, line: 16, size: 32, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !814, file: !427, line: 18, baseType: !6, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !814, file: !427, line: 19, baseType: !435, size: 32)
!818 = !DISubprogram(name: "hard_locale", scope: !819, file: !819, line: 26, type: !820, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!819 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!820 = !DISubroutineType(types: !821)
!821 = !{!202, !45}
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !824, nameTableKind: None)
!823 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!824 = !{!825}
!825 = !DISubprogram(name: "rpl_fclose", scope: !186, file: !186, line: 672, type: !826, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!826 = !DISubroutineType(types: !827)
!827 = !{!45, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !829, file: !53, line: 51, baseType: !45, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !829, file: !53, line: 54, baseType: !41, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !829, file: !53, line: 55, baseType: !41, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !829, file: !53, line: 56, baseType: !41, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !829, file: !53, line: 57, baseType: !41, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !829, file: !53, line: 58, baseType: !41, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !829, file: !53, line: 59, baseType: !41, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !829, file: !53, line: 60, baseType: !41, size: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !829, file: !53, line: 61, baseType: !41, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !829, file: !53, line: 64, baseType: !41, size: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !829, file: !53, line: 65, baseType: !41, size: 64, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !829, file: !53, line: 66, baseType: !41, size: 64, offset: 704)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !829, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !829, file: !53, line: 70, baseType: !828, size: 64, offset: 832)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !829, file: !53, line: 72, baseType: !45, size: 32, offset: 896)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !829, file: !53, line: 73, baseType: !45, size: 32, offset: 928)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !829, file: !53, line: 74, baseType: !74, size: 64, offset: 960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !829, file: !53, line: 77, baseType: !78, size: 16, offset: 1024)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !829, file: !53, line: 78, baseType: !80, size: 8, offset: 1040)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !829, file: !53, line: 79, baseType: !82, size: 8, offset: 1048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !829, file: !53, line: 81, baseType: !86, size: 64, offset: 1088)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !829, file: !53, line: 89, baseType: !89, size: 64, offset: 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !829, file: !53, line: 91, baseType: !91, size: 64, offset: 1216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !829, file: !53, line: 92, baseType: !94, size: 64, offset: 1280)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !829, file: !53, line: 93, baseType: !828, size: 64, offset: 1344)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !829, file: !53, line: 94, baseType: !98, size: 64, offset: 1408)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !829, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !829, file: !53, line: 96, baseType: !45, size: 32, offset: 1536)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !829, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !46, retainedTypes: !862, nameTableKind: None)
!861 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!862 = !{!863}
!863 = !DISubprogram(name: "setlocale_null_r", scope: !864, file: !864, line: 64, type: !865, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!864 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!865 = !DISubroutineType(types: !866)
!866 = !{!45, !45, !41, !102}
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !869, retainedTypes: !1256, nameTableKind: None)
!868 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!869 = !{!870}
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !871, line: 41, baseType: !6, size: 32, elements: !872)
!871 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255}
!873 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!874 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!875 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!876 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!877 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!878 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!879 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!880 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!881 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!882 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!883 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!884 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!885 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!886 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!887 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!888 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!889 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!890 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!891 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!892 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!893 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!894 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!895 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!896 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!897 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!898 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!899 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!900 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!901 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!902 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!903 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!904 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!905 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!906 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
