; ModuleID = 'coreutils-8.32/src/test.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [85 x i8] c"Usage: test EXPRESSION\0A  or:  test\0A  or:  [ EXPRESSION ]\0A  or:  [ ]\0A  or:  [ OPTION\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "argv", scope: !2, file: !3, line: 73, type: !165, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !30, globals: !160, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/test.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 59, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "TEST_TRUE", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "TEST_FALSE", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "TEST_FAILURE", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 42, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14}
!14 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 46, baseType: !6, size: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!18 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!21 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!30 = !{!31, !41, !102, !106, !110, !113, !116, !123, !127, !131, !134, !135, !39, !72, !6, !138, !142, !92, !146, !149}
!31 = !DISubprogram(name: "dcgettext", scope: !32, file: !32, line: 51, type: !33, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!32 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !37, !37, !39}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !{}
!41 = !DISubprogram(name: "fputs_unlocked", scope: !42, file: !42, line: 662, type: !43, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!39, !37, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !48)
!47 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !64, !65, !66, !67, !71, !73, !75, !79, !82, !84, !87, !90, !91, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 51, baseType: !39, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 36, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 70, baseType: !45, size: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !70)
!69 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!70 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!74 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 43, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !69, line: 153, baseType: !70)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !46, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !47, line: 37, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !46, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !47, line: 38, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !46, file: !47, line: 93, baseType: !45, size: 64, offset: 1344)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !46, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!96 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DISubprogram(name: "set_program_name", scope: !103, file: !103, line: 37, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!103 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!104 = !DISubroutineType(types: !105)
!105 = !{null, !37}
!106 = !DISubprogram(name: "setlocale", scope: !107, file: !107, line: 122, type: !108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!107 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!35, !39, !37}
!110 = !DISubprogram(name: "bindtextdomain", scope: !32, file: !32, line: 86, type: !111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!111 = !DISubroutineType(types: !112)
!112 = !{!35, !37, !37}
!113 = !DISubprogram(name: "textdomain", scope: !32, file: !32, line: 82, type: !114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!114 = !DISubroutineType(types: !115)
!115 = !{!35, !37}
!116 = !DISubprogram(name: "atexit", scope: !117, file: !117, line: 595, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!117 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!39, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null}
!123 = !DISubprogram(name: "quote", scope: !124, file: !124, line: 44, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!124 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!125 = !DISubroutineType(types: !126)
!126 = !{!37, !37}
!127 = !DISubprogram(name: "euidaccess", scope: !128, file: !128, line: 292, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!128 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!39, !37, !39}
!131 = !DISubprogram(name: "geteuid", scope: !128, file: !128, line: 678, type: !132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!132 = !DISubroutineType(types: !133)
!133 = !{!6}
!134 = !DISubprogram(name: "getegid", scope: !128, file: !128, line: 684, type: !132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!135 = !DISubprogram(name: "isatty", scope: !128, file: !128, line: 779, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!136 = !DISubroutineType(types: !137)
!137 = !{!39, !39}
!138 = !DISubprogram(name: "umaxtostr", scope: !139, file: !139, line: 46, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!139 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !DISubroutineType(types: !141)
!141 = !{!35, !96, !35}
!142 = !DISubprogram(name: "strintcmp", scope: !143, file: !143, line: 1, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!143 = !DIFile(filename: "./lib/strnumcmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!144 = !DISubroutineType(types: !145)
!145 = !{!39, !37, !37}
!146 = !DISubprogram(name: "quote_n", scope: !124, file: !124, line: 40, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!147 = !DISubroutineType(types: !148)
!148 = !{!37, !39, !37}
!149 = !DISubprogram(name: "verror", scope: !150, file: !150, line: 34, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!150 = !DIFile(filename: "./lib/verror.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !39, !39, !37, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 93, size: 192, elements: !155)
!155 = !{!156, !157, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !154, file: !3, line: 93, baseType: !6, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !154, file: !3, line: 93, baseType: !6, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !154, file: !3, line: 93, baseType: !92, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !154, file: !3, line: 93, baseType: !92, size: 64, offset: 128)
!160 = !{!161, !163, !0}
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "pos", scope: !2, file: !3, line: 71, type: !39, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "argc", scope: !2, file: !3, line: 72, type: !39, isLocal: true, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "file_name", scope: !168, file: !169, line: 46, type: !37, isLocal: true, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !170, globals: !213, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !{!171, !31, !207, !209}
!171 = !DISubprogram(name: "close_stream", scope: !172, file: !172, line: 2, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!172 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{!39, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !176, file: !47, line: 51, baseType: !39, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !176, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !176, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !176, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !176, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !176, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !176, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !176, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !176, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !176, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !176, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !176, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !176, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !176, file: !47, line: 70, baseType: !175, size: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !176, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !176, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !176, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !176, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !176, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !176, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !176, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !176, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !176, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !176, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !176, file: !47, line: 93, baseType: !175, size: 64, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !176, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !176, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !176, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !176, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!207 = !DISubprogram(name: "quotearg_colon", scope: !208, file: !208, line: 391, type: !114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!208 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !DISubprogram(name: "error", scope: !210, file: !210, line: 52, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!210 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!211 = !DISubroutineType(types: !212)
!212 = !{null, !39, !39, !37, null}
!213 = !{!166, !214}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !168, file: !169, line: 56, type: !216, isLocal: true, isDefinition: true)
!216 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "exit_failure", scope: !219, file: !220, line: 24, type: !222, isLocal: false, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, globals: !221, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!221 = !{!217}
!222 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "program_name", scope: !225, file: !226, line: 33, type: !37, isLocal: false, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !227, globals: !263, splitDebugInlining: false, nameTableKind: None)
!226 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!227 = !{!92, !228, !35}
!228 = !DISubprogram(name: "fputs", scope: !42, file: !42, line: 626, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!229 = !DISubroutineType(types: !230)
!230 = !{!39, !37, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !232, file: !47, line: 51, baseType: !39, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !232, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !232, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !232, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !232, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !232, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !232, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !232, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !232, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !232, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !232, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !232, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !232, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !232, file: !47, line: 70, baseType: !231, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !232, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !232, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !232, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !232, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !232, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !232, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !232, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !232, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !232, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !232, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !232, file: !47, line: 93, baseType: !231, size: 64, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !232, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !232, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !232, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !232, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!263 = !{!223}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !266, file: !267, line: 85, type: !384, isLocal: false, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !268, retainedTypes: !287, globals: !357, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = !{!269, !282, !15}
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !208, line: 32, baseType: !6, size: 32, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!271 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!272 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!273 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!274 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!275 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!276 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!277 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!278 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!279 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!280 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!281 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !208, line: 242, baseType: !6, size: 32, elements: !283)
!283 = !{!284, !285, !286}
!284 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!287 = !{!288, !294, !310, !313, !39, !72, !316, !94, !334, !338, !31, !344, !348, !35, !350, !353, !354}
!288 = !DISubprogram(name: "xmemdup", scope: !289, file: !289, line: 62, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!289 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!290 = !DISubroutineType(types: !291)
!291 = !{!92, !292, !96}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!294 = !DISubprogram(name: "quotearg_alloc_mem", scope: !208, file: !208, line: 342, type: !295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!295 = !DISubroutineType(types: !296)
!296 = !{!35, !37, !96, !297, !298}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !267, line: 65, size: 448, elements: !301)
!301 = !{!302, !303, !304, !308, !309}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !300, file: !267, line: 68, baseType: !269, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !267, line: 71, baseType: !39, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !300, file: !267, line: 75, baseType: !305, size: 256, offset: 64)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !300, file: !267, line: 78, baseType: !37, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !300, file: !267, line: 81, baseType: !37, size: 64, offset: 384)
!310 = !DISubprogram(name: "free", scope: !117, file: !117, line: 565, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !92}
!313 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !208, file: !208, line: 408, type: !314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!314 = !DISubroutineType(types: !315)
!315 = !{!35, !39, !37, !37, !37, !96}
!316 = !DISubprogram(name: "rpl_mbrtowc", scope: !317, file: !317, line: 717, type: !318, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!317 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!318 = !DISubroutineType(types: !319)
!319 = !{!96, !320, !37, !96, !321}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 13, size: 64, elements: !324)
!323 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !322, file: !323, line: 15, baseType: !39, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !322, file: !323, line: 20, baseType: !327, size: 32, offset: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !322, file: !323, line: 16, size: 32, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !327, file: !323, line: 18, baseType: !6, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !327, file: !323, line: 19, baseType: !331, size: 32)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 4)
!334 = !DISubprogram(name: "iswprint", scope: !335, file: !335, line: 120, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!335 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!336 = !DISubroutineType(types: !337)
!337 = !{!39, !6}
!338 = !DISubprogram(name: "mbsinit", scope: !339, file: !339, line: 292, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!339 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!340 = !DISubroutineType(types: !341)
!341 = !{!39, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!344 = !DISubprogram(name: "locale_charset", scope: !345, file: !345, line: 35, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!345 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!346 = !DISubroutineType(types: !347)
!347 = !{!37}
!348 = !DISubprogram(name: "c_strcasecmp", scope: !349, file: !349, line: 42, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!349 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !DISubprogram(name: "xmalloc", scope: !289, file: !289, line: 53, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!351 = !DISubroutineType(types: !352)
!352 = !{!92, !96}
!353 = !DISubprogram(name: "xalloc_die", scope: !289, file: !289, line: 51, type: !121, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !40)
!354 = !DISubprogram(name: "xrealloc", scope: !289, file: !289, line: 59, type: !355, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!355 = !DISubroutineType(types: !356)
!356 = !{!92, !92, !96}
!357 = !{!264, !358, !364, !366, !368, !373, !380, !382}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !266, file: !267, line: 101, type: !360, isLocal: false, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 320, elements: !362)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!362 = !{!363}
!363 = !DISubrange(count: 10)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !266, file: !267, line: 1052, type: !300, isLocal: false, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !266, file: !267, line: 116, type: !300, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "slot0", scope: !266, file: !267, line: 842, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 256)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "slotvec", scope: !266, file: !267, line: 845, type: !375, isLocal: true, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !267, line: 834, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !267, line: 836, baseType: !94, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !376, file: !267, line: 837, baseType: !35, size: 64, offset: 64)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "nslots", scope: !266, file: !267, line: 843, type: !39, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "slotvec0", scope: !266, file: !267, line: 844, type: !376, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 704, elements: !386)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!386 = !{!387}
!387 = !DISubrange(count: 11)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !392, line: 102, baseType: !393)
!392 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !69, line: 73, baseType: !96)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !133, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "lib/strintcmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !398, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/verror.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!398 = !{!399, !409, !413, !209, !31, !310}
!399 = !DISubprogram(name: "verror_at_line", scope: !150, file: !150, line: 45, type: !400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !39, !39, !37, !6, !37, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !397, size: 192, elements: !404)
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !403, file: !397, baseType: !6, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !403, file: !397, baseType: !6, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !403, file: !397, baseType: !92, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !403, file: !397, baseType: !92, size: 64, offset: 128)
!409 = !DISubprogram(name: "xvasprintf", scope: !410, file: !410, line: 48, type: !411, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!410 = !DIFile(filename: "./lib/xvasprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!411 = !DISubroutineType(types: !412)
!412 = !{!35, !37, !402}
!413 = !DISubprogram(name: "error_at_line", scope: !210, file: !210, line: 55, type: !414, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !39, !39, !37, !6, !37, null}
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !431, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!419}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !420, file: !289, line: 186, baseType: !6, size: 32, elements: !429)
!420 = distinct !DISubprogram(name: "x2nrealloc", scope: !289, file: !289, line: 174, type: !421, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !424)
!421 = !DISubroutineType(types: !422)
!422 = !{!92, !92, !423, !94}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!424 = !{!425, !426, !427, !428}
!425 = !DILocalVariable(name: "p", arg: 1, scope: !420, file: !289, line: 174, type: !92)
!426 = !DILocalVariable(name: "pn", arg: 2, scope: !420, file: !289, line: 174, type: !423)
!427 = !DILocalVariable(name: "s", arg: 3, scope: !420, file: !289, line: 174, type: !94)
!428 = !DILocalVariable(name: "n", scope: !420, file: !289, line: 176, type: !94)
!429 = !{!430}
!430 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!431 = !{!94, !353, !350, !354, !35, !310, !92, !432, !435}
!432 = !DISubprogram(name: "xcalloc", scope: !289, file: !289, line: 57, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!433 = !DISubroutineType(types: !434)
!434 = !{!92, !96, !96}
!435 = !DISubprogram(name: "rpl_calloc", scope: !436, file: !436, line: 688, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!436 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !439, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!439 = !{!31, !209}
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !442, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!353, !35, !350}
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !445, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!445 = !{!92}
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !448, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = !{!449, !94, !461}
!449 = !DISubprogram(name: "mbrtowc", scope: !339, file: !339, line: 296, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!450 = !DISubroutineType(types: !451)
!451 = !{!96, !320, !37, !96, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 13, size: 64, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !453, file: !323, line: 15, baseType: !39, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !453, file: !323, line: 20, baseType: !457, size: 32, offset: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !323, line: 16, size: 32, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !457, file: !323, line: 18, baseType: !6, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !457, file: !323, line: 19, baseType: !331, size: 32)
!461 = !DISubprogram(name: "hard_locale", scope: !462, file: !462, line: 26, type: !463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!462 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = !DISubroutineType(types: !464)
!464 = !{!216, !39}
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !467, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!468}
!468 = !DISubprogram(name: "rpl_fclose", scope: !469, file: !469, line: 672, type: !470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!469 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!470 = !DISubroutineType(types: !471)
!471 = !{!39, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !473, file: !47, line: 51, baseType: !39, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !473, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !473, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !473, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !473, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !473, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !473, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !473, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !473, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !473, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !473, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !473, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !473, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !473, file: !47, line: 70, baseType: !472, size: 64, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !473, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !473, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !473, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !473, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !473, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !473, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !473, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !473, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !473, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !473, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !473, file: !47, line: 93, baseType: !472, size: 64, offset: 1344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !473, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !473, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !473, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !473, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!506 = !{!507}
!507 = !DISubprogram(name: "setlocale_null_r", scope: !508, file: !508, line: 64, type: !509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!508 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = !DISubroutineType(types: !510)
!510 = !{!39, !39, !35, !96}
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !513, retainedTypes: !900, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!513 = !{!514}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !515, line: 41, baseType: !6, size: 32, elements: !516)
!515 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!517 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!518 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!519 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!520 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!521 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!522 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!523 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!524 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!525 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!526 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!527 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!528 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!529 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!530 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!531 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!532 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!533 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!534 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!535 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!536 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!537 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!538 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!539 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!540 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!541 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!542 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!543 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!544 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!545 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!546 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!547 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!548 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!549 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!550 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!551 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!552 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!553 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!554 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!555 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!556 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!557 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!558 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!559 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!560 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!561 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!562 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!563 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!564 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!565 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!566 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!625 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!628 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!629 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!630 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!631 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!632 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!633 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!634 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!635 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!636 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!637 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!638 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!639 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!712 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!785 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!786 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!787 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!788 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!789 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!790 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!791 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!792 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!793 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!794 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!795 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!796 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!797 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!798 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!799 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!801 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!802 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!803 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!804 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!805 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!806 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!832 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!833 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!834 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!835 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!836 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!841 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!842 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!843 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!844 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!900 = !{!901, !92}
!901 = !DISubprogram(name: "nl_langinfo", scope: !515, file: !515, line: 661, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!902 = !DISubroutineType(types: !903)
!903 = !{!35, !39}
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !906, splitDebugInlining: false, nameTableKind: None)
!905 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!906 = !{!92, !106}
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !909, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!909 = !{!910, !945, !946, !949}
!910 = !DISubprogram(name: "fileno", scope: !42, file: !42, line: 786, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!911 = !DISubroutineType(types: !912)
!912 = !{!39, !913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !914, file: !47, line: 51, baseType: !39, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !914, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !914, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !914, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !914, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !914, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !914, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !914, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !914, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !914, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !914, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !914, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !914, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !914, file: !47, line: 70, baseType: !913, size: 64, offset: 832)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !914, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !914, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !914, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !914, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !914, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !914, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !914, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !914, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !914, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !914, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !914, file: !47, line: 93, baseType: !913, size: 64, offset: 1344)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !914, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !914, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !914, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !914, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!945 = !DISubprogram(name: "fclose", scope: !42, file: !42, line: 213, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!946 = !DISubprogram(name: "lseek", scope: !128, file: !128, line: 334, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!947 = !DISubroutineType(types: !948)
!948 = !{!70, !39, !70, !39}
!949 = !DISubprogram(name: "rpl_fflush", scope: !469, file: !469, line: 718, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !952, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!952 = !{!92, !953, !988}
!953 = !DISubprogram(name: "fflush", scope: !42, file: !42, line: 218, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!954 = !DISubroutineType(types: !955)
!955 = !{!39, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !957, file: !47, line: 51, baseType: !39, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !957, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !957, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !957, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !957, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !957, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !957, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !957, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !957, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !957, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !957, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !957, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !957, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !957, file: !47, line: 70, baseType: !956, size: 64, offset: 832)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !957, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !957, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !957, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !957, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !957, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !957, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !957, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !957, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !957, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !957, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !957, file: !47, line: 93, baseType: !956, size: 64, offset: 1344)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !957, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !957, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !957, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !957, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!988 = !DISubprogram(name: "rpl_fseeko", scope: !469, file: !469, line: 1034, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!989 = !DISubroutineType(types: !990)
!990 = !{!39, !956, !70, !39}
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !993, splitDebugInlining: false, nameTableKind: None)
!992 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!993 = !{!92, !994, !946, !1029}
!994 = !DISubprogram(name: "fileno", scope: !42, file: !42, line: 786, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!995 = !DISubroutineType(types: !996)
!996 = !{!39, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !998, file: !47, line: 51, baseType: !39, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !998, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !998, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !998, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !998, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !998, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !998, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !998, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !998, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !998, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !998, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
