; ModuleID = 'coreutils-8.32/src/test.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [85 x i8] c"Usage: test EXPRESSION\0A  or:  test\0A  or:  [ EXPRESSION ]\0A  or:  [ ]\0A  or:  [ OPTION\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!38 = distinct !DIGlobalVariable(name: "argc", scope: !2, file: !3, line: 72, type: !31, isLocal: true, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "file_name", scope: !44, file: !45, line: 46, type: !51, isLocal: true, isDefinition: true)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, globals: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!46 = !{}
!47 = !{!42, !48}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !44, file: !45, line: 56, type: !50, isLocal: true, isDefinition: true)
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "exit_failure", scope: !55, file: !56, line: 24, type: !58, isLocal: false, isDefinition: true)
!55 = distinct !DICompileUnit(language: DW_LANG_C99, file: !56, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, globals: !57, splitDebugInlining: false, nameTableKind: None)
!56 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!57 = !{!53}
!58 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "program_name", scope: !61, file: !62, line: 33, type: !51, isLocal: false, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !63, globals: !64, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!63 = !{!33, !40}
!64 = !{!59}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !67, file: !68, line: 85, type: !130, isLocal: false, isDefinition: true)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !89, globals: !93, splitDebugInlining: false, nameTableKind: None)
!68 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!69 = !{!70, !84, !15}
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !71, line: 32, baseType: !6, size: 32, elements: !72)
!71 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!73 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!79 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!80 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!81 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!82 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!83 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !71, line: 242, baseType: !6, size: 32, elements: !85)
!85 = !{!86, !87, !88}
!86 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!89 = !{!31, !32, !90, !40}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!92 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!93 = !{!65, !94, !100, !112, !114, !119, !126, !128}
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !67, file: !68, line: 101, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 320, elements: !98)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!98 = !{!99}
!99 = !DISubrange(count: 10)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !67, file: !68, line: 1052, type: !102, isLocal: false, isDefinition: true)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !68, line: 65, size: 448, elements: !103)
!103 = !{!104, !105, !106, !110, !111}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !102, file: !68, line: 68, baseType: !70, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !102, file: !68, line: 71, baseType: !31, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !102, file: !68, line: 75, baseType: !107, size: 256, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !102, file: !68, line: 78, baseType: !51, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !102, file: !68, line: 81, baseType: !51, size: 64, offset: 384)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !67, file: !68, line: 116, type: !102, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "slot0", scope: !67, file: !68, line: 842, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 256)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "slotvec", scope: !67, file: !68, line: 845, type: !121, isLocal: true, isDefinition: true)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !68, line: 834, size: 128, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !122, file: !68, line: 836, baseType: !90, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !122, file: !68, line: 837, baseType: !40, size: 64, offset: 64)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "nslots", scope: !67, file: !68, line: 843, type: !31, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "slotvec0", scope: !67, file: !68, line: 844, type: !122, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 704, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!132 = !{!133}
!133 = !DISubrange(count: 11)
!134 = distinct !DICompileUnit(language: DW_LANG_C99, file: !135, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !136, splitDebugInlining: false, nameTableKind: None)
!135 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !138, line: 102, baseType: !139)
!138 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !140, line: 73, baseType: !92)
!140 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !142, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !143, splitDebugInlining: false, nameTableKind: None)
!142 = !DIFile(filename: "lib/strintcmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!143 = !{!6}
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!145 = !DIFile(filename: "lib/verror.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !148, retainedTypes: !162, splitDebugInlining: false, nameTableKind: None)
!147 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!148 = !{!149}
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !151, file: !150, line: 186, baseType: !6, size: 32, elements: !160)
!150 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = distinct !DISubprogram(name: "x2nrealloc", scope: !150, file: !150, line: 174, type: !152, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !146, retainedNodes: !155)
!152 = !DISubroutineType(types: !153)
!153 = !{!33, !33, !154, !90}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!155 = !{!156, !157, !158, !159}
!156 = !DILocalVariable(name: "p", arg: 1, scope: !151, file: !150, line: 174, type: !33)
!157 = !DILocalVariable(name: "pn", arg: 2, scope: !151, file: !150, line: 174, type: !154)
!158 = !DILocalVariable(name: "s", arg: 3, scope: !151, file: !150, line: 174, type: !90)
!159 = !DILocalVariable(name: "n", scope: !151, file: !150, line: 176, type: !90)
!160 = !{!161}
!161 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!162 = !{!90, !40, !33}
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!164 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !167, splitDebugInlining: false, nameTableKind: None)
!166 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !{!40}
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !{!33}
!171 = distinct !DICompileUnit(language: DW_LANG_C99, file: !172, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !173, splitDebugInlining: false, nameTableKind: None)
!172 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !{!90}
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!177 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !180, retainedTypes: !170, splitDebugInlining: false, nameTableKind: None)
!179 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !{!181}
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !182, line: 41, baseType: !6, size: 32, elements: !183)
!182 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!184 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!185 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!186 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!187 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!188 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!189 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!190 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!191 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!192 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!193 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!194 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!195 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!196 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!197 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!198 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!199 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!200 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!201 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!202 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!203 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!204 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!205 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!206 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!207 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!208 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!209 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!210 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!211 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!212 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!213 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!214 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!215 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!216 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!217 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!218 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!219 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!220 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!221 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!222 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!223 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!224 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!225 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!226 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!227 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!228 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!229 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!230 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!231 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!232 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!233 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!234 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!235 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!236 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!237 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!238 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!239 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!240 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!241 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!242 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!243 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!244 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!245 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!246 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!247 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!248 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!249 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!250 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!251 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!252 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!253 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!254 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!255 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!256 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!257 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!258 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!259 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!260 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!261 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!262 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!263 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!264 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!265 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!266 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!267 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!268 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!269 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!270 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!271 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!292 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!295 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!296 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!297 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!298 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!299 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!300 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!301 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!302 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!303 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!304 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!305 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!306 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!312 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!379 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!452 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!453 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!454 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!455 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!456 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!457 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!458 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!459 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!460 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!461 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!462 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!463 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!464 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!465 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!466 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!468 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!469 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!470 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!471 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!472 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!473 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!499 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!500 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!501 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!502 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!503 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!508 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!509 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!510 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!511 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !170, splitDebugInlining: false, nameTableKind: None)
!568 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !170, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !170, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!575 = !{!"clang version 12.0.1"}
!576 = !{i32 7, !"Dwarf Version", i32 4}
!577 = !{i32 2, !"Debug Info Version", i32 3}
!578 = !{i32 1, !"wchar_size", i32 4}
!579 = !{i32 7, !"PIC Level", i32 2}
!580 = !{i32 7, !"PIE Level", i32 2}
!581 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 684, type: !582, scopeLine: 685, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !31}
!584 = !{!585}
!585 = !DILocalVariable(name: "status", arg: 1, scope: !581, file: !3, line: 684, type: !31)
!586 = !DILocation(line: 0, scope: !581)
!587 = !DILocation(line: 686, column: 14, scope: !588)
!588 = distinct !DILexicalBlock(scope: !581, file: !3, line: 686, column: 7)
!589 = !DILocation(line: 686, column: 7, scope: !581)
!590 = !DILocation(line: 687, column: 5, scope: !591)
!591 = distinct !DILexicalBlock(scope: !588, file: !3, line: 687, column: 5)
!592 = !{!593, !593, i64 0}
!593 = !{!"any pointer", !594, i64 0}
!594 = !{!"omnipotent char", !595, i64 0}
!595 = !{!"Simple C/C++ TBAA"}
!596 = !DILocation(line: 690, column: 7, scope: !597)
!597 = distinct !DILexicalBlock(scope: !588, file: !3, line: 689, column: 5)
!598 = !DILocation(line: 697, column: 7, scope: !597)
!599 = !DILocation(line: 701, column: 7, scope: !597)
!600 = !DILocation(line: 702, column: 7, scope: !597)
!601 = !DILocation(line: 703, column: 7, scope: !597)
!602 = !DILocation(line: 708, column: 7, scope: !597)
!603 = !DILocation(line: 715, column: 7, scope: !597)
!604 = !DILocation(line: 723, column: 7, scope: !597)
!605 = !DILocation(line: 732, column: 7, scope: !597)
!606 = !DILocation(line: 738, column: 7, scope: !597)
!607 = !DILocation(line: 745, column: 7, scope: !597)
!608 = !DILocation(line: 752, column: 7, scope: !597)
!609 = !DILocation(line: 760, column: 7, scope: !597)
!610 = !DILocation(line: 767, column: 7, scope: !597)
!611 = !DILocation(line: 773, column: 7, scope: !597)
!612 = !DILocation(line: 778, column: 7, scope: !597)
!613 = !DILocation(line: 783, column: 7, scope: !597)
!614 = !DILocalVariable(name: "program", arg: 1, scope: !615, file: !616, line: 634, type: !51)
!615 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !616, file: !616, line: 634, type: !617, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !619)
!616 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!617 = !DISubroutineType(types: !618)
!618 = !{null, !51}
!619 = !{!614, !620, !629, !630, !632}
!620 = !DILocalVariable(name: "infomap", scope: !615, file: !616, line: 636, type: !621)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 896, elements: !627)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !615, file: !616, line: 636, size: 128, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !623, file: !616, line: 636, baseType: !51, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !623, file: !616, line: 636, baseType: !51, size: 64, offset: 64)
!627 = !{!628}
!628 = !DISubrange(count: 7)
!629 = !DILocalVariable(name: "node", scope: !615, file: !616, line: 646, type: !51)
!630 = !DILocalVariable(name: "map_prog", scope: !615, file: !616, line: 647, type: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!632 = !DILocalVariable(name: "lc_messages", scope: !615, file: !616, line: 659, type: !51)
!633 = !DILocation(line: 0, scope: !615, inlinedAt: !634)
!634 = distinct !DILocation(line: 784, column: 7, scope: !597)
!635 = !DILocation(line: 636, column: 3, scope: !615, inlinedAt: !634)
!636 = !DILocation(line: 636, column: 67, scope: !615, inlinedAt: !634)
!637 = !DILocation(line: 647, column: 36, scope: !615, inlinedAt: !634)
!638 = !DILocation(line: 649, column: 3, scope: !615, inlinedAt: !634)
!639 = !DILocation(line: 649, column: 33, scope: !615, inlinedAt: !634)
!640 = !DILocation(line: 650, column: 13, scope: !615, inlinedAt: !634)
!641 = !DILocation(line: 649, column: 20, scope: !615, inlinedAt: !634)
!642 = !{!643, !593, i64 0}
!643 = !{!"infomap", !593, i64 0, !593, i64 8}
!644 = !DILocation(line: 649, column: 10, scope: !615, inlinedAt: !634)
!645 = !DILocation(line: 649, column: 28, scope: !615, inlinedAt: !634)
!646 = distinct !{!646, !638, !640, !647}
!647 = !{!"llvm.loop.mustprogress"}
!648 = !DILocation(line: 652, column: 17, scope: !649, inlinedAt: !634)
!649 = distinct !DILexicalBlock(scope: !615, file: !616, line: 652, column: 7)
!650 = !{!643, !593, i64 8}
!651 = !DILocation(line: 652, column: 7, scope: !649, inlinedAt: !634)
!652 = !DILocation(line: 652, column: 7, scope: !615, inlinedAt: !634)
!653 = !DILocation(line: 655, column: 3, scope: !615, inlinedAt: !634)
!654 = !DILocation(line: 659, column: 29, scope: !615, inlinedAt: !634)
!655 = !DILocation(line: 660, column: 7, scope: !656, inlinedAt: !634)
!656 = distinct !DILexicalBlock(scope: !615, file: !616, line: 660, column: 7)
!657 = !DILocation(line: 660, column: 19, scope: !656, inlinedAt: !634)
!658 = !DILocation(line: 660, column: 22, scope: !656, inlinedAt: !634)
!659 = !DILocation(line: 660, column: 7, scope: !615, inlinedAt: !634)
!660 = !DILocation(line: 666, column: 7, scope: !661, inlinedAt: !634)
!661 = distinct !DILexicalBlock(scope: !656, file: !616, line: 661, column: 5)
!662 = !DILocation(line: 668, column: 5, scope: !661, inlinedAt: !634)
!663 = !DILocation(line: 669, column: 3, scope: !615, inlinedAt: !634)
!664 = !DILocation(line: 671, column: 3, scope: !615, inlinedAt: !634)
!665 = !DILocation(line: 673, column: 1, scope: !615, inlinedAt: !634)
!666 = !DILocation(line: 786, column: 3, scope: !581)
!667 = !DISubprogram(name: "dcgettext", scope: !668, file: !668, line: 51, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!668 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!669 = !DISubroutineType(types: !670)
!670 = !{!40, !51, !51, !31}
!671 = !DISubprogram(name: "fputs_unlocked", scope: !672, file: !672, line: 667, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!672 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!673 = !DISubroutineType(types: !674)
!674 = !{!31, !51, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !677, line: 49, size: 1728, elements: !678)
!677 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !694, !695, !696, !697, !700, !701, !703, !707, !710, !712, !715, !718, !719, !720, !721, !722}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !676, file: !677, line: 51, baseType: !31, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !676, file: !677, line: 54, baseType: !40, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !676, file: !677, line: 55, baseType: !40, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !676, file: !677, line: 56, baseType: !40, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !676, file: !677, line: 57, baseType: !40, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !676, file: !677, line: 58, baseType: !40, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !676, file: !677, line: 59, baseType: !40, size: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !676, file: !677, line: 60, baseType: !40, size: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !676, file: !677, line: 61, baseType: !40, size: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !676, file: !677, line: 64, baseType: !40, size: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !676, file: !677, line: 65, baseType: !40, size: 64, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !676, file: !677, line: 66, baseType: !40, size: 64, offset: 704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !676, file: !677, line: 68, baseType: !692, size: 64, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !677, line: 36, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !676, file: !677, line: 70, baseType: !675, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !676, file: !677, line: 72, baseType: !31, size: 32, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !676, file: !677, line: 73, baseType: !31, size: 32, offset: 928)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !676, file: !677, line: 74, baseType: !698, size: 64, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !140, line: 152, baseType: !699)
!699 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !676, file: !677, line: 77, baseType: !32, size: 16, offset: 1024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !676, file: !677, line: 78, baseType: !702, size: 8, offset: 1040)
!702 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !676, file: !677, line: 79, baseType: !704, size: 8, offset: 1048)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 1)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !676, file: !677, line: 81, baseType: !708, size: 64, offset: 1088)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !677, line: 43, baseType: null)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !676, file: !677, line: 89, baseType: !711, size: 64, offset: 1152)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !140, line: 153, baseType: !699)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !676, file: !677, line: 91, baseType: !713, size: 64, offset: 1216)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !677, line: 37, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !676, file: !677, line: 92, baseType: !716, size: 64, offset: 1280)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !677, line: 38, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !676, file: !677, line: 93, baseType: !675, size: 64, offset: 1344)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !676, file: !677, line: 94, baseType: !33, size: 64, offset: 1408)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !676, file: !677, line: 95, baseType: !90, size: 64, offset: 1472)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !676, file: !677, line: 96, baseType: !31, size: 32, offset: 1536)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !676, file: !677, line: 98, baseType: !723, size: 160, offset: 1568)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 20)
!726 = !DISubprogram(name: "setlocale", scope: !727, file: !727, line: 122, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!727 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!728 = !DISubroutineType(types: !729)
!729 = !{!40, !31, !51}
!730 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 805, type: !731, scopeLine: 806, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!31, !31, !39}
!733 = !{!734, !735, !736}
!734 = !DILocalVariable(name: "margc", arg: 1, scope: !730, file: !3, line: 805, type: !31)
!735 = !DILocalVariable(name: "margv", arg: 2, scope: !730, file: !3, line: 805, type: !39)
!736 = !DILocalVariable(name: "value", scope: !730, file: !3, line: 807, type: !50)
!737 = !DILocation(line: 0, scope: !730)
!738 = !DILocation(line: 818, column: 21, scope: !730)
!739 = !DILocation(line: 818, column: 3, scope: !730)
!740 = !DILocation(line: 819, column: 3, scope: !730)
!741 = !DILocation(line: 820, column: 3, scope: !730)
!742 = !DILocation(line: 821, column: 3, scope: !730)
!743 = !DILocalVariable(name: "status", arg: 1, scope: !744, file: !616, line: 99, type: !31)
!744 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !616, file: !616, line: 99, type: !582, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !745)
!745 = !{!743}
!746 = !DILocation(line: 0, scope: !744, inlinedAt: !747)
!747 = distinct !DILocation(line: 823, column: 3, scope: !730)
!748 = !DILocation(line: 102, column: 18, scope: !749, inlinedAt: !747)
!749 = distinct !DILexicalBlock(scope: !744, file: !616, line: 101, column: 7)
!750 = !{!751, !751, i64 0}
!751 = !{!"int", !594, i64 0}
!752 = !DILocation(line: 824, column: 3, scope: !730)
!753 = !DILocation(line: 827, column: 8, scope: !730)
!754 = !DILocation(line: 855, column: 8, scope: !730)
!755 = !DILocation(line: 856, column: 7, scope: !730)
!756 = !DILocation(line: 858, column: 11, scope: !757)
!757 = distinct !DILexicalBlock(scope: !730, file: !3, line: 858, column: 7)
!758 = !DILocation(line: 858, column: 7, scope: !730)
!759 = !DILocation(line: 861, column: 27, scope: !730)
!760 = !DILocation(line: 861, column: 11, scope: !730)
!761 = !DILocation(line: 863, column: 7, scope: !762)
!762 = distinct !DILexicalBlock(scope: !730, file: !3, line: 863, column: 7)
!763 = !DILocation(line: 863, column: 14, scope: !762)
!764 = !DILocation(line: 863, column: 11, scope: !762)
!765 = !DILocation(line: 863, column: 7, scope: !730)
!766 = !DILocation(line: 864, column: 24, scope: !762)
!767 = !DILocation(line: 864, column: 55, scope: !762)
!768 = !DILocation(line: 864, column: 60, scope: !762)
!769 = !DILocation(line: 864, column: 48, scope: !762)
!770 = !DILocation(line: 864, column: 5, scope: !762)
!771 = !DILocation(line: 866, column: 3, scope: !730)
!772 = !DILocation(line: 867, column: 1, scope: !730)
!773 = !DISubprogram(name: "bindtextdomain", scope: !668, file: !668, line: 86, type: !774, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!774 = !DISubroutineType(types: !775)
!775 = !{!40, !51, !51}
!776 = !DISubprogram(name: "textdomain", scope: !668, file: !668, line: 82, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!777 = !DISubroutineType(types: !778)
!778 = !{!40, !51}
!779 = !DISubprogram(name: "atexit", scope: !780, file: !780, line: 595, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !46)
!780 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!781 = !DISubroutineType(types: !782)
!782 = !{!31, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null}
!786 = distinct !DISubprogram(name: "posixtest", scope: !3, file: !3, line: 638, type: !787, scopeLine: 639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !789)
!787 = !DISubroutineType(types: !788)
!788 = !{!50, !31}
!789 = !{!790, !791}
!790 = !DILocalVariable(name: "nargs", arg: 1, scope: !786, file: !3, line: 638, type: !31)
!791 = !DILocalVariable(name: "value", scope: !786, file: !3, line: 640, type: !50)
!792 = !DILocation(line: 0, scope: !786)
!793 = !DILocation(line: 642, column: 3, scope: !786)
!794 = !DILocation(line: 587, column: 10, scope: !795, inlinedAt: !798)
!795 = distinct !DISubprogram(name: "one_argument", scope: !3, file: !3, line: 585, type: !796, scopeLine: 586, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !46)
!796 = !DISubroutineType(types: !797)
!797 = !{!50}
!798 = distinct !DILocation(line: 645, column: 17, scope: !799)
!799 = distinct !DILexicalBlock(scope: !786, file: !3, line: 643, column: 5)
!800 = !DILocation(line: 587, column: 18, scope: !795, inlinedAt: !798)
!801 = !{!594, !594, i64 0}
!802 = !DILocation(line: 587, column: 25, scope: !795, inlinedAt: !798)
!803 = !DILocation(line: 646, column: 9, scope: !799)
!804 = !DILocation(line: 595, column: 7, scope: !805, inlinedAt: !809)
!805 = distinct !DILexicalBlock(scope: !806, file: !3, line: 595, column: 7)
!806 = distinct !DISubprogram(name: "two_arguments", scope: !3, file: !3, line: 591, type: !796, scopeLine: 592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!807 = !{!808}
!808 = !DILocalVariable(name: "value", scope: !806, file: !3, line: 593, type: !50)
!809 = distinct !DILocation(line: 649, column: 17, scope: !799)
!810 = !DILocation(line: 595, column: 7, scope: !806, inlinedAt: !809)
!811 = !DILocalVariable(name: "f", arg: 1, scope: !812, file: !3, line: 104, type: !50)
!812 = distinct !DISubprogram(name: "advance", scope: !3, file: !3, line: 104, type: !813, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !50}
!815 = !{!811}
!816 = !DILocation(line: 0, scope: !812, inlinedAt: !817)
!817 = distinct !DILocation(line: 597, column: 7, scope: !818, inlinedAt: !809)
!818 = distinct !DILexicalBlock(scope: !805, file: !3, line: 596, column: 5)
!819 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !817)
!820 = !DILocation(line: 587, column: 18, scope: !795, inlinedAt: !821)
!821 = distinct !DILocation(line: 598, column: 17, scope: !818, inlinedAt: !809)
!822 = !DILocation(line: 587, column: 10, scope: !795, inlinedAt: !821)
!823 = !DILocation(line: 587, column: 25, scope: !795, inlinedAt: !821)
!824 = !DILocation(line: 0, scope: !806, inlinedAt: !809)
!825 = !DILocation(line: 599, column: 5, scope: !818, inlinedAt: !809)
!826 = !DILocation(line: 600, column: 12, scope: !827, inlinedAt: !809)
!827 = distinct !DILexicalBlock(scope: !805, file: !3, line: 600, column: 12)
!828 = !DILocation(line: 600, column: 25, scope: !827, inlinedAt: !809)
!829 = !DILocation(line: 601, column: 12, scope: !827, inlinedAt: !809)
!830 = !DILocation(line: 601, column: 15, scope: !827, inlinedAt: !809)
!831 = !DILocation(line: 601, column: 28, scope: !827, inlinedAt: !809)
!832 = !DILocation(line: 602, column: 12, scope: !827, inlinedAt: !809)
!833 = !DILocation(line: 602, column: 15, scope: !827, inlinedAt: !809)
!834 = !DILocation(line: 602, column: 28, scope: !827, inlinedAt: !809)
!835 = !DILocation(line: 600, column: 12, scope: !805, inlinedAt: !809)
!836 = !DILocation(line: 604, column: 15, scope: !837, inlinedAt: !809)
!837 = distinct !DILexicalBlock(scope: !827, file: !3, line: 603, column: 5)
!838 = !DILocation(line: 607, column: 5, scope: !827, inlinedAt: !809)
!839 = !DILocation(line: 653, column: 17, scope: !799)
!840 = !DILocation(line: 654, column: 9, scope: !799)
!841 = !DILocation(line: 657, column: 13, scope: !842)
!842 = distinct !DILexicalBlock(scope: !799, file: !3, line: 657, column: 13)
!843 = !DILocation(line: 657, column: 13, scope: !799)
!844 = !DILocation(line: 0, scope: !812, inlinedAt: !845)
!845 = distinct !DILocation(line: 659, column: 13, scope: !846)
!846 = distinct !DILexicalBlock(scope: !842, file: !3, line: 658, column: 11)
!847 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !845)
!848 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !845)
!849 = distinct !DILexicalBlock(scope: !812, file: !3, line: 108, column: 7)
!850 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !845)
!851 = !DILocation(line: 660, column: 22, scope: !846)
!852 = !DILocation(line: 660, column: 21, scope: !846)
!853 = !DILocation(line: 661, column: 13, scope: !846)
!854 = !DILocation(line: 663, column: 13, scope: !855)
!855 = distinct !DILexicalBlock(scope: !799, file: !3, line: 663, column: 13)
!856 = !DILocation(line: 663, column: 36, scope: !855)
!857 = !DILocation(line: 663, column: 39, scope: !855)
!858 = !DILocation(line: 663, column: 13, scope: !799)
!859 = !DILocation(line: 0, scope: !812, inlinedAt: !860)
!860 = distinct !DILocation(line: 665, column: 13, scope: !861)
!861 = distinct !DILexicalBlock(scope: !855, file: !3, line: 664, column: 11)
!862 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !860)
!863 = !DILocation(line: 595, column: 7, scope: !805, inlinedAt: !864)
!864 = distinct !DILocation(line: 666, column: 21, scope: !861)
!865 = !DILocation(line: 595, column: 7, scope: !806, inlinedAt: !864)
!866 = !DILocation(line: 0, scope: !812, inlinedAt: !867)
!867 = distinct !DILocation(line: 597, column: 7, scope: !818, inlinedAt: !864)
!868 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !867)
!869 = !DILocation(line: 587, column: 10, scope: !795, inlinedAt: !870)
!870 = distinct !DILocation(line: 598, column: 17, scope: !818, inlinedAt: !864)
!871 = !DILocation(line: 587, column: 25, scope: !795, inlinedAt: !870)
!872 = !DILocation(line: 0, scope: !806, inlinedAt: !864)
!873 = !DILocation(line: 599, column: 5, scope: !818, inlinedAt: !864)
!874 = !DILocation(line: 600, column: 12, scope: !827, inlinedAt: !864)
!875 = !DILocation(line: 600, column: 25, scope: !827, inlinedAt: !864)
!876 = !DILocation(line: 601, column: 12, scope: !827, inlinedAt: !864)
!877 = !DILocation(line: 601, column: 15, scope: !827, inlinedAt: !864)
!878 = !DILocation(line: 601, column: 28, scope: !827, inlinedAt: !864)
!879 = !DILocation(line: 602, column: 12, scope: !827, inlinedAt: !864)
!880 = !DILocation(line: 602, column: 15, scope: !827, inlinedAt: !864)
!881 = !DILocation(line: 602, column: 28, scope: !827, inlinedAt: !864)
!882 = !DILocation(line: 600, column: 12, scope: !805, inlinedAt: !864)
!883 = !DILocation(line: 604, column: 15, scope: !837, inlinedAt: !864)
!884 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !885)
!885 = distinct !DILocation(line: 667, column: 13, scope: !861)
!886 = !DILocation(line: 607, column: 5, scope: !827, inlinedAt: !864)
!887 = !DILocation(line: 0, scope: !812, inlinedAt: !885)
!888 = !DILocation(line: 668, column: 13, scope: !861)
!889 = !DILocation(line: 673, column: 19, scope: !890)
!890 = distinct !DILexicalBlock(scope: !799, file: !3, line: 673, column: 13)
!891 = !DILocation(line: 673, column: 13, scope: !799)
!892 = !DILocation(line: 578, column: 7, scope: !893, inlinedAt: !895)
!893 = distinct !DILexicalBlock(scope: !894, file: !3, line: 578, column: 7)
!894 = distinct !DISubprogram(name: "expr", scope: !3, file: !3, line: 576, type: !796, scopeLine: 577, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !46)
!895 = distinct !DILocation(line: 675, column: 17, scope: !799)
!896 = !DILocation(line: 674, column: 11, scope: !890)
!897 = !DILocation(line: 578, column: 14, scope: !893, inlinedAt: !895)
!898 = !DILocation(line: 578, column: 11, scope: !893, inlinedAt: !895)
!899 = !DILocation(line: 578, column: 7, scope: !894, inlinedAt: !895)
!900 = !DILocalVariable(name: "value", scope: !901, file: !3, line: 560, type: !50)
!901 = distinct !DISubprogram(name: "or", scope: !3, file: !3, line: 558, type: !796, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !902)
!902 = !{!900}
!903 = !DILocation(line: 0, scope: !901, inlinedAt: !904)
!904 = distinct !DILocation(line: 581, column: 10, scope: !894, inlinedAt: !895)
!905 = !DILocalVariable(name: "value", scope: !906, file: !3, line: 541, type: !50)
!906 = distinct !DISubprogram(name: "and", scope: !3, file: !3, line: 539, type: !796, scopeLine: 540, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !907)
!907 = !{!905}
!908 = !DILocation(line: 0, scope: !906, inlinedAt: !909)
!909 = distinct !DILocation(line: 564, column: 16, scope: !910, inlinedAt: !904)
!910 = distinct !DILexicalBlock(scope: !901, file: !3, line: 563, column: 5)
!911 = !DILocation(line: 545, column: 16, scope: !912, inlinedAt: !909)
!912 = distinct !DILexicalBlock(scope: !906, file: !3, line: 544, column: 5)
!913 = !DILocation(line: 546, column: 14, scope: !914, inlinedAt: !909)
!914 = distinct !DILexicalBlock(scope: !912, file: !3, line: 546, column: 11)
!915 = !DILocation(line: 546, column: 20, scope: !914, inlinedAt: !909)
!916 = !DILocation(line: 546, column: 18, scope: !914, inlinedAt: !909)
!917 = !DILocation(line: 546, column: 25, scope: !914, inlinedAt: !909)
!918 = !DILocation(line: 579, column: 5, scope: !893, inlinedAt: !895)
!919 = !DILocation(line: 546, column: 28, scope: !914, inlinedAt: !909)
!920 = !DILocation(line: 546, column: 11, scope: !912, inlinedAt: !909)
!921 = !DILocation(line: 0, scope: !812, inlinedAt: !922)
!922 = distinct !DILocation(line: 548, column: 7, scope: !912, inlinedAt: !909)
!923 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !922)
!924 = !DILocation(line: 545, column: 13, scope: !912, inlinedAt: !909)
!925 = distinct !{!925, !926, !927}
!926 = !DILocation(line: 543, column: 3, scope: !906, inlinedAt: !909)
!927 = !DILocation(line: 549, column: 5, scope: !906, inlinedAt: !909)
!928 = !DILocation(line: 564, column: 13, scope: !910, inlinedAt: !904)
!929 = !DILocation(line: 565, column: 28, scope: !930, inlinedAt: !904)
!930 = distinct !DILexicalBlock(scope: !910, file: !3, line: 565, column: 11)
!931 = !DILocation(line: 565, column: 11, scope: !910, inlinedAt: !904)
!932 = !DILocation(line: 0, scope: !812, inlinedAt: !933)
!933 = distinct !DILocation(line: 567, column: 7, scope: !910, inlinedAt: !904)
!934 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !933)
!935 = distinct !{!935, !936, !937}
!936 = !DILocation(line: 562, column: 3, scope: !901, inlinedAt: !904)
!937 = !DILocation(line: 568, column: 5, scope: !901, inlinedAt: !904)
!938 = !DILocation(line: 678, column: 3, scope: !786)
!939 = distinct !DISubprogram(name: "test_syntax_error", scope: !3, file: !3, line: 91, type: !940, scopeLine: 92, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !942)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !51, null}
!942 = !{!943, !944}
!943 = !DILocalVariable(name: "format", arg: 1, scope: !939, file: !3, line: 91, type: !51)
!944 = !DILocalVariable(name: "ap", scope: !939, file: !3, line: 93, type: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !672, line: 52, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !947, line: 32, baseType: !948)
!947 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stdarg.h", directory: "")
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !949)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 192, elements: !705)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !950, file: !3, line: 93, baseType: !6, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !950, file: !3, line: 93, baseType: !6, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !950, file: !3, line: 93, baseType: !33, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !950, file: !3, line: 93, baseType: !33, size: 64, offset: 128)
!956 = !DILocation(line: 0, scope: !939)
!957 = !DILocation(line: 93, column: 3, scope: !939)
!958 = !DILocation(line: 93, column: 11, scope: !939)
!959 = !DILocation(line: 94, column: 3, scope: !939)
!960 = !DILocation(line: 95, column: 3, scope: !939)
!961 = !DILocation(line: 96, column: 3, scope: !939)
!962 = distinct !DISubprogram(name: "unary_operator", scope: !3, file: !3, line: 389, type: !796, scopeLine: 390, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !963)
!963 = !{!964, !1001, !1004, !1005, !1009, !1010, !1013, !1014, !1016}
!964 = !DILocalVariable(name: "stat_buf", scope: !962, file: !3, line: 391, type: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !966, line: 26, size: 1152, elements: !967)
!966 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!967 = !{!968, !970, !972, !974, !976, !978, !980, !981, !982, !983, !985, !987, !995, !996, !997}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !965, file: !966, line: 28, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !140, line: 145, baseType: !92)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !965, file: !966, line: 33, baseType: !971, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !140, line: 148, baseType: !92)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !965, file: !966, line: 41, baseType: !973, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !140, line: 151, baseType: !92)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !965, file: !966, line: 42, baseType: !975, size: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !140, line: 150, baseType: !6)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !965, file: !966, line: 44, baseType: !977, size: 32, offset: 224)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !140, line: 146, baseType: !6)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !965, file: !966, line: 45, baseType: !979, size: 32, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !140, line: 147, baseType: !6)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !965, file: !966, line: 47, baseType: !31, size: 32, offset: 288)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !965, file: !966, line: 49, baseType: !969, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !965, file: !966, line: 54, baseType: !698, size: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !965, file: !966, line: 58, baseType: !984, size: 64, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !140, line: 175, baseType: !699)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !965, file: !966, line: 60, baseType: !986, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !140, line: 180, baseType: !699)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !965, file: !966, line: 71, baseType: !988, size: 128, offset: 576)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !989, line: 10, size: 128, elements: !990)
!989 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!990 = !{!991, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !988, file: !989, line: 12, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !140, line: 160, baseType: !699)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !988, file: !989, line: 16, baseType: !994, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !140, line: 197, baseType: !699)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !965, file: !966, line: 72, baseType: !988, size: 128, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !965, file: !966, line: 73, baseType: !988, size: 128, offset: 832)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !965, file: !966, line: 86, baseType: !998, size: 192, offset: 960)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 192, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 3)
!1001 = !DILocalVariable(name: "atime", scope: !1002, file: !3, line: 425, type: !988)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 421, column: 7)
!1003 = distinct !DILexicalBlock(scope: !962, file: !3, line: 394, column: 5)
!1004 = !DILocalVariable(name: "mtime", scope: !1002, file: !3, line: 426, type: !988)
!1005 = !DILocalVariable(name: "euid", scope: !1006, file: !3, line: 436, type: !1007)
!1006 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 431, column: 7)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !1008, line: 79, baseType: !977)
!1008 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!1009 = !DILocalVariable(name: "NO_UID", scope: !1006, file: !3, line: 437, type: !1007)
!1010 = !DILocalVariable(name: "egid", scope: !1011, file: !3, line: 447, type: !1012)
!1011 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 442, column: 7)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !1008, line: 64, baseType: !979)
!1013 = !DILocalVariable(name: "NO_GID", scope: !1011, file: !3, line: 448, type: !1012)
!1014 = !DILocalVariable(name: "fd", scope: !1015, file: !3, line: 514, type: !699)
!1015 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 513, column: 7)
!1016 = !DILocalVariable(name: "arg", scope: !1015, file: !3, line: 515, type: !51)
!1017 = !DILocation(line: 391, column: 3, scope: !962)
!1018 = !DILocation(line: 391, column: 15, scope: !962)
!1019 = !DILocation(line: 393, column: 11, scope: !962)
!1020 = !DILocation(line: 393, column: 16, scope: !962)
!1021 = !DILocation(line: 393, column: 3, scope: !962)
!1022 = !DILocation(line: 396, column: 26, scope: !1003)
!1023 = !DILocation(line: 396, column: 67, scope: !1003)
!1024 = !DILocation(line: 396, column: 72, scope: !1003)
!1025 = !DILocation(line: 396, column: 60, scope: !1003)
!1026 = !DILocation(line: 396, column: 7, scope: !1003)
!1027 = !DILocation(line: 0, scope: !812, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1030)
!1029 = distinct !DISubprogram(name: "unary_advance", scope: !3, file: !3, line: 113, type: !784, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !46)
!1030 = distinct !DILocation(line: 405, column: 7, scope: !1003)
!1031 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1028)
!1032 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1028)
!1033 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1028)
!1034 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1030)
!1035 = !DILocation(line: 406, column: 20, scope: !1003)
!1036 = !DILocation(line: 406, column: 14, scope: !1003)
!1037 = !DILocation(line: 406, column: 46, scope: !1003)
!1038 = !DILocation(line: 406, column: 7, scope: !1003)
!1039 = !DILocation(line: 0, scope: !812, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1041)
!1041 = distinct !DILocation(line: 409, column: 7, scope: !1003)
!1042 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1040)
!1043 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1040)
!1044 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1040)
!1045 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1041)
!1046 = !DILocation(line: 410, column: 26, scope: !1003)
!1047 = !DILocation(line: 410, column: 14, scope: !1003)
!1048 = !DILocation(line: 410, column: 47, scope: !1003)
!1049 = !DILocation(line: 410, column: 7, scope: !1003)
!1050 = !DILocation(line: 0, scope: !812, inlinedAt: !1051)
!1051 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 413, column: 7, scope: !1003)
!1053 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1051)
!1054 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1051)
!1055 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1051)
!1056 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1052)
!1057 = !DILocation(line: 414, column: 26, scope: !1003)
!1058 = !DILocation(line: 414, column: 14, scope: !1003)
!1059 = !DILocation(line: 414, column: 47, scope: !1003)
!1060 = !DILocation(line: 414, column: 7, scope: !1003)
!1061 = !DILocation(line: 0, scope: !812, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 417, column: 7, scope: !1003)
!1064 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1062)
!1065 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1062)
!1066 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1062)
!1067 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1063)
!1068 = !DILocation(line: 418, column: 26, scope: !1003)
!1069 = !DILocation(line: 418, column: 14, scope: !1003)
!1070 = !DILocation(line: 418, column: 47, scope: !1003)
!1071 = !DILocation(line: 418, column: 7, scope: !1003)
!1072 = !DILocation(line: 0, scope: !812, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 422, column: 9, scope: !1002)
!1075 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1073)
!1076 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1073)
!1077 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1073)
!1078 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1074)
!1079 = !DILocation(line: 423, column: 19, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 423, column: 13)
!1081 = !DILocation(line: 423, column: 13, scope: !1080)
!1082 = !DILocation(line: 423, column: 45, scope: !1080)
!1083 = !DILocation(line: 423, column: 13, scope: !1002)
!1084 = !DILocalVariable(name: "st", arg: 1, scope: !1085, file: !1086, line: 118, type: !1089)
!1085 = distinct !DISubprogram(name: "get_stat_atime", scope: !1086, file: !1086, line: 118, type: !1087, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1091)
!1086 = !DIFile(filename: "./lib/stat-time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!988, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1091 = !{!1084}
!1092 = !DILocation(line: 0, scope: !1085, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 425, column: 33, scope: !1002)
!1094 = !DILocation(line: 121, column: 10, scope: !1085, inlinedAt: !1093)
!1095 = !{i64 0, i64 8, !1096, i64 8, i64 8, !1096}
!1096 = !{!1097, !1097, i64 0}
!1097 = !{!"long", !594, i64 0}
!1098 = !{i64 0, i64 8, !1096}
!1099 = !DILocation(line: 0, scope: !1002)
!1100 = !DILocalVariable(name: "st", arg: 1, scope: !1101, file: !1086, line: 146, type: !1089)
!1101 = distinct !DISubprogram(name: "get_stat_mtime", scope: !1086, file: !1086, line: 146, type: !1087, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1102)
!1102 = !{!1100}
!1103 = !DILocation(line: 0, scope: !1101, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 426, column: 33, scope: !1002)
!1105 = !DILocation(line: 149, column: 10, scope: !1101, inlinedAt: !1104)
!1106 = !DILocalVariable(name: "a", arg: 1, scope: !1107, file: !12, line: 89, type: !988)
!1107 = distinct !DISubprogram(name: "timespec_cmp", scope: !12, file: !12, line: 89, type: !1108, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1110)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!31, !988, !988}
!1110 = !{!1106, !1111}
!1111 = !DILocalVariable(name: "b", arg: 2, scope: !1107, file: !12, line: 89, type: !988)
!1112 = !DILocation(line: 0, scope: !1107, inlinedAt: !1113)
!1113 = distinct !DILocation(line: 427, column: 17, scope: !1002)
!1114 = !DILocation(line: 91, column: 16, scope: !1115, inlinedAt: !1113)
!1115 = distinct !DILexicalBlock(scope: !1107, file: !12, line: 91, column: 7)
!1116 = !DILocation(line: 91, column: 7, scope: !1107, inlinedAt: !1113)
!1117 = !DILocation(line: 93, column: 16, scope: !1118, inlinedAt: !1113)
!1118 = distinct !DILexicalBlock(scope: !1107, file: !12, line: 93, column: 7)
!1119 = !DILocation(line: 93, column: 7, scope: !1107, inlinedAt: !1113)
!1120 = !DILocation(line: 98, column: 3, scope: !1107, inlinedAt: !1113)
!1121 = !DILocation(line: 99, column: 3, scope: !1107, inlinedAt: !1113)
!1122 = !DILocation(line: 101, column: 20, scope: !1107, inlinedAt: !1113)
!1123 = !DILocation(line: 101, column: 10, scope: !1107, inlinedAt: !1113)
!1124 = !DILocation(line: 101, column: 3, scope: !1107, inlinedAt: !1113)
!1125 = !DILocation(line: 0, scope: !812, inlinedAt: !1126)
!1126 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1127)
!1127 = distinct !DILocation(line: 432, column: 9, scope: !1006)
!1128 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1126)
!1129 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1126)
!1130 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1126)
!1131 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1127)
!1132 = !DILocation(line: 433, column: 19, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 433, column: 13)
!1134 = !DILocation(line: 433, column: 13, scope: !1133)
!1135 = !DILocation(line: 433, column: 45, scope: !1133)
!1136 = !DILocation(line: 433, column: 13, scope: !1006)
!1137 = !DILocation(line: 435, column: 9, scope: !1006)
!1138 = !DILocation(line: 435, column: 15, scope: !1006)
!1139 = !DILocation(line: 436, column: 22, scope: !1006)
!1140 = !DILocation(line: 0, scope: !1006)
!1141 = !DILocation(line: 438, column: 24, scope: !1006)
!1142 = !DILocation(line: 438, column: 34, scope: !1006)
!1143 = !DILocation(line: 438, column: 37, scope: !1006)
!1144 = !DILocation(line: 438, column: 44, scope: !1006)
!1145 = !DILocation(line: 438, column: 64, scope: !1006)
!1146 = !{!1147, !751, i64 28}
!1147 = !{!"stat", !1097, i64 0, !1097, i64 8, !1097, i64 16, !751, i64 24, !751, i64 28, !751, i64 32, !751, i64 36, !1097, i64 40, !1097, i64 48, !1097, i64 56, !1097, i64 64, !1148, i64 72, !1148, i64 88, !1148, i64 104, !594, i64 120}
!1148 = !{!"timespec", !1097, i64 0, !1097, i64 8}
!1149 = !DILocation(line: 438, column: 52, scope: !1006)
!1150 = !DILocation(line: 0, scope: !812, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1152)
!1152 = distinct !DILocation(line: 443, column: 9, scope: !1011)
!1153 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1151)
!1154 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1151)
!1155 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1151)
!1156 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1152)
!1157 = !DILocation(line: 444, column: 19, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 444, column: 13)
!1159 = !DILocation(line: 444, column: 13, scope: !1158)
!1160 = !DILocation(line: 444, column: 45, scope: !1158)
!1161 = !DILocation(line: 444, column: 13, scope: !1011)
!1162 = !DILocation(line: 446, column: 9, scope: !1011)
!1163 = !DILocation(line: 446, column: 15, scope: !1011)
!1164 = !DILocation(line: 447, column: 22, scope: !1011)
!1165 = !DILocation(line: 0, scope: !1011)
!1166 = !DILocation(line: 449, column: 24, scope: !1011)
!1167 = !DILocation(line: 449, column: 34, scope: !1011)
!1168 = !DILocation(line: 449, column: 37, scope: !1011)
!1169 = !DILocation(line: 449, column: 44, scope: !1011)
!1170 = !DILocation(line: 449, column: 64, scope: !1011)
!1171 = !{!1147, !751, i64 32}
!1172 = !DILocation(line: 449, column: 52, scope: !1011)
!1173 = !DILocation(line: 0, scope: !812, inlinedAt: !1174)
!1174 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1175)
!1175 = distinct !DILocation(line: 453, column: 7, scope: !1003)
!1176 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1174)
!1177 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1174)
!1178 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1174)
!1179 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1175)
!1180 = !DILocation(line: 456, column: 21, scope: !1003)
!1181 = !DILocation(line: 456, column: 15, scope: !1003)
!1182 = !DILocation(line: 456, column: 47, scope: !1003)
!1183 = !DILocation(line: 457, column: 15, scope: !1003)
!1184 = !DILocation(line: 456, column: 7, scope: !1003)
!1185 = !DILocation(line: 0, scope: !812, inlinedAt: !1186)
!1186 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1187)
!1187 = distinct !DILocation(line: 460, column: 7, scope: !1003)
!1188 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1186)
!1189 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1186)
!1190 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1186)
!1191 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1187)
!1192 = !DILocation(line: 461, column: 21, scope: !1003)
!1193 = !DILocation(line: 461, column: 15, scope: !1003)
!1194 = !DILocation(line: 461, column: 47, scope: !1003)
!1195 = !DILocation(line: 462, column: 15, scope: !1003)
!1196 = !DILocation(line: 461, column: 7, scope: !1003)
!1197 = !DILocation(line: 0, scope: !812, inlinedAt: !1198)
!1198 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1199)
!1199 = distinct !DILocation(line: 465, column: 7, scope: !1003)
!1200 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1198)
!1201 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1198)
!1202 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1198)
!1203 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1199)
!1204 = !DILocation(line: 466, column: 21, scope: !1003)
!1205 = !DILocation(line: 466, column: 15, scope: !1003)
!1206 = !DILocation(line: 466, column: 47, scope: !1003)
!1207 = !DILocation(line: 467, column: 15, scope: !1003)
!1208 = !DILocation(line: 466, column: 7, scope: !1003)
!1209 = !DILocation(line: 0, scope: !812, inlinedAt: !1210)
!1210 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1211)
!1211 = distinct !DILocation(line: 470, column: 7, scope: !1003)
!1212 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1210)
!1213 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1210)
!1214 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1210)
!1215 = !DILocation(line: 116, column: 3, scope: !1029, inlinedAt: !1211)
!1216 = !DILocation(line: 471, column: 21, scope: !1003)
!1217 = !DILocation(line: 471, column: 15, scope: !1003)
!1218 = !DILocation(line: 471, column: 47, scope: !1003)
!1219 = !DILocation(line: 472, column: 15, scope: !1003)
!1220 = !DILocation(line: 471, column: 7, scope: !1003)
!1221 = !DILocation(line: 0, scope: !812, inlinedAt: !1222)
!1222 = distinct !DILocation(line: 115, column: 3, scope: !1029, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 475, column: 7, scope: !1003)
!1224 = !DILocation(line: 106, column: 3, scope: !812, inlinedAt: !1222)
!1225 = !DILocation(line: 108, column: 9, scope: !849, inlinedAt: !1222)
!1226 = !DILocation(line: 109, column: 5, scope: !849, inlinedAt: !1222)
