; ModuleID = 'coreutils-8.32/src/timeout.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__sigset_t = type { [16 x i64] }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.itimerspec = type { %struct.timespec, %struct.timespec }
%struct.timespec = type { i64, i64 }
%struct.sigevent = type { %union.sigval, i32, i32, %union.anon.9 }
%union.sigval = type { i8* }
%union.anon.9 = type { %struct.anon.10, [32 x i8] }
%struct.anon.10 = type { void (i8*)*, %union.pthread_attr_t* }
%union.pthread_attr_t = type { i64, [48 x i8] }
%struct.__mbstate_t = type { i32, %union.anon.8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 96, type: !49, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/timeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 87, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124, isUnsigned: true)
!10 = !DIEnumerator(name: "EXIT_CANCELED", value: 125, isUnsigned: true)
!11 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126, isUnsigned: true)
!12 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!13 = !{!14, !16, !17, !23}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !18, line: 72, baseType: !19)
!18 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!24 = !{!25, !27, !33, !36, !39, !41, !43, !0, !47}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "timed_out", scope: !2, file: !3, line: 80, type: !22, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "monitored_pid", scope: !2, file: !3, line: 82, type: !29, isLocal: true, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !30, line: 97, baseType: !31)
!30 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !32, line: 154, baseType: !22)
!32 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "kill_after", scope: !2, file: !3, line: 83, type: !35, isLocal: true, isDefinition: true)
!35 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "foreground", scope: !2, file: !3, line: 84, type: !38, isLocal: true, isDefinition: true)
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "preserve_status", scope: !2, file: !3, line: 85, type: !38, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 86, type: !38, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "command", scope: !2, file: !3, line: 87, type: !45, isLocal: true, isDefinition: true)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "term_signal", scope: !2, file: !3, line: 81, type: !22, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !59)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !52, line: 50, size: 256, elements: !53)
!52 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!53 = !{!54, !55, !56, !58}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !52, line: 52, baseType: !45, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !51, file: !52, line: 55, baseType: !22, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !51, file: !52, line: 56, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !51, file: !52, line: 57, baseType: !22, size: 32, offset: 192)
!59 = !{!60}
!60 = !DISubrange(count: 8)
!61 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!62 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!63 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!64 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "Version", scope: !67, file: !68, line: 2, type: !45, isLocal: false, isDefinition: true)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !70, splitDebugInlining: false, nameTableKind: None)
!68 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!69 = !{}
!70 = !{!65}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "file_name", scope: !73, file: !74, line: 46, type: !45, isLocal: true, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !75, splitDebugInlining: false, nameTableKind: None)
!74 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!75 = !{!71, !76}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !73, file: !74, line: 56, type: !38, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "exit_failure", scope: !80, file: !81, line: 24, type: !83, isLocal: false, isDefinition: true)
!80 = distinct !DICompileUnit(language: DW_LANG_C99, file: !81, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !82, splitDebugInlining: false, nameTableKind: None)
!81 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!82 = !{!78}
!83 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !22)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "program_name", scope: !86, file: !87, line: 33, type: !45, isLocal: false, isDefinition: true)
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !88, globals: !89, splitDebugInlining: false, nameTableKind: None)
!87 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!88 = !{!16, !14}
!89 = !{!84}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !92, file: !93, line: 85, type: !169, isLocal: false, isDefinition: true)
!92 = distinct !DICompileUnit(language: DW_LANG_C99, file: !93, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !129, globals: !134, splitDebugInlining: false, nameTableKind: None)
!93 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !{!95, !109, !114}
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !96, line: 32, baseType: !7, size: 32, elements: !97)
!96 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!98 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!101 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!102 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!103 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!104 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!105 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!106 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!107 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!108 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !96, line: 242, baseType: !7, size: 32, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 46, baseType: !7, size: 32, elements: !116)
!115 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!117 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!119 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!120 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!121 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!122 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!123 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!124 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!125 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!128 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!129 = !{!22, !130, !131, !14}
!130 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !132, line: 46, baseType: !133)
!132 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!133 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!134 = !{!90, !135, !141, !151, !153, !158, !165, !167}
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !92, file: !93, line: 101, type: !137, isLocal: false, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 320, elements: !139)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!139 = !{!140}
!140 = !DISubrange(count: 10)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !92, file: !93, line: 1052, type: !143, isLocal: false, isDefinition: true)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !93, line: 65, size: 448, elements: !144)
!144 = !{!145, !146, !147, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !143, file: !93, line: 68, baseType: !95, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !143, file: !93, line: 71, baseType: !22, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !143, file: !93, line: 75, baseType: !148, size: 256, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !59)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !143, file: !93, line: 78, baseType: !45, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !143, file: !93, line: 81, baseType: !45, size: 64, offset: 384)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !92, file: !93, line: 116, type: !143, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "slot0", scope: !92, file: !93, line: 842, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 2048, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 256)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "slotvec", scope: !92, file: !93, line: 845, type: !160, isLocal: true, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !93, line: 834, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !161, file: !93, line: 836, baseType: !131, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !161, file: !93, line: 837, baseType: !14, size: 64, offset: 64)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "nslots", scope: !92, file: !93, line: 843, type: !22, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "slotvec0", scope: !92, file: !93, line: 844, type: !161, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 704, elements: !171)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!171 = !{!172}
!172 = !DISubrange(count: 11)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !175, file: !176, line: 26, type: !178, isLocal: false, isDefinition: true)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !177, splitDebugInlining: false, nameTableKind: None)
!176 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!173}
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 376, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 47)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "numname_table", scope: !183, file: !184, line: 41, type: !187, isLocal: true, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !185, globals: !186, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!185 = !{!7}
!186 = !{!181}
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 3360, elements: !193)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !184, line: 41, size: 96, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !188, file: !184, line: 41, baseType: !22, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !184, line: 41, baseType: !192, size: 64, offset: 32)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !59)
!193 = !{!194}
!194 = !DISubrange(count: 35)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !197, file: !198, line: 50, type: !223, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !199, globals: !222, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !{!14, !200}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !201, line: 24, baseType: !202)
!201 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !203, line: 42, baseType: !204)
!203 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !203, line: 28, size: 1856, elements: !206)
!206 = !{!207, !213, !216, !219, !220}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !205, file: !203, line: 31, baseType: !208, size: 832)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 832, elements: !211)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !203, line: 31, flags: DIFlagFwdDecl)
!211 = !{!212}
!212 = !DISubrange(count: 13)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !205, file: !203, line: 34, baseType: !214, size: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !205, file: !203, line: 35, baseType: !217, size: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !205, file: !203, line: 36, baseType: !217, size: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !205, file: !203, line: 39, baseType: !221, size: 832, offset: 1024)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 832, elements: !211)
!222 = !{!195}
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !200)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !185, splitDebugInlining: false, nameTableKind: None)
!225 = !DIFile(filename: "src/operand2sig.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "lib/cl-strtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = distinct !DICompileUnit(language: DW_LANG_C99, file: !229, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !230, retainedTypes: !235, splitDebugInlining: false, nameTableKind: None)
!229 = !DIFile(filename: "lib/dtotimespec.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!230 = !{!231}
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 42, baseType: !7, size: 32, elements: !233)
!232 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!233 = !{!234}
!234 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !237, line: 7, baseType: !238)
!237 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !32, line: 160, baseType: !239)
!239 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !246, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!242 = !{!243}
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 40, baseType: !7, size: 32, elements: !244)
!244 = !{!245}
!245 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!246 = !{!16}
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !263, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !{!250}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !252, file: !251, line: 186, baseType: !7, size: 32, elements: !261)
!251 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = distinct !DISubprogram(name: "x2nrealloc", scope: !251, file: !251, line: 174, type: !253, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !256)
!253 = !DISubroutineType(types: !254)
!254 = !{!16, !16, !255, !131}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!256 = !{!257, !258, !259, !260}
!257 = !DILocalVariable(name: "p", arg: 1, scope: !252, file: !251, line: 174, type: !16)
!258 = !DILocalVariable(name: "pn", arg: 2, scope: !252, file: !251, line: 174, type: !255)
!259 = !DILocalVariable(name: "s", arg: 3, scope: !252, file: !251, line: 174, type: !131)
!260 = !DILocalVariable(name: "n", scope: !252, file: !251, line: 176, type: !131)
!261 = !{!262}
!262 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!263 = !{!131, !14, !16}
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !246, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/xstrtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !246, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !{!131}
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !279, retainedTypes: !246, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!279 = !{!280}
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !281, line: 41, baseType: !7, size: 32, elements: !282)
!281 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!283 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!284 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!285 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!286 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!287 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!288 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!289 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!290 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!291 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!292 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!293 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!294 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!295 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!296 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!304 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!305 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!306 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!307 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!308 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!316 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!317 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!318 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!319 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!320 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!321 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!322 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!323 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!324 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!325 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!326 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!327 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!328 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!329 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!330 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!331 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!332 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!391 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!401 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!402 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!403 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!404 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!405 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!478 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!551 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!552 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!553 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!554 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!555 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!556 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!557 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!558 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!559 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!560 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!561 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!562 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!563 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!564 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!565 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!567 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!568 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!569 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!570 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!571 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!572 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!598 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!599 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!600 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!601 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!602 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!607 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!608 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!609 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!610 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !246, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !246, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !246, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = !{!"clang version 12.0.1"}
!675 = !{i32 7, !"Dwarf Version", i32 4}
!676 = !{i32 2, !"Debug Info Version", i32 3}
!677 = !{i32 1, !"wchar_size", i32 4}
!678 = !{i32 7, !"PIC Level", i32 2}
!679 = !{i32 7, !"PIE Level", i32 2}
!680 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 229, type: !20, scopeLine: 230, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !681)
!681 = !{!682}
!682 = !DILocalVariable(name: "status", arg: 1, scope: !680, file: !3, line: 229, type: !22)
!683 = !DILocation(line: 0, scope: !680)
!684 = !DILocation(line: 231, column: 14, scope: !685)
!685 = distinct !DILexicalBlock(scope: !680, file: !3, line: 231, column: 7)
!686 = !DILocation(line: 231, column: 7, scope: !680)
!687 = !DILocation(line: 232, column: 5, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !3, line: 232, column: 5)
!689 = !{!690, !690, i64 0}
!690 = !{!"any pointer", !691, i64 0}
!691 = !{!"omnipotent char", !692, i64 0}
!692 = !{!"Simple C/C++ TBAA"}
!693 = !DILocation(line: 235, column: 7, scope: !694)
!694 = distinct !DILexicalBlock(scope: !685, file: !3, line: 234, column: 5)
!695 = !DILocation(line: 239, column: 7, scope: !694)
!696 = !DILocation(line: 590, column: 3, scope: !697, inlinedAt: !700)
!697 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !6, file: !6, line: 588, type: !698, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !69)
!698 = !DISubroutineType(types: !699)
!699 = !{null}
!700 = distinct !DILocation(line: 243, column: 7, scope: !694)
!701 = !DILocation(line: 245, column: 7, scope: !694)
!702 = !DILocation(line: 260, column: 7, scope: !694)
!703 = !DILocation(line: 263, column: 7, scope: !694)
!704 = !DILocation(line: 264, column: 7, scope: !694)
!705 = !DILocation(line: 266, column: 7, scope: !694)
!706 = !DILocation(line: 271, column: 7, scope: !694)
!707 = !DILocalVariable(name: "program", arg: 1, scope: !708, file: !6, line: 634, type: !45)
!708 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !6, file: !6, line: 634, type: !709, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !45}
!711 = !{!707, !712, !721, !722, !724}
!712 = !DILocalVariable(name: "infomap", scope: !708, file: !6, line: 636, type: !713)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 896, elements: !719)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !708, file: !6, line: 636, size: 128, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !715, file: !6, line: 636, baseType: !45, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !6, line: 636, baseType: !45, size: 64, offset: 64)
!719 = !{!720}
!720 = !DISubrange(count: 7)
!721 = !DILocalVariable(name: "node", scope: !708, file: !6, line: 646, type: !45)
!722 = !DILocalVariable(name: "map_prog", scope: !708, file: !6, line: 647, type: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!724 = !DILocalVariable(name: "lc_messages", scope: !708, file: !6, line: 659, type: !45)
!725 = !DILocation(line: 0, scope: !708, inlinedAt: !726)
!726 = distinct !DILocation(line: 278, column: 7, scope: !694)
!727 = !DILocation(line: 636, column: 3, scope: !708, inlinedAt: !726)
!728 = !DILocation(line: 636, column: 67, scope: !708, inlinedAt: !726)
!729 = !DILocation(line: 647, column: 36, scope: !708, inlinedAt: !726)
!730 = !DILocation(line: 649, column: 3, scope: !708, inlinedAt: !726)
!731 = !DILocation(line: 649, column: 33, scope: !708, inlinedAt: !726)
!732 = !DILocation(line: 650, column: 13, scope: !708, inlinedAt: !726)
!733 = !DILocation(line: 649, column: 20, scope: !708, inlinedAt: !726)
!734 = !{!735, !690, i64 0}
!735 = !{!"infomap", !690, i64 0, !690, i64 8}
!736 = !DILocation(line: 649, column: 10, scope: !708, inlinedAt: !726)
!737 = !DILocation(line: 649, column: 28, scope: !708, inlinedAt: !726)
!738 = distinct !{!738, !730, !732, !739}
!739 = !{!"llvm.loop.mustprogress"}
!740 = !DILocation(line: 652, column: 17, scope: !741, inlinedAt: !726)
!741 = distinct !DILexicalBlock(scope: !708, file: !6, line: 652, column: 7)
!742 = !{!735, !690, i64 8}
!743 = !DILocation(line: 652, column: 7, scope: !741, inlinedAt: !726)
!744 = !DILocation(line: 652, column: 7, scope: !708, inlinedAt: !726)
!745 = !DILocation(line: 655, column: 3, scope: !708, inlinedAt: !726)
!746 = !DILocation(line: 659, column: 29, scope: !708, inlinedAt: !726)
!747 = !DILocation(line: 660, column: 7, scope: !748, inlinedAt: !726)
!748 = distinct !DILexicalBlock(scope: !708, file: !6, line: 660, column: 7)
!749 = !DILocation(line: 660, column: 19, scope: !748, inlinedAt: !726)
!750 = !DILocation(line: 660, column: 22, scope: !748, inlinedAt: !726)
!751 = !DILocation(line: 660, column: 7, scope: !708, inlinedAt: !726)
!752 = !DILocation(line: 666, column: 7, scope: !753, inlinedAt: !726)
!753 = distinct !DILexicalBlock(scope: !748, file: !6, line: 661, column: 5)
!754 = !DILocation(line: 668, column: 5, scope: !753, inlinedAt: !726)
!755 = !DILocation(line: 669, column: 3, scope: !708, inlinedAt: !726)
!756 = !DILocation(line: 671, column: 3, scope: !708, inlinedAt: !726)
!757 = !DILocation(line: 673, column: 1, scope: !708, inlinedAt: !726)
!758 = !DILocation(line: 280, column: 3, scope: !680)
!759 = !DISubprogram(name: "dcgettext", scope: !760, file: !760, line: 51, type: !761, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !69)
!760 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!761 = !DISubroutineType(types: !762)
!762 = !{!14, !45, !45, !22}
!763 = !DISubprogram(name: "fputs_unlocked", scope: !764, file: !764, line: 667, type: !765, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !69)
!764 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!765 = !DISubroutineType(types: !766)
!766 = !{!22, !45, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !769, line: 49, size: 1728, elements: !770)
!769 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !786, !787, !788, !789, !791, !792, !793, !797, !800, !802, !805, !808, !809, !810, !811, !812}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !768, file: !769, line: 51, baseType: !22, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !768, file: !769, line: 54, baseType: !14, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !768, file: !769, line: 55, baseType: !14, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !768, file: !769, line: 56, baseType: !14, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !768, file: !769, line: 57, baseType: !14, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !768, file: !769, line: 58, baseType: !14, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !768, file: !769, line: 59, baseType: !14, size: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !768, file: !769, line: 60, baseType: !14, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !768, file: !769, line: 61, baseType: !14, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !768, file: !769, line: 64, baseType: !14, size: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !768, file: !769, line: 65, baseType: !14, size: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !768, file: !769, line: 66, baseType: !14, size: 64, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !768, file: !769, line: 68, baseType: !784, size: 64, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !769, line: 36, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !768, file: !769, line: 70, baseType: !767, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !768, file: !769, line: 72, baseType: !22, size: 32, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !768, file: !769, line: 73, baseType: !22, size: 32, offset: 928)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !768, file: !769, line: 74, baseType: !790, size: 64, offset: 960)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !32, line: 152, baseType: !239)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !768, file: !769, line: 77, baseType: !130, size: 16, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !768, file: !769, line: 78, baseType: !23, size: 8, offset: 1040)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !768, file: !769, line: 79, baseType: !794, size: 8, offset: 1048)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 1)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !768, file: !769, line: 81, baseType: !798, size: 64, offset: 1088)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !769, line: 43, baseType: null)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !768, file: !769, line: 89, baseType: !801, size: 64, offset: 1152)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !32, line: 153, baseType: !239)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !768, file: !769, line: 91, baseType: !803, size: 64, offset: 1216)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !769, line: 37, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !768, file: !769, line: 92, baseType: !806, size: 64, offset: 1280)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !769, line: 38, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !768, file: !769, line: 93, baseType: !767, size: 64, offset: 1344)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !768, file: !769, line: 94, baseType: !16, size: 64, offset: 1408)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !768, file: !769, line: 95, baseType: !131, size: 64, offset: 1472)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !768, file: !769, line: 96, baseType: !22, size: 32, offset: 1536)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !768, file: !769, line: 98, baseType: !813, size: 160, offset: 1568)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 20)
!816 = !DISubprogram(name: "setlocale", scope: !817, file: !817, line: 122, type: !818, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !69)
!817 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!818 = !DISubroutineType(types: !819)
!819 = !{!14, !22, !45}
!820 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 430, type: !821, scopeLine: 431, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !824)
!821 = !DISubroutineType(types: !822)
!822 = !{!22, !22, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!824 = !{!825, !826, !827, !828, !832, !833, !837, !839, !840, !851}
!825 = !DILocalVariable(name: "argc", arg: 1, scope: !820, file: !3, line: 430, type: !22)
!826 = !DILocalVariable(name: "argv", arg: 2, scope: !820, file: !3, line: 430, type: !823)
!827 = !DILocalVariable(name: "timeout", scope: !820, file: !3, line: 432, type: !35)
!828 = !DILocalVariable(name: "signame", scope: !820, file: !3, line: 433, type: !829)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 152, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 19)
!832 = !DILocalVariable(name: "c", scope: !820, file: !3, line: 434, type: !22)
!833 = !DILocalVariable(name: "exit_status", scope: !834, file: !3, line: 518, type: !22)
!834 = distinct !DILexicalBlock(scope: !835, file: !3, line: 510, column: 5)
!835 = distinct !DILexicalBlock(scope: !836, file: !3, line: 509, column: 12)
!836 = distinct !DILexicalBlock(scope: !820, file: !3, line: 504, column: 7)
!837 = !DILocalVariable(name: "wait_result", scope: !838, file: !3, line: 524, type: !29)
!838 = distinct !DILexicalBlock(scope: !835, file: !3, line: 523, column: 5)
!839 = !DILocalVariable(name: "status", scope: !838, file: !3, line: 525, type: !22)
!840 = !DILocalVariable(name: "cleanup_set", scope: !838, file: !3, line: 535, type: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !842, line: 7, baseType: !843)
!842 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !844, line: 8, baseType: !845)
!844 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !844, line: 5, size: 1024, elements: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !845, file: !844, line: 7, baseType: !848, size: 1024)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1024, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 16)
!851 = !DILocalVariable(name: "sig", scope: !852, file: !3, line: 553, type: !22)
!852 = distinct !DILexicalBlock(scope: !853, file: !3, line: 552, column: 13)
!853 = distinct !DILexicalBlock(scope: !854, file: !3, line: 551, column: 20)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 549, column: 15)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 548, column: 9)
!856 = distinct !DILexicalBlock(scope: !838, file: !3, line: 541, column: 11)
!857 = !DILocation(line: 0, scope: !820)
!858 = !DILocation(line: 433, column: 3, scope: !820)
!859 = !DILocation(line: 433, column: 8, scope: !820)
!860 = !DILocation(line: 437, column: 21, scope: !820)
!861 = !DILocation(line: 437, column: 3, scope: !820)
!862 = !DILocation(line: 438, column: 3, scope: !820)
!863 = !DILocation(line: 439, column: 3, scope: !820)
!864 = !DILocation(line: 440, column: 3, scope: !820)
!865 = !DILocalVariable(name: "status", arg: 1, scope: !866, file: !6, line: 99, type: !22)
!866 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !6, file: !6, line: 99, type: !20, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !867)
!867 = !{!865}
!868 = !DILocation(line: 0, scope: !866, inlinedAt: !869)
!869 = distinct !DILocation(line: 442, column: 3, scope: !820)
!870 = !DILocation(line: 102, column: 18, scope: !871, inlinedAt: !869)
!871 = distinct !DILexicalBlock(scope: !866, file: !6, line: 101, column: 7)
!872 = !{!873, !873, i64 0}
!873 = !{!"int", !691, i64 0}
!874 = !DILocation(line: 443, column: 3, scope: !820)
!875 = !DILocation(line: 445, column: 3, scope: !820)
!876 = !DILocation(line: 445, column: 15, scope: !820)
!877 = !DILocation(line: 450, column: 40, scope: !878)
!878 = distinct !DILexicalBlock(scope: !879, file: !3, line: 448, column: 9)
!879 = distinct !DILexicalBlock(scope: !820, file: !3, line: 446, column: 5)
!880 = !DILocation(line: 450, column: 24, scope: !878)
!881 = !DILocation(line: 450, column: 22, scope: !878)
!882 = !{!883, !883, i64 0}
!883 = !{!"double", !691, i64 0}
!884 = !DILocation(line: 451, column: 11, scope: !878)
!885 = !DILocation(line: 454, column: 38, scope: !878)
!886 = !DILocation(line: 454, column: 25, scope: !878)
!887 = !DILocation(line: 454, column: 23, scope: !878)
!888 = !DILocation(line: 455, column: 27, scope: !889)
!889 = distinct !DILexicalBlock(scope: !878, file: !3, line: 455, column: 15)
!890 = !DILocation(line: 455, column: 15, scope: !878)
!891 = distinct !{!891, !875, !892, !739}
!892 = !DILocation(line: 479, column: 5, scope: !820)
!893 = !DILocation(line: 456, column: 13, scope: !889)
!894 = !DILocation(line: 460, column: 19, scope: !878)
!895 = !DILocation(line: 461, column: 11, scope: !878)
!896 = !DILocation(line: 464, column: 22, scope: !878)
!897 = !DILocation(line: 465, column: 11, scope: !878)
!898 = !DILocation(line: 468, column: 27, scope: !878)
!899 = !DILocation(line: 469, column: 11, scope: !878)
!900 = !DILocation(line: 471, column: 9, scope: !878)
!901 = !DILocation(line: 473, column: 9, scope: !878)
!902 = !DILocation(line: 476, column: 11, scope: !878)
!903 = !DILocation(line: 481, column: 14, scope: !904)
!904 = distinct !DILexicalBlock(scope: !820, file: !3, line: 481, column: 7)
!905 = !DILocation(line: 481, column: 12, scope: !904)
!906 = !DILocation(line: 481, column: 21, scope: !904)
!907 = !DILocation(line: 481, column: 7, scope: !820)
!908 = !DILocation(line: 482, column: 5, scope: !904)
!909 = !DILocation(line: 484, column: 40, scope: !820)
!910 = !DILocation(line: 484, column: 29, scope: !820)
!911 = !DILocation(line: 484, column: 13, scope: !820)
!912 = !DILocation(line: 486, column: 11, scope: !820)
!913 = !DILocation(line: 486, column: 8, scope: !820)
!914 = !DILocation(line: 487, column: 13, scope: !820)
!915 = !DILocation(line: 487, column: 11, scope: !820)
!916 = !DILocation(line: 493, column: 8, scope: !917)
!917 = distinct !DILexicalBlock(scope: !820, file: !3, line: 493, column: 7)
!918 = !DILocation(line: 493, column: 7, scope: !820)
!919 = !DILocation(line: 494, column: 5, scope: !917)
!920 = !DILocation(line: 498, column: 20, scope: !820)
!921 = !DILocalVariable(name: "sigterm", arg: 1, scope: !922, file: !3, line: 366, type: !22)
!922 = distinct !DISubprogram(name: "install_cleanup", scope: !3, file: !3, line: 366, type: !20, scopeLine: 367, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !923)
!923 = !{!921, !924}
!924 = !DILocalVariable(name: "sa", scope: !922, file: !3, line: 368, type: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !926, line: 27, size: 1216, elements: !927)
!926 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!927 = !{!928, !1012, !1013, !1014}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !925, file: !926, line: 38, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !925, file: !926, line: 31, size: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !929, file: !926, line: 34, baseType: !17, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !929, file: !926, line: 36, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !22, !936, !16}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !938, line: 124, baseType: !939)
!938 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !938, line: 36, size: 1024, elements: !940)
!940 = !{!941, !942, !943, !944, !945}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !939, file: !938, line: 38, baseType: !22, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !939, file: !938, line: 40, baseType: !22, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !939, file: !938, line: 42, baseType: !22, size: 32, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !939, file: !938, line: 48, baseType: !22, size: 32, offset: 96)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !939, file: !938, line: 123, baseType: !946, size: 896, offset: 128)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !939, file: !938, line: 51, size: 896, elements: !947)
!947 = !{!948, !952, !958, !970, !976, !985, !1001, !1006}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !946, file: !938, line: 53, baseType: !949, size: 896)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 28)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !946, file: !938, line: 60, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !938, line: 56, size: 64, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !953, file: !938, line: 58, baseType: !31, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !953, file: !938, line: 59, baseType: !957, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !32, line: 146, baseType: !7)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !946, file: !938, line: 68, baseType: !959, size: 128)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !938, line: 63, size: 128, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !959, file: !938, line: 65, baseType: !22, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !959, file: !938, line: 66, baseType: !22, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !959, file: !938, line: 67, baseType: !964, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !965, line: 30, baseType: !966)
!965 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!966 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !965, line: 24, size: 64, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !966, file: !965, line: 26, baseType: !22, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !966, file: !965, line: 27, baseType: !16, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !946, file: !938, line: 76, baseType: !971, size: 128)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !938, line: 71, size: 128, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !971, file: !938, line: 73, baseType: !31, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !971, file: !938, line: 74, baseType: !957, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !971, file: !938, line: 75, baseType: !964, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !946, file: !938, line: 86, baseType: !977, size: 256)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !938, line: 79, size: 256, elements: !978)
!978 = !{!979, !980, !981, !982, !984}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !977, file: !938, line: 81, baseType: !31, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !977, file: !938, line: 82, baseType: !957, size: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !977, file: !938, line: 83, baseType: !22, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !977, file: !938, line: 84, baseType: !983, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !32, line: 156, baseType: !239)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !977, file: !938, line: 85, baseType: !983, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !946, file: !938, line: 105, baseType: !986, size: 256)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !938, line: 89, size: 256, elements: !987)
!987 = !{!988, !989, !991}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !986, file: !938, line: 91, baseType: !16, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !986, file: !938, line: 93, baseType: !990, size: 16, offset: 64)
!990 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !986, file: !938, line: 104, baseType: !992, size: 128, offset: 128)
!992 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !938, line: 94, size: 128, elements: !993)
!993 = !{!994, !999}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !992, file: !938, line: 101, baseType: !995, size: 128)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !992, file: !938, line: 97, size: 128, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !995, file: !938, line: 99, baseType: !16, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !995, file: !938, line: 100, baseType: !16, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !992, file: !938, line: 103, baseType: !1000, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !32, line: 42, baseType: !7)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !946, file: !938, line: 112, baseType: !1002, size: 128)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !938, line: 108, size: 128, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !1002, file: !938, line: 110, baseType: !239, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !1002, file: !938, line: 111, baseType: !22, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !946, file: !938, line: 121, baseType: !1007, size: 128)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !938, line: 116, size: 128, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1007, file: !938, line: 118, baseType: !16, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1007, file: !938, line: 119, baseType: !22, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !1007, file: !938, line: 120, baseType: !7, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !925, file: !926, line: 46, baseType: !843, size: 1024, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !925, file: !926, line: 49, baseType: !22, size: 32, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !925, file: !926, line: 52, baseType: !1015, size: 64, offset: 1152)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!1016 = !DILocation(line: 0, scope: !922, inlinedAt: !1017)
!1017 = distinct !DILocation(line: 498, column: 3, scope: !820)
!1018 = !DILocation(line: 368, column: 3, scope: !922, inlinedAt: !1017)
!1019 = !DILocation(line: 368, column: 20, scope: !922, inlinedAt: !1017)
!1020 = !DILocation(line: 369, column: 20, scope: !922, inlinedAt: !1017)
!1021 = !DILocation(line: 369, column: 3, scope: !922, inlinedAt: !1017)
!1022 = !DILocation(line: 370, column: 6, scope: !922, inlinedAt: !1017)
!1023 = !DILocation(line: 370, column: 17, scope: !922, inlinedAt: !1017)
!1024 = !{!691, !691, i64 0}
!1025 = !DILocation(line: 371, column: 6, scope: !922, inlinedAt: !1017)
!1026 = !DILocation(line: 371, column: 15, scope: !922, inlinedAt: !1017)
!1027 = !{!1028, !873, i64 136}
!1028 = !{!"sigaction", !691, i64 0, !1029, i64 8, !873, i64 136, !690, i64 144}
!1029 = !{!"", !691, i64 0}
!1030 = !DILocation(line: 374, column: 3, scope: !922, inlinedAt: !1017)
!1031 = !DILocation(line: 375, column: 3, scope: !922, inlinedAt: !1017)
!1032 = !DILocation(line: 376, column: 3, scope: !922, inlinedAt: !1017)
!1033 = !DILocation(line: 377, column: 3, scope: !922, inlinedAt: !1017)
!1034 = !DILocation(line: 378, column: 3, scope: !922, inlinedAt: !1017)
!1035 = !DILocation(line: 379, column: 3, scope: !922, inlinedAt: !1017)
!1036 = !DILocation(line: 380, column: 1, scope: !922, inlinedAt: !1017)
!1037 = !DILocation(line: 499, column: 3, scope: !820)
!1038 = !DILocation(line: 500, column: 3, scope: !820)
!1039 = !DILocation(line: 352, column: 3, scope: !1040, inlinedAt: !1043)
!1040 = distinct !DISubprogram(name: "install_sigchld", scope: !3, file: !3, line: 350, type: !698, scopeLine: 351, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1041)
!1041 = !{!1042}
!1042 = !DILocalVariable(name: "sa", scope: !1040, file: !3, line: 352, type: !925)
!1043 = distinct !DILocation(line: 501, column: 3, scope: !820)
!1044 = !DILocation(line: 352, column: 20, scope: !1040, inlinedAt: !1043)
!1045 = !DILocation(line: 353, column: 20, scope: !1040, inlinedAt: !1043)
!1046 = !DILocation(line: 353, column: 3, scope: !1040, inlinedAt: !1043)
!1047 = !DILocation(line: 354, column: 6, scope: !1040, inlinedAt: !1043)
!1048 = !DILocation(line: 354, column: 17, scope: !1040, inlinedAt: !1043)
!1049 = !DILocation(line: 355, column: 6, scope: !1040, inlinedAt: !1043)
!1050 = !DILocation(line: 355, column: 15, scope: !1040, inlinedAt: !1043)
!1051 = !DILocation(line: 358, column: 3, scope: !1040, inlinedAt: !1043)
!1052 = !DILocation(line: 362, column: 3, scope: !1040, inlinedAt: !1043)
!1053 = !DILocation(line: 363, column: 1, scope: !1040, inlinedAt: !1043)
!1054 = !DILocation(line: 503, column: 19, scope: !820)
!1055 = !DILocation(line: 503, column: 17, scope: !820)
!1056 = !DILocation(line: 504, column: 7, scope: !820)
!1057 = !DILocation(line: 506, column: 17, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !836, file: !3, line: 505, column: 5)
!1059 = !DILocation(line: 506, column: 24, scope: !1058)
!1060 = !DILocation(line: 506, column: 7, scope: !1058)
!1061 = !DILocation(line: 507, column: 7, scope: !1058)
!1062 = !DILocation(line: 512, column: 7, scope: !834)
!1063 = !DILocation(line: 513, column: 7, scope: !834)
!1064 = !DILocation(line: 515, column: 15, scope: !834)
!1065 = !DILocation(line: 515, column: 7, scope: !834)
!1066 = !DILocation(line: 518, column: 25, scope: !834)
!1067 = !DILocation(line: 518, column: 31, scope: !834)
!1068 = !DILocation(line: 0, scope: !834)
!1069 = !DILocation(line: 519, column: 24, scope: !834)
!1070 = !DILocation(line: 519, column: 62, scope: !834)
!1071 = !DILocation(line: 519, column: 55, scope: !834)
!1072 = !DILocation(line: 519, column: 7, scope: !834)
!1073 = !DILocation(line: 525, column: 7, scope: !838)
!1074 = !DILocation(line: 529, column: 7, scope: !838)
!1075 = !DILocation(line: 531, column: 7, scope: !838)
!1076 = !DILocation(line: 535, column: 7, scope: !838)
!1077 = !DILocation(line: 535, column: 16, scope: !838)
!1078 = !DILocation(line: 536, column: 31, scope: !838)
!1079 = !DILocalVariable(name: "sigterm", arg: 1, scope: !1080, file: !3, line: 388, type: !22)
!1080 = distinct !DISubprogram(name: "block_cleanup_and_chld", scope: !3, file: !3, line: 388, type: !1081, scopeLine: 389, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1084)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !22, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!1084 = !{!1079, !1085, !1086}
!1085 = !DILocalVariable(name: "old_set", arg: 2, scope: !1080, file: !3, line: 388, type: !1083)
!1086 = !DILocalVariable(name: "block_set", scope: !1080, file: !3, line: 390, type: !841)
!1087 = !DILocation(line: 0, scope: !1080, inlinedAt: !1088)
!1088 = distinct !DILocation(line: 536, column: 7, scope: !838)
!1089 = !DILocation(line: 390, column: 3, scope: !1080, inlinedAt: !1088)
!1090 = !DILocation(line: 390, column: 12, scope: !1080, inlinedAt: !1088)
!1091 = !DILocation(line: 391, column: 3, scope: !1080, inlinedAt: !1088)
!1092 = !DILocation(line: 393, column: 3, scope: !1080, inlinedAt: !1088)
!1093 = !DILocation(line: 394, column: 3, scope: !1080, inlinedAt: !1088)
!1094 = !DILocation(line: 395, column: 3, scope: !1080, inlinedAt: !1088)
!1095 = !DILocation(line: 396, column: 3, scope: !1080, inlinedAt: !1088)
!1096 = !DILocation(line: 397, column: 3, scope: !1080, inlinedAt: !1088)
!1097 = !DILocation(line: 398, column: 3, scope: !1080, inlinedAt: !1088)
!1098 = !DILocation(line: 400, column: 3, scope: !1080, inlinedAt: !1088)
!1099 = !DILocation(line: 402, column: 7, scope: !1100, inlinedAt: !1088)
!1100 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 402, column: 7)
!1101 = !DILocation(line: 402, column: 52, scope: !1100, inlinedAt: !1088)
!1102 = !DILocation(line: 402, column: 7, scope: !1080, inlinedAt: !1088)
!1103 = !DILocation(line: 403, column: 15, scope: !1100, inlinedAt: !1088)
!1104 = !DILocation(line: 403, column: 22, scope: !1100, inlinedAt: !1088)
!1105 = !DILocation(line: 403, column: 5, scope: !1100, inlinedAt: !1088)
!1106 = !DILocation(line: 404, column: 1, scope: !1080, inlinedAt: !1088)
!1107 = !DILocation(line: 538, column: 38, scope: !838)
!1108 = !DILocation(line: 0, scope: !838)
!1109 = !DILocation(line: 538, column: 29, scope: !838)
!1110 = !DILocation(line: 538, column: 72, scope: !838)
!1111 = !DILocation(line: 538, column: 7, scope: !838)
!1112 = !DILocation(line: 539, column: 9, scope: !838)
!1113 = distinct !{!1113, !1111, !1114, !739}
!1114 = !DILocation(line: 539, column: 33, scope: !838)
!1115 = !DILocation(line: 541, column: 23, scope: !856)
!1116 = !DILocation(line: 541, column: 11, scope: !838)
!1117 = !DILocation(line: 544, column: 21, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !856, file: !3, line: 542, column: 9)
!1119 = !DILocation(line: 544, column: 28, scope: !1118)
!1120 = !DILocation(line: 544, column: 11, scope: !1118)
!1121 = !DILocation(line: 546, column: 9, scope: !1118)
!1122 = !DILocation(line: 549, column: 15, scope: !854)
!1123 = !DILocation(line: 549, column: 15, scope: !855)
!1124 = !DILocation(line: 550, column: 22, scope: !854)
!1125 = !DILocation(line: 550, column: 13, scope: !854)
!1126 = !DILocation(line: 551, column: 20, scope: !853)
!1127 = !DILocation(line: 551, column: 20, scope: !854)
!1128 = !DILocation(line: 0, scope: !852)
!1129 = !DILocation(line: 554, column: 19, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !852, file: !3, line: 554, column: 19)
!1131 = !DILocation(line: 554, column: 19, scope: !852)
!1132 = !DILocation(line: 555, column: 30, scope: !1130)
!1133 = !DILocation(line: 555, column: 17, scope: !1130)
!1134 = !DILocation(line: 556, column: 20, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !852, file: !3, line: 556, column: 19)
!1136 = !DILocation(line: 556, column: 30, scope: !1135)
!1137 = !DILocation(line: 412, column: 7, scope: !1138, inlinedAt: !1142)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !3, line: 412, column: 7)
