source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__locale_data = type opaque
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__mbstate_t = type { i32, %union.anon.8 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon.10 = type { void (i8*)*, %union.pthread_attr_t* }
%struct.infomap = type { i8*, i8* }
%struct.itimerspec = type { %struct.timespec, %struct.timespec }
%struct.numname = type { i32, [8 x i8] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%struct.sigevent = type { %union.sigval, i32, i32, %union.anon.9 }
%struct.slotvec = type { i64, i8* }
%struct.timespec = type { i64, i64 }
%union.anon = type { void (i32)* }
%union.anon.8 = type { i32 }
%union.anon.9 = type { %struct.anon.10, [32 x i8] }
%union.pthread_attr_t = type { i64, [48 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 96, type: !388, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !369, nameTableKind: None)
!3 = !DIFile(filename: "src/timeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 87, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124, isUnsigned: true)
!10 = !DIEnumerator(name: "EXIT_CANCELED", value: 125, isUnsigned: true)
!11 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126, isUnsigned: true)
!12 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!13 = !{!14, !24, !85, !89, !93, !96, !99, !106, !121, !18, !75, !125, !129, !133, !138, !141, !144, !148, !151, !155, !159, !57, !171, !174, !186, !190, !288, !292, !293, !296, !299, !310, !348, !359, !362, !365}
!14 = !DISubprogram(name: "dcgettext", scope: !15, file: !15, line: 51, type: !16, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!15 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !20, !20, !22}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !{}
!24 = !DISubprogram(name: "fputs_unlocked", scope: !25, file: !25, line: 662, type: !26, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!26 = !DISubroutineType(types: !27)
!27 = !{!22, !20, !28}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 49, size: 1728, elements: !31)
!30 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !47, !48, !49, !50, !54, !56, !58, !62, !65, !67, !70, !73, !74, !76, !80, !81}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !29, file: !30, line: 51, baseType: !22, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !29, file: !30, line: 54, baseType: !18, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !29, file: !30, line: 55, baseType: !18, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !29, file: !30, line: 56, baseType: !18, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !29, file: !30, line: 57, baseType: !18, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !29, file: !30, line: 58, baseType: !18, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !29, file: !30, line: 59, baseType: !18, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !29, file: !30, line: 60, baseType: !18, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !29, file: !30, line: 61, baseType: !18, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !29, file: !30, line: 64, baseType: !18, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !29, file: !30, line: 65, baseType: !18, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !29, file: !30, line: 66, baseType: !18, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !29, file: !30, line: 68, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !30, line: 36, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !29, file: !30, line: 70, baseType: !28, size: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !29, file: !30, line: 72, baseType: !22, size: 32, offset: 896)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !29, file: !30, line: 73, baseType: !22, size: 32, offset: 928)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !29, file: !30, line: 74, baseType: !51, size: 64, offset: 960)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !52, line: 152, baseType: !53)
!52 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!53 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !29, file: !30, line: 77, baseType: !55, size: 16, offset: 1024)
!55 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !29, file: !30, line: 78, baseType: !57, size: 8, offset: 1040)
!57 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !29, file: !30, line: 79, baseType: !59, size: 8, offset: 1048)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 1)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !29, file: !30, line: 81, baseType: !63, size: 64, offset: 1088)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !30, line: 43, baseType: null)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !29, file: !30, line: 89, baseType: !66, size: 64, offset: 1152)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !52, line: 153, baseType: !53)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !29, file: !30, line: 91, baseType: !68, size: 64, offset: 1216)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !30, line: 37, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !29, file: !30, line: 92, baseType: !71, size: 64, offset: 1280)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !30, line: 38, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !29, file: !30, line: 93, baseType: !28, size: 64, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !29, file: !30, line: 94, baseType: !75, size: 64, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !29, file: !30, line: 95, baseType: !77, size: 64, offset: 1472)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 46, baseType: !79)
!78 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !29, file: !30, line: 96, baseType: !22, size: 32, offset: 1536)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !29, file: !30, line: 98, baseType: !82, size: 160, offset: 1568)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 20)
!85 = !DISubprogram(name: "set_program_name", scope: !86, file: !86, line: 37, type: !87, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!86 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!87 = !DISubroutineType(types: !88)
!88 = !{null, !20}
!89 = !DISubprogram(name: "setlocale", scope: !90, file: !90, line: 122, type: !91, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!90 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!91 = !DISubroutineType(types: !92)
!92 = !{!18, !22, !20}
!93 = !DISubprogram(name: "bindtextdomain", scope: !15, file: !15, line: 86, type: !94, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!94 = !DISubroutineType(types: !95)
!95 = !{!18, !20, !20}
!96 = !DISubprogram(name: "textdomain", scope: !15, file: !15, line: 82, type: !97, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!97 = !DISubroutineType(types: !98)
!98 = !{!18, !20}
!99 = !DISubprogram(name: "atexit", scope: !100, file: !100, line: 595, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!100 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!101 = !DISubroutineType(types: !102)
!102 = !{!22, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null}
!106 = !DISubprogram(name: "getopt_long", scope: !107, file: !107, line: 66, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!107 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!22, !22, !110, !20, !112, !119}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !107, line: 50, size: 256, elements: !115)
!115 = !{!116, !117, !118, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !107, line: 52, baseType: !20, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !114, file: !107, line: 55, baseType: !22, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !107, line: 56, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !114, file: !107, line: 57, baseType: !22, size: 32, offset: 192)
!121 = !DISubprogram(name: "operand2sig", scope: !122, file: !122, line: 18, type: !123, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!122 = !DIFile(filename: "src/operand2sig.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!123 = !DISubroutineType(types: !124)
!124 = !{!22, !20, !18}
!125 = !DISubprogram(name: "version_etc", scope: !126, file: !126, line: 69, type: !127, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!126 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!127 = !DISubroutineType(types: !128)
!128 = !{null, !28, !20, !20, !20, null}
!129 = !DISubprogram(name: "setpgid", scope: !130, file: !130, line: 646, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!130 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!131 = !DISubroutineType(types: !132)
!132 = !{!22, !22, !22}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !134, line: 72, baseType: !135)
!134 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !22}
!138 = !DISubprogram(name: "signal", scope: !134, file: !134, line: 88, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!139 = !DISubroutineType(types: !140)
!140 = !{!135, !22, !135}
!141 = !DISubprogram(name: "fork", scope: !130, file: !130, line: 756, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!142 = !DISubroutineType(types: !143)
!143 = !{!22}
!144 = !DISubprogram(name: "error", scope: !145, file: !145, line: 52, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!145 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{null, !22, !22, !20, null}
!148 = !DISubprogram(name: "execvp", scope: !130, file: !130, line: 578, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!149 = !DISubroutineType(types: !150)
!150 = !{!22, !20, !110}
!151 = !DISubprogram(name: "quote", scope: !152, file: !152, line: 44, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!152 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{!20, !20}
!155 = !DISubprogram(name: "waitpid", scope: !156, file: !156, line: 111, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!156 = !DIFile(filename: "/usr/include/sys/wait.h", directory: "")
!157 = !DISubroutineType(types: !158)
!158 = !{!22, !22, !119, !22}
!159 = !DISubprogram(name: "sigsuspend", scope: !134, file: !134, line: 237, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!160 = !DISubroutineType(types: !161)
!161 = !{!22, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 5, size: 1024, elements: !166)
!165 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !164, file: !165, line: 7, baseType: !168, size: 1024)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 1024, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 16)
!171 = !DISubprogram(name: "raise", scope: !134, file: !134, line: 123, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!172 = !DISubroutineType(types: !173)
!173 = !{!22, !22}
!174 = !DISubprogram(name: "xstrtod", scope: !175, file: !175, line: 26, type: !176, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!175 = !DIFile(filename: "./lib/xstrtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !20, !179, !180, !182}
!178 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!181, !20, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!186 = !DISubprogram(name: "sigemptyset", scope: !134, file: !134, line: 196, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!187 = !DISubroutineType(types: !188)
!188 = !{!22, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!190 = !DISubprogram(name: "sigaction", scope: !134, file: !134, line: 240, type: !191, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!191 = !DISubroutineType(types: !192)
!192 = !{!22, !22, !193, !287}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !196, line: 27, size: 1216, elements: !197)
!196 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!197 = !{!198, !283, !285, !286}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !195, file: !196, line: 38, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !196, line: 31, size: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !199, file: !196, line: 34, baseType: !133, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !199, file: !196, line: 36, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !22, !206, !75}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !208, line: 124, baseType: !209)
!208 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 36, size: 1024, elements: !210)
!210 = !{!211, !212, !213, !214, !215}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !209, file: !208, line: 38, baseType: !22, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !209, file: !208, line: 40, baseType: !22, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !209, file: !208, line: 42, baseType: !22, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !209, file: !208, line: 48, baseType: !22, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !209, file: !208, line: 123, baseType: !216, size: 896, offset: 128)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !209, file: !208, line: 51, size: 896, elements: !217)
!217 = !{!218, !222, !229, !241, !247, !256, !272, !277}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !216, file: !208, line: 53, baseType: !219, size: 896)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 28)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !216, file: !208, line: 60, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !208, line: 56, size: 64, elements: !224)
!224 = !{!225, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !223, file: !208, line: 58, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !52, line: 154, baseType: !22)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !223, file: !208, line: 59, baseType: !228, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !52, line: 146, baseType: !7)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !216, file: !208, line: 68, baseType: !230, size: 128)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !208, line: 63, size: 128, elements: !231)
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !230, file: !208, line: 65, baseType: !22, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !230, file: !208, line: 66, baseType: !22, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !230, file: !208, line: 67, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !236, line: 30, baseType: !237)
!236 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !236, line: 24, size: 64, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !237, file: !236, line: 26, baseType: !22, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !237, file: !236, line: 27, baseType: !75, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !216, file: !208, line: 76, baseType: !242, size: 128)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !208, line: 71, size: 128, elements: !243)
!243 = !{!244, !245, !246}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !242, file: !208, line: 73, baseType: !226, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !242, file: !208, line: 74, baseType: !228, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !242, file: !208, line: 75, baseType: !235, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !216, file: !208, line: 86, baseType: !248, size: 256)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !208, line: 79, size: 256, elements: !249)
!249 = !{!250, !251, !252, !253, !255}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !248, file: !208, line: 81, baseType: !226, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !248, file: !208, line: 82, baseType: !228, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !248, file: !208, line: 83, baseType: !22, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !248, file: !208, line: 84, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !52, line: 156, baseType: !53)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !248, file: !208, line: 85, baseType: !254, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !216, file: !208, line: 105, baseType: !257, size: 256)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !208, line: 89, size: 256, elements: !258)
!258 = !{!259, !260, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !257, file: !208, line: 91, baseType: !75, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !257, file: !208, line: 93, baseType: !261, size: 16, offset: 64)
!261 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !257, file: !208, line: 104, baseType: !263, size: 128, offset: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !208, line: 94, size: 128, elements: !264)
!264 = !{!265, !270}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !263, file: !208, line: 101, baseType: !266, size: 128)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !208, line: 97, size: 128, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !266, file: !208, line: 99, baseType: !75, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !266, file: !208, line: 100, baseType: !75, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !263, file: !208, line: 103, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !52, line: 42, baseType: !7)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !216, file: !208, line: 112, baseType: !273, size: 128)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !208, line: 108, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !273, file: !208, line: 110, baseType: !53, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !273, file: !208, line: 111, baseType: !22, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !216, file: !208, line: 121, baseType: !278, size: 128)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !208, line: 116, size: 128, elements: !279)
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !278, file: !208, line: 118, baseType: !75, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !278, file: !208, line: 119, baseType: !22, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !278, file: !208, line: 120, baseType: !7, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !195, file: !196, line: 46, baseType: !284, size: 1024, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !165, line: 8, baseType: !164)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !195, file: !196, line: 49, baseType: !22, size: 32, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !195, file: !196, line: 52, baseType: !103, size: 64, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!288 = !DISubprogram(name: "sig2str", scope: !289, file: !289, line: 34, type: !290, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!289 = !DIFile(filename: "./lib/sig2str.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!290 = !DISubroutineType(types: !291)
!291 = !{!22, !22, !18}
!292 = !DISubprogram(name: "kill", scope: !134, file: !134, line: 112, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!293 = !DISubprogram(name: "sigaddset", scope: !134, file: !134, line: 202, type: !294, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!294 = !DISubroutineType(types: !295)
!295 = !{!22, !189, !22}
!296 = !DISubprogram(name: "sigprocmask", scope: !134, file: !134, line: 229, type: !297, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!297 = !DISubroutineType(types: !298)
!298 = !{!22, !22, !162, !189}
!299 = !DISubprogram(name: "dtotimespec", scope: !300, file: !300, line: 116, type: !301, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!300 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !181}
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !304, line: 10, size: 128, elements: !305)
!304 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !303, file: !304, line: 12, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 160, baseType: !53)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !303, file: !304, line: 16, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !52, line: 196, baseType: !53)
!310 = !DISubprogram(name: "timer_create", scope: !311, file: !311, line: 234, type: !312, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!311 = !DIFile(filename: "/usr/include/time.h", directory: "")
!312 = !DISubroutineType(types: !313)
!313 = !{!22, !22, !314, !347}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", file: !316, line: 22, size: 512, elements: !317)
!316 = !DIFile(filename: "/usr/include/bits/types/sigevent_t.h", directory: "")
!317 = !{!318, !319, !320, !321}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !315, file: !316, line: 24, baseType: !235, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !315, file: !316, line: 25, baseType: !22, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !315, file: !316, line: 26, baseType: !22, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_sigev_un", scope: !315, file: !316, line: 41, baseType: !322, size: 384, offset: 128)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !315, file: !316, line: 28, size: 384, elements: !323)
!323 = !{!324, !328, !329}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !322, file: !316, line: 30, baseType: !325, size: 384)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 384, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 12)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !322, file: !316, line: 34, baseType: !226, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_sigev_thread", scope: !322, file: !316, line: 40, baseType: !330, size: 128)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !322, file: !316, line: 36, size: 128, elements: !331)
!331 = !{!332, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_function", scope: !330, file: !316, line: 38, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !235}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_attribute", scope: !330, file: !316, line: 39, baseType: !337, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !339, line: 62, baseType: !340)
!339 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !339, line: 56, size: 448, elements: !341)
!341 = !{!342, !346}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !340, file: !339, line: 58, baseType: !343, size: 448)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 448, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 56)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !340, file: !339, line: 59, baseType: !53, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!348 = !DISubprogram(name: "timer_settime", scope: !311, file: !311, line: 242, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!349 = !DISubroutineType(types: !350)
!350 = !{!22, !75, !22, !351, !358}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "itimerspec", file: !354, line: 8, size: 256, elements: !355)
!354 = !DIFile(filename: "/usr/include/bits/types/struct_itimerspec.h", directory: "")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !353, file: !354, line: 10, baseType: !303, size: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !353, file: !354, line: 11, baseType: !303, size: 128, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!359 = !DISubprogram(name: "timer_delete", scope: !311, file: !311, line: 239, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!360 = !DISubroutineType(types: !361)
!361 = !{!22, !75}
!362 = !DISubprogram(name: "alarm", scope: !130, file: !130, line: 432, type: !363, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!363 = !DISubroutineType(types: !364)
!364 = !{!7, !7}
!365 = !DISubprogram(name: "prctl", scope: !366, file: !366, line: 27, type: !367, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!366 = !DIFile(filename: "/usr/include/sys/prctl.h", directory: "")
!367 = !DISubroutineType(types: !368)
!368 = !{!22, !22, null}
!369 = !{!370, !372, !376, !378, !380, !382, !384, !0, !386}
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "timed_out", scope: !2, file: !3, line: 80, type: !22, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "monitored_pid", scope: !2, file: !3, line: 82, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !375, line: 97, baseType: !226)
!375 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "kill_after", scope: !2, file: !3, line: 83, type: !181, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "foreground", scope: !2, file: !3, line: 84, type: !178, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "preserve_status", scope: !2, file: !3, line: 85, type: !178, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 86, type: !178, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "command", scope: !2, file: !3, line: 87, type: !20, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "term_signal", scope: !2, file: !3, line: 81, type: !22, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 2048, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 8)
!391 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!392 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!393 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!394 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "Version", scope: !397, file: !398, line: 2, type: !20, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, globals: !399, nameTableKind: None)
!398 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!399 = !{!395}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "file_name", scope: !402, file: !403, line: 46, type: !20, isLocal: true, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !404, globals: !443, nameTableKind: None)
!403 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!404 = !{!405, !14, !441, !144}
!405 = !DISubprogram(name: "close_stream", scope: !406, file: !406, line: 2, type: !407, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!406 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!407 = !DISubroutineType(types: !408)
!408 = !{!22, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 49, size: 1728, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !410, file: !30, line: 51, baseType: !22, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !410, file: !30, line: 54, baseType: !18, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !410, file: !30, line: 55, baseType: !18, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !410, file: !30, line: 56, baseType: !18, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !410, file: !30, line: 57, baseType: !18, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !410, file: !30, line: 58, baseType: !18, size: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !410, file: !30, line: 59, baseType: !18, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !410, file: !30, line: 60, baseType: !18, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !410, file: !30, line: 61, baseType: !18, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !410, file: !30, line: 64, baseType: !18, size: 64, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !410, file: !30, line: 65, baseType: !18, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !410, file: !30, line: 66, baseType: !18, size: 64, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !410, file: !30, line: 68, baseType: !45, size: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !410, file: !30, line: 70, baseType: !409, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !410, file: !30, line: 72, baseType: !22, size: 32, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !410, file: !30, line: 73, baseType: !22, size: 32, offset: 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !410, file: !30, line: 74, baseType: !51, size: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !410, file: !30, line: 77, baseType: !55, size: 16, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !410, file: !30, line: 78, baseType: !57, size: 8, offset: 1040)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !410, file: !30, line: 79, baseType: !59, size: 8, offset: 1048)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !410, file: !30, line: 81, baseType: !63, size: 64, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !410, file: !30, line: 89, baseType: !66, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !410, file: !30, line: 91, baseType: !68, size: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !410, file: !30, line: 92, baseType: !71, size: 64, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !410, file: !30, line: 93, baseType: !409, size: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !410, file: !30, line: 94, baseType: !75, size: 64, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !410, file: !30, line: 95, baseType: !77, size: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !410, file: !30, line: 96, baseType: !22, size: 32, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !410, file: !30, line: 98, baseType: !82, size: 160, offset: 1568)
!441 = !DISubprogram(name: "quotearg_colon", scope: !442, file: !442, line: 391, type: !97, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!442 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!443 = !{!400, !444}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !402, file: !403, line: 56, type: !178, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "exit_failure", scope: !448, file: !449, line: 24, type: !451, isDefinition: true)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, globals: !450, nameTableKind: None)
!449 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!450 = !{!446}
!451 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !22)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "program_name", scope: !454, file: !455, line: 33, type: !20, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !456, globals: !492, nameTableKind: None)
!455 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!456 = !{!75, !457, !18}
!457 = !DISubprogram(name: "fputs", scope: !25, file: !25, line: 626, type: !458, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!458 = !DISubroutineType(types: !459)
!459 = !{!22, !20, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 49, size: 1728, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !461, file: !30, line: 51, baseType: !22, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !461, file: !30, line: 54, baseType: !18, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !461, file: !30, line: 55, baseType: !18, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !461, file: !30, line: 56, baseType: !18, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !461, file: !30, line: 57, baseType: !18, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !461, file: !30, line: 58, baseType: !18, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !461, file: !30, line: 59, baseType: !18, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !461, file: !30, line: 60, baseType: !18, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !461, file: !30, line: 61, baseType: !18, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !461, file: !30, line: 64, baseType: !18, size: 64, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !461, file: !30, line: 65, baseType: !18, size: 64, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !461, file: !30, line: 66, baseType: !18, size: 64, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !461, file: !30, line: 68, baseType: !45, size: 64, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !461, file: !30, line: 70, baseType: !460, size: 64, offset: 832)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !461, file: !30, line: 72, baseType: !22, size: 32, offset: 896)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !461, file: !30, line: 73, baseType: !22, size: 32, offset: 928)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !461, file: !30, line: 74, baseType: !51, size: 64, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !461, file: !30, line: 77, baseType: !55, size: 16, offset: 1024)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !461, file: !30, line: 78, baseType: !57, size: 8, offset: 1040)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !461, file: !30, line: 79, baseType: !59, size: 8, offset: 1048)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !461, file: !30, line: 81, baseType: !63, size: 64, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !461, file: !30, line: 89, baseType: !66, size: 64, offset: 1152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !461, file: !30, line: 91, baseType: !68, size: 64, offset: 1216)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !461, file: !30, line: 92, baseType: !71, size: 64, offset: 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !461, file: !30, line: 93, baseType: !460, size: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !461, file: !30, line: 94, baseType: !75, size: 64, offset: 1408)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !461, file: !30, line: 95, baseType: !77, size: 64, offset: 1472)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !461, file: !30, line: 96, baseType: !22, size: 32, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !461, file: !30, line: 98, baseType: !82, size: 160, offset: 1568)
!492 = !{!452}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !495, file: !496, line: 85, type: !627, isDefinition: true)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !497, retainedTypes: !531, globals: !600, nameTableKind: None)
!496 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = !{!498, !511, !516}
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !442, line: 32, baseType: !7, size: 32, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!500 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!501 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!502 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!503 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!504 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!505 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!506 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!507 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!508 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!509 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!510 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!511 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !442, line: 242, baseType: !7, size: 32, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!514 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!515 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !517, line: 46, baseType: !7, size: 32, elements: !518)
!517 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!519 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!520 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!521 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!522 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!523 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!524 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!525 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!526 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!527 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!528 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!529 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!530 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!531 = !{!532, !538, !552, !555, !22, !55, !558, !77, !575, !579, !14, !585, !589, !18, !593, !596, !597}
!532 = !DISubprogram(name: "xmemdup", scope: !533, file: !533, line: 62, type: !534, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!533 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!534 = !DISubroutineType(types: !535)
!535 = !{!75, !536, !79}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!538 = !DISubprogram(name: "quotearg_alloc_mem", scope: !442, file: !442, line: 342, type: !539, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!539 = !DISubroutineType(types: !540)
!540 = !{!18, !20, !79, !541, !542}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !496, line: 65, size: 448, elements: !545)
!545 = !{!546, !547, !548, !550, !551}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !544, file: !496, line: 68, baseType: !498, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !544, file: !496, line: 71, baseType: !22, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !544, file: !496, line: 75, baseType: !549, size: 256, offset: 64)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !389)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !544, file: !496, line: 78, baseType: !20, size: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !544, file: !496, line: 81, baseType: !20, size: 64, offset: 384)
!552 = !DISubprogram(name: "free", scope: !100, file: !100, line: 565, type: !553, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !75}
!555 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !442, file: !442, line: 408, type: !556, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!556 = !DISubroutineType(types: !557)
!557 = !{!18, !22, !20, !20, !20, !79}
!558 = !DISubprogram(name: "rpl_mbrtowc", scope: !559, file: !559, line: 717, type: !560, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!559 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!560 = !DISubroutineType(types: !561)
!561 = !{!79, !119, !20, !79, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 13, size: 64, elements: !565)
!564 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !563, file: !564, line: 15, baseType: !22, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !563, file: !564, line: 20, baseType: !568, size: 32, offset: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !564, line: 16, size: 32, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !568, file: !564, line: 18, baseType: !7, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !568, file: !564, line: 19, baseType: !572, size: 32)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 4)
!575 = !DISubprogram(name: "iswprint", scope: !576, file: !576, line: 120, type: !577, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!576 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!577 = !DISubroutineType(types: !578)
!578 = !{!22, !7}
!579 = !DISubprogram(name: "mbsinit", scope: !580, file: !580, line: 292, type: !581, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!580 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!581 = !DISubroutineType(types: !582)
!582 = !{!22, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!585 = !DISubprogram(name: "locale_charset", scope: !586, file: !586, line: 35, type: !587, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!586 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!587 = !DISubroutineType(types: !588)
!588 = !{!20}
!589 = !DISubprogram(name: "c_strcasecmp", scope: !590, file: !590, line: 42, type: !591, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!590 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!591 = !DISubroutineType(types: !592)
!592 = !{!22, !20, !20}
!593 = !DISubprogram(name: "xmalloc", scope: !533, file: !533, line: 53, type: !594, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!594 = !DISubroutineType(types: !595)
!595 = !{!75, !79}
!596 = !DISubprogram(name: "xalloc_die", scope: !533, file: !533, line: 51, type: !104, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !23)
!597 = !DISubprogram(name: "xrealloc", scope: !533, file: !533, line: 59, type: !598, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!598 = !DISubroutineType(types: !599)
!599 = !{!75, !75, !79}
!600 = !{!493, !601, !607, !609, !611, !616, !623, !625}
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !495, file: !496, line: 101, type: !603, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 320, elements: !605)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!605 = !{!606}
!606 = !DISubrange(count: 10)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !495, file: !496, line: 1052, type: !544, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !495, file: !496, line: 116, type: !544, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "slot0", scope: !495, file: !496, line: 842, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 256)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "slotvec", scope: !495, file: !496, line: 845, type: !618, isLocal: true, isDefinition: true)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !496, line: 834, size: 128, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !496, line: 836, baseType: !77, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !619, file: !496, line: 837, baseType: !18, size: 64, offset: 64)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "nslots", scope: !495, file: !496, line: 843, type: !22, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "slotvec0", scope: !495, file: !496, line: 844, type: !619, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 704, elements: !629)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!629 = !{!630}
!630 = !DISubrange(count: 11)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !633, file: !634, line: 26, type: !636, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, globals: !635, nameTableKind: None)
!634 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!635 = !{!631}
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 376, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 47)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "numname_table", scope: !641, file: !642, line: 41, type: !645, isLocal: true, isDefinition: true)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !643, globals: !644, nameTableKind: None)
!642 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!643 = !{!7}
!644 = !{!639}
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 3360, elements: !651)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !642, line: 41, size: 96, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !646, file: !642, line: 41, baseType: !22, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !642, line: 41, baseType: !650, size: 64, offset: 32)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !389)
!651 = !{!652}
!652 = !DISubrange(count: 35)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !655, file: !656, line: 50, type: !687, isLocal: true, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !657, globals: !686, nameTableKind: None)
!656 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!657 = !{!18, !658, !680, !683}
!658 = !DISubprogram(name: "strtod_l", scope: !100, file: !100, line: 295, type: !659, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!659 = !DISubroutineType(types: !660)
!660 = !{!181, !20, !185, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !663, line: 28, size: 1856, elements: !664)
!663 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!664 = !{!665, !671, !674, !677, !678}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !662, file: !663, line: 31, baseType: !666, size: 832)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 832, elements: !669)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !663, line: 31, flags: DIFlagFwdDecl)
!669 = !{!670}
!670 = !DISubrange(count: 13)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !662, file: !663, line: 34, baseType: !672, size: 64, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !662, file: !663, line: 35, baseType: !675, size: 64, offset: 896)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !662, file: !663, line: 36, baseType: !675, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !662, file: !663, line: 39, baseType: !679, size: 832, offset: 1024)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 832, elements: !669)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !681, line: 24, baseType: !682)
!681 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !663, line: 42, baseType: !661)
!683 = !DISubprogram(name: "newlocale", scope: !90, file: !90, line: 141, type: !684, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!684 = !DISubroutineType(types: !685)
!685 = !{!661, !22, !20, !661}
!686 = !{!653}
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !680)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !690, nameTableKind: None)
!689 = !DIFile(filename: "src/operand2sig.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!690 = !{!7, !691, !692, !552, !288, !14, !151, !144}
!691 = !DISubprogram(name: "xstrdup", scope: !533, file: !533, line: 64, type: !97, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!692 = !DISubprogram(name: "str2sig", scope: !289, file: !289, line: 35, type: !693, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!693 = !DISubroutineType(types: !694)
!694 = !{!22, !20, !119}
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !697, nameTableKind: None)
!696 = !DIFile(filename: "lib/cl-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!697 = !{!698}
!698 = !DISubprogram(name: "c_strtod", scope: !699, file: !699, line: 40, type: !183, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!699 = !DIFile(filename: "./lib/c-strtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !702, retainedTypes: !706, nameTableKind: None)
!701 = !DIFile(filename: "lib/dtotimespec.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!702 = !{!703}
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 42, baseType: !7, size: 32, elements: !704)
!704 = !{!705}
!705 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !708, line: 7, baseType: !307)
!708 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !711, retainedTypes: !715, nameTableKind: None)
!710 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!711 = !{!712}
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !710, line: 40, baseType: !7, size: 32, elements: !713)
!713 = !{!714}
!714 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!715 = !{!14, !716, !75}
!716 = !DISubprogram(name: "fputs_unlocked", scope: !25, file: !25, line: 662, type: !717, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!717 = !DISubroutineType(types: !718)
!718 = !{!22, !20, !719}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 49, size: 1728, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !720, file: !30, line: 51, baseType: !22, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !720, file: !30, line: 54, baseType: !18, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !720, file: !30, line: 55, baseType: !18, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !720, file: !30, line: 56, baseType: !18, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !720, file: !30, line: 57, baseType: !18, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !720, file: !30, line: 58, baseType: !18, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !720, file: !30, line: 59, baseType: !18, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !720, file: !30, line: 60, baseType: !18, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !720, file: !30, line: 61, baseType: !18, size: 64, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !720, file: !30, line: 64, baseType: !18, size: 64, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !720, file: !30, line: 65, baseType: !18, size: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !720, file: !30, line: 66, baseType: !18, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !720, file: !30, line: 68, baseType: !45, size: 64, offset: 768)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !720, file: !30, line: 70, baseType: !719, size: 64, offset: 832)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !720, file: !30, line: 72, baseType: !22, size: 32, offset: 896)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !720, file: !30, line: 73, baseType: !22, size: 32, offset: 928)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !720, file: !30, line: 74, baseType: !51, size: 64, offset: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !720, file: !30, line: 77, baseType: !55, size: 16, offset: 1024)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !720, file: !30, line: 78, baseType: !57, size: 8, offset: 1040)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !720, file: !30, line: 79, baseType: !59, size: 8, offset: 1048)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !720, file: !30, line: 81, baseType: !63, size: 64, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !720, file: !30, line: 89, baseType: !66, size: 64, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !720, file: !30, line: 91, baseType: !68, size: 64, offset: 1216)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !720, file: !30, line: 92, baseType: !71, size: 64, offset: 1280)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !720, file: !30, line: 93, baseType: !719, size: 64, offset: 1344)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !720, file: !30, line: 94, baseType: !75, size: 64, offset: 1408)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !720, file: !30, line: 95, baseType: !77, size: 64, offset: 1472)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !720, file: !30, line: 96, baseType: !22, size: 32, offset: 1536)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !720, file: !30, line: 98, baseType: !82, size: 160, offset: 1568)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !753, retainedTypes: !766, nameTableKind: None)
!752 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!753 = !{!754}
!754 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !755, file: !533, line: 186, baseType: !7, size: 32, elements: !764)
!755 = distinct !DISubprogram(name: "x2nrealloc", scope: !533, file: !533, line: 174, type: !756, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !751, retainedNodes: !759)
!756 = !DISubroutineType(types: !757)
!757 = !{!75, !75, !758, !77}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!759 = !{!760, !761, !762, !763}
!760 = !DILocalVariable(name: "p", arg: 1, scope: !755, file: !533, line: 174, type: !75)
!761 = !DILocalVariable(name: "pn", arg: 2, scope: !755, file: !533, line: 174, type: !758)
!762 = !DILocalVariable(name: "s", arg: 3, scope: !755, file: !533, line: 174, type: !77)
!763 = !DILocalVariable(name: "n", scope: !755, file: !533, line: 176, type: !77)
!764 = !{!765}
!765 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!766 = !{!77, !596, !593, !597, !18, !552, !75, !767, !770}
!767 = !DISubprogram(name: "xcalloc", scope: !533, file: !533, line: 57, type: !768, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!768 = !DISubroutineType(types: !769)
!769 = !{!75, !79, !79}
!770 = !DISubprogram(name: "rpl_calloc", scope: !771, file: !771, line: 688, type: !768, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!771 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !774, nameTableKind: None)
!773 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!774 = !{!14, !144}
!775 = distinct !DICompileUnit(language: DW_LANG_C99, file: !776, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !777, nameTableKind: None)
!776 = !DIFile(filename: "lib/xstrtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!777 = !{!75}
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !777, nameTableKind: None)
!779 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !782, nameTableKind: None)
!781 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!782 = !{!783, !77, !795}
!783 = !DISubprogram(name: "mbrtowc", scope: !580, file: !580, line: 296, type: !784, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!784 = !DISubroutineType(types: !785)
!785 = !{!79, !119, !20, !79, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 13, size: 64, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !787, file: !564, line: 15, baseType: !22, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !787, file: !564, line: 20, baseType: !791, size: 32, offset: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !787, file: !564, line: 16, size: 32, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !791, file: !564, line: 18, baseType: !7, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !791, file: !564, line: 19, baseType: !572, size: 32)
!795 = !DISubprogram(name: "hard_locale", scope: !796, file: !796, line: 26, type: !797, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!796 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!797 = !DISubroutineType(types: !798)
!798 = !{!178, !22}
!799 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !801, nameTableKind: None)
!800 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!801 = !{!802}
!802 = !DISubprogram(name: "rpl_fclose", scope: !803, file: !803, line: 672, type: !804, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!803 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!804 = !DISubroutineType(types: !805)
!805 = !{!22, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 49, size: 1728, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !807, file: !30, line: 51, baseType: !22, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !807, file: !30, line: 54, baseType: !18, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !807, file: !30, line: 55, baseType: !18, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !807, file: !30, line: 56, baseType: !18, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !807, file: !30, line: 57, baseType: !18, size: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !807, file: !30, line: 58, baseType: !18, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !807, file: !30, line: 59, baseType: !18, size: 64, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !807, file: !30, line: 60, baseType: !18, size: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !807, file: !30, line: 61, baseType: !18, size: 64, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !807, file: !30, line: 64, baseType: !18, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !807, file: !30, line: 65, baseType: !18, size: 64, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !807, file: !30, line: 66, baseType: !18, size: 64, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !807, file: !30, line: 68, baseType: !45, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !807, file: !30, line: 70, baseType: !806, size: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !807, file: !30, line: 72, baseType: !22, size: 32, offset: 896)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !807, file: !30, line: 73, baseType: !22, size: 32, offset: 928)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !807, file: !30, line: 74, baseType: !51, size: 64, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !807, file: !30, line: 77, baseType: !55, size: 16, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !807, file: !30, line: 78, baseType: !57, size: 8, offset: 1040)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !807, file: !30, line: 79, baseType: !59, size: 8, offset: 1048)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !807, file: !30, line: 81, baseType: !63, size: 64, offset: 1088)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !807, file: !30, line: 89, baseType: !66, size: 64, offset: 1152)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !807, file: !30, line: 91, baseType: !68, size: 64, offset: 1216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !807, file: !30, line: 92, baseType: !71, size: 64, offset: 1280)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !807, file: !30, line: 93, baseType: !806, size: 64, offset: 1344)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !807, file: !30, line: 94, baseType: !75, size: 64, offset: 1408)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !807, file: !30, line: 95, baseType: !77, size: 64, offset: 1472)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !807, file: !30, line: 96, baseType: !22, size: 32, offset: 1536)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !807, file: !30, line: 98, baseType: !82, size: 160, offset: 1568)
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !23, retainedTypes: !840, nameTableKind: None)
!839 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!840 = !{!841}
!841 = !DISubprogram(name: "setlocale_null_r", scope: !842, file: !842, line: 64, type: !843, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!842 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!843 = !DISubroutineType(types: !844)
!844 = !{!22, !22, !18, !79}
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !847, retainedTypes: !1234, nameTableKind: None)
!846 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!847 = !{!848}
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !849, line: 41, baseType: !7, size: 32, elements: !850)
!849 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233}
!851 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!852 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!853 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!854 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!855 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!856 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!857 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!858 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!859 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!860 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!861 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!862 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!863 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!864 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!865 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!866 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!867 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!868 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!869 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!870 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!871 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!872 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!873 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!874 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!875 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!876 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!877 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!878 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!879 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!880 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!881 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!882 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!883 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!884 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!885 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!886 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!887 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!888 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!889 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!890 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!891 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!892 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!893 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!894 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!895 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!896 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!897 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!898 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!899 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!900 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!959 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!962 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!963 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!964 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!965 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!966 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!967 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!968 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!969 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!970 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!971 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!972 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!973 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
