source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.table = type { i8*, i32, i32 }
%struct.textint = type { i8, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "change_times", scope: !2, file: !3, line: 53, type: !29, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !207, nameTableKind: None)
!3 = !DIFile(filename: "src/touch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !31, !92, !96, !100, !103, !106, !113, !128, !134, !138, !142, !25, !82, !144, !148, !151, !163, !167, !168, !189, !195, !199, !203}
!21 = !DISubprogram(name: "dcgettext", scope: !22, file: !22, line: 51, type: !23, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!22 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !27, !27, !29}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !{}
!31 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !33, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!29, !27, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !38)
!37 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !54, !55, !56, !57, !61, !63, !65, !69, !72, !74, !77, !80, !81, !83, !87, !88}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !36, file: !37, line: 51, baseType: !29, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !36, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !36, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !36, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !36, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !36, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !36, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !36, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !36, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !36, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !36, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !36, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !36, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !37, line: 36, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !36, file: !37, line: 70, baseType: !35, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !36, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !36, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !36, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !59, line: 152, baseType: !60)
!59 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !36, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !36, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !36, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !36, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !37, line: 43, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !36, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !59, line: 153, baseType: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !36, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !37, line: 37, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !36, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !37, line: 38, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !36, file: !37, line: 93, baseType: !35, size: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !36, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !36, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!86 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !36, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !36, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DISubprogram(name: "set_program_name", scope: !93, file: !93, line: 37, type: !94, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!93 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !DISubroutineType(types: !95)
!95 = !{null, !27}
!96 = !DISubprogram(name: "setlocale", scope: !97, file: !97, line: 122, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!97 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{!25, !29, !27}
!100 = !DISubprogram(name: "bindtextdomain", scope: !22, file: !22, line: 86, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!101 = !DISubroutineType(types: !102)
!102 = !{!25, !27, !27}
!103 = !DISubprogram(name: "textdomain", scope: !22, file: !22, line: 82, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!104 = !DISubroutineType(types: !105)
!105 = !{!25, !27}
!106 = !DISubprogram(name: "atexit", scope: !107, file: !107, line: 595, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!107 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!29, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DISubprogram(name: "getopt_long", scope: !114, file: !114, line: 66, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!114 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!29, !29, !117, !27, !119, !126}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !114, line: 50, size: 256, elements: !122)
!122 = !{!123, !124, !125, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !114, line: 52, baseType: !27, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !121, file: !114, line: 55, baseType: !29, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !114, line: 56, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !114, line: 57, baseType: !29, size: 32, offset: 192)
!128 = !DISubprogram(name: "posixtime", scope: !129, file: !129, line: 37, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!129 = !DIFile(filename: "./lib/posixtm.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !133, !27, !7}
!132 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!134 = !DISubprogram(name: "quote", scope: !135, file: !135, line: 44, type: !136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!135 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !DISubroutineType(types: !137)
!137 = !{!27, !27}
!138 = !DISubprogram(name: "error", scope: !139, file: !139, line: 52, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!139 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !DISubroutineType(types: !141)
!141 = !{null, !29, !29, !27, null}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!144 = !DISubprogram(name: "version_etc", scope: !145, file: !145, line: 69, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!145 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{null, !35, !27, !27, !27, null}
!148 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!149 = !DISubroutineType(types: !150)
!150 = !{!25, !5, !27}
!151 = !DISubprogram(name: "gettime", scope: !152, file: !152, line: 127, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!152 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !157, line: 10, size: 128, elements: !158)
!157 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!158 = !{!159, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !156, file: !157, line: 12, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !59, line: 160, baseType: !60)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !156, file: !157, line: 16, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !59, line: 196, baseType: !60)
!163 = !DISubprogram(name: "posix2_version", scope: !164, file: !164, line: 1, type: !165, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!164 = !DIFile(filename: "./lib/posixver.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubroutineType(types: !166)
!166 = !{!29}
!167 = !DISubprogram(name: "getenv", scope: !107, file: !107, line: 634, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!168 = !DISubprogram(name: "localtime", scope: !169, file: !169, line: 123, type: !170, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!169 = !DIFile(filename: "/usr/include/time.h", directory: "")
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !187}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !174, line: 7, size: 448, elements: !175)
!174 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !173, file: !174, line: 9, baseType: !29, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !173, file: !174, line: 10, baseType: !29, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !173, file: !174, line: 11, baseType: !29, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !173, file: !174, line: 12, baseType: !29, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !173, file: !174, line: 13, baseType: !29, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !173, file: !174, line: 14, baseType: !29, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !173, file: !174, line: 15, baseType: !29, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !173, file: !174, line: 16, baseType: !29, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !173, file: !174, line: 17, baseType: !29, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !173, file: !174, line: 20, baseType: !60, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !173, file: !174, line: 21, baseType: !27, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!189 = !DISubprogram(name: "parse_datetime", scope: !190, file: !190, line: 22, type: !191, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!190 = !DIFile(filename: "./lib/parse-datetime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = !DISubroutineType(types: !192)
!192 = !{!132, !155, !27, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!195 = !DISubprogram(name: "fd_reopen", scope: !196, file: !196, line: 22, type: !197, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!196 = !DIFile(filename: "./lib/fd-reopen.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !DISubroutineType(types: !198)
!198 = !{!29, !29, !27, !29, !7}
!199 = !DISubprogram(name: "fdutimensat", scope: !200, file: !200, line: 37, type: !201, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!200 = !DIFile(filename: "./lib/utimens.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !DISubroutineType(types: !202)
!202 = !{!29, !29, !29, !27, !193, !29}
!203 = !DISubprogram(name: "close", scope: !204, file: !204, line: 353, type: !205, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!204 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!205 = !DISubroutineType(types: !206)
!206 = !{!29, !29}
!207 = !{!0, !208, !210, !212, !214, !216, !221, !223, !228, !234}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 56, type: !132, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "use_ref", scope: !2, file: !3, line: 59, type: !132, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "no_dereference", scope: !2, file: !3, line: 62, type: !132, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "amtime_now", scope: !2, file: !3, line: 69, type: !132, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "newtime", scope: !2, file: !3, line: 72, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 75, type: !25, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 84, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 2048, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 8)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "time_masks", scope: !2, file: !3, line: 103, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 160, elements: !232)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 97, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 384, elements: !238)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!238 = !{!239}
!239 = !DISubrange(count: 6)
!240 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!241 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!242 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!243 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "Version", scope: !246, file: !247, line: 2, type: !27, isDefinition: true)
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !248, nameTableKind: None)
!247 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = !{!244}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !251, file: !252, line: 67, type: !300, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !253, globals: !299, nameTableKind: None)
!252 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !{!82, !27, !21, !254, !257, !138, !260, !134, !295, !298}
!254 = !DISubprogram(name: "quotearg_n_style", scope: !6, file: !6, line: 368, type: !255, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!255 = !DISubroutineType(types: !256)
!256 = !{!25, !29, !5, !27}
!257 = !DISubprogram(name: "quote_n", scope: !135, file: !135, line: 40, type: !258, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!258 = !DISubroutineType(types: !259)
!259 = !{!27, !29, !27}
!260 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !261, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!261 = !DISubroutineType(types: !262)
!262 = !{!29, !27, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !264, file: !37, line: 51, baseType: !29, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !264, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !264, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !264, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !264, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !264, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !264, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !264, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !264, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !264, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !264, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !264, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !264, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !264, file: !37, line: 70, baseType: !263, size: 64, offset: 832)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !264, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !264, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !264, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !264, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !264, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !264, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !264, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !264, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !264, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !264, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !264, file: !37, line: 93, baseType: !263, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !264, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !264, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !264, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !264, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!295 = !DISubprogram(name: "usage", scope: !252, file: !252, line: 56, type: !296, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !29}
!298 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!299 = !{!249}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !301, line: 61, baseType: !110)
!301 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "file_name", scope: !304, file: !305, line: 46, type: !27, isLocal: true, isDefinition: true)
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !306, globals: !344, nameTableKind: None)
!305 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!306 = !{!307, !21, !343, !138}
!307 = !DISubprogram(name: "close_stream", scope: !308, file: !308, line: 2, type: !309, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!308 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!309 = !DISubroutineType(types: !310)
!310 = !{!29, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !312, file: !37, line: 51, baseType: !29, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !312, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !312, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !312, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !312, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !312, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !312, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !312, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !312, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !312, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !312, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !312, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !312, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !312, file: !37, line: 70, baseType: !311, size: 64, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !312, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !312, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !312, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !312, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !312, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !312, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !312, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !312, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !312, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !312, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !312, file: !37, line: 93, baseType: !311, size: 64, offset: 1344)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !312, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !312, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !312, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !312, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!343 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!344 = !{!302, !345}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !304, file: !305, line: 56, type: !132, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "exit_failure", scope: !349, file: !350, line: 24, type: !352, isDefinition: true)
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !351, nameTableKind: None)
!350 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!351 = !{!347}
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "yypact", scope: !355, file: !584, line: 1067, type: !850, isLocal: true, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !357, retainedTypes: !610, globals: !696, nameTableKind: None)
!356 = !DIFile(filename: "lib/parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!357 = !{!358, !364, !580, !583, !606}
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !359, line: 167, baseType: !7, size: 32, elements: !360)
!359 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!360 = !{!361, !362, !363}
!361 = !DIEnumerator(name: "MERam", value: 0, isUnsigned: true)
!362 = !DIEnumerator(name: "MERpm", value: 1, isUnsigned: true)
!363 = !DIEnumerator(name: "MER24", value: 2, isUnsigned: true)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !365, file: !359, line: 1746, baseType: !7, size: 32, elements: !578)
!365 = distinct !DISubprogram(name: "parse_datetime2", scope: !359, file: !359, line: 1732, type: !366, scopeLine: 1735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !355, retainedNodes: !379)
!366 = !DISubroutineType(types: !367)
!367 = !{!132, !368, !27, !373, !7, !375, !27}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !157, line: 10, size: 128, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !369, file: !157, line: 12, baseType: !160, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !369, file: !157, line: 16, baseType: !162, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !376, line: 778, baseType: !377)
!376 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !376, line: 778, flags: DIFlagFwdDecl)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !400, !401, !405, !409, !410, !411, !412, !413, !414, !417, !418, !419, !420, !435, !438, !440, !441, !447, !448, !449, !450, !500, !502, !506, !507, !508, !515, !518, !519, !525, !526, !527, !530, !533, !534, !535, !543, !546, !547, !548, !549, !552, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !566, !569, !570, !571, !572, !573, !576, !577}
!380 = !DILocalVariable(name: "result", arg: 1, scope: !365, file: !359, line: 1732, type: !368)
!381 = !DILocalVariable(name: "p", arg: 2, scope: !365, file: !359, line: 1732, type: !27)
!382 = !DILocalVariable(name: "now", arg: 3, scope: !365, file: !359, line: 1733, type: !373)
!383 = !DILocalVariable(name: "flags", arg: 4, scope: !365, file: !359, line: 1733, type: !7)
!384 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !365, file: !359, line: 1734, type: !375)
!385 = !DILocalVariable(name: "tzstring", arg: 6, scope: !365, file: !359, line: 1734, type: !27)
!386 = !DILocalVariable(name: "tm", scope: !365, file: !359, line: 1736, type: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !174, line: 7, size: 448, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !387, file: !174, line: 9, baseType: !29, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !387, file: !174, line: 10, baseType: !29, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !387, file: !174, line: 11, baseType: !29, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !387, file: !174, line: 12, baseType: !29, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !387, file: !174, line: 13, baseType: !29, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !387, file: !174, line: 14, baseType: !29, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !387, file: !174, line: 15, baseType: !29, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !387, file: !174, line: 16, baseType: !29, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !387, file: !174, line: 17, baseType: !29, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !387, file: !174, line: 20, baseType: !60, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !387, file: !174, line: 21, baseType: !27, size: 64, offset: 384)
!400 = !DILocalVariable(name: "tm0", scope: !365, file: !359, line: 1737, type: !387)
!401 = !DILocalVariable(name: "time_zone_buf", scope: !365, file: !359, line: 1738, type: !402)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 216, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 27)
!405 = !DILocalVariable(name: "dbg_tm", scope: !365, file: !359, line: 1739, type: !406)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 800, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 100)
!409 = !DILocalVariable(name: "ok", scope: !365, file: !359, line: 1740, type: !132)
!410 = !DILocalVariable(name: "input_sentinel", scope: !365, file: !359, line: 1741, type: !27)
!411 = !DILocalVariable(name: "tz1alloc", scope: !365, file: !359, line: 1742, type: !25)
!412 = !DILocalVariable(name: "tz1buf", scope: !365, file: !359, line: 1747, type: !406)
!413 = !DILocalVariable(name: "gettime_buffer", scope: !365, file: !359, line: 1749, type: !369)
!414 = !DILocalVariable(name: "Start", scope: !365, file: !359, line: 1756, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !416, line: 7, baseType: !160)
!416 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!417 = !DILocalVariable(name: "Start_ns", scope: !365, file: !359, line: 1757, type: !29)
!418 = !DILocalVariable(name: "c", scope: !365, file: !359, line: 1759, type: !298)
!419 = !DILocalVariable(name: "tz", scope: !365, file: !359, line: 1763, type: !375)
!420 = !DILocalVariable(name: "rel_time_0", scope: !365, file: !359, line: 1768, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !359, line: 185, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 175, size: 448, elements: !424)
!424 = !{!425, !429, !430, !431, !432, !433, !434}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !423, file: !359, line: 178, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !427, line: 101, baseType: !428)
!427 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !59, line: 72, baseType: !60)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !423, file: !359, line: 179, baseType: !426, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !423, file: !359, line: 180, baseType: !426, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !423, file: !359, line: 181, baseType: !426, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !423, file: !359, line: 182, baseType: !426, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !423, file: !359, line: 183, baseType: !426, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !423, file: !359, line: 184, baseType: !29, size: 32, offset: 384)
!435 = !DILocalVariable(name: "tzbase", scope: !436, file: !359, line: 1772, type: !27)
!436 = distinct !DILexicalBlock(scope: !437, file: !359, line: 1771, column: 5)
!437 = distinct !DILexicalBlock(scope: !365, file: !359, line: 1770, column: 7)
!438 = !DILocalVariable(name: "tzsize", scope: !436, file: !359, line: 1773, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !85, line: 35, baseType: !60)
!440 = !DILocalVariable(name: "s", scope: !436, file: !359, line: 1774, type: !27)
!441 = !DILocalVariable(name: "tz1", scope: !442, file: !359, line: 1785, type: !375)
!442 = distinct !DILexicalBlock(scope: !443, file: !359, line: 1784, column: 11)
!443 = distinct !DILexicalBlock(scope: !444, file: !359, line: 1783, column: 18)
!444 = distinct !DILexicalBlock(scope: !445, file: !359, line: 1777, column: 13)
!445 = distinct !DILexicalBlock(scope: !446, file: !359, line: 1776, column: 7)
!446 = distinct !DILexicalBlock(scope: !436, file: !359, line: 1776, column: 7)
!447 = !DILocalVariable(name: "tz1string", scope: !442, file: !359, line: 1786, type: !25)
!448 = !DILocalVariable(name: "z", scope: !442, file: !359, line: 1787, type: !25)
!449 = !DILocalVariable(name: "tmp", scope: !365, file: !359, line: 1813, type: !387)
!450 = !DILocalVariable(name: "pc", scope: !365, file: !359, line: 1823, type: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !359, line: 252, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 194, size: 2240, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !452, file: !359, line: 197, baseType: !27, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !452, file: !359, line: 200, baseType: !426, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !452, file: !359, line: 203, baseType: !29, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !452, file: !359, line: 206, baseType: !29, size: 32, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !452, file: !359, line: 209, baseType: !29, size: 32, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !452, file: !359, line: 212, baseType: !29, size: 32, offset: 224)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !452, file: !359, line: 215, baseType: !461, size: 192, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !359, line: 156, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 151, size: 192, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !462, file: !359, line: 153, baseType: !132, size: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !462, file: !359, line: 154, baseType: !426, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !462, file: !359, line: 155, baseType: !439, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !452, file: !359, line: 216, baseType: !426, size: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !452, file: !359, line: 217, baseType: !426, size: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !452, file: !359, line: 218, baseType: !426, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !452, file: !359, line: 219, baseType: !426, size: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !452, file: !359, line: 220, baseType: !369, size: 128, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !452, file: !359, line: 223, baseType: !422, size: 448, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !452, file: !359, line: 226, baseType: !132, size: 8, offset: 1280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !452, file: !359, line: 227, baseType: !132, size: 8, offset: 1288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !452, file: !359, line: 228, baseType: !439, size: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !452, file: !359, line: 229, baseType: !439, size: 64, offset: 1408)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !452, file: !359, line: 230, baseType: !439, size: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !452, file: !359, line: 231, baseType: !439, size: 64, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !452, file: !359, line: 232, baseType: !439, size: 64, offset: 1600)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !452, file: !359, line: 233, baseType: !439, size: 64, offset: 1664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !452, file: !359, line: 234, baseType: !132, size: 8, offset: 1728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !452, file: !359, line: 237, baseType: !132, size: 8, offset: 1736)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !452, file: !359, line: 240, baseType: !132, size: 8, offset: 1744)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !452, file: !359, line: 241, baseType: !132, size: 8, offset: 1752)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !452, file: !359, line: 242, baseType: !132, size: 8, offset: 1760)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !452, file: !359, line: 243, baseType: !132, size: 8, offset: 1768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !452, file: !359, line: 244, baseType: !132, size: 8, offset: 1776)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !452, file: !359, line: 245, baseType: !132, size: 8, offset: 1784)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !452, file: !359, line: 248, baseType: !132, size: 8, offset: 1792)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !452, file: !359, line: 251, baseType: !491, size: 384, offset: 1856)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 384, elements: !498)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !359, line: 164, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 159, size: 128, elements: !494)
!494 = !{!495, !496, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !493, file: !359, line: 161, baseType: !27, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !359, line: 162, baseType: !29, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !493, file: !359, line: 163, baseType: !29, size: 32, offset: 96)
!498 = !{!499}
!499 = !DISubrange(count: 3)
!500 = !DILocalVariable(name: "quarter", scope: !501, file: !359, line: 1869, type: !29)
!501 = distinct !DILexicalBlock(scope: !365, file: !359, line: 1868, column: 3)
!502 = !DILocalVariable(name: "iprobe", scope: !503, file: !359, line: 1872, type: !426)
!503 = distinct !DILexicalBlock(scope: !504, file: !359, line: 1871, column: 7)
!504 = distinct !DILexicalBlock(scope: !505, file: !359, line: 1870, column: 5)
!505 = distinct !DILexicalBlock(scope: !501, file: !359, line: 1870, column: 5)
!506 = !DILocalVariable(name: "probe", scope: !503, file: !359, line: 1876, type: !415)
!507 = !DILocalVariable(name: "probe_tm", scope: !503, file: !359, line: 1877, type: !387)
!508 = !DILocalVariable(name: "mrd", scope: !509, file: !359, line: 2006, type: !27)
!509 = distinct !DILexicalBlock(scope: !510, file: !359, line: 2005, column: 13)
!510 = distinct !DILexicalBlock(scope: !511, file: !359, line: 2004, column: 15)
!511 = distinct !DILexicalBlock(scope: !512, file: !359, line: 2002, column: 9)
!512 = distinct !DILexicalBlock(scope: !513, file: !359, line: 2001, column: 11)
!513 = distinct !DILexicalBlock(scope: !514, file: !359, line: 1973, column: 5)
!514 = distinct !DILexicalBlock(scope: !365, file: !359, line: 1970, column: 7)
!515 = !DILocalVariable(name: "repaired", scope: !516, file: !359, line: 2051, type: !132)
!516 = distinct !DILexicalBlock(scope: !517, file: !359, line: 2050, column: 9)
!517 = distinct !DILexicalBlock(scope: !513, file: !359, line: 2049, column: 11)
!518 = !DILocalVariable(name: "time_zone_seen", scope: !516, file: !359, line: 2052, type: !132)
!519 = !DILocalVariable(name: "tz2buf", scope: !520, file: !359, line: 2065, type: !522)
!520 = distinct !DILexicalBlock(scope: !521, file: !359, line: 2054, column: 13)
!521 = distinct !DILexicalBlock(scope: !516, file: !359, line: 2053, column: 15)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 240, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 30)
!525 = !DILocalVariable(name: "tz2", scope: !520, file: !359, line: 2068, type: !375)
!526 = !DILocalVariable(name: "dbg_ord", scope: !513, file: !359, line: 2095, type: !406)
!527 = !DILocalVariable(name: "dayincr", scope: !528, file: !359, line: 2099, type: !426)
!528 = distinct !DILexicalBlock(scope: !529, file: !359, line: 2098, column: 9)
!529 = distinct !DILexicalBlock(scope: !513, file: !359, line: 2097, column: 11)
!530 = !DILocalVariable(name: "year", scope: !531, file: !359, line: 2164, type: !29)
!531 = distinct !DILexicalBlock(scope: !532, file: !359, line: 2151, column: 9)
!532 = distinct !DILexicalBlock(scope: !513, file: !359, line: 2150, column: 11)
!533 = !DILocalVariable(name: "month", scope: !531, file: !359, line: 2164, type: !29)
!534 = !DILocalVariable(name: "day", scope: !531, file: !359, line: 2164, type: !29)
!535 = !DILocalVariable(name: "tm_year_buf", scope: !536, file: !359, line: 2237, type: !540)
!536 = distinct !DILexicalBlock(scope: !537, file: !359, line: 2234, column: 17)
!537 = distinct !DILexicalBlock(scope: !538, file: !359, line: 2231, column: 19)
!538 = distinct !DILexicalBlock(scope: !539, file: !359, line: 2192, column: 13)
!539 = distinct !DILexicalBlock(scope: !531, file: !359, line: 2191, column: 15)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 104, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 13)
!543 = !DILocalVariable(name: "delta", scope: !544, file: !359, line: 2252, type: !426)
!544 = distinct !DILexicalBlock(scope: !545, file: !359, line: 2251, column: 9)
!545 = distinct !DILexicalBlock(scope: !513, file: !359, line: 2250, column: 11)
!546 = !DILocalVariable(name: "t1", scope: !544, file: !359, line: 2252, type: !426)
!547 = !DILocalVariable(name: "overflow", scope: !544, file: !359, line: 2253, type: !132)
!548 = !DILocalVariable(name: "utcoff", scope: !544, file: !359, line: 2255, type: !60)
!549 = !DILocalVariable(name: "Starti", scope: !550, file: !359, line: 2277, type: !426)
!550 = distinct !DILexicalBlock(scope: !551, file: !359, line: 2276, column: 9)
!551 = distinct !DILexicalBlock(scope: !513, file: !359, line: 2275, column: 11)
!552 = !DILocalVariable(name: "orig_ns", scope: !553, file: !359, line: 2292, type: !426)
!553 = distinct !DILexicalBlock(scope: !513, file: !359, line: 2291, column: 7)
!554 = !DILocalVariable(name: "sum_ns", scope: !553, file: !359, line: 2293, type: !426)
!555 = !DILocalVariable(name: "normalized_ns", scope: !553, file: !359, line: 2294, type: !29)
!556 = !DILocalVariable(name: "d4", scope: !553, file: !359, line: 2295, type: !29)
!557 = !DILocalVariable(name: "d1", scope: !553, file: !359, line: 2296, type: !426)
!558 = !DILocalVariable(name: "t1", scope: !553, file: !359, line: 2296, type: !426)
!559 = !DILocalVariable(name: "d2", scope: !553, file: !359, line: 2296, type: !426)
!560 = !DILocalVariable(name: "t2", scope: !553, file: !359, line: 2296, type: !426)
!561 = !DILocalVariable(name: "t3", scope: !553, file: !359, line: 2296, type: !426)
!562 = !DILocalVariable(name: "t4", scope: !553, file: !359, line: 2296, type: !426)
!563 = !DILocalVariable(name: "lmt", scope: !564, file: !359, line: 2335, type: !387)
!564 = distinct !DILexicalBlock(scope: !565, file: !359, line: 2316, column: 11)
!565 = distinct !DILexicalBlock(scope: !553, file: !359, line: 2314, column: 13)
!566 = !DILocalVariable(name: "sec", scope: !567, file: !359, line: 2354, type: !426)
!567 = distinct !DILexicalBlock(scope: !568, file: !359, line: 2345, column: 5)
!568 = distinct !DILexicalBlock(scope: !365, file: !359, line: 2344, column: 7)
!569 = !DILocalVariable(name: "nsec", scope: !567, file: !359, line: 2355, type: !29)
!570 = !DILocalVariable(name: "gmt", scope: !567, file: !359, line: 2359, type: !387)
!571 = !DILocalVariable(name: "lmt", scope: !567, file: !359, line: 2359, type: !387)
!572 = !DILocalVariable(name: "got_utc", scope: !567, file: !359, line: 2360, type: !132)
!573 = !DILocalVariable(name: "got_utcoff", scope: !574, file: !359, line: 2368, type: !132)
!574 = distinct !DILexicalBlock(scope: !575, file: !359, line: 2366, column: 9)
!575 = distinct !DILexicalBlock(scope: !567, file: !359, line: 2365, column: 11)
!576 = !DILocalVariable(name: "utcoff", scope: !574, file: !359, line: 2369, type: !60)
!577 = !DILabel(scope: !365, name: "fail", file: !359, line: 2388)
!578 = !{!579}
!579 = !DIEnumerator(name: "TZBUFSIZE", value: 100, isUnsigned: true)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !359, line: 1249, baseType: !7, size: 32, elements: !581)
!581 = !{!582}
!582 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900, isUnsigned: true)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !584, line: 671, baseType: !7, size: 32, elements: !585)
!584 = !DIFile(filename: "parse-datetime.tab.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!586 = !DIEnumerator(name: "tAGO", value: 258, isUnsigned: true)
!587 = !DIEnumerator(name: "tDST", value: 259, isUnsigned: true)
!588 = !DIEnumerator(name: "tYEAR_UNIT", value: 260, isUnsigned: true)
!589 = !DIEnumerator(name: "tMONTH_UNIT", value: 261, isUnsigned: true)
!590 = !DIEnumerator(name: "tHOUR_UNIT", value: 262, isUnsigned: true)
!591 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263, isUnsigned: true)
!592 = !DIEnumerator(name: "tSEC_UNIT", value: 264, isUnsigned: true)
!593 = !DIEnumerator(name: "tDAY_UNIT", value: 265, isUnsigned: true)
!594 = !DIEnumerator(name: "tDAY_SHIFT", value: 266, isUnsigned: true)
!595 = !DIEnumerator(name: "tDAY", value: 267, isUnsigned: true)
!596 = !DIEnumerator(name: "tDAYZONE", value: 268, isUnsigned: true)
!597 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269, isUnsigned: true)
!598 = !DIEnumerator(name: "tMERIDIAN", value: 270, isUnsigned: true)
!599 = !DIEnumerator(name: "tMONTH", value: 271, isUnsigned: true)
!600 = !DIEnumerator(name: "tORDINAL", value: 272, isUnsigned: true)
!601 = !DIEnumerator(name: "tZONE", value: 273, isUnsigned: true)
!602 = !DIEnumerator(name: "tSNUMBER", value: 274, isUnsigned: true)
!603 = !DIEnumerator(name: "tUNUMBER", value: 275, isUnsigned: true)
!604 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 276, isUnsigned: true)
!605 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 277, isUnsigned: true)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !359, line: 172, baseType: !7, size: 32, elements: !607)
!607 = !{!608, !609}
!608 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!609 = !DIEnumerator(name: "LOG10_BILLION", value: 9, isUnsigned: true)
!610 = !{!611, !86, !613, !625, !7, !21, !426, !64, !298, !612, !62, !29, !60, !628, !629, !167, !630, !633, !636, !639, !642, !646, !681, !415, !684, !687, !690}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !584, line: 748, baseType: !612)
!612 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !584, line: 898, size: 448, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !614, file: !584, line: 900, baseType: !611, size: 16)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !614, file: !584, line: 901, baseType: !618, size: 448)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !584, line: 710, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !584, line: 698, size: 448, elements: !620)
!620 = !{!621, !622, !623, !624}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !619, file: !359, line: 577, baseType: !426, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !619, file: !359, line: 578, baseType: !461, size: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !619, file: !359, line: 579, baseType: !369, size: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !619, file: !359, line: 580, baseType: !422, size: 448)
!625 = !DISubprogram(name: "free", scope: !107, file: !107, line: 565, type: !626, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !82}
!628 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!629 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!630 = !DISubprogram(name: "tzalloc", scope: !376, file: !376, line: 779, type: !631, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!631 = !DISubroutineType(types: !632)
!632 = !{!377, !27}
!633 = !DISubprogram(name: "parse_datetime2", scope: !190, file: !190, line: 29, type: !634, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!634 = !DISubroutineType(types: !635)
!635 = !{!132, !368, !27, !373, !7, !377, !27}
!636 = !DISubprogram(name: "tzfree", scope: !376, file: !376, line: 781, type: !637, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !377}
!639 = !DISubprogram(name: "gettime", scope: !152, file: !152, line: 127, type: !640, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !368}
!642 = !DISubprogram(name: "localtime_rz", scope: !376, file: !376, line: 783, type: !643, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!643 = !DISubroutineType(types: !644)
!644 = !{!645, !377, !187, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!646 = !DISubprogram(name: "fputc", scope: !32, file: !32, line: 521, type: !647, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!647 = !DISubroutineType(types: !648)
!648 = !{!29, !29, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !650, file: !37, line: 51, baseType: !29, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !650, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !650, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !650, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !650, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !650, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !650, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !650, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !650, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !650, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !650, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !650, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !650, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !650, file: !37, line: 70, baseType: !649, size: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !650, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !650, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !650, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !650, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !650, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !650, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !650, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !650, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !650, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !650, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !650, file: !37, line: 93, baseType: !649, size: 64, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !650, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !650, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !650, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !650, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!681 = !DISubprogram(name: "mktime_z", scope: !376, file: !376, line: 789, type: !682, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!682 = !DISubroutineType(types: !683)
!683 = !{!60, !377, !645}
!684 = !DISubprogram(name: "gmtime_r", scope: !169, file: !169, line: 128, type: !685, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!685 = !DISubroutineType(types: !686)
!686 = !{!645, !187, !645}
!687 = !DISubprogram(name: "fputs", scope: !32, file: !32, line: 626, type: !688, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!688 = !DISubroutineType(types: !689)
!689 = !{!29, !27, !649}
!690 = !DISubprogram(name: "nstrftime", scope: !691, file: !691, line: 28, type: !692, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!691 = !DIFile(filename: "./lib/strftime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!692 = !DISubroutineType(types: !693)
!693 = !{!86, !25, !86, !27, !694, !377, !29}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!696 = !{!697, !353, !759, !766, !773, !776, !781, !786, !788, !793, !795, !797, !801, !806, !811, !816, !819, !824, !829, !832, !845}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "yyval_default", scope: !699, file: !584, line: 1647, type: !618, isLocal: true, isDefinition: true)
!699 = distinct !DISubprogram(name: "yyparse", scope: !584, file: !584, line: 1638, type: !700, scopeLine: 1639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !355, retainedNodes: !703)
!700 = !DISubroutineType(types: !701)
!701 = !{!29, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !712, !714, !715, !717, !719, !720, !721, !722, !723, !724, !725, !726, !729, !731, !732, !734, !736, !744, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!704 = !DILocalVariable(name: "pc", arg: 1, scope: !699, file: !584, line: 1638, type: !702)
!705 = !DILocalVariable(name: "yychar", scope: !699, file: !584, line: 1641, type: !29)
!706 = !DILocalVariable(name: "yylval", scope: !699, file: !584, line: 1648, type: !618)
!707 = !DILocalVariable(name: "yynerrs", scope: !699, file: !584, line: 1651, type: !29)
!708 = !DILocalVariable(name: "yystate", scope: !699, file: !584, line: 1653, type: !29)
!709 = !DILocalVariable(name: "yyerrstatus", scope: !699, file: !584, line: 1655, type: !29)
!710 = !DILocalVariable(name: "yyssa", scope: !699, file: !584, line: 1665, type: !711)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 320, elements: !90)
!712 = !DILocalVariable(name: "yyss", scope: !699, file: !584, line: 1666, type: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!714 = !DILocalVariable(name: "yyssp", scope: !699, file: !584, line: 1667, type: !713)
!715 = !DILocalVariable(name: "yyvsa", scope: !699, file: !584, line: 1670, type: !716)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 8960, elements: !90)
!717 = !DILocalVariable(name: "yyvs", scope: !699, file: !584, line: 1671, type: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!719 = !DILocalVariable(name: "yyvsp", scope: !699, file: !584, line: 1672, type: !718)
!720 = !DILocalVariable(name: "yystacksize", scope: !699, file: !584, line: 1674, type: !86)
!721 = !DILocalVariable(name: "yyn", scope: !699, file: !584, line: 1676, type: !29)
!722 = !DILocalVariable(name: "yyresult", scope: !699, file: !584, line: 1677, type: !29)
!723 = !DILocalVariable(name: "yytoken", scope: !699, file: !584, line: 1679, type: !29)
!724 = !DILocalVariable(name: "yyval", scope: !699, file: !584, line: 1682, type: !618)
!725 = !DILocalVariable(name: "yylen", scope: !699, file: !584, line: 1695, type: !29)
!726 = !DILocalVariable(name: "yysize", scope: !727, file: !584, line: 1733, type: !86)
!727 = distinct !DILexicalBlock(scope: !728, file: !584, line: 1731, column: 5)
!728 = distinct !DILexicalBlock(scope: !699, file: !584, line: 1727, column: 7)
!729 = !DILocalVariable(name: "yyss1", scope: !730, file: !584, line: 1763, type: !713)
!730 = distinct !DILexicalBlock(scope: !727, file: !584, line: 1762, column: 7)
!731 = !DILocalVariable(name: "yyptr", scope: !730, file: !584, line: 1764, type: !613)
!732 = !DILocalVariable(name: "yynewbytes", scope: !733, file: !584, line: 1768, type: !86)
!733 = distinct !DILexicalBlock(scope: !730, file: !584, line: 1768, column: 9)
!734 = !DILocalVariable(name: "yynewbytes", scope: !735, file: !584, line: 1769, type: !86)
!735 = distinct !DILexicalBlock(scope: !730, file: !584, line: 1769, column: 9)
!736 = !DILocalVariable(name: "digits", scope: !737, file: !359, line: 819, type: !426)
!737 = distinct !DILexicalBlock(scope: !738, file: !359, line: 818, column: 15)
!738 = distinct !DILexicalBlock(scope: !739, file: !359, line: 817, column: 17)
!739 = distinct !DILexicalBlock(scope: !740, file: !359, line: 816, column: 11)
!740 = distinct !DILexicalBlock(scope: !741, file: !359, line: 815, column: 13)
!741 = distinct !DILexicalBlock(scope: !742, file: !359, line: 809, column: 5)
!742 = !DILexicalBlockFile(scope: !743, file: !359, discriminator: 0)
!743 = distinct !DILexicalBlock(scope: !699, file: !584, line: 1887, column: 5)
!744 = !DILocalVariable(name: "yylhs", scope: !745, file: !584, line: 2514, type: !231)
!745 = distinct !DILexicalBlock(scope: !699, file: !584, line: 2513, column: 3)
!746 = !DILocalVariable(name: "yyi", scope: !745, file: !584, line: 2515, type: !231)
!747 = !DILabel(scope: !699, name: "yynewstate", file: !584, line: 1713)
!748 = !DILabel(scope: !699, name: "yysetstate", file: !584, line: 1722)
!749 = !DILabel(scope: !699, name: "yybackup", file: !584, line: 1796)
!750 = !DILabel(scope: !699, name: "yydefault", file: !584, line: 1860)
!751 = !DILabel(scope: !699, name: "yyreduce", file: !584, line: 1870)
!752 = !DILabel(scope: !699, name: "yyerrlab", file: !584, line: 2527)
!753 = !DILabel(scope: !699, name: "yyerrorlab", file: !584, line: 2601)
!754 = !DILabel(scope: !699, name: "yyerrlab1", file: !584, line: 2619)
!755 = !DILabel(scope: !699, name: "yyacceptlab", file: !584, line: 2663)
!756 = !DILabel(scope: !699, name: "yyabortlab", file: !584, line: 2671)
!757 = !DILabel(scope: !699, name: "yyexhaustedlab", file: !584, line: 2680)
!758 = !DILabel(scope: !699, name: "yyreturn", file: !584, line: 2690)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "yytranslate", scope: !355, file: !584, line: 977, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 2224, elements: !764)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !584, line: 730, baseType: !298)
!764 = !{!765}
!765 = !DISubrange(count: 278)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "yycheck", scope: !355, file: !584, line: 1137, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 904, elements: !771)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !584, line: 736, baseType: !64)
!771 = !{!772}
!772 = !DISubrange(count: 113)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "yytable", scope: !355, file: !584, line: 1121, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 904, elements: !771)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "yydefact", scope: !355, file: !584, line: 1086, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 912, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 114)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "yyr2", scope: !355, file: !584, line: 1187, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 736, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 92)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "yyr1", scope: !355, file: !584, line: 1172, type: !783, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "yypgoto", scope: !355, file: !584, line: 1103, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 208, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 26)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !355, file: !584, line: 1111, type: !790, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "yystos", scope: !355, file: !584, line: 1155, type: !778, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "meridian_table", scope: !355, file: !359, line: 1008, type: !799, isLocal: true, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 640, elements: !232)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !355, file: !359, line: 1022, type: !803, isLocal: true, isDefinition: true)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 3200, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 25)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !355, file: !359, line: 1096, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 512, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 4)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !355, file: !359, line: 1109, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 6144, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 48)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "dst_table", scope: !355, file: !359, line: 1017, type: !818, isLocal: true, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 128, elements: !67)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "time_units_table", scope: !355, file: !359, line: 1051, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 1408, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 11)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !355, file: !359, line: 1067, type: !826, isLocal: true, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 2688, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 21)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "military_table", scope: !355, file: !359, line: 1168, type: !831, isLocal: true, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 3328, elements: !791)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !834, file: !359, line: 343, type: !842, isLocal: true, isDefinition: true)
!834 = distinct !DISubprogram(name: "str_days", scope: !359, file: !359, line: 340, type: !835, scopeLine: 341, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !355, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!27, !702, !25, !29}
!837 = !{!838, !839, !840, !841}
!838 = !DILocalVariable(name: "pc", arg: 1, scope: !834, file: !359, line: 340, type: !702)
!839 = !DILocalVariable(name: "buffer", arg: 2, scope: !834, file: !359, line: 340, type: !25)
!840 = !DILocalVariable(name: "n", arg: 3, scope: !834, file: !359, line: 340, type: !29)
!841 = !DILocalVariable(name: "len", scope: !834, file: !359, line: 370, type: !29)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1232, elements: !843)
!843 = !{!844, !823}
!844 = !DISubrange(count: 14)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "days_values", scope: !834, file: !359, line: 360, type: !847, isLocal: true, isDefinition: true)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 224, elements: !848)
!848 = !{!849, !810}
!849 = !DISubrange(count: 7)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 912, elements: !779)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "program_name", scope: !853, file: !854, line: 33, type: !27, isDefinition: true)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !855, globals: !891, nameTableKind: None)
!854 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!855 = !{!82, !856, !25}
!856 = !DISubprogram(name: "fputs", scope: !32, file: !32, line: 626, type: !857, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!857 = !DISubroutineType(types: !858)
!858 = !{!29, !27, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !860, file: !37, line: 51, baseType: !29, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !860, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !860, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !860, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !860, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !860, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !860, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !860, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !860, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !860, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !860, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !860, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !860, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !860, file: !37, line: 70, baseType: !859, size: 64, offset: 832)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !860, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !860, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !860, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !860, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !860, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !860, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !860, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !860, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !860, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !860, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !860, file: !37, line: 93, baseType: !859, size: 64, offset: 1344)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !860, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !860, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !860, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !860, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!891 = !{!851}
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !894, file: !895, line: 85, type: !1006, isDefinition: true)
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !896, retainedTypes: !917, globals: !979, nameTableKind: None)
!895 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!896 = !{!5, !897, !902}
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!900 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!901 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !903, line: 46, baseType: !7, size: 32, elements: !904)
!903 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!905 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!906 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!907 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!908 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!909 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!910 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!911 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!912 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!913 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!914 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!915 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!916 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!917 = !{!918, !922, !625, !936, !29, !62, !939, !84, !954, !958, !21, !964, !968, !25, !972, !975, !976}
!918 = !DISubprogram(name: "xmemdup", scope: !919, file: !919, line: 62, type: !920, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!919 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!920 = !DISubroutineType(types: !921)
!921 = !{!82, !142, !86}
!922 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !923, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!923 = !DISubroutineType(types: !924)
!924 = !{!25, !27, !86, !925, !926}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !895, line: 65, size: 448, elements: !929)
!929 = !{!930, !931, !932, !934, !935}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !928, file: !895, line: 68, baseType: !5, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !928, file: !895, line: 71, baseType: !29, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !928, file: !895, line: 75, baseType: !933, size: 256, offset: 64)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !226)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !928, file: !895, line: 78, baseType: !27, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !928, file: !895, line: 81, baseType: !27, size: 64, offset: 384)
!936 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !937, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!937 = !DISubroutineType(types: !938)
!938 = !{!25, !29, !27, !27, !27, !86}
!939 = !DISubprogram(name: "rpl_mbrtowc", scope: !940, file: !940, line: 717, type: !941, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!940 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!941 = !DISubroutineType(types: !942)
!942 = !{!86, !126, !27, !86, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !945, line: 13, size: 64, elements: !946)
!945 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !944, file: !945, line: 15, baseType: !29, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !944, file: !945, line: 20, baseType: !949, size: 32, offset: 32)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !944, file: !945, line: 16, size: 32, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !949, file: !945, line: 18, baseType: !7, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !949, file: !945, line: 19, baseType: !953, size: 32)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !809)
!954 = !DISubprogram(name: "iswprint", scope: !955, file: !955, line: 120, type: !956, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!955 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!956 = !DISubroutineType(types: !957)
!957 = !{!29, !7}
!958 = !DISubprogram(name: "mbsinit", scope: !959, file: !959, line: 292, type: !960, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!959 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!960 = !DISubroutineType(types: !961)
!961 = !{!29, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!964 = !DISubprogram(name: "locale_charset", scope: !965, file: !965, line: 35, type: !966, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!965 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!966 = !DISubroutineType(types: !967)
!967 = !{!27}
!968 = !DISubprogram(name: "c_strcasecmp", scope: !969, file: !969, line: 42, type: !970, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!969 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!970 = !DISubroutineType(types: !971)
!971 = !{!29, !27, !27}
!972 = !DISubprogram(name: "xmalloc", scope: !919, file: !919, line: 53, type: !973, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!973 = !DISubroutineType(types: !974)
!974 = !{!82, !86}
!975 = !DISubprogram(name: "xalloc_die", scope: !919, file: !919, line: 51, type: !111, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!976 = !DISubprogram(name: "xrealloc", scope: !919, file: !919, line: 59, type: !977, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!977 = !DISubroutineType(types: !978)
!978 = !{!82, !82, !86}
!979 = !{!892, !980, !986, !988, !990, !995, !1002, !1004}
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !894, file: !895, line: 101, type: !982, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 320, elements: !984)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!984 = !{!985}
!985 = !DISubrange(count: 10)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !894, file: !895, line: 1052, type: !928, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !894, file: !895, line: 116, type: !928, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "slot0", scope: !894, file: !895, line: 842, type: !992, isLocal: true, isDefinition: true)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 256)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "slotvec", scope: !894, file: !895, line: 845, type: !997, isLocal: true, isDefinition: true)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !895, line: 834, size: 128, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !998, file: !895, line: 836, baseType: !84, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !998, file: !895, line: 837, baseType: !25, size: 64, offset: 64)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "nslots", scope: !894, file: !895, line: 843, type: !29, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "slotvec0", scope: !894, file: !895, line: 844, type: !998, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 704, elements: !822)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1009, file: !1010, line: 26, type: !1012, isDefinition: true)
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !1011, nameTableKind: None)
!1010 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1011 = !{!1007}
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 376, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 47)
!1015 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1016, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !1017, nameTableKind: None)
!1016 = !DIFile(filename: "lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1017 = !{!1018, !1022, !203}
!1018 = !DISubprogram(name: "open", scope: !1019, file: !1019, line: 196, type: !1020, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!1019 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
