source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.table = type { i8*, i32, i32 }
%struct.textint = type { i8, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "change_times", scope: !2, file: !3, line: 53, type: !61, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !26)
!3 = !DIFile(filename: "src/touch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !24, !25}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !{!0, !27, !30, !32, !34, !36, !50, !52, !67, !73}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 56, type: !29, isLocal: true, isDefinition: true)
!29 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "use_ref", scope: !2, file: !3, line: 59, type: !29, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "no_dereference", scope: !2, file: !3, line: 62, type: !29, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "amtime_now", scope: !2, file: !3, line: 69, type: !29, isLocal: true, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "newtime", scope: !2, file: !3, line: 72, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !48)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !40, line: 9, size: 128, elements: !41)
!40 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!41 = !{!42, !46}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !39, file: !40, line: 11, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !44, line: 158, baseType: !45)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !39, file: !40, line: 12, baseType: !47, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !44, line: 194, baseType: !45)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 75, type: !24, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 84, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !65)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !57, line: 50, size: 256, elements: !58)
!57 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!58 = !{!59, !60, !62, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !57, line: 52, baseType: !21, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !56, file: !57, line: 55, baseType: !61, size: 32, offset: 64)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !56, file: !57, line: 56, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !56, file: !57, line: 57, baseType: !61, size: 32, offset: 192)
!65 = !{!66}
!66 = !DISubrange(count: 8)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "time_masks", scope: !2, file: !3, line: 103, type: !69, isLocal: true, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 160, elements: !71)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!71 = !{!72}
!72 = !DISubrange(count: 5)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 97, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 384, elements: !77)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!77 = !{!78}
!78 = !DISubrange(count: 6)
!79 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!80 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!81 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!82 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "Version", scope: !85, file: !86, line: 2, type: !21, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !88)
!86 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!87 = !{}
!88 = !{!83}
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !91, file: !96, line: 69, type: !97, isDefinition: true)
!91 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !93, globals: !95)
!92 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!93 = !{!25, !94}
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !{!89}
!96 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !98, line: 55, baseType: !99)
!98 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "file_name", scope: !104, file: !109, line: 46, type: !21, isLocal: true, isDefinition: true)
!104 = distinct !DICompileUnit(language: DW_LANG_C99, file: !105, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !106)
!105 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!106 = !{!102, !107}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !104, file: !109, line: 56, type: !29, isLocal: true, isDefinition: true)
!109 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "exit_failure", scope: !112, file: !115, line: 24, type: !116, isDefinition: true)
!112 = distinct !DICompileUnit(language: DW_LANG_C99, file: !113, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !114)
!113 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!114 = !{!110}
!115 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "yypact", scope: !119, file: !355, line: 1087, type: !515, isLocal: true, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, retainedTypes: !352, globals: !372)
!120 = !DIFile(filename: "./lib/parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!121 = !{!122, !128, !345, !348}
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 167, baseType: !7, size: 32, elements: !124)
!123 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!124 = !{!125, !126, !127}
!125 = !DIEnumerator(name: "MERam", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "MERpm", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "MER24", value: 2, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !129, file: !123, line: 1750, baseType: !7, size: 32, elements: !343)
!129 = distinct !DISubprogram(name: "parse_datetime2", scope: !123, file: !123, line: 1736, type: !130, isDefinition: true, scopeLine: 1739, flags: DIFlagPrototyped, isOptimized: true, unit: !119, retainedNodes: !143)
!130 = !DISubroutineType(types: !131)
!131 = !{!29, !132, !21, !137, !7, !139, !21}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !40, line: 9, size: 128, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !133, file: !40, line: 11, baseType: !43, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !133, file: !40, line: 12, baseType: !47, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !140, line: 742, baseType: !141)
!140 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !140, line: 742, flags: DIFlagFwdDecl)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !165, !166, !170, !174, !175, !176, !177, !178, !179, !182, !183, !184, !185, !200, !203, !206, !207, !213, !214, !215, !216, !266, !268, !272, !273, !274, !281, !284, !285, !291, !292, !293, !296, !299, !300, !301, !309, !312, !313, !314, !315, !318, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !332, !335, !336, !337, !338, !339, !342}
!144 = !DILocalVariable(name: "result", arg: 1, scope: !129, file: !123, line: 1736, type: !132)
!145 = !DILocalVariable(name: "p", arg: 2, scope: !129, file: !123, line: 1736, type: !21)
!146 = !DILocalVariable(name: "now", arg: 3, scope: !129, file: !123, line: 1737, type: !137)
!147 = !DILocalVariable(name: "flags", arg: 4, scope: !129, file: !123, line: 1737, type: !7)
!148 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !129, file: !123, line: 1738, type: !139)
!149 = !DILocalVariable(name: "tzstring", arg: 6, scope: !129, file: !123, line: 1738, type: !21)
!150 = !DILocalVariable(name: "tm", scope: !129, file: !123, line: 1740, type: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !152, line: 7, size: 448, elements: !153)
!152 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !151, file: !152, line: 9, baseType: !61, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !151, file: !152, line: 10, baseType: !61, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !151, file: !152, line: 11, baseType: !61, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !151, file: !152, line: 12, baseType: !61, size: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !151, file: !152, line: 13, baseType: !61, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !151, file: !152, line: 14, baseType: !61, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !151, file: !152, line: 15, baseType: !61, size: 32, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !151, file: !152, line: 16, baseType: !61, size: 32, offset: 224)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !151, file: !152, line: 17, baseType: !61, size: 32, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !151, file: !152, line: 20, baseType: !45, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !151, file: !152, line: 21, baseType: !21, size: 64, offset: 384)
!165 = !DILocalVariable(name: "tm0", scope: !129, file: !123, line: 1741, type: !151)
!166 = !DILocalVariable(name: "time_zone_buf", scope: !129, file: !123, line: 1742, type: !167)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 216, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 27)
!170 = !DILocalVariable(name: "dbg_tm", scope: !129, file: !123, line: 1743, type: !171)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 800, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 100)
!174 = !DILocalVariable(name: "ok", scope: !129, file: !123, line: 1744, type: !29)
!175 = !DILocalVariable(name: "input_sentinel", scope: !129, file: !123, line: 1745, type: !21)
!176 = !DILocalVariable(name: "tz1alloc", scope: !129, file: !123, line: 1746, type: !24)
!177 = !DILocalVariable(name: "tz1buf", scope: !129, file: !123, line: 1751, type: !171)
!178 = !DILocalVariable(name: "gettime_buffer", scope: !129, file: !123, line: 1753, type: !133)
!179 = !DILocalVariable(name: "Start", scope: !129, file: !123, line: 1760, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !181, line: 7, baseType: !43)
!181 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!182 = !DILocalVariable(name: "Start_ns", scope: !129, file: !123, line: 1761, type: !61)
!183 = !DILocalVariable(name: "c", scope: !129, file: !123, line: 1763, type: !94)
!184 = !DILocalVariable(name: "tz", scope: !129, file: !123, line: 1767, type: !139)
!185 = !DILocalVariable(name: "rel_time_0", scope: !129, file: !123, line: 1772, type: !186)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !123, line: 185, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 175, size: 448, elements: !189)
!189 = !{!190, !194, !195, !196, !197, !198, !199}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !188, file: !123, line: 178, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !192, line: 101, baseType: !193)
!192 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !44, line: 71, baseType: !45)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !188, file: !123, line: 179, baseType: !191, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !188, file: !123, line: 180, baseType: !191, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !188, file: !123, line: 181, baseType: !191, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !188, file: !123, line: 182, baseType: !191, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !188, file: !123, line: 183, baseType: !191, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !188, file: !123, line: 184, baseType: !61, size: 32, offset: 384)
!200 = !DILocalVariable(name: "tzbase", scope: !201, file: !123, line: 1776, type: !21)
!201 = distinct !DILexicalBlock(scope: !202, file: !123, line: 1775, column: 5)
!202 = distinct !DILexicalBlock(scope: !129, file: !123, line: 1774, column: 7)
!203 = !DILocalVariable(name: "tzsize", scope: !201, file: !123, line: 1777, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !205, line: 51, baseType: !45)
!205 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!206 = !DILocalVariable(name: "s", scope: !201, file: !123, line: 1778, type: !21)
!207 = !DILocalVariable(name: "tz1", scope: !208, file: !123, line: 1789, type: !139)
!208 = distinct !DILexicalBlock(scope: !209, file: !123, line: 1788, column: 11)
!209 = distinct !DILexicalBlock(scope: !210, file: !123, line: 1787, column: 18)
!210 = distinct !DILexicalBlock(scope: !211, file: !123, line: 1781, column: 13)
!211 = distinct !DILexicalBlock(scope: !212, file: !123, line: 1780, column: 7)
!212 = distinct !DILexicalBlock(scope: !201, file: !123, line: 1780, column: 7)
!213 = !DILocalVariable(name: "tz1string", scope: !208, file: !123, line: 1790, type: !24)
!214 = !DILocalVariable(name: "z", scope: !208, file: !123, line: 1791, type: !24)
!215 = !DILocalVariable(name: "tmp", scope: !129, file: !123, line: 1817, type: !151)
!216 = !DILocalVariable(name: "pc", scope: !129, file: !123, line: 1827, type: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !123, line: 252, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 194, size: 2240, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !218, file: !123, line: 197, baseType: !21, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !218, file: !123, line: 200, baseType: !191, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !218, file: !123, line: 203, baseType: !61, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !218, file: !123, line: 206, baseType: !61, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !218, file: !123, line: 209, baseType: !61, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !218, file: !123, line: 212, baseType: !61, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !218, file: !123, line: 215, baseType: !227, size: 192, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !123, line: 156, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 151, size: 192, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !228, file: !123, line: 153, baseType: !29, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !228, file: !123, line: 154, baseType: !191, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !228, file: !123, line: 155, baseType: !204, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !218, file: !123, line: 216, baseType: !191, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !218, file: !123, line: 217, baseType: !191, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !218, file: !123, line: 218, baseType: !191, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !218, file: !123, line: 219, baseType: !191, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !218, file: !123, line: 220, baseType: !133, size: 128, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !218, file: !123, line: 223, baseType: !187, size: 448, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !218, file: !123, line: 226, baseType: !29, size: 8, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !218, file: !123, line: 227, baseType: !29, size: 8, offset: 1288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !218, file: !123, line: 228, baseType: !204, size: 64, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !218, file: !123, line: 229, baseType: !204, size: 64, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !218, file: !123, line: 230, baseType: !204, size: 64, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !218, file: !123, line: 231, baseType: !204, size: 64, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !218, file: !123, line: 232, baseType: !204, size: 64, offset: 1600)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !218, file: !123, line: 233, baseType: !204, size: 64, offset: 1664)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !218, file: !123, line: 234, baseType: !29, size: 8, offset: 1728)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !218, file: !123, line: 237, baseType: !29, size: 8, offset: 1736)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !218, file: !123, line: 240, baseType: !29, size: 8, offset: 1744)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !218, file: !123, line: 241, baseType: !29, size: 8, offset: 1752)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !218, file: !123, line: 242, baseType: !29, size: 8, offset: 1760)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !218, file: !123, line: 243, baseType: !29, size: 8, offset: 1768)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !218, file: !123, line: 244, baseType: !29, size: 8, offset: 1776)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !218, file: !123, line: 245, baseType: !29, size: 8, offset: 1784)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !218, file: !123, line: 248, baseType: !29, size: 8, offset: 1792)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !218, file: !123, line: 251, baseType: !257, size: 384, offset: 1856)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 384, elements: !264)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !123, line: 164, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 159, size: 128, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !123, line: 161, baseType: !21, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !123, line: 162, baseType: !61, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !259, file: !123, line: 163, baseType: !61, size: 32, offset: 96)
!264 = !{!265}
!265 = !DISubrange(count: 3)
!266 = !DILocalVariable(name: "quarter", scope: !267, file: !123, line: 1873, type: !61)
!267 = distinct !DILexicalBlock(scope: !129, file: !123, line: 1872, column: 3)
!268 = !DILocalVariable(name: "iprobe", scope: !269, file: !123, line: 1876, type: !191)
!269 = distinct !DILexicalBlock(scope: !270, file: !123, line: 1875, column: 7)
!270 = distinct !DILexicalBlock(scope: !271, file: !123, line: 1874, column: 5)
!271 = distinct !DILexicalBlock(scope: !267, file: !123, line: 1874, column: 5)
!272 = !DILocalVariable(name: "probe", scope: !269, file: !123, line: 1880, type: !180)
!273 = !DILocalVariable(name: "probe_tm", scope: !269, file: !123, line: 1881, type: !151)
!274 = !DILocalVariable(name: "mrd", scope: !275, file: !123, line: 2010, type: !21)
!275 = distinct !DILexicalBlock(scope: !276, file: !123, line: 2009, column: 13)
!276 = distinct !DILexicalBlock(scope: !277, file: !123, line: 2008, column: 15)
!277 = distinct !DILexicalBlock(scope: !278, file: !123, line: 2006, column: 9)
!278 = distinct !DILexicalBlock(scope: !279, file: !123, line: 2005, column: 11)
!279 = distinct !DILexicalBlock(scope: !280, file: !123, line: 1977, column: 5)
!280 = distinct !DILexicalBlock(scope: !129, file: !123, line: 1974, column: 7)
!281 = !DILocalVariable(name: "repaired", scope: !282, file: !123, line: 2054, type: !29)
!282 = distinct !DILexicalBlock(scope: !283, file: !123, line: 2053, column: 9)
!283 = distinct !DILexicalBlock(scope: !279, file: !123, line: 2052, column: 11)
!284 = !DILocalVariable(name: "time_zone_seen", scope: !282, file: !123, line: 2055, type: !29)
!285 = !DILocalVariable(name: "tz2buf", scope: !286, file: !123, line: 2068, type: !288)
!286 = distinct !DILexicalBlock(scope: !287, file: !123, line: 2057, column: 13)
!287 = distinct !DILexicalBlock(scope: !282, file: !123, line: 2056, column: 15)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 240, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 30)
!291 = !DILocalVariable(name: "tz2", scope: !286, file: !123, line: 2071, type: !139)
!292 = !DILocalVariable(name: "dbg_ord", scope: !279, file: !123, line: 2097, type: !171)
!293 = !DILocalVariable(name: "dayincr", scope: !294, file: !123, line: 2101, type: !191)
!294 = distinct !DILexicalBlock(scope: !295, file: !123, line: 2100, column: 9)
!295 = distinct !DILexicalBlock(scope: !279, file: !123, line: 2099, column: 11)
!296 = !DILocalVariable(name: "year", scope: !297, file: !123, line: 2166, type: !61)
!297 = distinct !DILexicalBlock(scope: !298, file: !123, line: 2153, column: 9)
!298 = distinct !DILexicalBlock(scope: !279, file: !123, line: 2152, column: 11)
!299 = !DILocalVariable(name: "month", scope: !297, file: !123, line: 2166, type: !61)
!300 = !DILocalVariable(name: "day", scope: !297, file: !123, line: 2166, type: !61)
!301 = !DILocalVariable(name: "tm_year_buf", scope: !302, file: !123, line: 2239, type: !306)
!302 = distinct !DILexicalBlock(scope: !303, file: !123, line: 2236, column: 17)
!303 = distinct !DILexicalBlock(scope: !304, file: !123, line: 2233, column: 19)
!304 = distinct !DILexicalBlock(scope: !305, file: !123, line: 2194, column: 13)
!305 = distinct !DILexicalBlock(scope: !297, file: !123, line: 2193, column: 15)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 104, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 13)
!309 = !DILocalVariable(name: "delta", scope: !310, file: !123, line: 2254, type: !191)
!310 = distinct !DILexicalBlock(scope: !311, file: !123, line: 2253, column: 9)
!311 = distinct !DILexicalBlock(scope: !279, file: !123, line: 2252, column: 11)
!312 = !DILocalVariable(name: "t1", scope: !310, file: !123, line: 2254, type: !191)
!313 = !DILocalVariable(name: "overflow", scope: !310, file: !123, line: 2255, type: !29)
!314 = !DILocalVariable(name: "utcoff", scope: !310, file: !123, line: 2257, type: !45)
!315 = !DILocalVariable(name: "Starti", scope: !316, file: !123, line: 2279, type: !191)
!316 = distinct !DILexicalBlock(scope: !317, file: !123, line: 2278, column: 9)
!317 = distinct !DILexicalBlock(scope: !279, file: !123, line: 2277, column: 11)
!318 = !DILocalVariable(name: "orig_ns", scope: !319, file: !123, line: 2294, type: !191)
!319 = distinct !DILexicalBlock(scope: !279, file: !123, line: 2293, column: 7)
!320 = !DILocalVariable(name: "sum_ns", scope: !319, file: !123, line: 2295, type: !191)
!321 = !DILocalVariable(name: "normalized_ns", scope: !319, file: !123, line: 2296, type: !61)
!322 = !DILocalVariable(name: "d4", scope: !319, file: !123, line: 2297, type: !61)
!323 = !DILocalVariable(name: "d1", scope: !319, file: !123, line: 2298, type: !191)
!324 = !DILocalVariable(name: "t1", scope: !319, file: !123, line: 2298, type: !191)
!325 = !DILocalVariable(name: "d2", scope: !319, file: !123, line: 2298, type: !191)
!326 = !DILocalVariable(name: "t2", scope: !319, file: !123, line: 2298, type: !191)
!327 = !DILocalVariable(name: "t3", scope: !319, file: !123, line: 2298, type: !191)
!328 = !DILocalVariable(name: "t4", scope: !319, file: !123, line: 2298, type: !191)
!329 = !DILocalVariable(name: "lmt", scope: !330, file: !123, line: 2337, type: !151)
!330 = distinct !DILexicalBlock(scope: !331, file: !123, line: 2318, column: 11)
!331 = distinct !DILexicalBlock(scope: !319, file: !123, line: 2316, column: 13)
!332 = !DILocalVariable(name: "sec", scope: !333, file: !123, line: 2356, type: !191)
!333 = distinct !DILexicalBlock(scope: !334, file: !123, line: 2347, column: 5)
!334 = distinct !DILexicalBlock(scope: !129, file: !123, line: 2346, column: 7)
!335 = !DILocalVariable(name: "nsec", scope: !333, file: !123, line: 2357, type: !61)
!336 = !DILocalVariable(name: "gmt", scope: !333, file: !123, line: 2361, type: !151)
!337 = !DILocalVariable(name: "lmt", scope: !333, file: !123, line: 2361, type: !151)
!338 = !DILocalVariable(name: "got_utc", scope: !333, file: !123, line: 2362, type: !29)
!339 = !DILocalVariable(name: "got_utcoff", scope: !340, file: !123, line: 2370, type: !29)
!340 = distinct !DILexicalBlock(scope: !341, file: !123, line: 2368, column: 9)
!341 = distinct !DILexicalBlock(scope: !333, file: !123, line: 2367, column: 11)
!342 = !DILocalVariable(name: "utcoff", scope: !340, file: !123, line: 2371, type: !45)
!343 = !{!344}
!344 = !DIEnumerator(name: "TZBUFSIZE", value: 100, isUnsigned: true)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 1246, baseType: !7, size: 32, elements: !346)
!346 = !{!347}
!347 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 172, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!351 = !DIEnumerator(name: "LOG10_BILLION", value: 9, isUnsigned: true)
!352 = !{!353, !7, !368, !359, !61, !45, !369, !370, !371, !180}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !355, line: 918, size: 448, elements: !356)
!355 = !DIFile(filename: "parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!356 = !{!357, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !354, file: !355, line: 920, baseType: !358, size: 16)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !355, line: 761, baseType: !359)
!359 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !354, file: !355, line: 921, baseType: !361, size: 448)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !355, line: 721, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !355, line: 709, size: 448, elements: !363)
!363 = !{!364, !365, !366, !367}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !362, file: !123, line: 577, baseType: !191, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !362, file: !123, line: 578, baseType: !227, size: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !362, file: !123, line: 579, baseType: !133, size: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !362, file: !123, line: 580, baseType: !187, size: 448)
!368 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!369 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!370 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!371 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!372 = !{!373, !117, !422, !429, !436, !439, !444, !449, !451, !456, !458, !460, !464, !469, !474, !479, !484, !489, !494, !497, !510}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "yyval_default", scope: !375, file: !355, line: 1662, type: !361, isLocal: true, isDefinition: true)
!375 = distinct !DISubprogram(name: "yyparse", scope: !355, file: !355, line: 1653, type: !376, isDefinition: true, scopeLine: 1654, flags: DIFlagPrototyped, isOptimized: true, unit: !119, retainedNodes: !379)
!376 = !DISubroutineType(types: !377)
!377 = !{!61, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !390, !392, !393, !395, !397, !398, !399, !400, !401, !402, !403, !404, !407, !409, !410, !412, !414}
!380 = !DILocalVariable(name: "pc", arg: 1, scope: !375, file: !355, line: 1653, type: !378)
!381 = !DILocalVariable(name: "yychar", scope: !375, file: !355, line: 1656, type: !61)
!382 = !DILocalVariable(name: "yylval", scope: !375, file: !355, line: 1663, type: !361)
!383 = !DILocalVariable(name: "yynerrs", scope: !375, file: !355, line: 1666, type: !61)
!384 = !DILocalVariable(name: "yystate", scope: !375, file: !355, line: 1668, type: !61)
!385 = !DILocalVariable(name: "yyerrstatus", scope: !375, file: !355, line: 1670, type: !61)
!386 = !DILocalVariable(name: "yyssa", scope: !375, file: !355, line: 1680, type: !387)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 20)
!390 = !DILocalVariable(name: "yyss", scope: !375, file: !355, line: 1681, type: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!392 = !DILocalVariable(name: "yyssp", scope: !375, file: !355, line: 1682, type: !391)
!393 = !DILocalVariable(name: "yyvsa", scope: !375, file: !355, line: 1685, type: !394)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 8960, elements: !388)
!395 = !DILocalVariable(name: "yyvs", scope: !375, file: !355, line: 1686, type: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!397 = !DILocalVariable(name: "yyvsp", scope: !375, file: !355, line: 1687, type: !396)
!398 = !DILocalVariable(name: "yystacksize", scope: !375, file: !355, line: 1689, type: !369)
!399 = !DILocalVariable(name: "yyn", scope: !375, file: !355, line: 1691, type: !61)
!400 = !DILocalVariable(name: "yyresult", scope: !375, file: !355, line: 1692, type: !61)
!401 = !DILocalVariable(name: "yytoken", scope: !375, file: !355, line: 1694, type: !61)
!402 = !DILocalVariable(name: "yyval", scope: !375, file: !355, line: 1697, type: !361)
!403 = !DILocalVariable(name: "yylen", scope: !375, file: !355, line: 1710, type: !61)
!404 = !DILocalVariable(name: "yysize", scope: !405, file: !355, line: 1738, type: !369)
!405 = distinct !DILexicalBlock(scope: !406, file: !355, line: 1736, column: 5)
!406 = distinct !DILexicalBlock(scope: !375, file: !355, line: 1735, column: 7)
!407 = !DILocalVariable(name: "yyss1", scope: !408, file: !355, line: 1772, type: !391)
!408 = distinct !DILexicalBlock(scope: !405, file: !355, line: 1771, column: 7)
!409 = !DILocalVariable(name: "yyptr", scope: !408, file: !355, line: 1773, type: !353)
!410 = !DILocalVariable(name: "yynewbytes", scope: !411, file: !355, line: 1777, type: !369)
!411 = distinct !DILexicalBlock(scope: !408, file: !355, line: 1777, column: 9)
!412 = !DILocalVariable(name: "yynewbytes", scope: !413, file: !355, line: 1778, type: !369)
!413 = distinct !DILexicalBlock(scope: !408, file: !355, line: 1778, column: 9)
!414 = !DILocalVariable(name: "digits", scope: !415, file: !123, line: 819, type: !191)
!415 = distinct !DILexicalBlock(scope: !416, file: !123, line: 818, column: 15)
!416 = distinct !DILexicalBlock(scope: !417, file: !123, line: 817, column: 17)
!417 = distinct !DILexicalBlock(scope: !418, file: !123, line: 816, column: 11)
!418 = distinct !DILexicalBlock(scope: !419, file: !123, line: 815, column: 13)
!419 = distinct !DILexicalBlock(scope: !420, file: !123, line: 809, column: 5)
!420 = !DILexicalBlockFile(scope: !421, file: !123, discriminator: 0)
!421 = distinct !DILexicalBlock(scope: !375, file: !355, line: 1899, column: 5)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "yytranslate", scope: !119, file: !355, line: 997, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 2224, elements: !427)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !355, line: 743, baseType: !94)
!427 = !{!428}
!428 = !DISubrange(count: 278)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "yycheck", scope: !119, file: !355, line: 1157, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 904, elements: !434)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !355, line: 749, baseType: !368)
!434 = !{!435}
!435 = !DISubrange(count: 113)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "yytable", scope: !119, file: !355, line: 1141, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 904, elements: !434)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "yydefact", scope: !119, file: !355, line: 1106, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 912, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 114)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "yyr2", scope: !119, file: !355, line: 1207, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 736, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 92)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "yyr1", scope: !119, file: !355, line: 1192, type: !446, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "yypgoto", scope: !119, file: !355, line: 1123, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 208, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 26)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !119, file: !355, line: 1131, type: !453, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "yystos", scope: !119, file: !355, line: 1175, type: !441, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "meridian_table", scope: !119, file: !123, line: 1008, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 640, elements: !71)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !119, file: !123, line: 1022, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 3200, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 25)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !119, file: !123, line: 1096, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 512, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 4)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !119, file: !123, line: 1109, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 6144, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 48)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "dst_table", scope: !119, file: !123, line: 1017, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 128, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 1)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "time_units_table", scope: !119, file: !123, line: 1051, type: !486, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1408, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 11)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !119, file: !123, line: 1067, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 2688, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 21)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "military_table", scope: !119, file: !123, line: 1165, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 3328, elements: !454)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !499, file: !123, line: 343, type: !507, isLocal: true, isDefinition: true)
!499 = distinct !DISubprogram(name: "str_days", scope: !123, file: !123, line: 340, type: !500, isLocal: true, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, unit: !119, retainedNodes: !502)
!500 = !DISubroutineType(types: !501)
!501 = !{!21, !378, !24, !61}
!502 = !{!503, !504, !505, !506}
!503 = !DILocalVariable(name: "pc", arg: 1, scope: !499, file: !123, line: 340, type: !378)
!504 = !DILocalVariable(name: "buffer", arg: 2, scope: !499, file: !123, line: 340, type: !24)
!505 = !DILocalVariable(name: "n", arg: 3, scope: !499, file: !123, line: 340, type: !61)
!506 = !DILocalVariable(name: "len", scope: !499, file: !123, line: 370, type: !61)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1232, elements: !508)
!508 = !{!509, !488}
!509 = !DISubrange(count: 14)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "days_values", scope: !499, file: !123, line: 360, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 224, elements: !513)
!513 = !{!514, !473}
!514 = !DISubrange(count: 7)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 912, elements: !442)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "program_name", scope: !518, file: !522, line: 33, type: !21, isDefinition: true)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !520, globals: !521)
!519 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!520 = !{!25, !24}
!521 = !{!516}
!522 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !525, file: !554, line: 85, type: !587, isDefinition: true)
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !527, retainedTypes: !548, globals: !551)
!526 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!527 = !{!5, !528, !533}
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!531 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!532 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !534, line: 46, baseType: !7, size: 32, elements: !535)
!534 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!536 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!537 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!538 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!539 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!540 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!541 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!542 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!543 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!544 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!545 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!546 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!547 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!548 = !{!61, !549, !550, !24}
!549 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !205, line: 62, baseType: !369)
!551 = !{!523, !552, !559, !569, !571, !576, !583, !585}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !525, file: !554, line: 101, type: !555, isDefinition: true)
!554 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 320, elements: !557)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!557 = !{!558}
!558 = !DISubrange(count: 10)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !525, file: !554, line: 1052, type: !561, isDefinition: true)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !554, line: 65, size: 448, elements: !562)
!562 = !{!563, !564, !565, !567, !568}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !561, file: !554, line: 68, baseType: !5, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !561, file: !554, line: 71, baseType: !61, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !561, file: !554, line: 75, baseType: !566, size: 256, offset: 64)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !65)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !561, file: !554, line: 78, baseType: !21, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !561, file: !554, line: 81, baseType: !21, size: 64, offset: 384)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !525, file: !554, line: 116, type: !561, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "slot0", scope: !525, file: !554, line: 842, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 256)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "slotvec", scope: !525, file: !554, line: 845, type: !578, isLocal: true, isDefinition: true)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !554, line: 834, size: 128, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !554, line: 836, baseType: !550, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !579, file: !554, line: 837, baseType: !24, size: 64, offset: 64)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "nslots", scope: !525, file: !554, line: 843, type: !61, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "slotvec0", scope: !525, file: !554, line: 844, type: !579, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 704, elements: !487)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !590, file: !593, line: 26, type: !594, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !592)
!591 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!592 = !{!588}
!593 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 376, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 47)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!598 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!600 = !DIFile(filename: "./lib/fdutimensat.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!602 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !605)
!604 = !DIFile(filename: "./lib/posixtm.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!605 = !{!180, !7}
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!607 = !DIFile(filename: "./lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !610, retainedTypes: !615)
!609 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!610 = !{!611}
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !612, line: 41, baseType: !7, size: 32, elements: !613)
!612 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!613 = !{!614}
!614 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!615 = !{!25}
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !618, retainedTypes: !632)
!617 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!618 = !{!619}
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !621, file: !620, line: 186, baseType: !7, size: 32, elements: !630)
!620 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!621 = distinct !DISubprogram(name: "x2nrealloc", scope: !620, file: !620, line: 174, type: !622, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !616, retainedNodes: !625)
!622 = !DISubroutineType(types: !623)
!623 = !{!25, !25, !624, !550}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!625 = !{!626, !627, !628, !629}
!626 = !DILocalVariable(name: "p", arg: 1, scope: !621, file: !620, line: 174, type: !25)
!627 = !DILocalVariable(name: "pn", arg: 2, scope: !621, file: !620, line: 174, type: !624)
!628 = !DILocalVariable(name: "s", arg: 3, scope: !621, file: !620, line: 174, type: !550)
!629 = !DILocalVariable(name: "n", scope: !621, file: !620, line: 176, type: !550)
!630 = !{!631}
!631 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!632 = !{!550, !24, !25}
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!634 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !615)
!636 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !639)
!638 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!639 = !{!550}
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !642, retainedTypes: !647, globals: !648)
!641 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!642 = !{!643}
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !644, line: 50, baseType: !7, size: 32, elements: !645)
!644 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!645 = !{!646}
!646 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!647 = !{!24, !550}
!648 = !{!649}
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "local_tz", scope: !640, file: !644, line: 55, type: !651, isLocal: true, isDefinition: true)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !140, line: 742, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !655, line: 21, size: 128, elements: !656)
!655 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !655, line: 25, baseType: !653, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !654, file: !655, line: 36, baseType: !23, size: 8, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !654, file: !655, line: 48, baseType: !660, offset: 72)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: -1)
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!664 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!666 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!667 = distinct !DICompileUnit(language: DW_LANG_C99, file: !668, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !669, retainedTypes: !615)
!668 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!669 = !{!670}
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !671, line: 41, baseType: !7, size: 32, elements: !672)
!671 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!673 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!674 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!675 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!676 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!677 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!678 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!679 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!680 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!681 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!682 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!683 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!684 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!685 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!686 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!687 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!688 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!689 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!690 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!691 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!692 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!693 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!694 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!695 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!696 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!697 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!698 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!699 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!700 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!701 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!702 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!703 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!704 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!705 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!706 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!707 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!708 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!709 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!710 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!711 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!712 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!713 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!714 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!715 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!716 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!717 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!718 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!719 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!720 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!721 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!722 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!781 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!784 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!785 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!786 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!787 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!788 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!789 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!790 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!791 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!792 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!793 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!794 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!795 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!868 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!941 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!942 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!943 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!944 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!945 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!946 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!947 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!948 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!949 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!950 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!951 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!952 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!953 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!954 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!955 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!957 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!958 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!959 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!960 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!961 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!962 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!988 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!989 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!990 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!991 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!992 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!997 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!998 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!999 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!1000 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1037 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1038 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1039 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1040 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1041 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1042 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1043 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1044 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1045 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1046 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1047 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1048 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1049 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1050 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1051 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1052 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1053 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1054 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1055 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1056 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1057, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !1058)
!1057 = !DIFile(filename: "./lib/nstrftime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1058 = !{!21, !7, !550, !25, !1059, !61, !94}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1061 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1062, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!1062 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1063 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1064, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !615)
!1064 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1065 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1066, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !615)
!1066 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1067 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!1068 = !{i32 2, !"Dwarf Version", i32 4}
!1069 = !{i32 2, !"Debug Info Version", i32 3}
!1070 = !{i32 1, !"wchar_size", i32 4}
!1071 = !{i32 7, !"PIC Level", i32 2}
!1072 = !{i32 7, !"PIE Level", i32 2}
!1073 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 207, type: !1074, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !1076)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !61}
!1076 = !{!1077}
!1077 = !DILocalVariable(name: "status", arg: 1, scope: !1073, file: !3, line: 207, type: !61)
!1078 = !DILocalVariable(name: "infomap", scope: !1079, file: !1080, line: 632, type: !1094)
!1079 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !1080, file: !1080, line: 630, type: !1081, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1083)
!1080 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !21}
!1083 = !{!1084, !1078, !1085, !1086, !1093}
!1084 = !DILocalVariable(name: "program", arg: 1, scope: !1079, file: !1080, line: 630, type: !21)
!1085 = !DILocalVariable(name: "node", scope: !1079, file: !1080, line: 642, type: !21)
!1086 = !DILocalVariable(name: "map_prog", scope: !1079, file: !1080, line: 643, type: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
