; ModuleID = 'coreutils-8.32/src/touch.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.table = type { i8*, i32, i32 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.parser_control = type { i8*, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "change_times", scope: !2, file: !3, line: 53, type: !63, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/touch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !23, !25}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !{!0, !27, !30, !32, !34, !36, !50, !52, !69, !75}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 56, type: !29, isLocal: true, isDefinition: true)
!29 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "use_ref", scope: !2, file: !3, line: 59, type: !29, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "no_dereference", scope: !2, file: !3, line: 62, type: !29, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "amtime_now", scope: !2, file: !3, line: 69, type: !29, isLocal: true, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "newtime", scope: !2, file: !3, line: 72, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !48)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !40, line: 10, size: 128, elements: !41)
!40 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!41 = !{!42, !46}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !39, file: !40, line: 12, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !44, line: 160, baseType: !45)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !39, file: !40, line: 16, baseType: !47, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !44, line: 197, baseType: !45)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 75, type: !23, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 84, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !67)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !57, line: 50, size: 256, elements: !58)
!57 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!58 = !{!59, !62, !64, !66}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !57, line: 52, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !56, file: !57, line: 55, baseType: !63, size: 32, offset: 64)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !56, file: !57, line: 56, baseType: !65, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !56, file: !57, line: 57, baseType: !63, size: 32, offset: 192)
!67 = !{!68}
!68 = !DISubrange(count: 8)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "time_masks", scope: !2, file: !3, line: 103, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, elements: !73)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!73 = !{!74}
!74 = !DISubrange(count: 5)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 97, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 384, elements: !79)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!79 = !{!80}
!80 = !DISubrange(count: 6)
!81 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!82 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!83 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!84 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "Version", scope: !87, file: !88, line: 2, type: !60, isLocal: false, isDefinition: true)
!87 = distinct !DICompileUnit(language: DW_LANG_C99, file: !88, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, globals: !90, splitDebugInlining: false, nameTableKind: None)
!88 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!89 = !{}
!90 = !{!85}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !93, file: !94, line: 67, type: !98, isLocal: false, isDefinition: true)
!93 = distinct !DICompileUnit(language: DW_LANG_C99, file: !94, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !95, globals: !97, splitDebugInlining: false, nameTableKind: None)
!94 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!95 = !{!25, !60, !96}
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !{!91}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !99, line: 61, baseType: !100)
!99 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "file_name", scope: !105, file: !106, line: 46, type: !60, isLocal: true, isDefinition: true)
!105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !106, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, globals: !107, splitDebugInlining: false, nameTableKind: None)
!106 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!107 = !{!103, !108}
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !105, file: !106, line: 56, type: !29, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "exit_failure", scope: !112, file: !113, line: 24, type: !115, isLocal: false, isDefinition: true)
!112 = distinct !DICompileUnit(language: DW_LANG_C99, file: !113, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, globals: !114, splitDebugInlining: false, nameTableKind: None)
!113 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !{!110}
!115 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "yypact", scope: !118, file: !349, line: 1067, type: !553, isLocal: true, isDefinition: true)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !375, globals: !395, splitDebugInlining: false, nameTableKind: None)
!119 = !DIFile(filename: "lib/parse-datetime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!120 = !{!121, !127, !345, !348, !371}
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !122, line: 167, baseType: !7, size: 32, elements: !123)
!122 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "MERam", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "MERpm", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "MER24", value: 2, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !128, file: !122, line: 1746, baseType: !7, size: 32, elements: !343)
!128 = distinct !DISubprogram(name: "parse_datetime2", scope: !122, file: !122, line: 1732, type: !129, scopeLine: 1735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !118, retainedNodes: !142)
!129 = !DISubroutineType(types: !130)
!130 = !{!29, !131, !60, !136, !7, !138, !60}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !40, line: 10, size: 128, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !132, file: !40, line: 12, baseType: !43, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !132, file: !40, line: 16, baseType: !47, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !139, line: 778, baseType: !140)
!139 = !DIFile(filename: "./lib/time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !139, line: 778, flags: DIFlagFwdDecl)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !164, !165, !169, !173, !174, !175, !176, !177, !178, !181, !182, !183, !184, !199, !202, !205, !206, !212, !213, !214, !215, !265, !267, !271, !272, !273, !280, !283, !284, !290, !291, !292, !295, !298, !299, !300, !308, !311, !312, !313, !314, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !331, !334, !335, !336, !337, !338, !341, !342}
!143 = !DILocalVariable(name: "result", arg: 1, scope: !128, file: !122, line: 1732, type: !131)
!144 = !DILocalVariable(name: "p", arg: 2, scope: !128, file: !122, line: 1732, type: !60)
!145 = !DILocalVariable(name: "now", arg: 3, scope: !128, file: !122, line: 1733, type: !136)
!146 = !DILocalVariable(name: "flags", arg: 4, scope: !128, file: !122, line: 1733, type: !7)
!147 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !128, file: !122, line: 1734, type: !138)
!148 = !DILocalVariable(name: "tzstring", arg: 6, scope: !128, file: !122, line: 1734, type: !60)
!149 = !DILocalVariable(name: "tm", scope: !128, file: !122, line: 1736, type: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !151, line: 7, size: 448, elements: !152)
!151 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !150, file: !151, line: 9, baseType: !63, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !150, file: !151, line: 10, baseType: !63, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !150, file: !151, line: 11, baseType: !63, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !150, file: !151, line: 12, baseType: !63, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !150, file: !151, line: 13, baseType: !63, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !150, file: !151, line: 14, baseType: !63, size: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !150, file: !151, line: 15, baseType: !63, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !150, file: !151, line: 16, baseType: !63, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !150, file: !151, line: 17, baseType: !63, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !150, file: !151, line: 20, baseType: !45, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !150, file: !151, line: 21, baseType: !60, size: 64, offset: 384)
!164 = !DILocalVariable(name: "tm0", scope: !128, file: !122, line: 1737, type: !150)
!165 = !DILocalVariable(name: "time_zone_buf", scope: !128, file: !122, line: 1738, type: !166)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 216, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 27)
!169 = !DILocalVariable(name: "dbg_tm", scope: !128, file: !122, line: 1739, type: !170)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 800, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 100)
!173 = !DILocalVariable(name: "ok", scope: !128, file: !122, line: 1740, type: !29)
!174 = !DILocalVariable(name: "input_sentinel", scope: !128, file: !122, line: 1741, type: !60)
!175 = !DILocalVariable(name: "tz1alloc", scope: !128, file: !122, line: 1742, type: !23)
!176 = !DILocalVariable(name: "tz1buf", scope: !128, file: !122, line: 1747, type: !170)
!177 = !DILocalVariable(name: "gettime_buffer", scope: !128, file: !122, line: 1749, type: !132)
!178 = !DILocalVariable(name: "Start", scope: !128, file: !122, line: 1756, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !180, line: 7, baseType: !43)
!180 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!181 = !DILocalVariable(name: "Start_ns", scope: !128, file: !122, line: 1757, type: !63)
!182 = !DILocalVariable(name: "c", scope: !128, file: !122, line: 1759, type: !96)
!183 = !DILocalVariable(name: "tz", scope: !128, file: !122, line: 1763, type: !138)
!184 = !DILocalVariable(name: "rel_time_0", scope: !128, file: !122, line: 1768, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !122, line: 185, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 175, size: 448, elements: !188)
!188 = !{!189, !193, !194, !195, !196, !197, !198}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !187, file: !122, line: 178, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !191, line: 101, baseType: !192)
!191 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !44, line: 72, baseType: !45)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !187, file: !122, line: 179, baseType: !190, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !187, file: !122, line: 180, baseType: !190, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !187, file: !122, line: 181, baseType: !190, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !187, file: !122, line: 182, baseType: !190, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !187, file: !122, line: 183, baseType: !190, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !187, file: !122, line: 184, baseType: !63, size: 32, offset: 384)
!199 = !DILocalVariable(name: "tzbase", scope: !200, file: !122, line: 1772, type: !60)
!200 = distinct !DILexicalBlock(scope: !201, file: !122, line: 1771, column: 5)
!201 = distinct !DILexicalBlock(scope: !128, file: !122, line: 1770, column: 7)
!202 = !DILocalVariable(name: "tzsize", scope: !200, file: !122, line: 1773, type: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !204, line: 35, baseType: !45)
!204 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!205 = !DILocalVariable(name: "s", scope: !200, file: !122, line: 1774, type: !60)
!206 = !DILocalVariable(name: "tz1", scope: !207, file: !122, line: 1785, type: !138)
!207 = distinct !DILexicalBlock(scope: !208, file: !122, line: 1784, column: 11)
!208 = distinct !DILexicalBlock(scope: !209, file: !122, line: 1783, column: 18)
!209 = distinct !DILexicalBlock(scope: !210, file: !122, line: 1777, column: 13)
!210 = distinct !DILexicalBlock(scope: !211, file: !122, line: 1776, column: 7)
!211 = distinct !DILexicalBlock(scope: !200, file: !122, line: 1776, column: 7)
!212 = !DILocalVariable(name: "tz1string", scope: !207, file: !122, line: 1786, type: !23)
!213 = !DILocalVariable(name: "z", scope: !207, file: !122, line: 1787, type: !23)
!214 = !DILocalVariable(name: "tmp", scope: !128, file: !122, line: 1813, type: !150)
!215 = !DILocalVariable(name: "pc", scope: !128, file: !122, line: 1823, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !122, line: 252, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 194, size: 2240, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !217, file: !122, line: 197, baseType: !60, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !217, file: !122, line: 200, baseType: !190, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !217, file: !122, line: 203, baseType: !63, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !217, file: !122, line: 206, baseType: !63, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !217, file: !122, line: 209, baseType: !63, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !217, file: !122, line: 212, baseType: !63, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !217, file: !122, line: 215, baseType: !226, size: 192, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !122, line: 156, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 151, size: 192, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !227, file: !122, line: 153, baseType: !29, size: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !227, file: !122, line: 154, baseType: !190, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !227, file: !122, line: 155, baseType: !203, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !217, file: !122, line: 216, baseType: !190, size: 64, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !217, file: !122, line: 217, baseType: !190, size: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !217, file: !122, line: 218, baseType: !190, size: 64, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !217, file: !122, line: 219, baseType: !190, size: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !217, file: !122, line: 220, baseType: !132, size: 128, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !217, file: !122, line: 223, baseType: !186, size: 448, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !217, file: !122, line: 226, baseType: !29, size: 8, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !217, file: !122, line: 227, baseType: !29, size: 8, offset: 1288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !217, file: !122, line: 228, baseType: !203, size: 64, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !217, file: !122, line: 229, baseType: !203, size: 64, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !217, file: !122, line: 230, baseType: !203, size: 64, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !217, file: !122, line: 231, baseType: !203, size: 64, offset: 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !217, file: !122, line: 232, baseType: !203, size: 64, offset: 1600)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !217, file: !122, line: 233, baseType: !203, size: 64, offset: 1664)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !217, file: !122, line: 234, baseType: !29, size: 8, offset: 1728)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !217, file: !122, line: 237, baseType: !29, size: 8, offset: 1736)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !217, file: !122, line: 240, baseType: !29, size: 8, offset: 1744)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !217, file: !122, line: 241, baseType: !29, size: 8, offset: 1752)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !217, file: !122, line: 242, baseType: !29, size: 8, offset: 1760)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !217, file: !122, line: 243, baseType: !29, size: 8, offset: 1768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !217, file: !122, line: 244, baseType: !29, size: 8, offset: 1776)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !217, file: !122, line: 245, baseType: !29, size: 8, offset: 1784)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !217, file: !122, line: 248, baseType: !29, size: 8, offset: 1792)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !217, file: !122, line: 251, baseType: !256, size: 384, offset: 1856)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 384, elements: !263)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !122, line: 164, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 159, size: 128, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !122, line: 161, baseType: !60, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !122, line: 162, baseType: !63, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !258, file: !122, line: 163, baseType: !63, size: 32, offset: 96)
!263 = !{!264}
!264 = !DISubrange(count: 3)
!265 = !DILocalVariable(name: "quarter", scope: !266, file: !122, line: 1869, type: !63)
!266 = distinct !DILexicalBlock(scope: !128, file: !122, line: 1868, column: 3)
!267 = !DILocalVariable(name: "iprobe", scope: !268, file: !122, line: 1872, type: !190)
!268 = distinct !DILexicalBlock(scope: !269, file: !122, line: 1871, column: 7)
!269 = distinct !DILexicalBlock(scope: !270, file: !122, line: 1870, column: 5)
!270 = distinct !DILexicalBlock(scope: !266, file: !122, line: 1870, column: 5)
!271 = !DILocalVariable(name: "probe", scope: !268, file: !122, line: 1876, type: !179)
!272 = !DILocalVariable(name: "probe_tm", scope: !268, file: !122, line: 1877, type: !150)
!273 = !DILocalVariable(name: "mrd", scope: !274, file: !122, line: 2006, type: !60)
!274 = distinct !DILexicalBlock(scope: !275, file: !122, line: 2005, column: 13)
!275 = distinct !DILexicalBlock(scope: !276, file: !122, line: 2004, column: 15)
!276 = distinct !DILexicalBlock(scope: !277, file: !122, line: 2002, column: 9)
!277 = distinct !DILexicalBlock(scope: !278, file: !122, line: 2001, column: 11)
!278 = distinct !DILexicalBlock(scope: !279, file: !122, line: 1973, column: 5)
!279 = distinct !DILexicalBlock(scope: !128, file: !122, line: 1970, column: 7)
!280 = !DILocalVariable(name: "repaired", scope: !281, file: !122, line: 2051, type: !29)
!281 = distinct !DILexicalBlock(scope: !282, file: !122, line: 2050, column: 9)
!282 = distinct !DILexicalBlock(scope: !278, file: !122, line: 2049, column: 11)
!283 = !DILocalVariable(name: "time_zone_seen", scope: !281, file: !122, line: 2052, type: !29)
!284 = !DILocalVariable(name: "tz2buf", scope: !285, file: !122, line: 2065, type: !287)
!285 = distinct !DILexicalBlock(scope: !286, file: !122, line: 2054, column: 13)
!286 = distinct !DILexicalBlock(scope: !281, file: !122, line: 2053, column: 15)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 240, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 30)
!290 = !DILocalVariable(name: "tz2", scope: !285, file: !122, line: 2068, type: !138)
!291 = !DILocalVariable(name: "dbg_ord", scope: !278, file: !122, line: 2095, type: !170)
!292 = !DILocalVariable(name: "dayincr", scope: !293, file: !122, line: 2099, type: !190)
!293 = distinct !DILexicalBlock(scope: !294, file: !122, line: 2098, column: 9)
!294 = distinct !DILexicalBlock(scope: !278, file: !122, line: 2097, column: 11)
!295 = !DILocalVariable(name: "year", scope: !296, file: !122, line: 2164, type: !63)
!296 = distinct !DILexicalBlock(scope: !297, file: !122, line: 2151, column: 9)
!297 = distinct !DILexicalBlock(scope: !278, file: !122, line: 2150, column: 11)
!298 = !DILocalVariable(name: "month", scope: !296, file: !122, line: 2164, type: !63)
!299 = !DILocalVariable(name: "day", scope: !296, file: !122, line: 2164, type: !63)
!300 = !DILocalVariable(name: "tm_year_buf", scope: !301, file: !122, line: 2237, type: !305)
!301 = distinct !DILexicalBlock(scope: !302, file: !122, line: 2234, column: 17)
!302 = distinct !DILexicalBlock(scope: !303, file: !122, line: 2231, column: 19)
!303 = distinct !DILexicalBlock(scope: !304, file: !122, line: 2192, column: 13)
!304 = distinct !DILexicalBlock(scope: !296, file: !122, line: 2191, column: 15)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 104, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 13)
!308 = !DILocalVariable(name: "delta", scope: !309, file: !122, line: 2252, type: !190)
!309 = distinct !DILexicalBlock(scope: !310, file: !122, line: 2251, column: 9)
!310 = distinct !DILexicalBlock(scope: !278, file: !122, line: 2250, column: 11)
!311 = !DILocalVariable(name: "t1", scope: !309, file: !122, line: 2252, type: !190)
!312 = !DILocalVariable(name: "overflow", scope: !309, file: !122, line: 2253, type: !29)
!313 = !DILocalVariable(name: "utcoff", scope: !309, file: !122, line: 2255, type: !45)
!314 = !DILocalVariable(name: "Starti", scope: !315, file: !122, line: 2277, type: !190)
!315 = distinct !DILexicalBlock(scope: !316, file: !122, line: 2276, column: 9)
!316 = distinct !DILexicalBlock(scope: !278, file: !122, line: 2275, column: 11)
!317 = !DILocalVariable(name: "orig_ns", scope: !318, file: !122, line: 2292, type: !190)
!318 = distinct !DILexicalBlock(scope: !278, file: !122, line: 2291, column: 7)
!319 = !DILocalVariable(name: "sum_ns", scope: !318, file: !122, line: 2293, type: !190)
!320 = !DILocalVariable(name: "normalized_ns", scope: !318, file: !122, line: 2294, type: !63)
!321 = !DILocalVariable(name: "d4", scope: !318, file: !122, line: 2295, type: !63)
!322 = !DILocalVariable(name: "d1", scope: !318, file: !122, line: 2296, type: !190)
!323 = !DILocalVariable(name: "t1", scope: !318, file: !122, line: 2296, type: !190)
!324 = !DILocalVariable(name: "d2", scope: !318, file: !122, line: 2296, type: !190)
!325 = !DILocalVariable(name: "t2", scope: !318, file: !122, line: 2296, type: !190)
!326 = !DILocalVariable(name: "t3", scope: !318, file: !122, line: 2296, type: !190)
!327 = !DILocalVariable(name: "t4", scope: !318, file: !122, line: 2296, type: !190)
!328 = !DILocalVariable(name: "lmt", scope: !329, file: !122, line: 2335, type: !150)
!329 = distinct !DILexicalBlock(scope: !330, file: !122, line: 2316, column: 11)
!330 = distinct !DILexicalBlock(scope: !318, file: !122, line: 2314, column: 13)
!331 = !DILocalVariable(name: "sec", scope: !332, file: !122, line: 2354, type: !190)
!332 = distinct !DILexicalBlock(scope: !333, file: !122, line: 2345, column: 5)
!333 = distinct !DILexicalBlock(scope: !128, file: !122, line: 2344, column: 7)
!334 = !DILocalVariable(name: "nsec", scope: !332, file: !122, line: 2355, type: !63)
!335 = !DILocalVariable(name: "gmt", scope: !332, file: !122, line: 2359, type: !150)
!336 = !DILocalVariable(name: "lmt", scope: !332, file: !122, line: 2359, type: !150)
!337 = !DILocalVariable(name: "got_utc", scope: !332, file: !122, line: 2360, type: !29)
!338 = !DILocalVariable(name: "got_utcoff", scope: !339, file: !122, line: 2368, type: !29)
!339 = distinct !DILexicalBlock(scope: !340, file: !122, line: 2366, column: 9)
!340 = distinct !DILexicalBlock(scope: !332, file: !122, line: 2365, column: 11)
!341 = !DILocalVariable(name: "utcoff", scope: !339, file: !122, line: 2369, type: !45)
!342 = !DILabel(scope: !128, name: "fail", file: !122, line: 2388)
!343 = !{!344}
!344 = !DIEnumerator(name: "TZBUFSIZE", value: 100, isUnsigned: true)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !122, line: 1249, baseType: !7, size: 32, elements: !346)
!346 = !{!347}
!347 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !349, line: 671, baseType: !7, size: 32, elements: !350)
!349 = !DIFile(filename: "parse-datetime.tab.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!351 = !DIEnumerator(name: "tAGO", value: 258, isUnsigned: true)
!352 = !DIEnumerator(name: "tDST", value: 259, isUnsigned: true)
!353 = !DIEnumerator(name: "tYEAR_UNIT", value: 260, isUnsigned: true)
!354 = !DIEnumerator(name: "tMONTH_UNIT", value: 261, isUnsigned: true)
!355 = !DIEnumerator(name: "tHOUR_UNIT", value: 262, isUnsigned: true)
!356 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263, isUnsigned: true)
!357 = !DIEnumerator(name: "tSEC_UNIT", value: 264, isUnsigned: true)
!358 = !DIEnumerator(name: "tDAY_UNIT", value: 265, isUnsigned: true)
!359 = !DIEnumerator(name: "tDAY_SHIFT", value: 266, isUnsigned: true)
!360 = !DIEnumerator(name: "tDAY", value: 267, isUnsigned: true)
!361 = !DIEnumerator(name: "tDAYZONE", value: 268, isUnsigned: true)
!362 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269, isUnsigned: true)
!363 = !DIEnumerator(name: "tMERIDIAN", value: 270, isUnsigned: true)
!364 = !DIEnumerator(name: "tMONTH", value: 271, isUnsigned: true)
!365 = !DIEnumerator(name: "tORDINAL", value: 272, isUnsigned: true)
!366 = !DIEnumerator(name: "tZONE", value: 273, isUnsigned: true)
!367 = !DIEnumerator(name: "tSNUMBER", value: 274, isUnsigned: true)
!368 = !DIEnumerator(name: "tUNUMBER", value: 275, isUnsigned: true)
!369 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 276, isUnsigned: true)
!370 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 277, isUnsigned: true)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !122, line: 172, baseType: !7, size: 32, elements: !372)
!372 = !{!373, !374}
!373 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!374 = !DIEnumerator(name: "LOG10_BILLION", value: 9, isUnsigned: true)
!375 = !{!376, !378, !379, !7, !190, !391, !96, !377, !392, !63, !45, !393, !394, !179}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !349, line: 748, baseType: !377)
!377 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!378 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !349, line: 898, size: 448, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !380, file: !349, line: 900, baseType: !376, size: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !380, file: !349, line: 901, baseType: !384, size: 448)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !349, line: 710, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !349, line: 698, size: 448, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !385, file: !122, line: 577, baseType: !190, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !385, file: !122, line: 578, baseType: !226, size: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !385, file: !122, line: 579, baseType: !132, size: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !385, file: !122, line: 580, baseType: !186, size: 448)
!391 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!392 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!393 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!394 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!395 = !{!396, !116, !460, !467, !474, !477, !482, !487, !489, !494, !496, !498, !502, !507, !512, !517, !522, !527, !532, !535, !548}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "yyval_default", scope: !398, file: !349, line: 1647, type: !384, isLocal: true, isDefinition: true)
!398 = distinct !DISubprogram(name: "yyparse", scope: !349, file: !349, line: 1638, type: !399, scopeLine: 1639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !118, retainedNodes: !402)
!399 = !DISubroutineType(types: !400)
!400 = !{!63, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !413, !415, !416, !418, !420, !421, !422, !423, !424, !425, !426, !427, !430, !432, !433, !435, !437, !445, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!403 = !DILocalVariable(name: "pc", arg: 1, scope: !398, file: !349, line: 1638, type: !401)
!404 = !DILocalVariable(name: "yychar", scope: !398, file: !349, line: 1641, type: !63)
!405 = !DILocalVariable(name: "yylval", scope: !398, file: !349, line: 1648, type: !384)
!406 = !DILocalVariable(name: "yynerrs", scope: !398, file: !349, line: 1651, type: !63)
!407 = !DILocalVariable(name: "yystate", scope: !398, file: !349, line: 1653, type: !63)
!408 = !DILocalVariable(name: "yyerrstatus", scope: !398, file: !349, line: 1655, type: !63)
!409 = !DILocalVariable(name: "yyssa", scope: !398, file: !349, line: 1665, type: !410)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 320, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 20)
!413 = !DILocalVariable(name: "yyss", scope: !398, file: !349, line: 1666, type: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!415 = !DILocalVariable(name: "yyssp", scope: !398, file: !349, line: 1667, type: !414)
!416 = !DILocalVariable(name: "yyvsa", scope: !398, file: !349, line: 1670, type: !417)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 8960, elements: !411)
!418 = !DILocalVariable(name: "yyvs", scope: !398, file: !349, line: 1671, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!420 = !DILocalVariable(name: "yyvsp", scope: !398, file: !349, line: 1672, type: !419)
!421 = !DILocalVariable(name: "yystacksize", scope: !398, file: !349, line: 1674, type: !378)
!422 = !DILocalVariable(name: "yyn", scope: !398, file: !349, line: 1676, type: !63)
!423 = !DILocalVariable(name: "yyresult", scope: !398, file: !349, line: 1677, type: !63)
!424 = !DILocalVariable(name: "yytoken", scope: !398, file: !349, line: 1679, type: !63)
!425 = !DILocalVariable(name: "yyval", scope: !398, file: !349, line: 1682, type: !384)
!426 = !DILocalVariable(name: "yylen", scope: !398, file: !349, line: 1695, type: !63)
!427 = !DILocalVariable(name: "yysize", scope: !428, file: !349, line: 1733, type: !378)
!428 = distinct !DILexicalBlock(scope: !429, file: !349, line: 1731, column: 5)
!429 = distinct !DILexicalBlock(scope: !398, file: !349, line: 1727, column: 7)
!430 = !DILocalVariable(name: "yyss1", scope: !431, file: !349, line: 1763, type: !414)
!431 = distinct !DILexicalBlock(scope: !428, file: !349, line: 1762, column: 7)
!432 = !DILocalVariable(name: "yyptr", scope: !431, file: !349, line: 1764, type: !379)
!433 = !DILocalVariable(name: "yynewbytes", scope: !434, file: !349, line: 1768, type: !378)
!434 = distinct !DILexicalBlock(scope: !431, file: !349, line: 1768, column: 9)
!435 = !DILocalVariable(name: "yynewbytes", scope: !436, file: !349, line: 1769, type: !378)
!436 = distinct !DILexicalBlock(scope: !431, file: !349, line: 1769, column: 9)
!437 = !DILocalVariable(name: "digits", scope: !438, file: !122, line: 819, type: !190)
!438 = distinct !DILexicalBlock(scope: !439, file: !122, line: 818, column: 15)
!439 = distinct !DILexicalBlock(scope: !440, file: !122, line: 817, column: 17)
!440 = distinct !DILexicalBlock(scope: !441, file: !122, line: 816, column: 11)
!441 = distinct !DILexicalBlock(scope: !442, file: !122, line: 815, column: 13)
!442 = distinct !DILexicalBlock(scope: !443, file: !122, line: 809, column: 5)
!443 = !DILexicalBlockFile(scope: !444, file: !122, discriminator: 0)
!444 = distinct !DILexicalBlock(scope: !398, file: !349, line: 1887, column: 5)
!445 = !DILocalVariable(name: "yylhs", scope: !446, file: !349, line: 2514, type: !72)
!446 = distinct !DILexicalBlock(scope: !398, file: !349, line: 2513, column: 3)
!447 = !DILocalVariable(name: "yyi", scope: !446, file: !349, line: 2515, type: !72)
!448 = !DILabel(scope: !398, name: "yynewstate", file: !349, line: 1713)
!449 = !DILabel(scope: !398, name: "yysetstate", file: !349, line: 1722)
!450 = !DILabel(scope: !398, name: "yybackup", file: !349, line: 1796)
!451 = !DILabel(scope: !398, name: "yydefault", file: !349, line: 1860)
!452 = !DILabel(scope: !398, name: "yyreduce", file: !349, line: 1870)
!453 = !DILabel(scope: !398, name: "yyerrlab", file: !349, line: 2527)
!454 = !DILabel(scope: !398, name: "yyerrorlab", file: !349, line: 2601)
!455 = !DILabel(scope: !398, name: "yyerrlab1", file: !349, line: 2619)
!456 = !DILabel(scope: !398, name: "yyacceptlab", file: !349, line: 2663)
!457 = !DILabel(scope: !398, name: "yyabortlab", file: !349, line: 2671)
!458 = !DILabel(scope: !398, name: "yyexhaustedlab", file: !349, line: 2680)
!459 = !DILabel(scope: !398, name: "yyreturn", file: !349, line: 2690)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "yytranslate", scope: !118, file: !349, line: 977, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 2224, elements: !465)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !349, line: 730, baseType: !96)
!465 = !{!466}
!466 = !DISubrange(count: 278)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "yycheck", scope: !118, file: !349, line: 1137, type: !469, isLocal: true, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 904, elements: !472)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !349, line: 736, baseType: !391)
!472 = !{!473}
!473 = !DISubrange(count: 113)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "yytable", scope: !118, file: !349, line: 1121, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 904, elements: !472)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "yydefact", scope: !118, file: !349, line: 1086, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 912, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 114)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "yyr2", scope: !118, file: !349, line: 1187, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 736, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 92)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "yyr1", scope: !118, file: !349, line: 1172, type: !484, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "yypgoto", scope: !118, file: !349, line: 1103, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 208, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 26)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !118, file: !349, line: 1111, type: !491, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "yystos", scope: !118, file: !349, line: 1155, type: !479, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "meridian_table", scope: !118, file: !122, line: 1008, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 640, elements: !73)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !118, file: !122, line: 1022, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 3200, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 25)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !118, file: !122, line: 1096, type: !509, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 512, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 4)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !118, file: !122, line: 1109, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 6144, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 48)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "dst_table", scope: !118, file: !122, line: 1017, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 1)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "time_units_table", scope: !118, file: !122, line: 1051, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 1408, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 11)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !118, file: !122, line: 1067, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 2688, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 21)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "military_table", scope: !118, file: !122, line: 1168, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 3328, elements: !492)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !537, file: !122, line: 343, type: !545, isLocal: true, isDefinition: true)
!537 = distinct !DISubprogram(name: "str_days", scope: !122, file: !122, line: 340, type: !538, scopeLine: 341, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !118, retainedNodes: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!60, !401, !23, !63}
!540 = !{!541, !542, !543, !544}
!541 = !DILocalVariable(name: "pc", arg: 1, scope: !537, file: !122, line: 340, type: !401)
!542 = !DILocalVariable(name: "buffer", arg: 2, scope: !537, file: !122, line: 340, type: !23)
!543 = !DILocalVariable(name: "n", arg: 3, scope: !537, file: !122, line: 340, type: !63)
!544 = !DILocalVariable(name: "len", scope: !537, file: !122, line: 370, type: !63)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1232, elements: !546)
!546 = !{!547, !526}
!547 = !DISubrange(count: 14)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "days_values", scope: !537, file: !122, line: 360, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 224, elements: !551)
!551 = !{!552, !511}
!552 = !DISubrange(count: 7)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 912, elements: !480)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "program_name", scope: !556, file: !557, line: 33, type: !60, isLocal: false, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, retainedTypes: !558, globals: !559, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !{!25, !23}
!559 = !{!554}
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !562, file: !563, line: 85, type: !622, isLocal: false, isDefinition: true)
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !564, retainedTypes: !585, globals: !587, splitDebugInlining: false, nameTableKind: None)
!563 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!564 = !{!5, !565, !570}
!565 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!568 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!569 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !571, line: 46, baseType: !7, size: 32, elements: !572)
!571 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!573 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!574 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!575 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!576 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!577 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!578 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!579 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!580 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!581 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!582 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!583 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!584 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!585 = !{!63, !392, !586, !23}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !204, line: 46, baseType: !378)
!587 = !{!560, !588, !594, !604, !606, !611, !618, !620}
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !562, file: !563, line: 101, type: !590, isLocal: false, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 320, elements: !592)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!592 = !{!593}
!593 = !DISubrange(count: 10)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !562, file: !563, line: 1052, type: !596, isLocal: false, isDefinition: true)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !563, line: 65, size: 448, elements: !597)
!597 = !{!598, !599, !600, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !596, file: !563, line: 68, baseType: !5, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !563, line: 71, baseType: !63, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !596, file: !563, line: 75, baseType: !601, size: 256, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !67)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !596, file: !563, line: 78, baseType: !60, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !596, file: !563, line: 81, baseType: !60, size: 64, offset: 384)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !562, file: !563, line: 116, type: !596, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "slot0", scope: !562, file: !563, line: 842, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 256)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "slotvec", scope: !562, file: !563, line: 845, type: !613, isLocal: true, isDefinition: true)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !563, line: 834, size: 128, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !614, file: !563, line: 836, baseType: !586, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !614, file: !563, line: 837, baseType: !23, size: 64, offset: 64)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "nslots", scope: !562, file: !563, line: 843, type: !63, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "slotvec0", scope: !562, file: !563, line: 844, type: !614, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 704, elements: !525)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !625, file: !626, line: 26, type: !628, isLocal: false, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C99, file: !626, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, globals: !627, splitDebugInlining: false, nameTableKind: None)
!626 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!627 = !{!623}
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 376, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 47)
!631 = distinct !DICompileUnit(language: DW_LANG_C99, file: !632, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, splitDebugInlining: false, nameTableKind: None)
!632 = !DIFile(filename: "lib/fd-reopen.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/fdutimensat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "lib/gettime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, retainedTypes: !639, splitDebugInlining: false, nameTableKind: None)
!638 = !DIFile(filename: "lib/posixtm.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!639 = !{!7}
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/posixver.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!642 = distinct !DICompileUnit(language: DW_LANG_C99, file: !643, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !644, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!643 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!644 = !{!645}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !643, line: 40, baseType: !7, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!648 = !{!25}
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !651, retainedTypes: !665, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!651 = !{!652}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !654, file: !653, line: 186, baseType: !7, size: 32, elements: !663)
!653 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = distinct !DISubprogram(name: "x2nrealloc", scope: !653, file: !653, line: 174, type: !655, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !658)
!655 = !DISubroutineType(types: !656)
!656 = !{!25, !25, !657, !586}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(name: "p", arg: 1, scope: !654, file: !653, line: 174, type: !25)
!660 = !DILocalVariable(name: "pn", arg: 2, scope: !654, file: !653, line: 174, type: !657)
!661 = !DILocalVariable(name: "s", arg: 3, scope: !654, file: !653, line: 174, type: !586)
!662 = !DILocalVariable(name: "n", scope: !654, file: !653, line: 176, type: !586)
!663 = !{!664}
!664 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!665 = !{!586, !23, !25}
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, retainedTypes: !672, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!672 = !{!586}
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !675, retainedTypes: !679, globals: !680, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!675 = !{!676}
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 50, baseType: !7, size: 32, elements: !677)
!677 = !{!678}
!678 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!679 = !{!23, !586}
!680 = !{!681}
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "local_tz", scope: !673, file: !674, line: 55, type: !683, isLocal: true, isDefinition: true)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !139, line: 778, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !687, line: 21, size: 128, elements: !688)
!687 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !686, file: !687, line: 25, baseType: !685, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !686, file: !687, line: 36, baseType: !24, size: 8, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !686, file: !687, line: 48, baseType: !692, offset: 72)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: -1)
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !701, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = !{!702}
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !703, line: 41, baseType: !7, size: 32, elements: !704)
!703 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087}
!705 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!706 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!707 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!708 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!709 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!710 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!711 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!712 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!713 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!714 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!715 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!716 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!717 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!718 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!719 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!720 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!721 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!722 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!723 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!724 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!725 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!726 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!727 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!728 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!729 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!730 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!731 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!732 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!733 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!734 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!735 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!736 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!737 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!738 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!739 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!740 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!741 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!742 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!743 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!744 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!745 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!746 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!747 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!748 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!749 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!750 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!751 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!752 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!753 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!754 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!813 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!816 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!817 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!818 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!819 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!820 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!821 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!822 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!823 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!824 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!825 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!826 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!827 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!900 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!973 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!974 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!975 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!976 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!977 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!978 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!979 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!980 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!981 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!982 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!983 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!984 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!985 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!986 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!987 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!989 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!990 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!991 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!992 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!993 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!994 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!1020 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!1021 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!1022 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!1023 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!1024 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!1029 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!1030 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!1031 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!1032 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!1037 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!1038 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!1039 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!1040 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!1041 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!1042 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!1043 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!1044 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!1045 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!1046 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!1047 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!1048 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!1049 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!1050 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!1051 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!1052 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!1053 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!1054 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!1055 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!1056 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!1057 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!1058 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!1059 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!1060 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1061 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1062 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1063 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1064 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1065 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1066 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1067 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1068 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1069 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1070 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1071 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1072 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1073 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1074 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1075 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1076 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1077 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1078 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1079 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1080 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1081 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1082 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1083 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1084 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1085 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1086 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1087 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1088 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1089, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !89, retainedTypes: !1090, splitDebugInlining: false, nameTableKind: None)
