source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.E_string = type { i8*, i8*, i64 }
%struct.List_element = type { i32, %struct.List_element*, %union.anon }
%struct.Spec_list = type { %struct.List_element*, %struct.List_element*, i64, i64, i64, %struct.List_element*, i8, i8, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon = type { i8, i8 }
%struct.anon.0 = type { i8, i64 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { %struct.anon.0 }
%union.anon.12 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Usage: %s [OPTION]... SET1 [SET2]\0A\00", align 1

!10 = !DIEnumerator(name: "RE_CHAR_CLASS", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "RE_EQUIV_CLASS", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "RE_REPEATED_CHAR", value: 4, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Char_class", file: !3, line: 70, baseType: !6, size: 32, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!15 = !DIEnumerator(name: "CC_ALNUM", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "CC_ALPHA", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "CC_BLANK", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "CC_CNTRL", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "CC_DIGIT", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "CC_GRAPH", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "CC_LOWER", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "CC_PRINT", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "CC_PUNCT", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "CC_SPACE", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "CC_UPPER", value: 10, isUnsigned: true)
!26 = !DIEnumerator(name: "CC_XDIGIT", value: 11, isUnsigned: true)
!27 = !DIEnumerator(name: "CC_NO_CLASS", value: 9999, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 45, baseType: !6, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 40, baseType: !6, size: 32, elements: !38)
!38 = !{!39}
!39 = !DIEnumerator(name: "N_CHARS", value: 256, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Upper_Lower_class", file: !3, line: 84, baseType: !6, size: 32, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "UL_LOWER", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "UL_UPPER", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "UL_NONE", value: 2, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 46, baseType: !6, size: 32, elements: !47)
!46 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!48 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!49 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!50 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!51 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!52 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!53 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!54 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!55 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!56 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !61, line: 25, baseType: !6, size: 32, elements: !62)
!61 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!62 = !{!63, !64, !65, !66, !67}
!63 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!68 = !{!69, !79, !140, !144, !148, !151, !154, !161, !73, !130, !176, !180, !184, !188, !132, !75, !191, !77, !110, !196, !200, !204, !207, !6, !210, !211, !216, !220}
!69 = !DISubprogram(name: "dcgettext", scope: !70, file: !70, line: 51, type: !71, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!70 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !75, !75, !77}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !{}
!79 = !DISubprogram(name: "fputs_unlocked", scope: !80, file: !80, line: 662, type: !81, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!80 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!81 = !DISubroutineType(types: !82)
!82 = !{!77, !75, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !86)
!85 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !102, !103, !104, !105, !109, !111, !113, !117, !120, !122, !125, !128, !129, !131, !135, !136}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !84, file: !85, line: 51, baseType: !77, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !84, file: !85, line: 54, baseType: !73, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !84, file: !85, line: 55, baseType: !73, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !84, file: !85, line: 56, baseType: !73, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !84, file: !85, line: 57, baseType: !73, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !84, file: !85, line: 58, baseType: !73, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !84, file: !85, line: 59, baseType: !73, size: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !84, file: !85, line: 60, baseType: !73, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !84, file: !85, line: 61, baseType: !73, size: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !84, file: !85, line: 64, baseType: !73, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !84, file: !85, line: 65, baseType: !73, size: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !84, file: !85, line: 66, baseType: !73, size: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !84, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !85, line: 36, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !84, file: !85, line: 70, baseType: !83, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !84, file: !85, line: 72, baseType: !77, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !84, file: !85, line: 73, baseType: !77, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !84, file: !85, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !84, file: !85, line: 77, baseType: !110, size: 16, offset: 1024)
!110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !84, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !84, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !84, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !85, line: 43, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !84, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !84, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !85, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !84, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !85, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !84, file: !85, line: 93, baseType: !83, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !84, file: !85, line: 94, baseType: !130, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !84, file: !85, line: 95, baseType: !132, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 46, baseType: !134)
!133 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!134 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !84, file: !85, line: 96, baseType: !77, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !84, file: !85, line: 98, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DISubprogram(name: "set_program_name", scope: !141, file: !141, line: 37, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!141 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !75}
!144 = !DISubprogram(name: "setlocale", scope: !145, file: !145, line: 122, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!145 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!146 = !DISubroutineType(types: !147)
!147 = !{!73, !77, !75}
!148 = !DISubprogram(name: "bindtextdomain", scope: !70, file: !70, line: 86, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!149 = !DISubroutineType(types: !150)
!150 = !{!73, !75, !75}
!151 = !DISubprogram(name: "textdomain", scope: !70, file: !70, line: 82, type: !152, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!152 = !DISubroutineType(types: !153)
!153 = !{!73, !75}
!154 = !DISubprogram(name: "atexit", scope: !155, file: !155, line: 595, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!155 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!156 = !DISubroutineType(types: !157)
!157 = !{!77, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null}
!161 = !DISubprogram(name: "getopt_long", scope: !162, file: !162, line: 66, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!162 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!163 = !DISubroutineType(types: !164)
!164 = !{!77, !77, !165, !75, !167, !174}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !162, line: 50, size: 256, elements: !170)
!170 = !{!171, !172, !173, !175}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !162, line: 52, baseType: !75, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !169, file: !162, line: 55, baseType: !77, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !162, line: 56, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !169, file: !162, line: 57, baseType: !77, size: 32, offset: 192)
!176 = !DISubprogram(name: "version_etc", scope: !177, file: !177, line: 69, type: !178, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!177 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!178 = !DISubroutineType(types: !179)
!179 = !{null, !83, !75, !75, !75, null}
!180 = !DISubprogram(name: "error", scope: !181, file: !181, line: 52, type: !182, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!181 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!182 = !DISubroutineType(types: !183)
!183 = !{null, !77, !77, !75, null}
!184 = !DISubprogram(name: "quote", scope: !185, file: !185, line: 44, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!185 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = !DISubroutineType(types: !187)
!187 = !{!75, !75}
!188 = !DISubprogram(name: "fadvise", scope: !29, file: !29, line: 72, type: !189, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !83, !28}
!191 = !DISubprogram(name: "fwrite_unlocked", scope: !80, file: !80, line: 675, type: !192, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!192 = !DISubroutineType(types: !193)
!193 = !{!134, !194, !134, !134, !83}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!196 = !DISubprogram(name: "close", scope: !197, file: !197, line: 353, type: !198, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!197 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!198 = !DISubroutineType(types: !199)
!199 = !{!77, !77}
!200 = !DISubprogram(name: "xmalloc", scope: !201, file: !201, line: 53, type: !202, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!201 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !DISubroutineType(types: !203)
!203 = !{!130, !134}
!204 = !DISubprogram(name: "xcalloc", scope: !201, file: !201, line: 57, type: !205, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!205 = !DISubroutineType(types: !206)
!206 = !{!130, !134, !134}
!207 = !DISubprogram(name: "free", scope: !155, file: !155, line: 565, type: !208, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !130}
!210 = !DISubprogram(name: "xalloc_die", scope: !201, file: !201, line: 51, type: !159, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !78)
!211 = !DISubprogram(name: "xstrtoumax", scope: !61, file: !61, line: 48, type: !212, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!212 = !DISubroutineType(types: !213)
!213 = !{!60, !75, !214, !77, !215, !75}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!216 = !DISubprogram(name: "safe_read", scope: !217, file: !217, line: 42, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!217 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!218 = !DISubroutineType(types: !219)
!219 = !{!134, !77, !130, !134}
!220 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!221 = !{!222, !225, !230, !235, !237, !0, !240, !242, !244, !246, !248}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "translating", scope: !2, file: !3, line: 242, type: !224, isLocal: true, isDefinition: true)
!224 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "io_buf", scope: !2, file: !3, line: 244, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 65536, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 8192)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "in_squeeze_set", scope: !2, file: !3, line: 256, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 2048, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 256)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "in_delete_set", scope: !2, file: !3, line: 262, type: !232, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "xlate", scope: !2, file: !3, line: 267, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, elements: !233)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "complement", scope: !2, file: !3, line: 208, type: !224, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "delete", scope: !2, file: !3, line: 205, type: !224, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "squeeze_repeats", scope: !2, file: !3, line: 202, type: !224, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "truncate_set1", scope: !2, file: !3, line: 238, type: !224, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "char_class_name", scope: !2, file: !3, line: 246, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 768, elements: !252)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!252 = !{!253}
!253 = !DISubrange(count: 12)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1792, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 7)
!257 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!258 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!259 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!260 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "Version", scope: !263, file: !264, line: 2, type: !75, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, globals: !265, nameTableKind: None)
!264 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !{!261}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "file_name", scope: !268, file: !269, line: 46, type: !75, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, retainedTypes: !270, globals: !309, nameTableKind: None)
!269 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = !{!271, !69, !307, !180}
!271 = !DISubprogram(name: "close_stream", scope: !272, file: !272, line: 2, type: !273, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!272 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !DISubroutineType(types: !274)
!274 = !{!77, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !276, file: !85, line: 51, baseType: !77, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !276, file: !85, line: 54, baseType: !73, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !276, file: !85, line: 55, baseType: !73, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !276, file: !85, line: 56, baseType: !73, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !276, file: !85, line: 57, baseType: !73, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !276, file: !85, line: 58, baseType: !73, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !276, file: !85, line: 59, baseType: !73, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !276, file: !85, line: 60, baseType: !73, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !276, file: !85, line: 61, baseType: !73, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !276, file: !85, line: 64, baseType: !73, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !276, file: !85, line: 65, baseType: !73, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !276, file: !85, line: 66, baseType: !73, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !276, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !276, file: !85, line: 70, baseType: !275, size: 64, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !276, file: !85, line: 72, baseType: !77, size: 32, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !276, file: !85, line: 73, baseType: !77, size: 32, offset: 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !276, file: !85, line: 74, baseType: !106, size: 64, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !276, file: !85, line: 77, baseType: !110, size: 16, offset: 1024)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !276, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !276, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !276, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !276, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !276, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !276, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !276, file: !85, line: 93, baseType: !275, size: 64, offset: 1344)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !276, file: !85, line: 94, baseType: !130, size: 64, offset: 1408)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !276, file: !85, line: 95, baseType: !132, size: 64, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !276, file: !85, line: 96, baseType: !77, size: 32, offset: 1536)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !276, file: !85, line: 98, baseType: !137, size: 160, offset: 1568)
!307 = !DISubprogram(name: "quotearg_colon", scope: !308, file: !308, line: 391, type: !152, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!308 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!309 = !{!266, !310}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !268, file: !269, line: 56, type: !224, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "exit_failure", scope: !314, file: !315, line: 24, type: !317, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, globals: !316, nameTableKind: None)
!315 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!316 = !{!312}
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "program_name", scope: !320, file: !321, line: 33, type: !75, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, retainedTypes: !322, globals: !358, nameTableKind: None)
!321 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !{!130, !323, !73}
!323 = !DISubprogram(name: "fputs", scope: !80, file: !80, line: 626, type: !324, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!324 = !DISubroutineType(types: !325)
!325 = !{!77, !75, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !327, file: !85, line: 51, baseType: !77, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !327, file: !85, line: 54, baseType: !73, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !327, file: !85, line: 55, baseType: !73, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !327, file: !85, line: 56, baseType: !73, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !327, file: !85, line: 57, baseType: !73, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !327, file: !85, line: 58, baseType: !73, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !327, file: !85, line: 59, baseType: !73, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !327, file: !85, line: 60, baseType: !73, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !327, file: !85, line: 61, baseType: !73, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !327, file: !85, line: 64, baseType: !73, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !327, file: !85, line: 65, baseType: !73, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !327, file: !85, line: 66, baseType: !73, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !327, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !327, file: !85, line: 70, baseType: !326, size: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !327, file: !85, line: 72, baseType: !77, size: 32, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !327, file: !85, line: 73, baseType: !77, size: 32, offset: 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !327, file: !85, line: 74, baseType: !106, size: 64, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !327, file: !85, line: 77, baseType: !110, size: 16, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !327, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !327, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !327, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !327, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !327, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !327, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !327, file: !85, line: 93, baseType: !326, size: 64, offset: 1344)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !327, file: !85, line: 94, baseType: !130, size: 64, offset: 1408)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !327, file: !85, line: 95, baseType: !132, size: 64, offset: 1472)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !327, file: !85, line: 96, baseType: !77, size: 32, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !327, file: !85, line: 98, baseType: !137, size: 160, offset: 1568)
!358 = !{!318}
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !361, file: !362, line: 85, type: !466, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !363, retainedTypes: !382, globals: !442, nameTableKind: None)
!362 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!363 = !{!364, !377, !45}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !308, line: 32, baseType: !6, size: 32, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!366 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!367 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!369 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!370 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!371 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!372 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!373 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!374 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!375 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!376 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !308, line: 242, baseType: !6, size: 32, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!381 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!382 = !{!383, !386, !207, !401, !77, !110, !404, !132, !421, !425, !69, !431, !435, !73, !200, !210, !439}
!383 = !DISubprogram(name: "xmemdup", scope: !201, file: !201, line: 62, type: !384, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!384 = !DISubroutineType(types: !385)
!385 = !{!130, !194, !134}
!386 = !DISubprogram(name: "quotearg_alloc_mem", scope: !308, file: !308, line: 342, type: !387, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!387 = !DISubroutineType(types: !388)
!388 = !{!73, !75, !134, !215, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !362, line: 65, size: 448, elements: !392)
!392 = !{!393, !394, !395, !399, !400}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !391, file: !362, line: 68, baseType: !364, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !362, line: 71, baseType: !77, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !391, file: !362, line: 75, baseType: !396, size: 256, offset: 64)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !391, file: !362, line: 78, baseType: !75, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !391, file: !362, line: 81, baseType: !75, size: 64, offset: 384)
!401 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !308, file: !308, line: 408, type: !402, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!402 = !DISubroutineType(types: !403)
!403 = !{!73, !77, !75, !75, !75, !134}
!404 = !DISubprogram(name: "rpl_mbrtowc", scope: !405, file: !405, line: 717, type: !406, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!405 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!406 = !DISubroutineType(types: !407)
!407 = !{!134, !174, !75, !134, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 13, size: 64, elements: !411)
!410 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !409, file: !410, line: 15, baseType: !77, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !409, file: !410, line: 20, baseType: !414, size: 32, offset: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !409, file: !410, line: 16, size: 32, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !414, file: !410, line: 18, baseType: !6, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !414, file: !410, line: 19, baseType: !418, size: 32)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 4)
!421 = !DISubprogram(name: "iswprint", scope: !422, file: !422, line: 120, type: !423, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!422 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!423 = !DISubroutineType(types: !424)
!424 = !{!77, !6}
!425 = !DISubprogram(name: "mbsinit", scope: !426, file: !426, line: 292, type: !427, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!426 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!427 = !DISubroutineType(types: !428)
!428 = !{!77, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!431 = !DISubprogram(name: "locale_charset", scope: !432, file: !432, line: 35, type: !433, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!432 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!433 = !DISubroutineType(types: !434)
!434 = !{!75}
!435 = !DISubprogram(name: "c_strcasecmp", scope: !436, file: !436, line: 42, type: !437, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!436 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!437 = !DISubroutineType(types: !438)
!438 = !{!77, !75, !75}
!439 = !DISubprogram(name: "xrealloc", scope: !201, file: !201, line: 59, type: !440, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!440 = !DISubroutineType(types: !441)
!441 = !{!130, !130, !134}
!442 = !{!359, !443, !449, !451, !453, !455, !462, !464}
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !361, file: !362, line: 101, type: !445, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 320, elements: !447)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!447 = !{!448}
!448 = !DISubrange(count: 10)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !361, file: !362, line: 1052, type: !391, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !361, file: !362, line: 116, type: !391, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "slot0", scope: !361, file: !362, line: 842, type: !239, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "slotvec", scope: !361, file: !362, line: 845, type: !457, isLocal: true, isDefinition: true)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !362, line: 834, size: 128, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !458, file: !362, line: 836, baseType: !132, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !458, file: !362, line: 837, baseType: !73, size: 64, offset: 64)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "nslots", scope: !361, file: !362, line: 843, type: !77, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "slotvec0", scope: !361, file: !362, line: 844, type: !458, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 704, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 11)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !471, file: !472, line: 26, type: !474, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, globals: !473, nameTableKind: None)
!472 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = !{!469}
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 376, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 47)
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !479, retainedTypes: !480, nameTableKind: None)
!478 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!479 = !{!28}
!480 = !{!481, !485}
!481 = !DISubprogram(name: "posix_fadvise", scope: !482, file: !482, line: 288, type: !483, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!482 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!483 = !DISubroutineType(types: !484)
!484 = !{!77, !77, !108, !108, !77}
!485 = !DISubprogram(name: "fileno", scope: !80, file: !80, line: 786, type: !486, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!486 = !DISubroutineType(types: !487)
!487 = !{!77, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !489, file: !85, line: 51, baseType: !77, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !489, file: !85, line: 54, baseType: !73, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !489, file: !85, line: 55, baseType: !73, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !489, file: !85, line: 56, baseType: !73, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !489, file: !85, line: 57, baseType: !73, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !489, file: !85, line: 58, baseType: !73, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !489, file: !85, line: 59, baseType: !73, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !489, file: !85, line: 60, baseType: !73, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !489, file: !85, line: 61, baseType: !73, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !489, file: !85, line: 64, baseType: !73, size: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !489, file: !85, line: 65, baseType: !73, size: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !489, file: !85, line: 66, baseType: !73, size: 64, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !489, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !489, file: !85, line: 70, baseType: !488, size: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !489, file: !85, line: 72, baseType: !77, size: 32, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !489, file: !85, line: 73, baseType: !77, size: 32, offset: 928)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !489, file: !85, line: 74, baseType: !106, size: 64, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !489, file: !85, line: 77, baseType: !110, size: 16, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !489, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !489, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !489, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !489, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !489, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !489, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !489, file: !85, line: 93, baseType: !488, size: 64, offset: 1344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !489, file: !85, line: 94, baseType: !130, size: 64, offset: 1408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !489, file: !85, line: 95, baseType: !132, size: 64, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !489, file: !85, line: 96, baseType: !77, size: 32, offset: 1536)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !489, file: !85, line: 98, baseType: !137, size: 160, offset: 1568)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !522, nameTableKind: None)
!521 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = !{!523}
!523 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !524, line: 40, baseType: !6, size: 32, elements: !525)
!524 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!525 = !{!526}
!526 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !529, retainedTypes: !533, nameTableKind: None)
!528 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = !{!530}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !528, line: 40, baseType: !6, size: 32, elements: !531)
!531 = !{!532}
!532 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!533 = !{!69, !534, !130}
!534 = !DISubprogram(name: "fputs_unlocked", scope: !80, file: !80, line: 662, type: !535, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!535 = !DISubroutineType(types: !536)
!536 = !{!77, !75, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !538, file: !85, line: 51, baseType: !77, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !538, file: !85, line: 54, baseType: !73, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !538, file: !85, line: 55, baseType: !73, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !538, file: !85, line: 56, baseType: !73, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !538, file: !85, line: 57, baseType: !73, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !538, file: !85, line: 58, baseType: !73, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !538, file: !85, line: 59, baseType: !73, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !538, file: !85, line: 60, baseType: !73, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !538, file: !85, line: 61, baseType: !73, size: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !538, file: !85, line: 64, baseType: !73, size: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !538, file: !85, line: 65, baseType: !73, size: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !538, file: !85, line: 66, baseType: !73, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !538, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !538, file: !85, line: 70, baseType: !537, size: 64, offset: 832)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !538, file: !85, line: 72, baseType: !77, size: 32, offset: 896)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !538, file: !85, line: 73, baseType: !77, size: 32, offset: 928)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !538, file: !85, line: 74, baseType: !106, size: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !538, file: !85, line: 77, baseType: !110, size: 16, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !538, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !538, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !538, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !538, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !538, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !538, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !538, file: !85, line: 93, baseType: !537, size: 64, offset: 1344)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !538, file: !85, line: 94, baseType: !130, size: 64, offset: 1408)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !538, file: !85, line: 95, baseType: !132, size: 64, offset: 1472)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !538, file: !85, line: 96, baseType: !77, size: 32, offset: 1536)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !538, file: !85, line: 98, baseType: !137, size: 160, offset: 1568)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !571, retainedTypes: !584, nameTableKind: None)
!570 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!571 = !{!572}
!572 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !573, file: !201, line: 186, baseType: !6, size: 32, elements: !582)
!573 = distinct !DISubprogram(name: "x2nrealloc", scope: !201, file: !201, line: 174, type: !574, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !569, retainedNodes: !577)
!574 = !DISubroutineType(types: !575)
!575 = !{!130, !130, !576, !132}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!577 = !{!578, !579, !580, !581}
!578 = !DILocalVariable(name: "p", arg: 1, scope: !573, file: !201, line: 174, type: !130)
!579 = !DILocalVariable(name: "pn", arg: 2, scope: !573, file: !201, line: 174, type: !576)
!580 = !DILocalVariable(name: "s", arg: 3, scope: !573, file: !201, line: 174, type: !132)
!581 = !DILocalVariable(name: "n", scope: !573, file: !201, line: 176, type: !132)
!582 = !{!583}
!583 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!584 = !{!132, !210, !200, !439, !73, !207, !130, !204, !585}
!585 = !DISubprogram(name: "rpl_calloc", scope: !586, file: !586, line: 688, type: !205, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!586 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, retainedTypes: !589, nameTableKind: None)
!588 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = !{!69, !180}
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !592, retainedTypes: !593, nameTableKind: None)
!591 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!592 = !{!60, !45}
!593 = !{!77, !110}
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, retainedTypes: !596, nameTableKind: None)
!595 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!596 = !{!130}
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, retainedTypes: !599, nameTableKind: None)
!598 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!599 = !{!600, !132, !612}
!600 = !DISubprogram(name: "mbrtowc", scope: !426, file: !426, line: 296, type: !601, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!601 = !DISubroutineType(types: !602)
!602 = !{!134, !174, !75, !134, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 13, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !604, file: !410, line: 15, baseType: !77, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !604, file: !410, line: 20, baseType: !608, size: 32, offset: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !410, line: 16, size: 32, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !608, file: !410, line: 18, baseType: !6, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !608, file: !410, line: 19, baseType: !418, size: 32)
!612 = !DISubprogram(name: "hard_locale", scope: !613, file: !613, line: 26, type: !614, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!613 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!614 = !DISubroutineType(types: !615)
!615 = !{!224, !77}
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, retainedTypes: !618, nameTableKind: None)
!617 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!618 = !{!619}
!619 = !DISubprogram(name: "rpl_fclose", scope: !620, file: !620, line: 672, type: !621, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!620 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!621 = !DISubroutineType(types: !622)
!622 = !{!77, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !624, file: !85, line: 51, baseType: !77, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !624, file: !85, line: 54, baseType: !73, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !624, file: !85, line: 55, baseType: !73, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !624, file: !85, line: 56, baseType: !73, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !624, file: !85, line: 57, baseType: !73, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !624, file: !85, line: 58, baseType: !73, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !624, file: !85, line: 59, baseType: !73, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !624, file: !85, line: 60, baseType: !73, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !624, file: !85, line: 61, baseType: !73, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !624, file: !85, line: 64, baseType: !73, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !624, file: !85, line: 65, baseType: !73, size: 64, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !624, file: !85, line: 66, baseType: !73, size: 64, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !624, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !624, file: !85, line: 70, baseType: !623, size: 64, offset: 832)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !624, file: !85, line: 72, baseType: !77, size: 32, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !624, file: !85, line: 73, baseType: !77, size: 32, offset: 928)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !624, file: !85, line: 74, baseType: !106, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !624, file: !85, line: 77, baseType: !110, size: 16, offset: 1024)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !624, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !624, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !624, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !624, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !624, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !624, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !624, file: !85, line: 93, baseType: !623, size: 64, offset: 1344)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !624, file: !85, line: 94, baseType: !130, size: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !624, file: !85, line: 95, baseType: !132, size: 64, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !624, file: !85, line: 96, baseType: !77, size: 32, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !624, file: !85, line: 98, baseType: !137, size: 160, offset: 1568)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !78, retainedTypes: !657, nameTableKind: None)
!656 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!657 = !{!658}
!658 = !DISubprogram(name: "setlocale_null_r", scope: !659, file: !659, line: 64, type: !660, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !78)
!659 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!660 = !DISubroutineType(types: !661)
!661 = !{!77, !77, !73, !134}
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !664, retainedTypes: !1051, nameTableKind: None)
!663 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!664 = !{!665}
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !666, line: 41, baseType: !6, size: 32, elements: !667)
!666 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!668 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!669 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!670 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!671 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!672 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!673 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!674 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!675 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!676 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!677 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!678 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!679 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!680 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!681 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!682 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!683 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!684 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!685 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!686 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!687 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!688 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!689 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!690 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!691 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!692 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!693 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!694 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!695 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!696 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!697 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!698 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!699 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!700 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!701 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!702 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!703 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!704 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!705 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!706 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!707 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!708 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!709 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!710 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!711 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!712 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!713 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!714 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!715 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!716 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!717 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!776 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!779 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!780 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!781 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!782 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!783 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!784 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!785 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!786 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!787 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!788 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!789 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!790 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!863 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!936 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!937 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!938 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!939 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!940 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!941 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!942 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!943 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!944 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!945 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!946 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!947 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!948 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!949 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!950 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!952 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!953 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!954 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!955 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!956 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!957 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!983 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!984 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!985 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!986 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!987 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!992 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!993 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!994 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!995 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1037 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1038 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1039 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1040 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
