source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... FILE...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !200, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !192, nameTableKind: None)
!3 = !DIFile(filename: "src/truncate.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !14, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 60, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "rm_abs", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "rm_rel", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "rm_min", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "rm_max", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "rm_rdn", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "rm_rup", value: 5, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 46, baseType: !6, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!17 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!18 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!21 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !30, line: 32, baseType: !6, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!32 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!43 = !{!44, !54, !115, !119, !123, !126, !129, !136, !52, !85, !151, !155, !156, !48, !105, !160, !164, !168, !171, !175, !179, !107, !87, !6, !182, !183, !83, !109, !184, !185, !186, !189}
!44 = !DISubprogram(name: "dcgettext", scope: !45, file: !45, line: 51, type: !46, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!45 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !50, !50, !52}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !{}
!54 = !DISubprogram(name: "fputs_unlocked", scope: !55, file: !55, line: 662, type: !56, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!55 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!56 = !DISubroutineType(types: !57)
!57 = !{!52, !50, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !61)
!60 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !77, !78, !79, !80, !84, !86, !88, !92, !95, !97, !100, !103, !104, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 51, baseType: !52, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 36, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 70, baseType: !58, size: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !82, line: 152, baseType: !83)
!82 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!83 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 43, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !82, line: 153, baseType: !83)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !59, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !60, line: 37, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !59, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !60, line: 38, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !59, file: !60, line: 93, baseType: !58, size: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !59, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 160, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DISubprogram(name: "set_program_name", scope: !116, file: !116, line: 37, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!116 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!117 = !DISubroutineType(types: !118)
!118 = !{null, !50}
!119 = !DISubprogram(name: "setlocale", scope: !120, file: !120, line: 122, type: !121, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!120 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!121 = !DISubroutineType(types: !122)
!122 = !{!48, !52, !50}
!123 = !DISubprogram(name: "bindtextdomain", scope: !45, file: !45, line: 86, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!124 = !DISubroutineType(types: !125)
!125 = !{!48, !50, !50}
!126 = !DISubprogram(name: "textdomain", scope: !45, file: !45, line: 82, type: !127, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!127 = !DISubroutineType(types: !128)
!128 = !{!48, !50}
!129 = !DISubprogram(name: "atexit", scope: !130, file: !130, line: 595, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!130 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!131 = !DISubroutineType(types: !132)
!132 = !{!52, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DISubprogram(name: "getopt_long", scope: !137, file: !137, line: 66, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!137 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!138 = !DISubroutineType(types: !139)
!139 = !{!52, !52, !140, !50, !142, !149}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !137, line: 50, size: 256, elements: !145)
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !137, line: 52, baseType: !50, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !144, file: !137, line: 55, baseType: !52, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !144, file: !137, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !144, file: !137, line: 57, baseType: !52, size: 32, offset: 192)
!151 = !DISubprogram(name: "error", scope: !152, file: !152, line: 52, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!152 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !52, !52, !50, null}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !55, line: 63, baseType: !81)
!156 = !DISubprogram(name: "xdectoimax", scope: !157, file: !157, line: 30, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!157 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{!83, !50, !83, !83, !50, !50, !52}
!160 = !DISubprogram(name: "version_etc", scope: !161, file: !161, line: 69, type: !162, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!161 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !DISubroutineType(types: !163)
!163 = !{null, !58, !50, !50, !50, null}
!164 = !DISubprogram(name: "quote_n", scope: !165, file: !165, line: 40, type: !166, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!165 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !DISubroutineType(types: !167)
!167 = !{!50, !52, !50}
!168 = !DISubprogram(name: "quotearg_style", scope: !30, file: !30, line: 377, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!169 = !DISubroutineType(types: !170)
!170 = !{!48, !29, !50}
!171 = !DISubprogram(name: "open", scope: !172, file: !172, line: 196, type: !173, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!172 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!173 = !DISubroutineType(types: !174)
!174 = !{!52, !50, !52, null}
!175 = !DISubprogram(name: "lseek", scope: !176, file: !176, line: 334, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!176 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!177 = !DISubroutineType(types: !178)
!178 = !{!83, !52, !83, !52}
!179 = !DISubprogram(name: "close", scope: !176, file: !176, line: 353, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!180 = !DISubroutineType(types: !181)
!181 = !{!52, !52}
!182 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!183 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!184 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!185 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!186 = !DISubprogram(name: "ftruncate", scope: !176, file: !176, line: 1014, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!187 = !DISubroutineType(types: !188)
!188 = !{!52, !52, !83}
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !190, line: 101, baseType: !191)
!190 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !82, line: 72, baseType: !83)
!192 = !{!193, !196, !198, !0}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 41, type: !195, isLocal: true, isDefinition: true)
!195 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "block_mode", scope: !2, file: !3, line: 44, type: !195, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 47, type: !50, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 1792, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 7)
!203 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!204 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "Version", scope: !207, file: !208, line: 2, type: !50, isDefinition: true)
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, globals: !209, nameTableKind: None)
!208 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !{!205}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "file_name", scope: !212, file: !213, line: 46, type: !50, isLocal: true, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !214, globals: !252, nameTableKind: None)
!213 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !{!215, !44, !251, !151}
!215 = !DISubprogram(name: "close_stream", scope: !216, file: !216, line: 2, type: !217, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!216 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!217 = !DISubroutineType(types: !218)
!218 = !{!52, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !220, file: !60, line: 51, baseType: !52, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !220, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !220, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !220, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !220, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !220, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !220, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !220, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !220, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !220, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !220, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !220, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !220, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !220, file: !60, line: 70, baseType: !219, size: 64, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !220, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !220, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !220, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !220, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !220, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !220, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !220, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !220, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !220, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !220, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !220, file: !60, line: 93, baseType: !219, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !220, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !220, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !220, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !220, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!251 = !DISubprogram(name: "quotearg_colon", scope: !30, file: !30, line: 391, type: !127, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!252 = !{!210, !253}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !212, file: !213, line: 56, type: !195, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "exit_failure", scope: !257, file: !258, line: 24, type: !260, isDefinition: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, globals: !259, nameTableKind: None)
!258 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = !{!255}
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "program_name", scope: !263, file: !264, line: 33, type: !50, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !265, globals: !301, nameTableKind: None)
!264 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !{!105, !266, !48}
!266 = !DISubprogram(name: "fputs", scope: !55, file: !55, line: 626, type: !267, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!267 = !DISubroutineType(types: !268)
!268 = !{!52, !50, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !270, file: !60, line: 51, baseType: !52, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !270, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !270, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !270, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !270, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !270, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !270, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !270, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !270, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !270, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !270, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !270, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !270, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !270, file: !60, line: 70, baseType: !269, size: 64, offset: 832)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !270, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !270, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !270, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !270, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !270, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !270, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !270, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !270, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !270, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !270, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !270, file: !60, line: 93, baseType: !269, size: 64, offset: 1344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !270, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !270, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !270, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !270, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!301 = !{!261}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !304, file: !305, line: 85, type: !410, isDefinition: true)
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !306, retainedTypes: !312, globals: !383, nameTableKind: None)
!305 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!306 = !{!29, !307, !14}
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !30, line: 242, baseType: !6, size: 32, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!312 = !{!313, !319, !335, !338, !52, !85, !341, !107, !358, !362, !44, !368, !372, !48, !376, !379, !380}
!313 = !DISubprogram(name: "xmemdup", scope: !314, file: !314, line: 62, type: !315, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!314 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!315 = !DISubroutineType(types: !316)
!316 = !{!105, !317, !109}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!319 = !DISubprogram(name: "quotearg_alloc_mem", scope: !30, file: !30, line: 342, type: !320, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!320 = !DISubroutineType(types: !321)
!321 = !{!48, !50, !109, !322, !323}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !305, line: 65, size: 448, elements: !326)
!326 = !{!327, !328, !329, !333, !334}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !325, file: !305, line: 68, baseType: !29, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !325, file: !305, line: 71, baseType: !52, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !325, file: !305, line: 75, baseType: !330, size: 256, offset: 64)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !325, file: !305, line: 78, baseType: !50, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !325, file: !305, line: 81, baseType: !50, size: 64, offset: 384)
!335 = !DISubprogram(name: "free", scope: !130, file: !130, line: 565, type: !336, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !105}
!338 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !30, file: !30, line: 408, type: !339, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!339 = !DISubroutineType(types: !340)
!340 = !{!48, !52, !50, !50, !50, !109}
!341 = !DISubprogram(name: "rpl_mbrtowc", scope: !342, file: !342, line: 717, type: !343, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!342 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!343 = !DISubroutineType(types: !344)
!344 = !{!109, !149, !50, !109, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 13, size: 64, elements: !348)
!347 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !346, file: !347, line: 15, baseType: !52, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !346, file: !347, line: 20, baseType: !351, size: 32, offset: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !346, file: !347, line: 16, size: 32, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !351, file: !347, line: 18, baseType: !6, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !351, file: !347, line: 19, baseType: !355, size: 32)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 32, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 4)
!358 = !DISubprogram(name: "iswprint", scope: !359, file: !359, line: 120, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!359 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!360 = !DISubroutineType(types: !361)
!361 = !{!52, !6}
!362 = !DISubprogram(name: "mbsinit", scope: !363, file: !363, line: 292, type: !364, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!363 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!364 = !DISubroutineType(types: !365)
!365 = !{!52, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!368 = !DISubprogram(name: "locale_charset", scope: !369, file: !369, line: 35, type: !370, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!369 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !DISubroutineType(types: !371)
!371 = !{!50}
!372 = !DISubprogram(name: "c_strcasecmp", scope: !373, file: !373, line: 42, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!373 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!374 = !DISubroutineType(types: !375)
!375 = !{!52, !50, !50}
!376 = !DISubprogram(name: "xmalloc", scope: !314, file: !314, line: 53, type: !377, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!377 = !DISubroutineType(types: !378)
!378 = !{!105, !109}
!379 = !DISubprogram(name: "xalloc_die", scope: !314, file: !314, line: 51, type: !134, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !53)
!380 = !DISubprogram(name: "xrealloc", scope: !314, file: !314, line: 59, type: !381, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!381 = !DISubroutineType(types: !382)
!382 = !{!105, !105, !109}
!383 = !{!302, !384, !390, !392, !394, !399, !406, !408}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !304, file: !305, line: 101, type: !386, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 320, elements: !388)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!388 = !{!389}
!389 = !DISubrange(count: 10)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !304, file: !305, line: 1052, type: !325, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !304, file: !305, line: 116, type: !325, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "slot0", scope: !304, file: !305, line: 842, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 2048, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 256)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "slotvec", scope: !304, file: !305, line: 845, type: !401, isLocal: true, isDefinition: true)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !305, line: 834, size: 128, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !402, file: !305, line: 836, baseType: !107, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !402, file: !305, line: 837, baseType: !48, size: 64, offset: 64)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "nslots", scope: !304, file: !305, line: 843, type: !52, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "slotvec0", scope: !304, file: !305, line: 844, type: !402, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 704, elements: !412)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!412 = !{!413}
!413 = !DISubrange(count: 11)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !416, file: !417, line: 26, type: !419, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, globals: !418, nameTableKind: None)
!417 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!414}
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 376, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 47)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !424, retainedTypes: !428, nameTableKind: None)
!423 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!424 = !{!425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 40, baseType: !6, size: 32, elements: !426)
!426 = !{!427}
!427 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!428 = !{!44, !429, !105}
!429 = !DISubprogram(name: "fputs_unlocked", scope: !55, file: !55, line: 662, type: !430, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!430 = !DISubroutineType(types: !431)
!431 = !{!52, !50, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !433, file: !60, line: 51, baseType: !52, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !433, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !433, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !433, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !433, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !433, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !433, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !433, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !433, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !433, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !433, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !433, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !433, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !433, file: !60, line: 70, baseType: !432, size: 64, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !433, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !433, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !433, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !433, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !433, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !433, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !433, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !433, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !433, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !433, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !433, file: !60, line: 93, baseType: !432, size: 64, offset: 1344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !433, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !433, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !433, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !433, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !466, retainedTypes: !479, nameTableKind: None)
!465 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!466 = !{!467}
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !468, file: !314, line: 186, baseType: !6, size: 32, elements: !477)
!468 = distinct !DISubprogram(name: "x2nrealloc", scope: !314, file: !314, line: 174, type: !469, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !464, retainedNodes: !472)
!469 = !DISubroutineType(types: !470)
!470 = !{!105, !105, !471, !107}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!472 = !{!473, !474, !475, !476}
!473 = !DILocalVariable(name: "p", arg: 1, scope: !468, file: !314, line: 174, type: !105)
!474 = !DILocalVariable(name: "pn", arg: 2, scope: !468, file: !314, line: 174, type: !471)
!475 = !DILocalVariable(name: "s", arg: 3, scope: !468, file: !314, line: 174, type: !107)
!476 = !DILocalVariable(name: "n", scope: !468, file: !314, line: 176, type: !107)
!477 = !{!478}
!478 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!479 = !{!107, !379, !376, !380, !48, !335, !105, !480, !483}
!480 = !DISubprogram(name: "xcalloc", scope: !314, file: !314, line: 57, type: !481, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!481 = !DISubroutineType(types: !482)
!482 = !{!105, !109, !109}
!483 = !DISubprogram(name: "rpl_calloc", scope: !484, file: !484, line: 688, type: !481, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!484 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !487, nameTableKind: None)
!486 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = !{!44, !151}
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !490, retainedTypes: !499, nameTableKind: None)
!489 = !DIFile(filename: "lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = !{!491}
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !492, line: 25, baseType: !6, size: 32, elements: !493)
!492 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!493 = !{!494, !495, !496, !497, !498}
!494 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!495 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!496 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!497 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!498 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!499 = !{!500, !505, !151}
!500 = !DISubprogram(name: "xstrtoimax", scope: !492, file: !492, line: 47, type: !501, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!501 = !DISubroutineType(types: !502)
!502 = !{!491, !50, !503, !52, !504, !50}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!505 = !DISubprogram(name: "quote", scope: !165, file: !165, line: 44, type: !506, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!506 = !DISubroutineType(types: !507)
!507 = !{!50, !50}
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !490, nameTableKind: None)
!509 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !512, nameTableKind: None)
!511 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!512 = !{!105}
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !515, nameTableKind: None)
!514 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!515 = !{!516, !107, !528}
!516 = !DISubprogram(name: "mbrtowc", scope: !363, file: !363, line: 296, type: !517, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!517 = !DISubroutineType(types: !518)
!518 = !{!109, !149, !50, !109, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 13, size: 64, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !520, file: !347, line: 15, baseType: !52, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !520, file: !347, line: 20, baseType: !524, size: 32, offset: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !347, line: 16, size: 32, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !524, file: !347, line: 18, baseType: !6, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !524, file: !347, line: 19, baseType: !355, size: 32)
!528 = !DISubprogram(name: "hard_locale", scope: !529, file: !529, line: 26, type: !530, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!529 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !DISubroutineType(types: !531)
!531 = !{!195, !52}
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !534, nameTableKind: None)
!533 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!534 = !{!535}
!535 = !DISubprogram(name: "rpl_fclose", scope: !536, file: !536, line: 672, type: !537, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!536 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!537 = !DISubroutineType(types: !538)
!538 = !{!52, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !540, file: !60, line: 51, baseType: !52, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !540, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !540, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !540, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !540, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !540, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !540, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !540, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !540, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !540, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !540, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !540, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !540, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !540, file: !60, line: 70, baseType: !539, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !540, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !540, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !540, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !540, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !540, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !540, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !540, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !540, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !540, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !540, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !540, file: !60, line: 93, baseType: !539, size: 64, offset: 1344)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !540, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !540, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !540, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !540, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !573, nameTableKind: None)
!572 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !{!574}
!574 = !DISubprogram(name: "setlocale_null_r", scope: !575, file: !575, line: 64, type: !576, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!575 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !DISubroutineType(types: !577)
!577 = !{!52, !52, !48, !109}
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !580, retainedTypes: !967, nameTableKind: None)
!579 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!580 = !{!581}
!581 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !582, line: 41, baseType: !6, size: 32, elements: !583)
!582 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966}
!584 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!585 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!586 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!587 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!588 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!589 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!590 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!591 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!592 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!593 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!594 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!595 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!596 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!597 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!598 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!599 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!600 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!601 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!602 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!603 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!604 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!605 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!606 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!607 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!608 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!609 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!610 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!611 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!612 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!613 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!614 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!615 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!616 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!617 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!618 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!619 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!620 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!621 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!622 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!623 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!624 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!625 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!626 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!627 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!628 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!629 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!630 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!631 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!632 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!633 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!692 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!695 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!696 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!697 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!698 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!699 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!700 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!701 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!702 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!703 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!704 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!705 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!706 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!779 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!852 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!853 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!854 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!855 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!856 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!857 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!858 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!859 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!860 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!861 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!862 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!863 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!864 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!865 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!866 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!868 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!869 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!870 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!871 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!872 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!873 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!899 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!900 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!901 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!902 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!903 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!908 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!909 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!910 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!911 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!967 = !{!968, !105}
!968 = !DISubprogram(name: "nl_langinfo", scope: !582, file: !582, line: 661, type: !969, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!969 = !DISubroutineType(types: !970)
!970 = !{!48, !52}
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !973, nameTableKind: None)
!972 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!973 = !{!105, !119}
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !976, nameTableKind: None)
!975 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!976 = !{!977, !1012, !175, !1013}
!977 = !DISubprogram(name: "fileno", scope: !55, file: !55, line: 786, type: !978, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!978 = !DISubroutineType(types: !979)
!979 = !{!52, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !981, file: !60, line: 51, baseType: !52, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !981, file: !60, line: 54, baseType: !48, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !981, file: !60, line: 55, baseType: !48, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !981, file: !60, line: 56, baseType: !48, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !981, file: !60, line: 57, baseType: !48, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !981, file: !60, line: 58, baseType: !48, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !981, file: !60, line: 59, baseType: !48, size: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !981, file: !60, line: 60, baseType: !48, size: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !981, file: !60, line: 61, baseType: !48, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !981, file: !60, line: 64, baseType: !48, size: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !981, file: !60, line: 65, baseType: !48, size: 64, offset: 640)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !981, file: !60, line: 66, baseType: !48, size: 64, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !981, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !981, file: !60, line: 70, baseType: !980, size: 64, offset: 832)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !981, file: !60, line: 72, baseType: !52, size: 32, offset: 896)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !981, file: !60, line: 73, baseType: !52, size: 32, offset: 928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !981, file: !60, line: 74, baseType: !81, size: 64, offset: 960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !981, file: !60, line: 77, baseType: !85, size: 16, offset: 1024)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !981, file: !60, line: 78, baseType: !87, size: 8, offset: 1040)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !981, file: !60, line: 79, baseType: !89, size: 8, offset: 1048)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !981, file: !60, line: 81, baseType: !93, size: 64, offset: 1088)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !981, file: !60, line: 89, baseType: !96, size: 64, offset: 1152)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !981, file: !60, line: 91, baseType: !98, size: 64, offset: 1216)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !981, file: !60, line: 92, baseType: !101, size: 64, offset: 1280)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !981, file: !60, line: 93, baseType: !980, size: 64, offset: 1344)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !981, file: !60, line: 94, baseType: !105, size: 64, offset: 1408)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !981, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !981, file: !60, line: 96, baseType: !52, size: 32, offset: 1536)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !981, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!1012 = !DISubprogram(name: "fclose", scope: !55, file: !55, line: 213, type: !978, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!1013 = !DISubprogram(name: "rpl_fflush", scope: !536, file: !536, line: 718, type: !978, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!1014 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1015, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !1016, nameTableKind: None)
!1015 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1016 = !{!105, !1017, !1052}
!1017 = !DISubprogram(name: "fflush", scope: !55, file: !55, line: 218, type: !1018, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !53)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!52, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1021, file: !60, line: 51, baseType: !52, size: 32)
