source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... FILE...\0A\00", align 1

!3 = !DIFile(filename: "src/truncate.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !14, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 60, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "rm_abs", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "rm_rel", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "rm_min", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "rm_max", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "rm_rdn", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "rm_rup", value: 5, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 46, baseType: !6, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!17 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!18 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!21 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !30, line: 32, baseType: !6, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!32 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!43 = !{!44, !45, !46, !51, !53, !54, !57, !6, !58, !59, !50, !56, !60, !61, !62}
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !47, line: 63, baseType: !48)
!47 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 152, baseType: !50)
!49 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!50 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 46, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!60 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !63, line: 101, baseType: !64)
!63 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !49, line: 72, baseType: !50)
!65 = !{!66, !69, !71, !0}
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 41, type: !68, isLocal: true, isDefinition: true)
!68 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "block_mode", scope: !2, file: !3, line: 44, type: !68, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 47, type: !73, isLocal: true, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1792, elements: !85)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !78, line: 50, size: 256, elements: !79)
!78 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!79 = !{!80, !81, !82, !84}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !78, line: 52, baseType: !73, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !77, file: !78, line: 55, baseType: !44, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !77, file: !78, line: 56, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !77, file: !78, line: 57, baseType: !44, size: 32, offset: 192)
!85 = !{!86}
!86 = !DISubrange(count: 7)
!87 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!88 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "Version", scope: !91, file: !92, line: 2, type: !73, isDefinition: true)
!91 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, globals: !94, nameTableKind: None)
!92 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!93 = !{}
!94 = !{!89}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "file_name", scope: !97, file: !98, line: 46, type: !73, isLocal: true, isDefinition: true)
!97 = distinct !DICompileUnit(language: DW_LANG_C99, file: !98, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, globals: !99, nameTableKind: None)
!98 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!99 = !{!95, !100}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !97, file: !98, line: 56, type: !68, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "exit_failure", scope: !104, file: !105, line: 24, type: !107, isDefinition: true)
!104 = distinct !DICompileUnit(language: DW_LANG_C99, file: !105, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, globals: !106, nameTableKind: None)
!105 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!106 = !{!102}
!107 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "program_name", scope: !110, file: !111, line: 33, type: !73, isDefinition: true)
!110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !111, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, retainedTypes: !112, globals: !113, nameTableKind: None)
!111 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!112 = !{!53, !51}
!113 = !{!108}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !116, file: !117, line: 85, type: !162, isDefinition: true)
!116 = distinct !DICompileUnit(language: DW_LANG_C99, file: !117, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !118, retainedTypes: !124, globals: !125, nameTableKind: None)
!117 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !{!29, !119, !14}
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !30, line: 242, baseType: !6, size: 32, elements: !120)
!120 = !{!121, !122, !123}
!121 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!124 = !{!44, !45, !54, !51}
!125 = !{!114, !126, !132, !144, !146, !151, !158, !160}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !116, file: !117, line: 101, type: !128, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !130)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!130 = !{!131}
!131 = !DISubrange(count: 10)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !116, file: !117, line: 1052, type: !134, isDefinition: true)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !117, line: 65, size: 448, elements: !135)
!135 = !{!136, !137, !138, !142, !143}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !134, file: !117, line: 68, baseType: !29, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !117, line: 71, baseType: !44, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !134, file: !117, line: 75, baseType: !139, size: 256, offset: 64)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 8)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !134, file: !117, line: 78, baseType: !73, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !134, file: !117, line: 81, baseType: !73, size: 64, offset: 384)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !116, file: !117, line: 116, type: !134, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "slot0", scope: !116, file: !117, line: 842, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 256)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "slotvec", scope: !116, file: !117, line: 845, type: !153, isLocal: true, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !117, line: 834, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !154, file: !117, line: 836, baseType: !54, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !154, file: !117, line: 837, baseType: !51, size: 64, offset: 64)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "nslots", scope: !116, file: !117, line: 843, type: !44, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "slotvec0", scope: !116, file: !117, line: 844, type: !154, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 704, elements: !164)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!164 = !{!165}
!165 = !DISubrange(count: 11)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !168, file: !169, line: 26, type: !171, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, globals: !170, nameTableKind: None)
!169 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !{!166}
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 376, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 47)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !176, retainedTypes: !180, nameTableKind: None)
!175 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !{!177}
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !175, line: 40, baseType: !6, size: 32, elements: !178)
!178 = !{!179}
!179 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!180 = !{!53}
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !183, retainedTypes: !197, nameTableKind: None)
!182 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !{!184}
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !186, file: !185, line: 186, baseType: !6, size: 32, elements: !195)
!185 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = distinct !DISubprogram(name: "x2nrealloc", scope: !185, file: !185, line: 174, type: !187, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !190)
!187 = !DISubroutineType(types: !188)
!188 = !{!53, !53, !189, !54}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!190 = !{!191, !192, !193, !194}
!191 = !DILocalVariable(name: "p", arg: 1, scope: !186, file: !185, line: 174, type: !53)
!192 = !DILocalVariable(name: "pn", arg: 2, scope: !186, file: !185, line: 174, type: !189)
!193 = !DILocalVariable(name: "s", arg: 3, scope: !186, file: !185, line: 174, type: !54)
!194 = !DILocalVariable(name: "n", scope: !186, file: !185, line: 176, type: !54)
!195 = !{!196}
!196 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!197 = !{!54, !51, !53}
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, nameTableKind: None)
!199 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !202, nameTableKind: None)
!201 = !DIFile(filename: "lib/xdectoimax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !{!203}
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !204, line: 25, baseType: !6, size: 32, elements: !205)
!204 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = !{!206, !207, !208, !209, !210}
!206 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!207 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!208 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!209 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!210 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !202, nameTableKind: None)
!212 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, retainedTypes: !180, nameTableKind: None)
!214 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, retainedTypes: !217, nameTableKind: None)
!216 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!217 = !{!54}
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, nameTableKind: None)
!219 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, nameTableKind: None)
!221 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !224, retainedTypes: !180, nameTableKind: None)
!223 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!224 = !{!225}
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 41, baseType: !6, size: 32, elements: !227)
!226 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!228 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!229 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!230 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!231 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!232 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!233 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!234 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!235 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!236 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!237 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!238 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!239 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!240 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!241 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!242 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!243 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!244 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!245 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!246 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!247 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!248 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!249 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!250 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!251 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!252 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!253 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!254 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!255 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!256 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!257 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!258 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!259 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!260 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!261 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!262 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!263 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!264 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!265 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!266 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!267 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!268 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!269 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!270 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!271 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!272 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!273 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!274 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!275 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!276 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!277 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!312 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!336 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!339 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!340 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!341 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!342 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!343 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!344 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!345 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!346 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!347 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!348 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!349 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!350 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!423 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!496 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!497 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!498 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!499 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!500 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!501 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!502 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!503 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!504 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!505 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!506 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!507 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!508 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!509 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!510 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!512 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!513 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!514 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!515 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!516 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!517 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!543 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!544 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!545 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!546 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!547 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!552 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!553 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!554 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!555 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, retainedTypes: !180, nameTableKind: None)
!612 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, nameTableKind: None)
!614 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, retainedTypes: !180, nameTableKind: None)
!616 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !93, retainedTypes: !180, nameTableKind: None)
!618 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!619 = !{!"clang version 12.0.1"}
!620 = !{i32 7, !"Dwarf Version", i32 4}
!621 = !{i32 2, !"Debug Info Version", i32 3}
!622 = !{i32 1, !"wchar_size", i32 4}
!623 = !{i32 7, !"PIC Level", i32 2}
!624 = !{i32 7, !"PIE Level", i32 2}
!625 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 64, type: !626, scopeLine: 65, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !44}
!628 = !{!629}
!629 = !DILocalVariable(name: "status", arg: 1, scope: !625, file: !3, line: 64, type: !44)
!630 = !DILocation(scope: !625)
!631 = !DILocation(line: 66, column: 14, scope: !632)
!632 = distinct !DILexicalBlock(scope: !625, file: !3, line: 66, column: 7)
!633 = !DILocation(line: 66, column: 7, scope: !625)
!634 = !DILocation(line: 67, column: 5, scope: !635)
!635 = distinct !DILexicalBlock(scope: !632, file: !3, line: 67, column: 5)
!636 = !{!637, !637, i64 0}
!637 = !{!"any pointer", !638, i64 0}
!638 = !{!"omnipotent char", !639, i64 0}
!639 = !{!"Simple C/C++ TBAA"}
!640 = !DILocation(line: 70, column: 7, scope: !641)
!641 = distinct !DILexicalBlock(scope: !632, file: !3, line: 69, column: 5)
!642 = !DILocation(line: 71, column: 7, scope: !641)
!643 = !DILocation(line: 590, column: 3, scope: !644, inlinedAt: !648)
!644 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !645, file: !645, line: 588, type: !646, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!645 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!646 = !DISubroutineType(types: !647)
!647 = !{null}
!648 = distinct !DILocation(line: 81, column: 7, scope: !641)
!649 = !DILocation(line: 83, column: 7, scope: !641)
!650 = !DILocation(line: 86, column: 7, scope: !641)
!651 = !DILocation(line: 89, column: 7, scope: !641)
!652 = !DILocation(line: 92, column: 7, scope: !641)
!653 = !DILocation(line: 93, column: 7, scope: !641)
!654 = !DILocation(line: 598, column: 3, scope: !655, inlinedAt: !656)
!655 = distinct !DISubprogram(name: "emit_size_note", scope: !645, file: !645, line: 596, type: !646, scopeLine: 597, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!656 = distinct !DILocation(line: 94, column: 7, scope: !641)
!657 = !DILocation(line: 95, column: 7, scope: !641)
!658 = !DILocalVariable(name: "program", arg: 1, scope: !659, file: !645, line: 634, type: !73)
!659 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !645, file: !645, line: 634, type: !660, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !662)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !73}
!662 = !{!658, !663, !670, !671, !673}
!663 = !DILocalVariable(name: "infomap", scope: !659, file: !645, line: 636, type: !664)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 896, elements: !85)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !659, file: !645, line: 636, size: 128, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !666, file: !645, line: 636, baseType: !73, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !666, file: !645, line: 636, baseType: !73, size: 64, offset: 64)
!670 = !DILocalVariable(name: "node", scope: !659, file: !645, line: 646, type: !73)
!671 = !DILocalVariable(name: "map_prog", scope: !659, file: !645, line: 647, type: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!673 = !DILocalVariable(name: "lc_messages", scope: !659, file: !645, line: 659, type: !73)
!674 = !DILocation(scope: !659, inlinedAt: !675)
!675 = distinct !DILocation(line: 99, column: 7, scope: !641)
!676 = !DILocation(line: 636, column: 3, scope: !659, inlinedAt: !675)
!677 = !DILocation(line: 636, column: 67, scope: !659, inlinedAt: !675)
!678 = !DILocation(line: 647, column: 36, scope: !659, inlinedAt: !675)
!679 = !DILocation(line: 649, column: 3, scope: !659, inlinedAt: !675)
!680 = !DILocation(line: 649, column: 33, scope: !659, inlinedAt: !675)
!681 = !DILocation(line: 650, column: 13, scope: !659, inlinedAt: !675)
!682 = !DILocation(line: 649, column: 20, scope: !659, inlinedAt: !675)
!683 = !{!684, !637, i64 0}
!684 = !{!"infomap", !637, i64 0, !637, i64 8}
!685 = !DILocation(line: 649, column: 10, scope: !659, inlinedAt: !675)
!686 = !DILocation(line: 649, column: 28, scope: !659, inlinedAt: !675)
!687 = distinct !{!687, !679, !681, !688}
!688 = !{!"llvm.loop.mustprogress"}
!689 = !DILocation(line: 652, column: 17, scope: !690, inlinedAt: !675)
!690 = distinct !DILexicalBlock(scope: !659, file: !645, line: 652, column: 7)
!691 = !{!684, !637, i64 8}
!692 = !DILocation(line: 652, column: 7, scope: !690, inlinedAt: !675)
!693 = !DILocation(line: 652, column: 7, scope: !659, inlinedAt: !675)
!694 = !DILocation(line: 655, column: 3, scope: !659, inlinedAt: !675)
!695 = !DILocation(line: 659, column: 29, scope: !659, inlinedAt: !675)
!696 = !DILocation(line: 660, column: 7, scope: !697, inlinedAt: !675)
!697 = distinct !DILexicalBlock(scope: !659, file: !645, line: 660, column: 7)
!698 = !DILocation(line: 660, column: 19, scope: !697, inlinedAt: !675)
!699 = !DILocation(line: 660, column: 22, scope: !697, inlinedAt: !675)
!700 = !DILocation(line: 660, column: 7, scope: !659, inlinedAt: !675)
!701 = !DILocation(line: 666, column: 7, scope: !702, inlinedAt: !675)
!702 = distinct !DILexicalBlock(scope: !697, file: !645, line: 661, column: 5)
!703 = !DILocation(line: 668, column: 5, scope: !702, inlinedAt: !675)
!704 = !DILocation(line: 669, column: 3, scope: !659, inlinedAt: !675)
!705 = !DILocation(line: 671, column: 3, scope: !659, inlinedAt: !675)
!706 = !DILocation(line: 673, column: 1, scope: !659, inlinedAt: !675)
!707 = !DILocation(line: 101, column: 3, scope: !625)
!708 = !DISubprogram(name: "dcgettext", scope: !709, file: !709, line: 51, type: !710, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!709 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!710 = !DISubroutineType(types: !711)
!711 = !{!51, !73, !73, !44}
!712 = !DISubprogram(name: "fputs_unlocked", scope: !47, file: !47, line: 667, type: !713, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!713 = !DISubroutineType(types: !714)
!714 = !{!44, !73, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !717, line: 49, size: 1728, elements: !718)
!717 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !734, !735, !736, !737, !738, !739, !740, !744, !747, !749, !752, !755, !756, !757, !758, !759}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !716, file: !717, line: 51, baseType: !44, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !716, file: !717, line: 54, baseType: !51, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !716, file: !717, line: 55, baseType: !51, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !716, file: !717, line: 56, baseType: !51, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !716, file: !717, line: 57, baseType: !51, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !716, file: !717, line: 58, baseType: !51, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !716, file: !717, line: 59, baseType: !51, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !716, file: !717, line: 60, baseType: !51, size: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !716, file: !717, line: 61, baseType: !51, size: 64, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !716, file: !717, line: 64, baseType: !51, size: 64, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !716, file: !717, line: 65, baseType: !51, size: 64, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !716, file: !717, line: 66, baseType: !51, size: 64, offset: 704)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !716, file: !717, line: 68, baseType: !732, size: 64, offset: 768)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !717, line: 36, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !716, file: !717, line: 70, baseType: !715, size: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !716, file: !717, line: 72, baseType: !44, size: 32, offset: 896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !716, file: !717, line: 73, baseType: !44, size: 32, offset: 928)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !716, file: !717, line: 74, baseType: !48, size: 64, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !716, file: !717, line: 77, baseType: !45, size: 16, offset: 1024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !716, file: !717, line: 78, baseType: !57, size: 8, offset: 1040)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !716, file: !717, line: 79, baseType: !741, size: 8, offset: 1048)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 1)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !716, file: !717, line: 81, baseType: !745, size: 64, offset: 1088)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !717, line: 43, baseType: null)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !716, file: !717, line: 89, baseType: !748, size: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 153, baseType: !50)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !716, file: !717, line: 91, baseType: !750, size: 64, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !717, line: 37, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !716, file: !717, line: 92, baseType: !753, size: 64, offset: 1280)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !717, line: 38, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !716, file: !717, line: 93, baseType: !715, size: 64, offset: 1344)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !716, file: !717, line: 94, baseType: !53, size: 64, offset: 1408)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !716, file: !717, line: 95, baseType: !54, size: 64, offset: 1472)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !716, file: !717, line: 96, baseType: !44, size: 32, offset: 1536)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !716, file: !717, line: 98, baseType: !760, size: 160, offset: 1568)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 20)
!763 = !DISubprogram(name: "setlocale", scope: !764, file: !764, line: 122, type: !765, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!764 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!765 = !DISubroutineType(types: !766)
!766 = !{!51, !44, !73}
!767 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 202, type: !768, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !771)
!768 = !DISubroutineType(types: !769)
!769 = !{!44, !44, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !780, !781, !782, !783, !784, !823, !824, !827, !830}
!772 = !DILocalVariable(name: "argc", arg: 1, scope: !767, file: !3, line: 202, type: !44)
!773 = !DILocalVariable(name: "argv", arg: 2, scope: !767, file: !3, line: 202, type: !770)
!774 = !DILocalVariable(name: "got_size", scope: !767, file: !3, line: 204, type: !68)
!775 = !DILocalVariable(name: "errors", scope: !767, file: !3, line: 205, type: !68)
!776 = !DILocalVariable(name: "size", scope: !767, file: !3, line: 206, type: !46)
!777 = !DILocalVariable(name: "rsize", scope: !767, file: !3, line: 207, type: !46)
!778 = !DILocalVariable(name: "rel_mode", scope: !767, file: !3, line: 208, type: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_mode_t", file: !3, line: 61, baseType: !5)
!780 = !DILocalVariable(name: "c", scope: !767, file: !3, line: 209, type: !44)
!781 = !DILocalVariable(name: "fd", scope: !767, file: !3, line: 209, type: !44)
!782 = !DILocalVariable(name: "oflags", scope: !767, file: !3, line: 209, type: !44)
!783 = !DILocalVariable(name: "fname", scope: !767, file: !3, line: 210, type: !73)
!784 = !DILocalVariable(name: "sb", scope: !785, file: !3, line: 324, type: !787)
!785 = distinct !DILexicalBlock(scope: !786, file: !3, line: 323, column: 5)
!786 = distinct !DILexicalBlock(scope: !767, file: !3, line: 322, column: 7)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !788, line: 26, size: 1152, elements: !789)
!788 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!789 = !{!790, !792, !794, !796, !798, !800, !802, !803, !804, !805, !807, !809, !817, !818, !819}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !787, file: !788, line: 28, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !49, line: 145, baseType: !56)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !787, file: !788, line: 33, baseType: !793, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !49, line: 148, baseType: !56)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !787, file: !788, line: 41, baseType: !795, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !49, line: 151, baseType: !56)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !787, file: !788, line: 42, baseType: !797, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !49, line: 150, baseType: !6)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !787, file: !788, line: 44, baseType: !799, size: 32, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !49, line: 146, baseType: !6)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !787, file: !788, line: 45, baseType: !801, size: 32, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !49, line: 147, baseType: !6)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !787, file: !788, line: 47, baseType: !44, size: 32, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !787, file: !788, line: 49, baseType: !791, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !787, file: !788, line: 54, baseType: !48, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !787, file: !788, line: 58, baseType: !806, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !49, line: 175, baseType: !50)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !787, file: !788, line: 60, baseType: !808, size: 64, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !49, line: 180, baseType: !50)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !787, file: !788, line: 71, baseType: !810, size: 128, offset: 576)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !811, line: 10, size: 128, elements: !812)
!811 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!812 = !{!813, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !810, file: !811, line: 12, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !49, line: 160, baseType: !50)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !810, file: !811, line: 16, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !49, line: 197, baseType: !50)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !787, file: !788, line: 72, baseType: !810, size: 128, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !787, file: !788, line: 73, baseType: !810, size: 128, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !787, file: !788, line: 86, baseType: !820, size: 192, offset: 960)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 192, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 3)
!823 = !DILocalVariable(name: "file_size", scope: !785, file: !3, line: 325, type: !46)
!824 = !DILocalVariable(name: "ref_fd", scope: !825, file: !3, line: 332, type: !44)
!825 = distinct !DILexicalBlock(scope: !826, file: !3, line: 331, column: 9)
!826 = distinct !DILexicalBlock(scope: !785, file: !3, line: 328, column: 11)
!827 = !DILocalVariable(name: "file_end", scope: !828, file: !3, line: 335, type: !46)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 334, column: 13)
!829 = distinct !DILexicalBlock(scope: !825, file: !3, line: 333, column: 15)
!830 = !DILocalVariable(name: "saved_errno", scope: !828, file: !3, line: 336, type: !44)
!831 = !DILocation(scope: !767)
!832 = !DILocation(line: 213, column: 21, scope: !767)
!833 = !DILocation(line: 213, column: 3, scope: !767)
!834 = !DILocation(line: 214, column: 3, scope: !767)
!835 = !DILocation(line: 215, column: 3, scope: !767)
!836 = !DILocation(line: 216, column: 3, scope: !767)
!837 = !DILocation(line: 218, column: 3, scope: !767)
!838 = !DILocation(line: 220, column: 3, scope: !767)
!839 = !DILocation(line: 220, column: 15, scope: !767)
!840 = !DILocation(line: 238, column: 18, scope: !841)
!841 = distinct !DILexicalBlock(scope: !842, file: !3, line: 223, column: 9)
!842 = distinct !DILexicalBlock(scope: !767, file: !3, line: 221, column: 5)
!843 = !{!638, !638, i64 0}
!844 = !{!845, !845, i64 0}
!845 = !{!"short", !638, i64 0}
!846 = !DILocation(line: 238, column: 11, scope: !841)
!847 = !DILocation(line: 225, column: 21, scope: !841)
!848 = !DILocation(line: 226, column: 11, scope: !841)
!849 = !DILocation(line: 229, column: 22, scope: !841)
!850 = !DILocation(line: 230, column: 11, scope: !841)
!851 = !DILocation(line: 233, column: 22, scope: !841)
!852 = !DILocation(line: 233, column: 20, scope: !841)
!853 = !DILocation(line: 234, column: 11, scope: !841)
!854 = distinct !{!854, !838, !855, !688}
!855 = !DILocation(line: 289, column: 5, scope: !767)
!856 = !DILocation(line: 239, column: 19, scope: !841)
!857 = distinct !{!857, !846, !856, !688}
!858 = !DILocation(line: 240, column: 19, scope: !841)
!859 = !DILocation(line: 240, column: 11, scope: !841)
!860 = !DILocation(line: 249, column: 15, scope: !861)
!861 = distinct !DILexicalBlock(scope: !841, file: !3, line: 241, column: 13)
!862 = !DILocation(line: 253, column: 15, scope: !861)
!863 = !DILocation(line: 257, column: 15, scope: !861)
!864 = !DILocation(scope: !861)
!865 = !DILocation(line: 260, column: 18, scope: !841)
!866 = !DILocation(line: 260, column: 11, scope: !841)
!867 = !DILocation(line: 261, column: 19, scope: !841)
!868 = distinct !{!868, !866, !867, !688}
!869 = !DILocation(line: 262, column: 30, scope: !870)
!870 = distinct !DILexicalBlock(scope: !841, file: !3, line: 262, column: 15)
!871 = !DILocation(line: 264, column: 19, scope: !872)
!872 = distinct !DILexicalBlock(scope: !873, file: !3, line: 264, column: 19)
!873 = distinct !DILexicalBlock(scope: !870, file: !3, line: 263, column: 13)
!874 = !DILocation(line: 264, column: 19, scope: !873)
!875 = !DILocation(line: 266, column: 32, scope: !876)
!876 = distinct !DILexicalBlock(scope: !872, file: !3, line: 265, column: 17)
!877 = !DILocation(line: 266, column: 19, scope: !876)
!878 = !DILocation(line: 268, column: 19, scope: !876)
!879 = !DILocation(line: 275, column: 30, scope: !841)
!880 = !DILocation(line: 274, column: 18, scope: !841)
!881 = !DILocation(line: 277, column: 35, scope: !882)
!882 = distinct !DILexicalBlock(scope: !841, file: !3, line: 277, column: 15)
!883 = !DILocation(line: 278, column: 13, scope: !882)
!884 = !DILocation(line: 282, column: 9, scope: !841)
!885 = !DILocation(line: 284, column: 9, scope: !841)
!886 = !DILocation(line: 287, column: 11, scope: !841)
!887 = !DILocation(line: 291, column: 11, scope: !767)
!888 = !{!889, !889, i64 0}
!889 = !{!"int", !638, i64 0}
!890 = !DILocation(line: 291, column: 8, scope: !767)
!891 = !DILocation(line: 295, column: 8, scope: !892)
!892 = distinct !DILexicalBlock(scope: !767, file: !3, line: 295, column: 7)
!893 = !DILocation(line: 295, column: 17, scope: !892)
!894 = !DILocation(line: 297, column: 20, scope: !895)
!895 = distinct !DILexicalBlock(scope: !892, file: !3, line: 296, column: 5)
!896 = !DILocation(line: 298, column: 14, scope: !895)
!897 = !DILocation(line: 298, column: 37, scope: !895)
!898 = !DILocation(line: 297, column: 7, scope: !895)
!899 = !DILocation(line: 299, column: 7, scope: !895)
!900 = !DILocation(line: 302, column: 16, scope: !901)
!901 = distinct !DILexicalBlock(scope: !767, file: !3, line: 302, column: 7)
!902 = !DILocation(line: 304, column: 20, scope: !903)
!903 = distinct !DILexicalBlock(scope: !901, file: !3, line: 303, column: 5)
!904 = !DILocation(line: 305, column: 14, scope: !903)
!905 = !DILocation(line: 305, column: 37, scope: !903)
!906 = !DILocation(line: 304, column: 7, scope: !903)
!907 = !DILocation(line: 306, column: 7, scope: !903)
!908 = !DILocation(line: 309, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !767, file: !3, line: 309, column: 7)
!910 = !DILocation(line: 309, column: 18, scope: !909)
!911 = !DILocation(line: 311, column: 20, scope: !912)
!912 = distinct !DILexicalBlock(scope: !909, file: !3, line: 310, column: 5)
!913 = !DILocation(line: 312, column: 14, scope: !912)
!914 = !DILocation(line: 312, column: 42, scope: !912)
!915 = !DILocation(line: 311, column: 7, scope: !912)
!916 = !DILocation(line: 313, column: 7, scope: !912)
!917 = !DILocation(line: 316, column: 12, scope: !918)
!918 = distinct !DILexicalBlock(scope: !767, file: !3, line: 316, column: 7)
!919 = !DILocation(line: 316, column: 7, scope: !767)
!920 = !DILocation(line: 318, column: 20, scope: !921)
!921 = distinct !DILexicalBlock(scope: !918, file: !3, line: 317, column: 5)
!922 = !DILocation(line: 318, column: 7, scope: !921)
!923 = !DILocation(line: 319, column: 7, scope: !921)
!924 = !DILocation(line: 322, column: 7, scope: !767)
!925 = !DILocation(line: 324, column: 7, scope: !785)
!926 = !DILocation(line: 324, column: 19, scope: !785)
!927 = !DILocation(scope: !785)
!928 = !DILocation(line: 326, column: 11, scope: !929)
!929 = distinct !DILexicalBlock(scope: !785, file: !3, line: 326, column: 11)
!930 = !DILocation(line: 326, column: 32, scope: !929)
!931 = !DILocation(line: 326, column: 11, scope: !785)
!932 = !DILocation(line: 327, column: 9, scope: !929)
!933 = !DILocalVariable(name: "sb", arg: 1, scope: !934, file: !645, line: 705, type: !937)
!934 = distinct !DISubprogram(name: "usable_st_size", scope: !645, file: !645, line: 705, type: !935, scopeLine: 706, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !939)
!935 = !DISubroutineType(types: !936)
!936 = !{!68, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!939 = !{!933}
!940 = !DILocation(scope: !934, inlinedAt: !941)
!941 = distinct !DILocation(line: 328, column: 11, scope: !826)
!942 = !DILocation(line: 707, column: 11, scope: !934, inlinedAt: !941)
!943 = !{!944, !889, i64 24}
!944 = !{!"stat", !945, i64 0, !945, i64 8, !945, i64 16, !889, i64 24, !889, i64 28, !889, i64 32, !889, i64 36, !945, i64 40, !945, i64 48, !945, i64 56, !945, i64 64, !946, i64 72, !946, i64 88, !946, i64 104, !638, i64 120}
!945 = !{!"long", !638, i64 0}
!946 = !{!"timespec", !945, i64 0, !945, i64 8}
!947 = !DILocation(line: 707, column: 33, scope: !934, inlinedAt: !941)
!948 = !DILocation(line: 332, column: 30, scope: !825)
!949 = !DILocation(line: 332, column: 24, scope: !825)
!950 = !DILocation(scope: !825)
!951 = !DILocation(line: 333, column: 17, scope: !829)
!952 = !DILocation(line: 333, column: 15, scope: !825)
!953 = !DILocation(line: 335, column: 32, scope: !828)
!954 = !DILocation(scope: !828)
!955 = !DILocation(line: 336, column: 33, scope: !828)
!956 = !DILocation(line: 337, column: 15, scope: !828)
!957 = !DILocation(line: 338, column: 21, scope: !958)
!958 = distinct !DILexicalBlock(scope: !828, file: !3, line: 338, column: 19)
!959 = !DILocation(line: 338, column: 19, scope: !828)
!960 = !DILocation(line: 343, column: 25, scope: !961)
!961 = distinct !DILexicalBlock(scope: !958, file: !3, line: 341, column: 17)
!962 = !DILocation(line: 329, column: 24, scope: !826)
!963 = !{!944, !945, i64 48}
!964 = !DILocation(line: 347, column: 21, scope: !965)
!965 = distinct !DILexicalBlock(scope: !785, file: !3, line: 347, column: 11)
!966 = !DILocation(line: 347, column: 11, scope: !785)
!967 = !DILocation(line: 348, column: 9, scope: !965)
!968 = !DILocation(line: 350, column: 11, scope: !785)
!969 = !DILocation(line: 354, column: 5, scope: !786)
!970 = !DILocation(line: 354, column: 5, scope: !785)
!971 = !DILocation(line: 356, column: 24, scope: !767)
!972 = !DILocation(line: 356, column: 49, scope: !767)
!973 = !DILocation(line: 358, column: 19, scope: !767)
!974 = !DILocation(line: 358, column: 28, scope: !767)
!975 = !DILocation(line: 358, column: 3, scope: !767)
!976 = !DILocation(line: 358, column: 24, scope: !767)
!977 = !DILocation(line: 360, column: 17, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !3, line: 360, column: 11)
!979 = distinct !DILexicalBlock(scope: !767, file: !3, line: 359, column: 5)
!980 = !DILocation(line: 360, column: 52, scope: !978)
!981 = !DILocation(line: 360, column: 11, scope: !979)
!982 = !DILocation(line: 366, column: 17, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !3, line: 366, column: 15)
!984 = distinct !DILexicalBlock(scope: !978, file: !3, line: 361, column: 9)
!985 = !DILocation(scope: !983)
!986 = !DILocation(line: 366, column: 27, scope: !983)
!987 = !DILocation(line: 366, column: 30, scope: !983)
!988 = !DILocation(line: 366, column: 36, scope: !983)
!989 = !DILocation(line: 366, column: 15, scope: !984)
!990 = !DILocation(line: 368, column: 25, scope: !991)
!991 = distinct !DILexicalBlock(scope: !983, file: !3, line: 367, column: 13)
!992 = !DILocation(line: 368, column: 32, scope: !991)
!993 = !DILocation(line: 369, column: 22, scope: !991)
!994 = !DILocation(line: 368, column: 15, scope: !991)
!995 = !DILocation(line: 371, column: 13, scope: !991)
!996 = distinct !{!996, !975, !997, !688}
!997 = !DILocation(line: 385, column: 5, scope: !767)
!998 = !DILocalVariable(name: "fd", arg: 1, scope: !999, file: !3, line: 106, type: !44)
!999 = distinct !DISubprogram(name: "do_ftruncate", scope: !3, file: !3, line: 106, type: !1000, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1002)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!68, !44, !73, !46, !46, !779}
!1002 = !{!998, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1013, !1014, !1017}
!1003 = !DILocalVariable(name: "fname", arg: 2, scope: !999, file: !3, line: 106, type: !73)
!1004 = !DILocalVariable(name: "ssize", arg: 3, scope: !999, file: !3, line: 106, type: !46)
!1005 = !DILocalVariable(name: "rsize", arg: 4, scope: !999, file: !3, line: 106, type: !46)
!1006 = !DILocalVariable(name: "rel_mode", arg: 5, scope: !999, file: !3, line: 107, type: !779)
!1007 = !DILocalVariable(name: "sb", scope: !999, file: !3, line: 109, type: !787)
!1008 = !DILocalVariable(name: "nsize", scope: !999, file: !3, line: 110, type: !46)
!1009 = !DILocalVariable(name: "blksize", scope: !1010, file: !3, line: 119, type: !1012)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 118, column: 5)
!1011 = distinct !DILexicalBlock(scope: !999, file: !3, line: 117, column: 7)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !55, line: 35, baseType: !50)
!1013 = !DILocalVariable(name: "ssize0", scope: !1010, file: !3, line: 120, type: !62)
!1014 = !DILocalVariable(name: "fsize", scope: !1015, file: !3, line: 132, type: !46)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 131, column: 5)
!1016 = distinct !DILexicalBlock(scope: !999, file: !3, line: 130, column: 7)
!1017 = !DILocalVariable(name: "r", scope: !1018, file: !3, line: 174, type: !46)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 172, column: 13)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 171, column: 15)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 170, column: 9)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 166, column: 16)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 164, column: 16)
!1023 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 162, column: 11)
!1024 = !DILocation(scope: !999, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 378, column: 22, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 377, column: 9)
!1027 = distinct !DILexicalBlock(scope: !979, file: !3, line: 376, column: 11)
!1028 = !DILocation(line: 109, column: 3, scope: !999, inlinedAt: !1025)
!1029 = !DILocation(line: 109, column: 15, scope: !999, inlinedAt: !1025)
!1030 = !DILocation(line: 112, column: 8, scope: !1031, inlinedAt: !1025)
!1031 = distinct !DILexicalBlock(scope: !999, file: !3, line: 112, column: 7)
!1032 = !DILocation(line: 112, column: 19, scope: !1031, inlinedAt: !1025)
!1033 = !DILocation(line: 112, column: 50, scope: !1031, inlinedAt: !1025)
!1034 = !DILocation(line: 112, column: 66, scope: !1031, inlinedAt: !1025)
!1035 = !DILocation(line: 112, column: 7, scope: !999, inlinedAt: !1025)
!1036 = !DILocation(line: 114, column: 17, scope: !1037, inlinedAt: !1025)
!1037 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 113, column: 5)
!1038 = !DILocation(line: 114, column: 24, scope: !1037, inlinedAt: !1025)
!1039 = !DILocation(line: 114, column: 46, scope: !1037, inlinedAt: !1025)
!1040 = !DILocation(line: 114, column: 7, scope: !1037, inlinedAt: !1025)
!1041 = !DILocation(line: 115, column: 7, scope: !1037, inlinedAt: !1025)
!1042 = !DILocation(line: 117, column: 7, scope: !1011, inlinedAt: !1025)
!1043 = !DILocation(line: 117, column: 7, scope: !999, inlinedAt: !1025)
!1044 = !DILocation(line: 119, column: 27, scope: !1010, inlinedAt: !1025)
!1045 = !{!944, !945, i64 56}
!1046 = !DILocation(scope: !1010, inlinedAt: !1025)
!1047 = !DILocation(line: 121, column: 11, scope: !1048, inlinedAt: !1025)
!1048 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 121, column: 11)
!1049 = !DILocation(line: 124, column: 18, scope: !1050, inlinedAt: !1025)
!1050 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 122, column: 9)
!1051 = !DILocation(line: 126, column: 35, scope: !1050, inlinedAt: !1025)
!1052 = !DILocation(line: 123, column: 11, scope: !1050, inlinedAt: !1025)
!1053 = !DILocation(line: 130, column: 7, scope: !999, inlinedAt: !1025)
!1054 = !DILocation(line: 134, column: 11, scope: !1015, inlinedAt: !1025)
!1055 = !DILocation(scope: !934, inlinedAt: !1056)
!1056 = distinct !DILocation(line: 138, column: 15, scope: !1057, inlinedAt: !1025)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 138, column: 15)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 137, column: 9)
!1059 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 134, column: 11)
!1060 = !DILocation(line: 707, column: 11, scope: !934, inlinedAt: !1056)
!1061 = !DILocation(line: 707, column: 33, scope: !934, inlinedAt: !1056)
!1062 = !DILocation(line: 140, column: 26, scope: !1063, inlinedAt: !1025)
!1063 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 139, column: 13)
!1064 = !DILocation(scope: !1015, inlinedAt: !1025)
!1065 = !DILocation(line: 141, column: 25, scope: !1066, inlinedAt: !1025)
!1066 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 141, column: 19)
!1067 = !DILocation(line: 141, column: 19, scope: !1063, inlinedAt: !1025)
!1068 = !DILocation(line: 145, column: 32, scope: !1069, inlinedAt: !1025)
!1069 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 142, column: 17)
!1070 = !DILocation(line: 146, column: 26, scope: !1069, inlinedAt: !1025)
!1071 = !DILocation(line: 145, column: 19, scope: !1069, inlinedAt: !1025)
!1072 = !DILocation(line: 147, column: 19, scope: !1069, inlinedAt: !1025)
!1073 = !DILocation(line: 152, column: 23, scope: !1074, inlinedAt: !1025)
!1074 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 151, column: 13)
!1075 = !DILocation(line: 153, column: 25, scope: !1076, inlinedAt: !1025)
!1076 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 153, column: 19)
!1077 = !DILocation(line: 153, column: 19, scope: !1074, inlinedAt: !1025)
!1078 = !DILocation(line: 155, column: 29, scope: !1079, inlinedAt: !1025)
!1079 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 154, column: 17)
!1080 = !DILocation(line: 155, column: 36, scope: !1079, inlinedAt: !1025)
!1081 = !DILocation(line: 156, column: 26, scope: !1079, inlinedAt: !1025)
!1082 = !DILocation(line: 155, column: 19, scope: !1079, inlinedAt: !1025)
!1083 = !DILocation(line: 157, column: 19, scope: !1079, inlinedAt: !1025)
!1084 = !DILocation(scope: !1059, inlinedAt: !1025)
!1085 = !DILocation(line: 162, column: 11, scope: !1015, inlinedAt: !1025)
!1086 = !DILocation(line: 163, column: 17, scope: !1023, inlinedAt: !1025)
!1087 = !DILocation(line: 163, column: 9, scope: !1023, inlinedAt: !1025)
!1088 = !DILocation(line: 165, column: 17, scope: !1022, inlinedAt: !1025)
!1089 = !DILocation(line: 165, column: 9, scope: !1022, inlinedAt: !1025)
!1090 = !DILocation(line: 168, column: 31, scope: !1021, inlinedAt: !1025)
!1091 = !DILocation(line: 168, column: 23, scope: !1021, inlinedAt: !1025)
!1092 = !DILocation(line: 168, column: 9, scope: !1021, inlinedAt: !1025)
!1093 = !DILocation(line: 174, column: 31, scope: !1018, inlinedAt: !1025)
!1094 = !DILocation(scope: !1018, inlinedAt: !1025)
!1095 = !DILocation(line: 175, column: 25, scope: !1018, inlinedAt: !1025)
!1096 = !DILocation(line: 175, column: 23, scope: !1018, inlinedAt: !1025)
!1097 = !DILocation(line: 176, column: 13, scope: !1018, inlinedAt: !1025)
!1098 = !DILocation(line: 177, column: 15, scope: !1099, inlinedAt: !1025)
!1099 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 177, column: 15)
!1100 = !DILocation(line: 177, column: 15, scope: !1020, inlinedAt: !1025)
!1101 = !DILocation(line: 179, column: 28, scope: !1102, inlinedAt: !1025)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 178, column: 13)
!1103 = !DILocation(line: 180, column: 22, scope: !1102, inlinedAt: !1025)
!1104 = !DILocation(line: 179, column: 15, scope: !1102, inlinedAt: !1025)
!1105 = !DILocation(line: 181, column: 15, scope: !1102, inlinedAt: !1025)
!1106 = !DILocation(scope: !1016, inlinedAt: !1025)
!1107 = !DILocation(line: 187, column: 7, scope: !999, inlinedAt: !1025)
!1108 = !DILocation(line: 190, column: 7, scope: !1109, inlinedAt: !1025)
!1109 = distinct !DILexicalBlock(scope: !999, file: !3, line: 190, column: 7)
!1110 = !DILocation(line: 190, column: 29, scope: !1109, inlinedAt: !1025)
!1111 = !DILocation(line: 190, column: 7, scope: !999, inlinedAt: !1025)
!1112 = !DILocation(line: 192, column: 17, scope: !1113, inlinedAt: !1025)
!1113 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 191, column: 5)
!1114 = !DILocation(line: 193, column: 14, scope: !1113, inlinedAt: !1025)
!1115 = !DILocation(line: 193, column: 64, scope: !1113, inlinedAt: !1025)
!1116 = !DILocation(line: 192, column: 7, scope: !1113, inlinedAt: !1025)
!1117 = !DILocation(line: 195, column: 7, scope: !1113, inlinedAt: !1025)
!1118 = !DILocation(line: 199, column: 1, scope: !999, inlinedAt: !1025)
!1119 = !DILocation(line: 378, column: 18, scope: !1026)
!1120 = !DILocation(line: 379, column: 15, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 379, column: 15)
!1122 = !DILocation(line: 379, column: 26, scope: !1121)
!1123 = !DILocation(line: 379, column: 15, scope: !1026)
!1124 = !DILocation(line: 381, column: 25, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 380, column: 13)
!1126 = !DILocation(line: 381, column: 32, scope: !1125)
!1127 = !DILocation(line: 381, column: 57, scope: !1125)
!1128 = !DILocation(line: 381, column: 15, scope: !1125)
!1129 = !DILocation(line: 383, column: 13, scope: !1125)
!1130 = !DILocation(line: 387, column: 10, scope: !767)
!1131 = !DILocation(line: 388, column: 1, scope: !767)
!1132 = !DISubprogram(name: "bindtextdomain", scope: !709, file: !709, line: 86, type: !1133, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!51, !73, !73}
!1135 = !DISubprogram(name: "textdomain", scope: !709, file: !709, line: 82, type: !1136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!51, !73}
!1138 = !DISubprogram(name: "atexit", scope: !1139, file: !1139, line: 595, type: !1140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1139 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!44, !1142}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!1143 = !DISubprogram(name: "getopt_long", scope: !78, file: !78, line: 66, type: !1144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!44, !44, !1146, !73, !1148, !83}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!1149 = !DISubprogram(name: "error", scope: !1150, file: !1150, line: 52, type: !1151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1150 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !44, !44, !73, null}
!1153 = !DISubprogram(name: "stat", scope: !1154, file: !1154, line: 205, type: !1155, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1154 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!44, !73, !1157}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!1158 = !DISubprogram(name: "open", scope: !1159, file: !1159, line: 196, type: !1160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1159 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!44, !73, !44, null}
!1162 = !DISubprogram(name: "lseek", scope: !1163, file: !1163, line: 334, type: !1164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1163 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!50, !44, !50, !44}
!1166 = !DISubprogram(name: "close", scope: !1163, file: !1163, line: 353, type: !1167, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!44, !44}
!1169 = !DISubprogram(name: "fstat", scope: !1154, file: !1154, line: 210, type: !1170, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!44, !44, !1157}
!1172 = !DISubprogram(name: "ftruncate", scope: !1163, file: !1163, line: 1028, type: !1173, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !93)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!44, !44, !50}
!1175 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !98, file: !98, line: 51, type: !660, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !1176)
!1176 = !{!1177}
!1177 = !DILocalVariable(name: "file", arg: 1, scope: !1175, file: !98, line: 51, type: !73)
!1178 = !DILocation(scope: !1175)
!1179 = !DILocation(line: 53, column: 13, scope: !1175)
!1180 = !DILocation(line: 54, column: 1, scope: !1175)
!1181 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !98, file: !98, line: 88, type: !1182, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !1184)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{null, !68}
!1184 = !{!1185}
!1185 = !DILocalVariable(name: "ignore", arg: 1, scope: !1181, file: !98, line: 88, type: !68)
!1186 = !DILocation(scope: !1181)
!1187 = !DILocation(line: 90, column: 16, scope: !1181)
!1188 = !{!1189, !1189, i64 0}
!1189 = !{!"_Bool", !638, i64 0}
!1190 = !DILocation(line: 91, column: 1, scope: !1181)
!1191 = distinct !DISubprogram(name: "close_stdout", scope: !98, file: !98, line: 117, type: !646, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !1192)
!1192 = !{!1193}
!1193 = !DILocalVariable(name: "write_error", scope: !1194, file: !98, line: 122, type: !73)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !98, line: 121, column: 5)
!1195 = distinct !DILexicalBlock(scope: !1191, file: !98, line: 119, column: 7)
!1196 = !DILocation(line: 119, column: 21, scope: !1195)
!1197 = !DILocation(line: 119, column: 7, scope: !1195)
!1198 = !DILocation(line: 119, column: 29, scope: !1195)
!1199 = !DILocation(line: 120, column: 7, scope: !1195)
!1200 = !DILocation(line: 120, column: 12, scope: !1195)
!1201 = !{i8 0, i8 2}
!1202 = !DILocation(line: 120, column: 25, scope: !1195)
