; ModuleID = 'coreutils-8.32/src/tsort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.item = type { i8*, %struct.item*, %struct.item*, i32, i64, %struct.item*, %struct.successor* }
%struct.successor = type { %struct.item*, %struct.successor* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.tokenbuffer = type { i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [100 x i8] c"Usage: %s [OPTION] [FILE]\0AWrite totally ordered list consistent with the partial ordering in FILE.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "n_strings", scope: !2, file: !3, line: 73, type: !93, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !173, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/tsort.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !{!30, !40, !101, !105, !109, !112, !115, !36, !91, !122, !131, !135, !139, !143, !146, !149, !158, !93, !161, !164, !168, !172}
!30 = !DISubprogram(name: "dcgettext", scope: !31, file: !31, line: 51, type: !32, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!31 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !36, !36, !38}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{}
!40 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !42, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!38, !36, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !47)
!46 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !63, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !92, !96, !97}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 51, baseType: !38, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 36, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 70, baseType: !44, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !45, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !46, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !45, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !46, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !45, file: !46, line: 93, baseType: !44, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !45, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DISubprogram(name: "set_program_name", scope: !102, file: !102, line: 37, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!102 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !DISubroutineType(types: !104)
!104 = !{null, !36}
!105 = !DISubprogram(name: "setlocale", scope: !106, file: !106, line: 122, type: !107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!106 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!107 = !DISubroutineType(types: !108)
!108 = !{!34, !38, !36}
!109 = !DISubprogram(name: "bindtextdomain", scope: !31, file: !31, line: 86, type: !110, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!110 = !DISubroutineType(types: !111)
!111 = !{!34, !36, !36}
!112 = !DISubprogram(name: "textdomain", scope: !31, file: !31, line: 82, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!113 = !DISubroutineType(types: !114)
!114 = !{!34, !36}
!115 = !DISubprogram(name: "atexit", scope: !116, file: !116, line: 595, type: !117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!116 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!117 = !DISubroutineType(types: !118)
!118 = !{!38, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DISubprogram(name: "parse_gnu_standard_options_only", scope: !123, file: !123, line: 33, type: !124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!123 = !DIFile(filename: "./lib/long-options.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!124 = !DISubroutineType(types: !125)
!125 = !{null, !38, !126, !36, !36, !36, !127, !128, null}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!127 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !38}
!131 = !DISubprogram(name: "quote", scope: !132, file: !132, line: 44, type: !133, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!132 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!133 = !DISubroutineType(types: !134)
!134 = !{!36, !36}
!135 = !DISubprogram(name: "error", scope: !136, file: !136, line: 52, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!136 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!137 = !DISubroutineType(types: !138)
!138 = !{null, !38, !38, !36, null}
!139 = !DISubprogram(name: "freopen_safer", scope: !140, file: !140, line: 27, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!140 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !DISubroutineType(types: !142)
!142 = !{!44, !36, !36, !44}
!143 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!144 = !DISubroutineType(types: !145)
!145 = !{!34, !38, !5, !36}
!146 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !44, !20}
!149 = !DISubprogram(name: "init_tokenbuffer", scope: !150, file: !150, line: 33, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!150 = !DIFile(filename: "./lib/readtokens.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenbuffer", file: !150, line: 26, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !154, file: !150, line: 28, baseType: !93, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !154, file: !150, line: 29, baseType: !34, size: 64, offset: 64)
!158 = !DISubprogram(name: "readtoken", scope: !150, file: !150, line: 36, type: !159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!159 = !DISubroutineType(types: !160)
!160 = !{!95, !44, !36, !95, !153}
!161 = !DISubprogram(name: "puts", scope: !41, file: !41, line: 632, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!162 = !DISubroutineType(types: !163)
!163 = !{!38, !36}
!164 = !DISubprogram(name: "rpl_fclose", scope: !165, file: !165, line: 672, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!165 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !DISubroutineType(types: !167)
!167 = !{!38, !44}
!168 = !DISubprogram(name: "xmalloc", scope: !169, file: !169, line: 53, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!169 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !DISubroutineType(types: !171)
!171 = !{!91, !95}
!172 = !DISubprogram(name: "xstrdup", scope: !169, file: !169, line: 64, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!173 = !{!0, !174, !191, !193}
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 64, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "item", file: !3, line: 53, size: 448, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !177, file: !3, line: 55, baseType: !36, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !177, file: !3, line: 56, baseType: !176, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !177, file: !3, line: 56, baseType: !176, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !177, file: !3, line: 57, baseType: !38, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !177, file: !3, line: 58, baseType: !93, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "qlink", scope: !177, file: !3, line: 59, baseType: !176, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !177, file: !3, line: 60, baseType: !186, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "successor", file: !3, line: 46, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "suc", scope: !187, file: !3, line: 48, baseType: !176, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !3, line: 49, baseType: !186, size: 64, offset: 64)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "zeros", scope: !2, file: !3, line: 67, type: !176, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "loop", scope: !2, file: !3, line: 70, type: !176, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "Version", scope: !197, file: !198, line: 2, type: !36, isLocal: false, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, globals: !199, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !{!195}
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "file_name", scope: !202, file: !203, line: 46, type: !36, isLocal: true, isDefinition: true)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !204, globals: !242, splitDebugInlining: false, nameTableKind: None)
!203 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !{!205, !30, !241, !135}
!205 = !DISubprogram(name: "close_stream", scope: !206, file: !206, line: 2, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!206 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !DISubroutineType(types: !208)
!208 = !{!38, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !210, file: !46, line: 51, baseType: !38, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !210, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !210, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !210, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !210, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !210, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !210, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !210, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !210, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !210, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !210, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !210, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !210, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !210, file: !46, line: 70, baseType: !209, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !210, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !210, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !210, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !210, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !210, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !210, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !210, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !210, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !210, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !210, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !210, file: !46, line: 93, baseType: !209, size: 64, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !210, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !210, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !210, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !210, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!241 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!242 = !{!200, !243}
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !202, file: !203, line: 56, type: !127, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "exit_failure", scope: !247, file: !248, line: 24, type: !250, isLocal: false, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, globals: !249, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !{!245}
!250 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "long_options", scope: !253, file: !254, line: 34, type: !315, isLocal: true, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !255, globals: !314, splitDebugInlining: false, nameTableKind: None)
!254 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!255 = !{!256, !271}
!256 = !DISubprogram(name: "getopt_long", scope: !257, file: !257, line: 66, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!257 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!258 = !DISubroutineType(types: !259)
!259 = !{!38, !38, !260, !36, !262, !269}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !257, line: 50, size: 256, elements: !265)
!265 = !{!266, !267, !268, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !257, line: 52, baseType: !36, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !264, file: !257, line: 55, baseType: !38, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !264, file: !257, line: 56, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !264, file: !257, line: 57, baseType: !38, size: 32, offset: 192)
!271 = !DISubprogram(name: "version_etc_va", scope: !272, file: !272, line: 63, type: !273, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!272 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !DISubroutineType(types: !274)
!274 = !{null, !275, !36, !36, !36, !307}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !276, file: !46, line: 51, baseType: !38, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !276, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !276, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !276, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !276, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !276, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !276, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !276, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !276, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !276, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !276, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !276, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !276, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !276, file: !46, line: 70, baseType: !275, size: 64, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !276, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !276, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !276, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !276, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !276, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !276, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !276, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !276, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !276, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !276, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !276, file: !46, line: 93, baseType: !275, size: 64, offset: 1344)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !276, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !276, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !276, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !276, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !254, line: 72, size: 192, elements: !309)
!309 = !{!310, !311, !312, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !308, file: !254, line: 72, baseType: !7, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !308, file: !254, line: 72, baseType: !7, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !308, file: !254, line: 72, baseType: !91, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !308, file: !254, line: 72, baseType: !91, size: 64, offset: 128)
!314 = !{!251}
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 768, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 3)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "program_name", scope: !320, file: !321, line: 33, type: !36, isLocal: false, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !322, globals: !358, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !{!91, !323, !34}
!323 = !DISubprogram(name: "fputs", scope: !41, file: !41, line: 626, type: !324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!324 = !DISubroutineType(types: !325)
!325 = !{!38, !36, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !327, file: !46, line: 51, baseType: !38, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !327, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !327, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !327, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !327, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !327, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !327, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !327, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !327, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !327, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !327, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !327, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !327, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !327, file: !46, line: 70, baseType: !326, size: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !327, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !327, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !327, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !327, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !327, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !327, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !327, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !327, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !327, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !327, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !327, file: !46, line: 93, baseType: !326, size: 64, offset: 1344)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !327, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !327, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !327, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !327, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!358 = !{!318}
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !361, file: !362, line: 85, type: !478, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !363, retainedTypes: !384, globals: !451, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!363 = !{!5, !364, !369}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!368 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 46, baseType: !7, size: 32, elements: !371)
!370 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!372 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!373 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!374 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!375 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!376 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!377 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!378 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!379 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!380 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!381 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!382 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!383 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!384 = !{!385, !390, !406, !409, !38, !71, !412, !93, !429, !433, !30, !439, !443, !34, !168, !447, !448}
!385 = !DISubprogram(name: "xmemdup", scope: !169, file: !169, line: 62, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!386 = !DISubroutineType(types: !387)
!387 = !{!91, !388, !95}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!390 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!391 = !DISubroutineType(types: !392)
!392 = !{!34, !36, !95, !393, !394}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !362, line: 65, size: 448, elements: !397)
!397 = !{!398, !399, !400, !404, !405}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !396, file: !362, line: 68, baseType: !5, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !396, file: !362, line: 71, baseType: !38, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !396, file: !362, line: 75, baseType: !401, size: 256, offset: 64)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 8)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !396, file: !362, line: 78, baseType: !36, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !396, file: !362, line: 81, baseType: !36, size: 64, offset: 384)
!406 = !DISubprogram(name: "free", scope: !116, file: !116, line: 565, type: !407, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !91}
!409 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !410, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!410 = !DISubroutineType(types: !411)
!411 = !{!34, !38, !36, !36, !36, !95}
!412 = !DISubprogram(name: "rpl_mbrtowc", scope: !413, file: !413, line: 717, type: !414, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!413 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!414 = !DISubroutineType(types: !415)
!415 = !{!95, !269, !36, !95, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 13, size: 64, elements: !419)
!418 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !417, file: !418, line: 15, baseType: !38, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !417, file: !418, line: 20, baseType: !422, size: 32, offset: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !417, file: !418, line: 16, size: 32, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !422, file: !418, line: 18, baseType: !7, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !422, file: !418, line: 19, baseType: !426, size: 32)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 4)
!429 = !DISubprogram(name: "iswprint", scope: !430, file: !430, line: 120, type: !431, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!430 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!431 = !DISubroutineType(types: !432)
!432 = !{!38, !7}
!433 = !DISubprogram(name: "mbsinit", scope: !434, file: !434, line: 292, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!434 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!435 = !DISubroutineType(types: !436)
!436 = !{!38, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!439 = !DISubprogram(name: "locale_charset", scope: !440, file: !440, line: 35, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!440 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!441 = !DISubroutineType(types: !442)
!442 = !{!36}
!443 = !DISubprogram(name: "c_strcasecmp", scope: !444, file: !444, line: 42, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!444 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!445 = !DISubroutineType(types: !446)
!446 = !{!38, !36, !36}
!447 = !DISubprogram(name: "xalloc_die", scope: !169, file: !169, line: 51, type: !120, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !39)
!448 = !DISubprogram(name: "xrealloc", scope: !169, file: !169, line: 59, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!449 = !DISubroutineType(types: !450)
!450 = !{!91, !91, !95}
!451 = !{!359, !452, !458, !460, !462, !467, !474, !476}
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !361, file: !362, line: 101, type: !454, isLocal: false, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 320, elements: !456)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!456 = !{!457}
!457 = !DISubrange(count: 10)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !361, file: !362, line: 1052, type: !396, isLocal: false, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !361, file: !362, line: 116, type: !396, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "slot0", scope: !361, file: !362, line: 842, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 256)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "slotvec", scope: !361, file: !362, line: 845, type: !469, isLocal: true, isDefinition: true)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !362, line: 834, size: 128, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !470, file: !362, line: 836, baseType: !93, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !470, file: !362, line: 837, baseType: !34, size: 64, offset: 64)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "nslots", scope: !361, file: !362, line: 843, type: !38, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "slotvec0", scope: !361, file: !362, line: 844, type: !470, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 704, elements: !480)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!480 = !{!481}
!481 = !DISubrange(count: 11)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !484, file: !485, line: 26, type: !487, isLocal: false, isDefinition: true)
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, globals: !486, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!486 = !{!482}
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 47)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !492, retainedTypes: !493, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!492 = !{!20}
!493 = !{!494, !498}
!494 = !DISubprogram(name: "posix_fadvise", scope: !495, file: !495, line: 288, type: !496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!495 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!496 = !DISubroutineType(types: !497)
!497 = !{!38, !38, !69, !69, !38}
!498 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!499 = !DISubroutineType(types: !500)
!500 = !{!38, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !502, file: !46, line: 51, baseType: !38, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !502, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !502, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !502, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !502, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !502, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !502, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !502, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !502, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !502, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !502, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !502, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !502, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !502, file: !46, line: 70, baseType: !501, size: 64, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !502, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !502, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !502, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !502, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !502, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !502, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !502, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !502, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !502, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !502, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !502, file: !46, line: 93, baseType: !501, size: 64, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !502, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !502, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !502, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !502, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !535, splitDebugInlining: false, nameTableKind: None)
!534 = !DIFile(filename: "lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!535 = !{!536, !571, !575, !578, !581}
!536 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!537 = !DISubroutineType(types: !538)
!538 = !{!38, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !540, file: !46, line: 51, baseType: !38, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !540, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !540, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !540, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !540, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !540, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !540, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !540, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !540, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !540, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !540, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !540, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !540, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !540, file: !46, line: 70, baseType: !539, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !540, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !540, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !540, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !540, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !540, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !540, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !540, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !540, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !540, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !540, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !540, file: !46, line: 93, baseType: !539, size: 64, offset: 1344)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !540, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !540, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !540, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !540, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!571 = !DISubprogram(name: "dup2", scope: !572, file: !572, line: 534, type: !573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!572 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!573 = !DISubroutineType(types: !574)
!574 = !{!38, !38, !38}
!575 = !DISubprogram(name: "freopen", scope: !41, file: !41, line: 252, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!576 = !DISubroutineType(types: !577)
!577 = !{!539, !36, !36, !539}
!578 = !DISubprogram(name: "close", scope: !572, file: !572, line: 353, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!579 = !DISubroutineType(types: !580)
!580 = !{!38, !38}
!581 = !DISubprogram(name: "open", scope: !495, file: !495, line: 196, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!582 = !DISubroutineType(types: !583)
!583 = !{!38, !36, !38, null}
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !586, retainedTypes: !602, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "lib/readtokens.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!586 = !{!587, !590}
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !585, line: 51, baseType: !7, size: 32, elements: !588)
!588 = !{!589}
!589 = !DIEnumerator(name: "bits_per_word", value: 64, isUnsigned: true)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !591, file: !169, line: 186, baseType: !7, size: 32, elements: !600)
!591 = distinct !DISubprogram(name: "x2nrealloc", scope: !169, file: !169, line: 174, type: !592, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !584, retainedNodes: !595)
!592 = !DISubroutineType(types: !593)
!593 = !{!91, !91, !594, !93}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!595 = !{!596, !597, !598, !599}
!596 = !DILocalVariable(name: "p", arg: 1, scope: !591, file: !169, line: 174, type: !91)
!597 = !DILocalVariable(name: "pn", arg: 2, scope: !591, file: !169, line: 174, type: !594)
!598 = !DILocalVariable(name: "s", arg: 3, scope: !591, file: !169, line: 174, type: !93)
!599 = !DILocalVariable(name: "n", scope: !591, file: !169, line: 176, type: !93)
!600 = !{!601}
!601 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!602 = !{!93, !406, !91, !603, !447, !448, !168}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !607, retainedTypes: !611, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!607 = !{!608}
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !606, line: 40, baseType: !7, size: 32, elements: !609)
!609 = !{!610}
!610 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!611 = !{!30, !612, !91}
!612 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !613, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!613 = !DISubroutineType(types: !614)
!614 = !{!38, !36, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !616, file: !46, line: 51, baseType: !38, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !616, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !616, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !616, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !616, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !616, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !616, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !616, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !616, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !616, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !616, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !616, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !616, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !616, file: !46, line: 70, baseType: !615, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !616, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !616, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !616, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !616, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !616, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !616, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !616, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !616, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !616, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !616, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !616, file: !46, line: 93, baseType: !615, size: 64, offset: 1344)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !616, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !616, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !616, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !616, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !649, retainedTypes: !657, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!649 = !{!650}
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !651, file: !169, line: 186, baseType: !7, size: 32, elements: !600)
!651 = distinct !DISubprogram(name: "x2nrealloc", scope: !169, file: !169, line: 174, type: !592, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !647, retainedNodes: !652)
!652 = !{!653, !654, !655, !656}
!653 = !DILocalVariable(name: "p", arg: 1, scope: !651, file: !169, line: 174, type: !91)
!654 = !DILocalVariable(name: "pn", arg: 2, scope: !651, file: !169, line: 174, type: !594)
!655 = !DILocalVariable(name: "s", arg: 3, scope: !651, file: !169, line: 174, type: !93)
!656 = !DILocalVariable(name: "n", scope: !651, file: !169, line: 176, type: !93)
!657 = !{!93, !447, !168, !448, !34, !406, !91, !658, !661}
!658 = !DISubprogram(name: "xcalloc", scope: !169, file: !169, line: 57, type: !659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!659 = !DISubroutineType(types: !660)
!660 = !{!91, !95, !95}
!661 = !DISubprogram(name: "rpl_calloc", scope: !662, file: !662, line: 688, type: !659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!662 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !665, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!665 = !{!30, !135}
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!668 = !{!91}
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !671, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!671 = !{!672, !707, !708, !711}
!672 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!673 = !DISubroutineType(types: !674)
!674 = !{!38, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !676, file: !46, line: 51, baseType: !38, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !676, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !676, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !676, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !676, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !676, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !676, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !676, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !676, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !676, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !676, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !676, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !676, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !676, file: !46, line: 70, baseType: !675, size: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !676, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !676, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !676, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !676, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !676, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !676, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !676, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !676, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !676, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !676, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !676, file: !46, line: 93, baseType: !675, size: 64, offset: 1344)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !676, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !676, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !676, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !676, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!707 = !DISubprogram(name: "fclose", scope: !41, file: !41, line: 213, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!708 = !DISubprogram(name: "lseek", scope: !572, file: !572, line: 334, type: !709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!709 = !DISubroutineType(types: !710)
!710 = !{!69, !38, !69, !38}
!711 = !DISubprogram(name: "rpl_fflush", scope: !165, file: !165, line: 718, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !714, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!714 = !{!91, !715, !750}
!715 = !DISubprogram(name: "fflush", scope: !41, file: !41, line: 218, type: !716, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!716 = !DISubroutineType(types: !717)
!717 = !{!38, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !719, file: !46, line: 51, baseType: !38, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !719, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !719, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !719, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !719, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !719, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !719, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !719, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !719, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !719, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !719, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !719, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !719, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !719, file: !46, line: 70, baseType: !718, size: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !719, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !719, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !719, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !719, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !719, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !719, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !719, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !719, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !719, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !719, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !719, file: !46, line: 93, baseType: !718, size: 64, offset: 1344)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !719, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !719, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !719, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !719, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!750 = !DISubprogram(name: "rpl_fseeko", scope: !165, file: !165, line: 1034, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!751 = !DISubroutineType(types: !752)
!752 = !{!38, !718, !69, !38}
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !755, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!755 = !{!91, !756, !708, !791}
!756 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !757, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!757 = !DISubroutineType(types: !758)
!758 = !{!38, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !760, file: !46, line: 51, baseType: !38, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !760, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !760, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !760, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !760, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !760, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !760, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !760, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !760, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !760, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !760, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !760, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !760, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !760, file: !46, line: 70, baseType: !759, size: 64, offset: 832)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !760, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !760, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !760, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !760, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !760, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !760, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !760, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !760, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !760, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !760, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !760, file: !46, line: 93, baseType: !759, size: 64, offset: 1344)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !760, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !760, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !760, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !760, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!791 = !DISubprogram(name: "fseeko", scope: !41, file: !41, line: 707, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!792 = !DISubroutineType(types: !793)
!793 = !{!38, !759, !69, !38}
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !796, splitDebugInlining: false, nameTableKind: None)
!795 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!796 = !{!797, !93, !809}
!797 = !DISubprogram(name: "mbrtowc", scope: !434, file: !434, line: 296, type: !798, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!798 = !DISubroutineType(types: !799)
!799 = !{!95, !269, !36, !95, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 13, size: 64, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !801, file: !418, line: 15, baseType: !38, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !801, file: !418, line: 20, baseType: !805, size: 32, offset: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !801, file: !418, line: 16, size: 32, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !805, file: !418, line: 18, baseType: !7, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !805, file: !418, line: 19, baseType: !426, size: 32)
!809 = !DISubprogram(name: "hard_locale", scope: !810, file: !810, line: 26, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!810 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!811 = !DISubroutineType(types: !812)
!812 = !{!127, !38}
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !815, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!815 = !{!816}
!816 = !DISubprogram(name: "rpl_fclose", scope: !165, file: !165, line: 672, type: !817, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!817 = !DISubroutineType(types: !818)
!818 = !{!38, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !820, file: !46, line: 51, baseType: !38, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !820, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !820, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !820, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !820, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !820, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !820, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !820, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !820, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !820, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !820, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !820, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !820, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !820, file: !46, line: 70, baseType: !819, size: 64, offset: 832)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !820, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !820, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !820, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !820, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !820, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !820, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !820, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !820, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !820, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !820, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !820, file: !46, line: 93, baseType: !819, size: 64, offset: 1344)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !820, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !820, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !820, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !820, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !853, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!853 = !{!854}
!854 = !DISubprogram(name: "setlocale_null_r", scope: !855, file: !855, line: 64, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!855 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!856 = !DISubroutineType(types: !857)
!857 = !{!38, !38, !34, !95}
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, retainedTypes: !1247, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!860 = !{!861}
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 41, baseType: !7, size: 32, elements: !863)
!862 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246}
!864 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!865 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!866 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!867 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!868 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!869 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!870 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!871 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!872 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!873 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!874 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!875 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!876 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!877 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!878 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!879 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!880 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!881 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!882 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!883 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!884 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!885 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!886 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!887 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!888 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!889 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!890 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!891 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!892 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!893 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!894 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!895 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!896 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!897 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!898 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!899 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!900 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!901 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!902 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!903 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!904 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!905 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!906 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!907 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!908 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!909 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!910 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!911 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
