; ModuleID = 'coreutils-8.32/src/tty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [135 x i8] c"Print the file name of the terminal connected to standard input.\0A\0A  -s, --silent, --quiet   print nothing, only return an exit status\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "silent", scope: !2, file: !3, line: 47, type: !148, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !141, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/tty.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 34, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "TTY_STDIN_NOTTY", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "TTY_FAILURE", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "TTY_WRITE_ERROR", value: 3, isUnsigned: true)
!11 = !{!12, !22, !83, !87, !91, !94, !97, !104, !16, !73, !119, !123, !127, !131, !135, !138}
!12 = !DISubprogram(name: "dcgettext", scope: !13, file: !13, line: 51, type: !14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!13 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !18, !18, !20}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !{}
!22 = !DISubprogram(name: "fputs_unlocked", scope: !23, file: !23, line: 662, type: !24, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!23 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!24 = !DISubroutineType(types: !25)
!25 = !{!20, !18, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !45, !46, !47, !48, !52, !54, !56, !60, !63, !65, !68, !71, !72, !74, !78, !79}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 51, baseType: !20, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 36, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 70, baseType: !26, size: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 72, baseType: !20, size: 32, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 73, baseType: !20, size: 32, offset: 928)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !51)
!50 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!51 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 77, baseType: !53, size: 16, offset: 1024)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 78, baseType: !55, size: 8, offset: 1040)
!55 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 79, baseType: !57, size: 8, offset: 1048)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 1)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 81, baseType: !61, size: 64, offset: 1088)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 43, baseType: null)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 89, baseType: !64, size: 64, offset: 1152)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !51)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !27, file: !28, line: 91, baseType: !66, size: 64, offset: 1216)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !28, line: 37, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !27, file: !28, line: 92, baseType: !69, size: 64, offset: 1280)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !28, line: 38, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !27, file: !28, line: 93, baseType: !26, size: 64, offset: 1344)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !27, file: !28, line: 94, baseType: !73, size: 64, offset: 1408)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 96, baseType: !20, size: 32, offset: 1536)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DISubprogram(name: "set_program_name", scope: !84, file: !84, line: 37, type: !85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!84 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!85 = !DISubroutineType(types: !86)
!86 = !{null, !18}
!87 = !DISubprogram(name: "setlocale", scope: !88, file: !88, line: 122, type: !89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!88 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!89 = !DISubroutineType(types: !90)
!90 = !{!16, !20, !18}
!91 = !DISubprogram(name: "bindtextdomain", scope: !13, file: !13, line: 86, type: !92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!92 = !DISubroutineType(types: !93)
!93 = !{!16, !18, !18}
!94 = !DISubprogram(name: "textdomain", scope: !13, file: !13, line: 82, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!95 = !DISubroutineType(types: !96)
!96 = !{!16, !18}
!97 = !DISubprogram(name: "atexit", scope: !98, file: !98, line: 595, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!98 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!20, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null}
!104 = !DISubprogram(name: "getopt_long", scope: !105, file: !105, line: 66, type: !106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!105 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!106 = !DISubroutineType(types: !107)
!107 = !{!20, !20, !108, !18, !110, !117}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !105, line: 50, size: 256, elements: !113)
!113 = !{!114, !115, !116, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !105, line: 52, baseType: !18, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !112, file: !105, line: 55, baseType: !20, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !105, line: 56, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !112, file: !105, line: 57, baseType: !20, size: 32, offset: 192)
!119 = !DISubprogram(name: "version_etc", scope: !120, file: !120, line: 69, type: !121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!120 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!121 = !DISubroutineType(types: !122)
!122 = !{null, !26, !18, !18, !18, null}
!123 = !DISubprogram(name: "quote", scope: !124, file: !124, line: 44, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!124 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!125 = !DISubroutineType(types: !126)
!126 = !{!18, !18}
!127 = !DISubprogram(name: "error", scope: !128, file: !128, line: 52, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!128 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!129 = !DISubroutineType(types: !130)
!130 = !{null, !20, !20, !18, null}
!131 = !DISubprogram(name: "isatty", scope: !132, file: !132, line: 779, type: !133, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!132 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!133 = !DISubroutineType(types: !134)
!134 = !{!20, !20}
!135 = !DISubprogram(name: "ttyname", scope: !132, file: !132, line: 770, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!136 = !DISubroutineType(types: !137)
!137 = !{!16, !20}
!138 = !DISubprogram(name: "puts", scope: !23, file: !23, line: 632, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!139 = !DISubroutineType(types: !140)
!140 = !{!20, !18}
!141 = !{!142, !143}
!142 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 1280, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 5)
!148 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "Version", scope: !151, file: !152, line: 2, type: !18, isLocal: false, isDefinition: true)
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, globals: !153, splitDebugInlining: false, nameTableKind: None)
!152 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !{!149}
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "file_name", scope: !156, file: !157, line: 46, type: !18, isLocal: true, isDefinition: true)
!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !157, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !158, globals: !197, splitDebugInlining: false, nameTableKind: None)
!157 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !{!159, !12, !195, !127}
!159 = !DISubprogram(name: "close_stream", scope: !160, file: !160, line: 2, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!160 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!20, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !164, file: !28, line: 51, baseType: !20, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !164, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !164, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !164, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !164, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !164, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !164, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !164, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !164, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !164, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !164, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !164, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !164, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !164, file: !28, line: 70, baseType: !163, size: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !164, file: !28, line: 72, baseType: !20, size: 32, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !164, file: !28, line: 73, baseType: !20, size: 32, offset: 928)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !164, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !164, file: !28, line: 77, baseType: !53, size: 16, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !164, file: !28, line: 78, baseType: !55, size: 8, offset: 1040)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !164, file: !28, line: 79, baseType: !57, size: 8, offset: 1048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !164, file: !28, line: 81, baseType: !61, size: 64, offset: 1088)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !164, file: !28, line: 89, baseType: !64, size: 64, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !164, file: !28, line: 91, baseType: !66, size: 64, offset: 1216)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !164, file: !28, line: 92, baseType: !69, size: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !164, file: !28, line: 93, baseType: !163, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !164, file: !28, line: 94, baseType: !73, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !164, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !164, file: !28, line: 96, baseType: !20, size: 32, offset: 1536)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !164, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!195 = !DISubprogram(name: "quotearg_colon", scope: !196, file: !196, line: 391, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!196 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !{!154, !198}
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !156, file: !157, line: 56, type: !148, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "exit_failure", scope: !202, file: !203, line: 24, type: !205, isLocal: false, isDefinition: true)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, globals: !204, splitDebugInlining: false, nameTableKind: None)
!203 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !{!200}
!205 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !20)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "program_name", scope: !208, file: !209, line: 33, type: !18, isLocal: false, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !210, globals: !246, splitDebugInlining: false, nameTableKind: None)
!209 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !{!73, !211, !16}
!211 = !DISubprogram(name: "fputs", scope: !23, file: !23, line: 626, type: !212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!212 = !DISubroutineType(types: !213)
!213 = !{!20, !18, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !215, file: !28, line: 51, baseType: !20, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !215, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !215, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !215, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !215, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !215, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !215, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !215, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !215, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !215, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !215, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !215, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !215, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !215, file: !28, line: 70, baseType: !214, size: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !215, file: !28, line: 72, baseType: !20, size: 32, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !215, file: !28, line: 73, baseType: !20, size: 32, offset: 928)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !215, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !215, file: !28, line: 77, baseType: !53, size: 16, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !215, file: !28, line: 78, baseType: !55, size: 8, offset: 1040)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !215, file: !28, line: 79, baseType: !57, size: 8, offset: 1048)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !215, file: !28, line: 81, baseType: !61, size: 64, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !215, file: !28, line: 89, baseType: !64, size: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !215, file: !28, line: 91, baseType: !66, size: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !215, file: !28, line: 92, baseType: !69, size: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !215, file: !28, line: 93, baseType: !214, size: 64, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !215, file: !28, line: 94, baseType: !73, size: 64, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !215, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !215, file: !28, line: 96, baseType: !20, size: 32, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !215, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!246 = !{!206}
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !249, file: !250, line: 85, type: !383, isLocal: false, isDefinition: true)
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !251, retainedTypes: !285, globals: !356, splitDebugInlining: false, nameTableKind: None)
!250 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !{!252, !265, !270}
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !196, line: 32, baseType: !6, size: 32, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!254 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!255 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!256 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!257 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!258 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!259 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!260 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!261 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!262 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!263 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!264 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !196, line: 242, baseType: !6, size: 32, elements: !266)
!266 = !{!267, !268, !269}
!267 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !271, line: 46, baseType: !6, size: 32, elements: !272)
!271 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!273 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!274 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!275 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!276 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!277 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!278 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!279 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!280 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!281 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!284 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!285 = !{!286, !292, !308, !311, !20, !53, !314, !75, !331, !335, !12, !341, !345, !16, !349, !352, !353}
!286 = !DISubprogram(name: "xmemdup", scope: !287, file: !287, line: 62, type: !288, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!287 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!288 = !DISubroutineType(types: !289)
!289 = !{!73, !290, !77}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!292 = !DISubprogram(name: "quotearg_alloc_mem", scope: !196, file: !196, line: 342, type: !293, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!293 = !DISubroutineType(types: !294)
!294 = !{!16, !18, !77, !295, !296}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !250, line: 65, size: 448, elements: !299)
!299 = !{!300, !301, !302, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !298, file: !250, line: 68, baseType: !252, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !250, line: 71, baseType: !20, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !298, file: !250, line: 75, baseType: !303, size: 256, offset: 64)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !298, file: !250, line: 78, baseType: !18, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !298, file: !250, line: 81, baseType: !18, size: 64, offset: 384)
!308 = !DISubprogram(name: "free", scope: !98, file: !98, line: 565, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !73}
!311 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !196, file: !196, line: 408, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!312 = !DISubroutineType(types: !313)
!313 = !{!16, !20, !18, !18, !18, !77}
!314 = !DISubprogram(name: "rpl_mbrtowc", scope: !315, file: !315, line: 717, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!315 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!316 = !DISubroutineType(types: !317)
!317 = !{!77, !117, !18, !77, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 13, size: 64, elements: !321)
!320 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !319, file: !320, line: 15, baseType: !20, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !319, file: !320, line: 20, baseType: !324, size: 32, offset: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !319, file: !320, line: 16, size: 32, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !324, file: !320, line: 18, baseType: !6, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !324, file: !320, line: 19, baseType: !328, size: 32)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 4)
!331 = !DISubprogram(name: "iswprint", scope: !332, file: !332, line: 120, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!332 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!333 = !DISubroutineType(types: !334)
!334 = !{!20, !6}
!335 = !DISubprogram(name: "mbsinit", scope: !336, file: !336, line: 292, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!336 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!337 = !DISubroutineType(types: !338)
!338 = !{!20, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!341 = !DISubprogram(name: "locale_charset", scope: !342, file: !342, line: 35, type: !343, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!342 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!343 = !DISubroutineType(types: !344)
!344 = !{!18}
!345 = !DISubprogram(name: "c_strcasecmp", scope: !346, file: !346, line: 42, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!346 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = !DISubroutineType(types: !348)
!348 = !{!20, !18, !18}
!349 = !DISubprogram(name: "xmalloc", scope: !287, file: !287, line: 53, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!350 = !DISubroutineType(types: !351)
!351 = !{!73, !77}
!352 = !DISubprogram(name: "xalloc_die", scope: !287, file: !287, line: 51, type: !102, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !21)
!353 = !DISubprogram(name: "xrealloc", scope: !287, file: !287, line: 59, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!354 = !DISubroutineType(types: !355)
!355 = !{!73, !73, !77}
!356 = !{!247, !357, !363, !365, !367, !372, !379, !381}
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !249, file: !250, line: 101, type: !359, isLocal: false, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 320, elements: !361)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!361 = !{!362}
!362 = !DISubrange(count: 10)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !249, file: !250, line: 1052, type: !298, isLocal: false, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !249, file: !250, line: 116, type: !298, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "slot0", scope: !249, file: !250, line: 842, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 256)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "slotvec", scope: !249, file: !250, line: 845, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !250, line: 834, size: 128, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !375, file: !250, line: 836, baseType: !75, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !375, file: !250, line: 837, baseType: !16, size: 64, offset: 64)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "nslots", scope: !249, file: !250, line: 843, type: !20, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "slotvec0", scope: !249, file: !250, line: 844, type: !375, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 704, elements: !385)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!385 = !{!386}
!386 = !DISubrange(count: 11)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !389, file: !390, line: 26, type: !392, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!391 = !{!387}
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 376, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 47)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !397, retainedTypes: !401, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!397 = !{!398}
!398 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 40, baseType: !6, size: 32, elements: !399)
!399 = !{!400}
!400 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!401 = !{!12, !402, !73}
!402 = !DISubprogram(name: "fputs_unlocked", scope: !23, file: !23, line: 662, type: !403, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!403 = !DISubroutineType(types: !404)
!404 = !{!20, !18, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !406, file: !28, line: 51, baseType: !20, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !406, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !406, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !406, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !406, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !406, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !406, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !406, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !406, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !406, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !406, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !406, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !406, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !406, file: !28, line: 70, baseType: !405, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !406, file: !28, line: 72, baseType: !20, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !406, file: !28, line: 73, baseType: !20, size: 32, offset: 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !406, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !406, file: !28, line: 77, baseType: !53, size: 16, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !406, file: !28, line: 78, baseType: !55, size: 8, offset: 1040)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !406, file: !28, line: 79, baseType: !57, size: 8, offset: 1048)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !406, file: !28, line: 81, baseType: !61, size: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !406, file: !28, line: 89, baseType: !64, size: 64, offset: 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !406, file: !28, line: 91, baseType: !66, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !406, file: !28, line: 92, baseType: !69, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !406, file: !28, line: 93, baseType: !405, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !406, file: !28, line: 94, baseType: !73, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !406, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !406, file: !28, line: 96, baseType: !20, size: 32, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !406, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !439, retainedTypes: !452, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!439 = !{!440}
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !441, file: !287, line: 186, baseType: !6, size: 32, elements: !450)
!441 = distinct !DISubprogram(name: "x2nrealloc", scope: !287, file: !287, line: 174, type: !442, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !437, retainedNodes: !445)
!442 = !DISubroutineType(types: !443)
!443 = !{!73, !73, !444, !75}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!445 = !{!446, !447, !448, !449}
!446 = !DILocalVariable(name: "p", arg: 1, scope: !441, file: !287, line: 174, type: !73)
!447 = !DILocalVariable(name: "pn", arg: 2, scope: !441, file: !287, line: 174, type: !444)
!448 = !DILocalVariable(name: "s", arg: 3, scope: !441, file: !287, line: 174, type: !75)
!449 = !DILocalVariable(name: "n", scope: !441, file: !287, line: 176, type: !75)
!450 = !{!451}
!451 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!452 = !{!75, !352, !349, !353, !16, !308, !73, !453, !456}
!453 = !DISubprogram(name: "xcalloc", scope: !287, file: !287, line: 57, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!454 = !DISubroutineType(types: !455)
!455 = !{!73, !77, !77}
!456 = !DISubprogram(name: "rpl_calloc", scope: !457, file: !457, line: 688, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!457 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !460, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !{!12, !127}
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !463, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = !{!73}
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !466, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!466 = !{!467, !75, !479}
!467 = !DISubprogram(name: "mbrtowc", scope: !336, file: !336, line: 296, type: !468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!468 = !DISubroutineType(types: !469)
!469 = !{!77, !117, !18, !77, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 13, size: 64, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !471, file: !320, line: 15, baseType: !20, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !471, file: !320, line: 20, baseType: !475, size: 32, offset: 32)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !320, line: 16, size: 32, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !475, file: !320, line: 18, baseType: !6, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !475, file: !320, line: 19, baseType: !328, size: 32)
!479 = !DISubprogram(name: "hard_locale", scope: !480, file: !480, line: 26, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!480 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !DISubroutineType(types: !482)
!482 = !{!148, !20}
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !485, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!485 = !{!486}
!486 = !DISubprogram(name: "rpl_fclose", scope: !487, file: !487, line: 672, type: !488, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!487 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !DISubroutineType(types: !489)
!489 = !{!20, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !491, file: !28, line: 51, baseType: !20, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !491, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !491, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !491, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !491, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !491, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !491, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !491, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !491, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !491, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !491, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !491, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !491, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !491, file: !28, line: 70, baseType: !490, size: 64, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !491, file: !28, line: 72, baseType: !20, size: 32, offset: 896)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !491, file: !28, line: 73, baseType: !20, size: 32, offset: 928)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !491, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !491, file: !28, line: 77, baseType: !53, size: 16, offset: 1024)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !491, file: !28, line: 78, baseType: !55, size: 8, offset: 1040)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !491, file: !28, line: 79, baseType: !57, size: 8, offset: 1048)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !491, file: !28, line: 81, baseType: !61, size: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !491, file: !28, line: 89, baseType: !64, size: 64, offset: 1152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !491, file: !28, line: 91, baseType: !66, size: 64, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !491, file: !28, line: 92, baseType: !69, size: 64, offset: 1280)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !491, file: !28, line: 93, baseType: !490, size: 64, offset: 1344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !491, file: !28, line: 94, baseType: !73, size: 64, offset: 1408)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !491, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !491, file: !28, line: 96, baseType: !20, size: 32, offset: 1536)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !491, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !524, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!524 = !{!525}
!525 = !DISubprogram(name: "setlocale_null_r", scope: !526, file: !526, line: 64, type: !527, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!526 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!527 = !DISubroutineType(types: !528)
!528 = !{!20, !20, !16, !77}
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !531, retainedTypes: !918, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!531 = !{!532}
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !533, line: 41, baseType: !6, size: 32, elements: !534)
!533 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!535 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!536 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!537 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!538 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!539 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!540 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!541 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!542 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!543 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!544 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!545 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!546 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!547 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!548 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!549 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!550 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!551 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!552 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!553 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!554 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!555 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!556 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!557 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!558 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!559 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!560 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!561 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!562 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!563 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!564 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!565 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!566 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!567 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!568 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!569 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!570 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!571 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!572 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!573 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!574 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!575 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!576 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!577 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!578 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!579 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!580 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!581 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!582 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!583 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!584 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!643 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!646 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!647 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!648 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!649 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!650 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!651 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!652 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!653 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!654 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!655 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!656 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!657 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!730 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!803 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!804 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!805 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!806 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!807 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!808 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!809 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!810 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!811 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!812 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!813 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!814 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!815 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!816 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!817 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!819 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!820 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!821 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!822 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!823 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!824 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!850 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!851 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!852 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!853 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!854 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!859 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!860 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!861 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!862 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!918 = !{!919, !73}
!919 = !DISubprogram(name: "nl_langinfo", scope: !533, file: !533, line: 661, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !922, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!922 = !{!73, !87}
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !925, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!925 = !{!926, !961, !962, !965}
!926 = !DISubprogram(name: "fileno", scope: !23, file: !23, line: 786, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!927 = !DISubroutineType(types: !928)
!928 = !{!20, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !930, file: !28, line: 51, baseType: !20, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !930, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !930, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !930, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !930, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !930, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !930, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !930, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !930, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !930, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !930, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !930, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !930, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !930, file: !28, line: 70, baseType: !929, size: 64, offset: 832)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !930, file: !28, line: 72, baseType: !20, size: 32, offset: 896)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !930, file: !28, line: 73, baseType: !20, size: 32, offset: 928)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !930, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !930, file: !28, line: 77, baseType: !53, size: 16, offset: 1024)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !930, file: !28, line: 78, baseType: !55, size: 8, offset: 1040)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !930, file: !28, line: 79, baseType: !57, size: 8, offset: 1048)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !930, file: !28, line: 81, baseType: !61, size: 64, offset: 1088)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !930, file: !28, line: 89, baseType: !64, size: 64, offset: 1152)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !930, file: !28, line: 91, baseType: !66, size: 64, offset: 1216)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !930, file: !28, line: 92, baseType: !69, size: 64, offset: 1280)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !930, file: !28, line: 93, baseType: !929, size: 64, offset: 1344)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !930, file: !28, line: 94, baseType: !73, size: 64, offset: 1408)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !930, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !930, file: !28, line: 96, baseType: !20, size: 32, offset: 1536)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !930, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!961 = !DISubprogram(name: "fclose", scope: !23, file: !23, line: 213, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!962 = !DISubprogram(name: "lseek", scope: !132, file: !132, line: 334, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!963 = !DISubroutineType(types: !964)
!964 = !{!51, !20, !51, !20}
!965 = !DISubprogram(name: "rpl_fflush", scope: !487, file: !487, line: 718, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !968, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!968 = !{!73, !969, !1004}
!969 = !DISubprogram(name: "fflush", scope: !23, file: !23, line: 218, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!970 = !DISubroutineType(types: !971)
!971 = !{!20, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !973, file: !28, line: 51, baseType: !20, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !973, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !973, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !973, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !973, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !973, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !973, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !973, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !973, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !973, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !973, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !973, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !973, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !973, file: !28, line: 70, baseType: !972, size: 64, offset: 832)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !973, file: !28, line: 72, baseType: !20, size: 32, offset: 896)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !973, file: !28, line: 73, baseType: !20, size: 32, offset: 928)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !973, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !973, file: !28, line: 77, baseType: !53, size: 16, offset: 1024)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !973, file: !28, line: 78, baseType: !55, size: 8, offset: 1040)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !973, file: !28, line: 79, baseType: !57, size: 8, offset: 1048)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !973, file: !28, line: 81, baseType: !61, size: 64, offset: 1088)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !973, file: !28, line: 89, baseType: !64, size: 64, offset: 1152)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !973, file: !28, line: 91, baseType: !66, size: 64, offset: 1216)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !973, file: !28, line: 92, baseType: !69, size: 64, offset: 1280)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !973, file: !28, line: 93, baseType: !972, size: 64, offset: 1344)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !973, file: !28, line: 94, baseType: !73, size: 64, offset: 1408)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !973, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !973, file: !28, line: 96, baseType: !20, size: 32, offset: 1536)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !973, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!1004 = !DISubprogram(name: "rpl_fseeko", scope: !487, file: !487, line: 1034, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !21)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!20, !972, !51, !20}
!1007 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1008, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !1009, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1009 = !{!73, !1010, !962, !1045}
