; ModuleID = 'coreutils-8.32/src/uname.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !2, file: !3, line: 107, type: !176, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !141, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/uname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !15, !76, !80, !84, !87, !90, !97, !113, !117, !10, !66, !132, !136, !140}
!6 = !DISubprogram(name: "dcgettext", scope: !7, file: !7, line: 51, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !17, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!14, !12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !61, !64, !65, !67, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !14, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 152, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 153, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DISubprogram(name: "set_program_name", scope: !77, file: !77, line: 37, type: !78, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !12}
!80 = !DISubprogram(name: "setlocale", scope: !81, file: !81, line: 122, type: !82, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !14, !12}
!84 = !DISubprogram(name: "bindtextdomain", scope: !7, file: !7, line: 86, type: !85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !12, !12}
!87 = !DISubprogram(name: "textdomain", scope: !7, file: !7, line: 82, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !12}
!90 = !DISubprogram(name: "atexit", scope: !91, file: !91, line: 595, type: !92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!14, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "uname", scope: !98, file: !98, line: 81, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!98 = !DIFile(filename: "/usr/include/sys/utsname.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!14, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !98, line: 48, size: 3120, elements: !103)
!103 = !{!104, !108, !109, !110, !111, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !102, file: !98, line: 51, baseType: !105, size: 520)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 520, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 65)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !102, file: !98, line: 54, baseType: !105, size: 520, offset: 520)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !102, file: !98, line: 57, baseType: !105, size: 520, offset: 1040)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !102, file: !98, line: 59, baseType: !105, size: 520, offset: 1560)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !102, file: !98, line: 62, baseType: !105, size: 520, offset: 2080)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !102, file: !98, line: 67, baseType: !105, size: 520, offset: 2600)
!113 = !DISubprogram(name: "error", scope: !114, file: !114, line: 52, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!114 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!115 = !DISubroutineType(types: !116)
!116 = !{null, !14, !14, !12, null}
!117 = !DISubprogram(name: "getopt_long", scope: !118, file: !118, line: 66, type: !119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!118 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!119 = !DISubroutineType(types: !120)
!120 = !{!14, !14, !121, !12, !123, !130}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !118, line: 50, size: 256, elements: !126)
!126 = !{!127, !128, !129, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !118, line: 52, baseType: !12, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !125, file: !118, line: 55, baseType: !14, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !118, line: 56, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !125, file: !118, line: 57, baseType: !14, size: 32, offset: 192)
!132 = !DISubprogram(name: "version_etc", scope: !133, file: !133, line: 69, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!133 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !19, !12, !12, !12, null}
!136 = !DISubprogram(name: "quote", scope: !137, file: !137, line: 44, type: !138, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!137 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!138 = !DISubroutineType(types: !139)
!139 = !{!12, !12}
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !{!142, !0, !165, !170}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "unknown", scope: !144, file: !3, line: 262, type: !162, isLocal: true, isDefinition: true)
!144 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !145, scopeLine: 261, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !148)
!145 = !DISubroutineType(types: !146)
!146 = !{!14, !14, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!148 = !{!149, !150, !151, !153, !156, !159}
!149 = !DILocalVariable(name: "argc", arg: 1, scope: !144, file: !3, line: 260, type: !14)
!150 = !DILocalVariable(name: "argv", arg: 2, scope: !144, file: !3, line: 260, type: !147)
!151 = !DILocalVariable(name: "toprint", scope: !144, file: !3, line: 265, type: !152)
!152 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!153 = !DILocalVariable(name: "name", scope: !154, file: !3, line: 284, type: !102)
!154 = distinct !DILexicalBlock(scope: !155, file: !3, line: 283, column: 5)
!155 = distinct !DILexicalBlock(scope: !144, file: !3, line: 280, column: 7)
!156 = !DILocalVariable(name: "element", scope: !157, file: !3, line: 303, type: !12)
!157 = distinct !DILexicalBlock(scope: !158, file: !3, line: 302, column: 5)
!158 = distinct !DILexicalBlock(scope: !144, file: !3, line: 301, column: 7)
!159 = !DILocalVariable(name: "element", scope: !160, file: !3, line: 347, type: !12)
!160 = distinct !DILexicalBlock(scope: !161, file: !3, line: 346, column: 5)
!161 = distinct !DILexicalBlock(scope: !144, file: !3, line: 345, column: 7)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 8)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !2, file: !3, line: 89, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 3584, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 14)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "printed", scope: !172, file: !3, line: 163, type: !175, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !78, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !173)
!173 = !{!174}
!174 = !DILocalVariable(name: "element", arg: 1, scope: !172, file: !3, line: 161, type: !12)
!175 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 768, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 3)
!179 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "uname_mode", scope: !182, file: !183, line: 2, type: !14, isLocal: false, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !184, splitDebugInlining: false, nameTableKind: None)
!183 = !DIFile(filename: "src/uname-uname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !{!180}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "Version", scope: !187, file: !188, line: 2, type: !12, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !189, splitDebugInlining: false, nameTableKind: None)
!188 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!189 = !{!185}
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "file_name", scope: !192, file: !193, line: 46, type: !12, isLocal: true, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !194, globals: !233, splitDebugInlining: false, nameTableKind: None)
!193 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!194 = !{!195, !6, !231, !113}
!195 = !DISubprogram(name: "close_stream", scope: !196, file: !196, line: 2, type: !197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!196 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !DISubroutineType(types: !198)
!198 = !{!14, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !200, file: !21, line: 51, baseType: !14, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !200, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !200, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !200, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !200, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !200, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !200, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !200, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !200, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !200, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !200, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !200, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !200, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !200, file: !21, line: 70, baseType: !199, size: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !200, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !200, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !200, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !200, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !200, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !200, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !200, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !200, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !200, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !200, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !200, file: !21, line: 93, baseType: !199, size: 64, offset: 1344)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !200, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !200, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !200, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !200, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!231 = !DISubprogram(name: "quotearg_colon", scope: !232, file: !232, line: 391, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!232 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!233 = !{!190, !234}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !192, file: !193, line: 56, type: !175, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "exit_failure", scope: !238, file: !239, line: 24, type: !241, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !240, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !{!236}
!241 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "program_name", scope: !244, file: !245, line: 33, type: !12, isLocal: false, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !246, globals: !282, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !{!66, !247, !10}
!247 = !DISubprogram(name: "fputs", scope: !16, file: !16, line: 626, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!248 = !DISubroutineType(types: !249)
!249 = !{!14, !12, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !251, file: !21, line: 51, baseType: !14, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !251, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !251, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !251, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !251, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !251, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !251, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !251, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !251, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !251, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !251, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !251, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !251, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !251, file: !21, line: 70, baseType: !250, size: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !251, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !251, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !251, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !251, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !251, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !251, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !251, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !251, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !251, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !251, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !251, file: !21, line: 93, baseType: !250, size: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !251, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !251, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !251, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !251, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!282 = !{!242}
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !285, file: !286, line: 85, type: !417, isLocal: false, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !287, retainedTypes: !321, globals: !390, splitDebugInlining: false, nameTableKind: None)
!286 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!287 = !{!288, !301, !306}
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !232, line: 32, baseType: !152, size: 32, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!290 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!293 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!294 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!295 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!296 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!297 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!298 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!299 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!300 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !232, line: 242, baseType: !152, size: 32, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !307, line: 46, baseType: !152, size: 32, elements: !308)
!307 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!309 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!310 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!311 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!312 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!313 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!314 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!315 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!316 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!317 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!319 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!320 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!321 = !{!322, !328, !342, !345, !14, !46, !348, !68, !365, !369, !6, !375, !379, !10, !383, !386, !387}
!322 = !DISubprogram(name: "xmemdup", scope: !323, file: !323, line: 62, type: !324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!323 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!324 = !DISubroutineType(types: !325)
!325 = !{!66, !326, !70}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!328 = !DISubprogram(name: "quotearg_alloc_mem", scope: !232, file: !232, line: 342, type: !329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!329 = !DISubroutineType(types: !330)
!330 = !{!10, !12, !70, !331, !332}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !286, line: 65, size: 448, elements: !335)
!335 = !{!336, !337, !338, !340, !341}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !334, file: !286, line: 68, baseType: !288, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !286, line: 71, baseType: !14, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !334, file: !286, line: 75, baseType: !339, size: 256, offset: 64)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 256, elements: !163)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !334, file: !286, line: 78, baseType: !12, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !334, file: !286, line: 81, baseType: !12, size: 64, offset: 384)
!342 = !DISubprogram(name: "free", scope: !91, file: !91, line: 565, type: !343, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !66}
!345 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !232, file: !232, line: 408, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!346 = !DISubroutineType(types: !347)
!347 = !{!10, !14, !12, !12, !12, !70}
!348 = !DISubprogram(name: "rpl_mbrtowc", scope: !349, file: !349, line: 717, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!349 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !DISubroutineType(types: !351)
!351 = !{!70, !130, !12, !70, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 13, size: 64, elements: !355)
!354 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !353, file: !354, line: 15, baseType: !14, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !353, file: !354, line: 20, baseType: !358, size: 32, offset: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !354, line: 16, size: 32, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !358, file: !354, line: 18, baseType: !152, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !358, file: !354, line: 19, baseType: !362, size: 32)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 4)
!365 = !DISubprogram(name: "iswprint", scope: !366, file: !366, line: 120, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!366 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!367 = !DISubroutineType(types: !368)
!368 = !{!14, !152}
!369 = !DISubprogram(name: "mbsinit", scope: !370, file: !370, line: 292, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!370 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!371 = !DISubroutineType(types: !372)
!372 = !{!14, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!375 = !DISubprogram(name: "locale_charset", scope: !376, file: !376, line: 35, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!376 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!377 = !DISubroutineType(types: !378)
!378 = !{!12}
!379 = !DISubprogram(name: "c_strcasecmp", scope: !380, file: !380, line: 42, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!380 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!381 = !DISubroutineType(types: !382)
!382 = !{!14, !12, !12}
!383 = !DISubprogram(name: "xmalloc", scope: !323, file: !323, line: 53, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!384 = !DISubroutineType(types: !385)
!385 = !{!66, !70}
!386 = !DISubprogram(name: "xalloc_die", scope: !323, file: !323, line: 51, type: !95, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!387 = !DISubprogram(name: "xrealloc", scope: !323, file: !323, line: 59, type: !388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!388 = !DISubroutineType(types: !389)
!389 = !{!66, !66, !70}
!390 = !{!283, !391, !397, !399, !401, !406, !413, !415}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !285, file: !286, line: 101, type: !393, isLocal: false, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 320, elements: !395)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!395 = !{!396}
!396 = !DISubrange(count: 10)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !285, file: !286, line: 1052, type: !334, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !285, file: !286, line: 116, type: !334, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "slot0", scope: !285, file: !286, line: 842, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 256)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "slotvec", scope: !285, file: !286, line: 845, type: !408, isLocal: true, isDefinition: true)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !286, line: 834, size: 128, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !286, line: 836, baseType: !68, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !409, file: !286, line: 837, baseType: !10, size: 64, offset: 64)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "nslots", scope: !285, file: !286, line: 843, type: !14, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "slotvec0", scope: !285, file: !286, line: 844, type: !409, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 704, elements: !419)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!419 = !{!420}
!420 = !DISubrange(count: 11)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !423, file: !424, line: 26, type: !426, isLocal: false, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !425, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = !{!421}
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 47)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !431, retainedTypes: !435, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!431 = !{!432}
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !430, line: 40, baseType: !152, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!435 = !{!6, !436, !66}
!436 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!437 = !DISubroutineType(types: !438)
!438 = !{!14, !12, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !440, file: !21, line: 51, baseType: !14, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !440, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !440, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !440, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !440, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !440, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !440, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !440, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !440, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !440, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !440, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !440, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !440, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !440, file: !21, line: 70, baseType: !439, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !440, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !440, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !440, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !440, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !440, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !440, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !440, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !440, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !440, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !440, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !440, file: !21, line: 93, baseType: !439, size: 64, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !440, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !440, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !440, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !440, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !473, retainedTypes: !486, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = !{!474}
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !475, file: !323, line: 186, baseType: !152, size: 32, elements: !484)
!475 = distinct !DISubprogram(name: "x2nrealloc", scope: !323, file: !323, line: 174, type: !476, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !471, retainedNodes: !479)
!476 = !DISubroutineType(types: !477)
!477 = !{!66, !66, !478, !68}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!479 = !{!480, !481, !482, !483}
!480 = !DILocalVariable(name: "p", arg: 1, scope: !475, file: !323, line: 174, type: !66)
!481 = !DILocalVariable(name: "pn", arg: 2, scope: !475, file: !323, line: 174, type: !478)
!482 = !DILocalVariable(name: "s", arg: 3, scope: !475, file: !323, line: 174, type: !68)
!483 = !DILocalVariable(name: "n", scope: !475, file: !323, line: 176, type: !68)
!484 = !{!485}
!485 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!486 = !{!68, !386, !383, !387, !10, !342, !66, !487, !490}
!487 = !DISubprogram(name: "xcalloc", scope: !323, file: !323, line: 57, type: !488, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!488 = !DISubroutineType(types: !489)
!489 = !{!66, !70, !70}
!490 = !DISubprogram(name: "rpl_calloc", scope: !491, file: !491, line: 688, type: !488, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!491 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !494, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!494 = !{!6, !113}
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = !{!66}
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !500, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = !{!501, !68, !513}
!501 = !DISubprogram(name: "mbrtowc", scope: !370, file: !370, line: 296, type: !502, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!502 = !DISubroutineType(types: !503)
!503 = !{!70, !130, !12, !70, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 13, size: 64, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !505, file: !354, line: 15, baseType: !14, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !505, file: !354, line: 20, baseType: !509, size: 32, offset: 32)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !354, line: 16, size: 32, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !509, file: !354, line: 18, baseType: !152, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !509, file: !354, line: 19, baseType: !362, size: 32)
!513 = !DISubprogram(name: "hard_locale", scope: !514, file: !514, line: 26, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!514 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!515 = !DISubroutineType(types: !516)
!516 = !{!175, !14}
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !519, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !{!520}
!520 = !DISubprogram(name: "rpl_fclose", scope: !521, file: !521, line: 672, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!521 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = !DISubroutineType(types: !523)
!523 = !{!14, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !525, file: !21, line: 51, baseType: !14, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !525, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !525, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !525, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !525, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !525, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !525, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !525, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !525, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !525, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !525, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !525, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !525, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !525, file: !21, line: 70, baseType: !524, size: 64, offset: 832)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !525, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !525, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !525, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !525, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !525, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !525, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !525, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !525, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !525, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !525, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !525, file: !21, line: 93, baseType: !524, size: 64, offset: 1344)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !525, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !525, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !525, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !525, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !558, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !{!559}
!559 = !DISubprogram(name: "setlocale_null_r", scope: !560, file: !560, line: 64, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!560 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!561 = !DISubroutineType(types: !562)
!562 = !{!14, !14, !10, !70}
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !565, retainedTypes: !952, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!565 = !{!566}
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !567, line: 41, baseType: !152, size: 32, elements: !568)
!567 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951}
!569 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!570 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!571 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!572 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!573 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!574 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!575 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!576 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!577 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!578 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!579 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!580 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!581 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!582 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!583 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!584 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!585 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!586 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!587 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!588 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!589 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!590 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!591 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!592 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!593 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!594 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!595 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!596 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!597 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!598 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!599 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!600 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!601 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!602 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!603 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!604 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!605 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!606 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!607 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!608 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!609 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!610 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!611 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!612 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!613 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!614 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!615 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!616 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!617 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!618 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!677 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!680 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!681 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!682 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!683 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!684 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!685 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!686 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!687 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!688 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!689 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!690 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!691 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!764 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!837 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!838 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!839 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!840 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!841 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!842 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!843 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!844 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!845 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!846 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!847 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!848 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!849 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!850 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!851 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!853 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!854 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!855 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!856 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!857 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!858 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!884 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!885 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!886 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!887 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!888 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!893 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!894 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!895 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!896 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!952 = !{!953, !66}
!953 = !DISubprogram(name: "nl_langinfo", scope: !567, file: !567, line: 661, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!954 = !DISubroutineType(types: !955)
!955 = !{!10, !14}
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !958, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!958 = !{!66, !80}
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !961, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!961 = !{!962, !997, !998, !1002}
!962 = !DISubprogram(name: "fileno", scope: !16, file: !16, line: 786, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!963 = !DISubroutineType(types: !964)
!964 = !{!14, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !966, file: !21, line: 51, baseType: !14, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !966, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !966, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !966, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !966, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !966, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !966, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !966, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !966, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !966, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !966, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !966, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !966, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !966, file: !21, line: 70, baseType: !965, size: 64, offset: 832)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !966, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !966, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !966, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !966, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !966, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !966, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !966, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !966, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !966, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !966, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !966, file: !21, line: 93, baseType: !965, size: 64, offset: 1344)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !966, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !966, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !966, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !966, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!997 = !DISubprogram(name: "fclose", scope: !16, file: !16, line: 213, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!998 = !DISubprogram(name: "lseek", scope: !999, file: !999, line: 334, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!999 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!44, !14, !44, !14}
!1002 = !DISubprogram(name: "rpl_fflush", scope: !521, file: !521, line: 718, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1003 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1004, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1005, splitDebugInlining: false, nameTableKind: None)
!1004 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1005 = !{!66, !1006, !1041}
!1006 = !DISubprogram(name: "fflush", scope: !16, file: !16, line: 218, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!14, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1010, file: !21, line: 51, baseType: !14, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1010, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1010, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1010, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1010, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1010, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1010, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1010, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
