; ModuleID = 'coreutils-8.32/src/unexpand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert blanks in each FILE to tabs, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.14 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 61, type: !177, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !176, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/unexpand.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !32, !93, !97, !101, !105, !108, !111, !116, !131, !132, !26, !83, !135, !139, !140, !143, !147, !148, !152, !153, !156, !30, !63, !160, !85, !28, !166, !171, !174, !175}
!22 = !DISubprogram(name: "dcgettext", scope: !23, file: !23, line: 51, type: !24, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!23 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !28, !28, !30}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !{}
!32 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !34, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!30, !28, !36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !39)
!38 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !55, !56, !57, !58, !62, !64, !66, !70, !73, !75, !78, !81, !82, !84, !88, !89}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 51, baseType: !30, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 36, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 70, baseType: !36, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 152, baseType: !61)
!60 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!65 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 43, baseType: null)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 153, baseType: !61)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !37, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !38, line: 37, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !37, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !38, line: 38, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !37, file: !38, line: 93, baseType: !36, size: 64, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !37, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DISubprogram(name: "emit_tab_list_info", scope: !94, file: !94, line: 76, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!94 = !DIFile(filename: "src/expand-common.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "set_program_name", scope: !98, file: !98, line: 37, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!98 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!99 = !DISubroutineType(types: !100)
!100 = !{null, !28}
!101 = !DISubprogram(name: "setlocale", scope: !102, file: !102, line: 122, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!102 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!103 = !DISubroutineType(types: !104)
!104 = !{!26, !30, !28}
!105 = !DISubprogram(name: "bindtextdomain", scope: !23, file: !23, line: 86, type: !106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!106 = !DISubroutineType(types: !107)
!107 = !{!26, !28, !28}
!108 = !DISubprogram(name: "textdomain", scope: !23, file: !23, line: 82, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!109 = !DISubroutineType(types: !110)
!110 = !{!26, !28}
!111 = !DISubprogram(name: "atexit", scope: !112, file: !112, line: 595, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!112 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!113 = !DISubroutineType(types: !114)
!114 = !{!30, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!116 = !DISubprogram(name: "getopt_long", scope: !117, file: !117, line: 66, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!117 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!30, !30, !120, !28, !122, !129}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !117, line: 50, size: 256, elements: !125)
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !117, line: 52, baseType: !28, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !124, file: !117, line: 55, baseType: !30, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !124, file: !117, line: 56, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !124, file: !117, line: 57, baseType: !30, size: 32, offset: 192)
!131 = !DISubprogram(name: "parse_tab_stops", scope: !94, file: !94, line: 44, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!132 = !DISubprogram(name: "add_tab_stop", scope: !94, file: !94, line: 39, type: !133, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !87}
!135 = !DISubprogram(name: "version_etc", scope: !136, file: !136, line: 69, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!136 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!137 = !DISubroutineType(types: !138)
!138 = !{null, !36, !28, !28, !28, null}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !141, line: 102, baseType: !142)
!141 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !60, line: 73, baseType: !87)
!143 = !DISubprogram(name: "error", scope: !144, file: !144, line: 52, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!144 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!145 = !DISubroutineType(types: !146)
!146 = !{null, !30, !30, !28, null}
!147 = !DISubprogram(name: "finalize_tab_stops", scope: !94, file: !94, line: 54, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!148 = !DISubprogram(name: "set_file_list", scope: !94, file: !94, line: 61, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!152 = !DISubprogram(name: "cleanup_file_list_stdin", scope: !94, file: !94, line: 72, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!153 = !DISubprogram(name: "next_file", scope: !94, file: !94, line: 68, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!154 = !DISubroutineType(types: !155)
!155 = !{!36, !36}
!156 = !DISubprogram(name: "xmalloc", scope: !157, file: !157, line: 53, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!157 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{!83, !87}
!160 = !DISubprogram(name: "get_next_tab_column", scope: !94, file: !94, line: 48, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!161 = !DISubroutineType(types: !162)
!162 = !{!87, !87, !163, !164}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!166 = !DISubprogram(name: "fwrite_unlocked", scope: !33, file: !33, line: 675, type: !167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!167 = !DISubroutineType(types: !168)
!168 = !{!87, !169, !87, !87, !36}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!171 = !DISubprogram(name: "free", scope: !112, file: !112, line: 565, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !83}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!176 = !{!0}
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1536, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 6)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !182, file: !183, line: 33, type: !165, isLocal: false, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !184, retainedTypes: !220, globals: !281, splitDebugInlining: false, nameTableKind: None)
!183 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !{!5, !185, !199, !208}
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !186, line: 32, baseType: !7, size: 32, elements: !187)
!186 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!188 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!189 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!190 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!191 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!192 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!193 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!194 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!195 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!196 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!197 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!198 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !200, line: 45, baseType: !7, size: 32, elements: !201)
!200 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !{!202, !203, !204, !205, !206, !207}
!202 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!203 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!204 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!205 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!206 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!207 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !209, file: !157, line: 186, baseType: !7, size: 32, elements: !218)
!209 = distinct !DISubprogram(name: "x2nrealloc", scope: !157, file: !157, line: 174, type: !210, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !213)
!210 = !DISubroutineType(types: !211)
!211 = !{!83, !83, !212, !85}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!213 = !{!214, !215, !216, !217}
!214 = !DILocalVariable(name: "p", arg: 1, scope: !209, file: !157, line: 174, type: !83)
!215 = !DILocalVariable(name: "pn", arg: 2, scope: !209, file: !157, line: 174, type: !212)
!216 = !DILocalVariable(name: "s", arg: 3, scope: !209, file: !157, line: 174, type: !85)
!217 = !DILocalVariable(name: "n", scope: !209, file: !157, line: 176, type: !85)
!218 = !{!219}
!219 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!220 = !{!22, !143, !30, !63, !221, !7, !139, !83, !140, !225, !171, !229, !232, !267, !271, !274, !85, !277, !278}
!221 = !DISubprogram(name: "quote", scope: !222, file: !222, line: 44, type: !223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!222 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = !DISubroutineType(types: !224)
!224 = !{!28, !28}
!225 = !DISubprogram(name: "xstrndup", scope: !226, file: !226, line: 23, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!226 = !DIFile(filename: "./lib/xstrndup.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!227 = !DISubroutineType(types: !228)
!228 = !{!26, !28, !87}
!229 = !DISubprogram(name: "quotearg_n_style_colon", scope: !186, file: !186, line: 397, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!230 = !DISubroutineType(types: !231)
!231 = !{!26, !30, !185, !28}
!232 = !DISubprogram(name: "clearerr_unlocked", scope: !33, file: !33, line: 765, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !236, file: !38, line: 51, baseType: !30, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !236, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !236, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !236, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !236, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !236, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !236, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !236, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !236, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !236, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !236, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !236, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !236, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !236, file: !38, line: 70, baseType: !235, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !236, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !236, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !236, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !236, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !236, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !236, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !236, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !236, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !236, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !236, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !236, file: !38, line: 93, baseType: !235, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !236, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !236, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !236, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !236, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!267 = !DISubprogram(name: "rpl_fclose", scope: !268, file: !268, line: 672, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!268 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!269 = !DISubroutineType(types: !270)
!270 = !{!30, !235}
!271 = !DISubprogram(name: "fadvise", scope: !200, file: !200, line: 72, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !235, !199}
!274 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!275 = !DISubroutineType(types: !276)
!276 = !{!30, !28, !235}
!277 = !DISubprogram(name: "xalloc_die", scope: !157, file: !157, line: 51, type: !95, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !31)
!278 = !DISubprogram(name: "xrealloc", scope: !157, file: !157, line: 59, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!279 = !DISubroutineType(types: !280)
!280 = !{!83, !83, !87}
!281 = !{!180, !282, !284, !295, !297, !299, !301, !303, !305, !307, !309, !311, !316}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "exit_status", scope: !182, file: !183, line: 72, type: !30, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "prev_file", scope: !286, file: !183, line: 336, type: !26, isLocal: true, isDefinition: true)
!286 = distinct !DISubprogram(name: "next_file", scope: !183, file: !183, line: 334, type: !287, scopeLine: 335, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !292)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !291, line: 7, baseType: !236)
!291 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!292 = !{!293, !294}
!293 = !DILocalVariable(name: "fp", arg: 1, scope: !286, file: !183, line: 334, type: !289)
!294 = !DILocalVariable(name: "file", scope: !286, file: !183, line: 337, type: !26)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "max_column_width", scope: !182, file: !183, line: 45, type: !85, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !182, file: !183, line: 57, type: !85, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "tab_list", scope: !182, file: !183, line: 50, type: !139, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !182, file: !183, line: 53, type: !85, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "extend_size", scope: !182, file: !183, line: 39, type: !140, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "increment_size", scope: !182, file: !183, line: 42, type: !140, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "tab_size", scope: !182, file: !183, line: 36, type: !140, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !182, file: !183, line: 69, type: !165, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !182, file: !183, line: 63, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 2)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "file_list", scope: !182, file: !183, line: 60, type: !151, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "Version", scope: !321, file: !322, line: 2, type: !28, isLocal: false, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, globals: !323, splitDebugInlining: false, nameTableKind: None)
!322 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = !{!319}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "file_name", scope: !326, file: !327, line: 46, type: !28, isLocal: true, isDefinition: true)
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !328, globals: !366, splitDebugInlining: false, nameTableKind: None)
!327 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!328 = !{!329, !22, !365, !143}
!329 = !DISubprogram(name: "close_stream", scope: !330, file: !330, line: 2, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!330 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!331 = !DISubroutineType(types: !332)
!332 = !{!30, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !334, file: !38, line: 51, baseType: !30, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !334, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !334, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !334, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !334, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !334, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !334, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !334, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !334, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !334, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !334, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !334, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !334, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !334, file: !38, line: 70, baseType: !333, size: 64, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !334, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !334, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !334, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !334, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !334, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !334, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !334, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !334, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !334, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !334, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !334, file: !38, line: 93, baseType: !333, size: 64, offset: 1344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !334, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !334, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !334, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !334, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!365 = !DISubprogram(name: "quotearg_colon", scope: !186, file: !186, line: 391, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!366 = !{!324, !367}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !326, file: !327, line: 56, type: !165, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "exit_failure", scope: !371, file: !372, line: 24, type: !374, isLocal: false, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, globals: !373, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !{!369}
!374 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "program_name", scope: !377, file: !378, line: 33, type: !28, isLocal: false, isDefinition: true)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !379, globals: !415, splitDebugInlining: false, nameTableKind: None)
!378 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!379 = !{!83, !380, !26}
!380 = !DISubprogram(name: "fputs", scope: !33, file: !33, line: 626, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!381 = !DISubroutineType(types: !382)
!382 = !{!30, !28, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !384, file: !38, line: 51, baseType: !30, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !384, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !384, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !384, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !384, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !384, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !384, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !384, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !384, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !384, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !384, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !384, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !384, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !384, file: !38, line: 70, baseType: !383, size: 64, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !384, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !384, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !384, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !384, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !384, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !384, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !384, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !384, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !384, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !384, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !384, file: !38, line: 93, baseType: !383, size: 64, offset: 1344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !384, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !384, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !384, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !384, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!415 = !{!375}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !418, file: !419, line: 85, type: !510, isLocal: false, isDefinition: true)
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !420, retainedTypes: !426, globals: !483, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!420 = !{!185, !421, !5}
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !186, line: 242, baseType: !7, size: 32, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!424 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!425 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!426 = !{!427, !430, !171, !445, !30, !63, !448, !85, !465, !469, !22, !475, !479, !26, !156, !277, !278}
!427 = !DISubprogram(name: "xmemdup", scope: !157, file: !157, line: 62, type: !428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!428 = !DISubroutineType(types: !429)
!429 = !{!83, !169, !87}
!430 = !DISubprogram(name: "quotearg_alloc_mem", scope: !186, file: !186, line: 342, type: !431, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!431 = !DISubroutineType(types: !432)
!432 = !{!26, !28, !87, !163, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !419, line: 65, size: 448, elements: !436)
!436 = !{!437, !438, !439, !443, !444}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !435, file: !419, line: 68, baseType: !185, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !435, file: !419, line: 71, baseType: !30, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !435, file: !419, line: 75, baseType: !440, size: 256, offset: 64)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !435, file: !419, line: 78, baseType: !28, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !435, file: !419, line: 81, baseType: !28, size: 64, offset: 384)
!445 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !186, file: !186, line: 408, type: !446, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!446 = !DISubroutineType(types: !447)
!447 = !{!26, !30, !28, !28, !28, !87}
!448 = !DISubprogram(name: "rpl_mbrtowc", scope: !449, file: !449, line: 717, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!449 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!450 = !DISubroutineType(types: !451)
!451 = !{!87, !129, !28, !87, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 13, size: 64, elements: !455)
!454 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !453, file: !454, line: 15, baseType: !30, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !453, file: !454, line: 20, baseType: !458, size: 32, offset: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !454, line: 16, size: 32, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !458, file: !454, line: 18, baseType: !7, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !458, file: !454, line: 19, baseType: !462, size: 32)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 4)
!465 = !DISubprogram(name: "iswprint", scope: !466, file: !466, line: 120, type: !467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!466 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!467 = !DISubroutineType(types: !468)
!468 = !{!30, !7}
!469 = !DISubprogram(name: "mbsinit", scope: !470, file: !470, line: 292, type: !471, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!470 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!471 = !DISubroutineType(types: !472)
!472 = !{!30, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!475 = !DISubprogram(name: "locale_charset", scope: !476, file: !476, line: 35, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!476 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!477 = !DISubroutineType(types: !478)
!478 = !{!28}
!479 = !DISubprogram(name: "c_strcasecmp", scope: !480, file: !480, line: 42, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!480 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !DISubroutineType(types: !482)
!482 = !{!30, !28, !28}
!483 = !{!416, !484, !490, !492, !494, !499, !506, !508}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !418, file: !419, line: 101, type: !486, isLocal: false, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 320, elements: !488)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!488 = !{!489}
!489 = !DISubrange(count: 10)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !418, file: !419, line: 1052, type: !435, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !418, file: !419, line: 116, type: !435, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "slot0", scope: !418, file: !419, line: 842, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 256)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "slotvec", scope: !418, file: !419, line: 845, type: !501, isLocal: true, isDefinition: true)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !419, line: 834, size: 128, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !502, file: !419, line: 836, baseType: !85, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !502, file: !419, line: 837, baseType: !26, size: 64, offset: 64)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "nslots", scope: !418, file: !419, line: 843, type: !30, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "slotvec0", scope: !418, file: !419, line: 844, type: !502, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 704, elements: !512)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!512 = !{!513}
!513 = !DISubrange(count: 11)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !516, file: !517, line: 26, type: !519, isLocal: false, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, globals: !518, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!518 = !{!514}
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 376, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 47)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !525, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!524 = !{!199}
!525 = !{!526, !530}
!526 = !DISubprogram(name: "posix_fadvise", scope: !527, file: !527, line: 288, type: !528, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!527 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!528 = !DISubroutineType(types: !529)
!529 = !{!30, !30, !61, !61, !30}
!530 = !DISubprogram(name: "fileno", scope: !33, file: !33, line: 786, type: !531, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!531 = !DISubroutineType(types: !532)
!532 = !{!30, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !534, file: !38, line: 51, baseType: !30, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !534, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !534, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !534, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !534, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !534, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !534, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !534, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !534, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !534, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !534, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !534, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !534, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !534, file: !38, line: 70, baseType: !533, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !534, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !534, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !534, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !534, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !534, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !534, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !534, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !534, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !534, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !534, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !534, file: !38, line: 93, baseType: !533, size: 64, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !534, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !534, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !534, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !534, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !567, retainedTypes: !571, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!567 = !{!568}
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !566, line: 40, baseType: !7, size: 32, elements: !569)
!569 = !{!570}
!570 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!571 = !{!22, !572, !83}
!572 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!573 = !DISubroutineType(types: !574)
!574 = !{!30, !28, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !576, file: !38, line: 51, baseType: !30, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !576, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !576, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !576, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !576, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !576, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !576, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !576, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !576, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !576, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !576, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !576, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !576, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !576, file: !38, line: 70, baseType: !575, size: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !576, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !576, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !576, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !576, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !576, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !576, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !576, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !576, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !576, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !576, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !576, file: !38, line: 93, baseType: !575, size: 64, offset: 1344)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !576, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !576, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !576, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !576, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !609, retainedTypes: !617, splitDebugInlining: false, nameTableKind: None)
!608 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = !{!610}
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !611, file: !157, line: 186, baseType: !7, size: 32, elements: !218)
!611 = distinct !DISubprogram(name: "x2nrealloc", scope: !157, file: !157, line: 174, type: !210, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !607, retainedNodes: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DILocalVariable(name: "p", arg: 1, scope: !611, file: !157, line: 174, type: !83)
!614 = !DILocalVariable(name: "pn", arg: 2, scope: !611, file: !157, line: 174, type: !212)
!615 = !DILocalVariable(name: "s", arg: 3, scope: !611, file: !157, line: 174, type: !85)
!616 = !DILocalVariable(name: "n", scope: !611, file: !157, line: 176, type: !85)
!617 = !{!85, !277, !156, !278, !26, !171, !83, !618, !621}
!618 = !DISubprogram(name: "xcalloc", scope: !157, file: !157, line: 57, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!619 = !DISubroutineType(types: !620)
!620 = !{!83, !87, !87}
!621 = !DISubprogram(name: "rpl_calloc", scope: !622, file: !622, line: 688, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!622 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !624, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !625, splitDebugInlining: false, nameTableKind: None)
!624 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!625 = !{!22, !143}
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !628, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!628 = !{!277}
!629 = distinct !DICompileUnit(language: DW_LANG_C99, file: !630, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !631, splitDebugInlining: false, nameTableKind: None)
!630 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!631 = !{!83}
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !634, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!634 = !{!635, !670, !671, !675}
!635 = !DISubprogram(name: "fileno", scope: !33, file: !33, line: 786, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!636 = !DISubroutineType(types: !637)
!637 = !{!30, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !639, file: !38, line: 51, baseType: !30, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !639, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !639, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !639, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !639, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !639, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !639, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !639, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !639, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !639, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !639, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !639, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !639, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !639, file: !38, line: 70, baseType: !638, size: 64, offset: 832)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !639, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !639, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !639, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !639, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !639, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !639, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !639, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !639, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !639, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !639, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !639, file: !38, line: 93, baseType: !638, size: 64, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !639, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !639, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !639, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !639, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!670 = !DISubprogram(name: "fclose", scope: !33, file: !33, line: 213, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!671 = !DISubprogram(name: "lseek", scope: !672, file: !672, line: 334, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!672 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!673 = !DISubroutineType(types: !674)
!674 = !{!61, !30, !61, !30}
!675 = !DISubprogram(name: "rpl_fflush", scope: !268, file: !268, line: 718, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !678, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!678 = !{!83, !679, !714}
!679 = !DISubprogram(name: "fflush", scope: !33, file: !33, line: 218, type: !680, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!680 = !DISubroutineType(types: !681)
!681 = !{!30, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !683, file: !38, line: 51, baseType: !30, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !683, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !683, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !683, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !683, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !683, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !683, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !683, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !683, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !683, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !683, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !683, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !683, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !683, file: !38, line: 70, baseType: !682, size: 64, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !683, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !683, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !683, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !683, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !683, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !683, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !683, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !683, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !683, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !683, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !683, file: !38, line: 93, baseType: !682, size: 64, offset: 1344)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !683, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !683, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !683, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !683, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!714 = !DISubprogram(name: "rpl_fseeko", scope: !268, file: !268, line: 1034, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!715 = !DISubroutineType(types: !716)
!716 = !{!30, !682, !61, !30}
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !719, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !{!83, !720, !671, !755}
!720 = !DISubprogram(name: "fileno", scope: !33, file: !33, line: 786, type: !721, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!721 = !DISubroutineType(types: !722)
!722 = !{!30, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !724, file: !38, line: 51, baseType: !30, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !724, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !724, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !724, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !724, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !724, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !724, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !724, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !724, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !724, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !724, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !724, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !724, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !724, file: !38, line: 70, baseType: !723, size: 64, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !724, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !724, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !724, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !724, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !724, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !724, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !724, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !724, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !724, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !724, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !724, file: !38, line: 93, baseType: !723, size: 64, offset: 1344)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !724, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !724, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !724, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !724, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!755 = !DISubprogram(name: "fseeko", scope: !33, file: !33, line: 707, type: !756, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!756 = !DISubroutineType(types: !757)
!757 = !{!30, !723, !61, !30}
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !760, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!760 = !{!761, !85, !773}
!761 = !DISubprogram(name: "mbrtowc", scope: !470, file: !470, line: 296, type: !762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!762 = !DISubroutineType(types: !763)
!763 = !{!87, !129, !28, !87, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 13, size: 64, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !765, file: !454, line: 15, baseType: !30, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !765, file: !454, line: 20, baseType: !769, size: 32, offset: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !454, line: 16, size: 32, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !769, file: !454, line: 18, baseType: !7, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !769, file: !454, line: 19, baseType: !462, size: 32)
!773 = !DISubprogram(name: "hard_locale", scope: !774, file: !774, line: 26, type: !775, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!774 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!775 = !DISubroutineType(types: !776)
!776 = !{!165, !30}
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !779, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!779 = !{!780}
!780 = !DISubprogram(name: "rpl_fclose", scope: !268, file: !268, line: 672, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!781 = !DISubroutineType(types: !782)
!782 = !{!30, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !784, file: !38, line: 51, baseType: !30, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !784, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !784, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !784, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !784, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !784, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !784, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !784, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !784, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !784, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !784, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !784, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !784, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !784, file: !38, line: 70, baseType: !783, size: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !784, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !784, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !784, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !784, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !784, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !784, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !784, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !784, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !784, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !784, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !784, file: !38, line: 93, baseType: !783, size: 64, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !784, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !784, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !784, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !784, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !817, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!817 = !{!818}
!818 = !DISubprogram(name: "setlocale_null_r", scope: !819, file: !819, line: 64, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!819 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!820 = !DISubroutineType(types: !821)
!821 = !{!30, !30, !26, !87}
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !824, retainedTypes: !1211, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!824 = !{!825}
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !826, line: 41, baseType: !7, size: 32, elements: !827)
!826 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210}
!828 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!829 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!830 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!831 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!832 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!833 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!834 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!835 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!836 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!837 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!838 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!839 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!840 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!841 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!842 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!843 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!844 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!845 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!846 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!847 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!848 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!849 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!850 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!851 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!852 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!853 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!854 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!855 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!856 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!857 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!858 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!859 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!860 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!861 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!862 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!863 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!864 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!865 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!866 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!867 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!868 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!869 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!870 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!871 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!872 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!873 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!874 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!875 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!876 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!877 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
