; ModuleID = 'coreutils-8.32/src/unexpand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert blanks in each FILE to tabs, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.14 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 61, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !39, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/unexpand.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !24, !25, !26, !31, !32, !33, !35, !37, !38}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !27, line: 102, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !29, line: 73, baseType: !30)
!29 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 46, baseType: !30)
!34 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!0}
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1536, elements: !50)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !43, line: 50, size: 256, elements: !44)
!43 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!44 = !{!45, !46, !47, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !43, line: 52, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !42, file: !43, line: 55, baseType: !31, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !42, file: !43, line: 56, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !42, file: !43, line: 57, baseType: !31, size: 32, offset: 192)
!50 = !{!51}
!51 = !DISubrange(count: 6)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !54, file: !55, line: 33, type: !175, isLocal: false, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !93, globals: !94, splitDebugInlining: false, nameTableKind: None)
!55 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!56 = !{!5, !57, !71, !80}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !7, size: 32, elements: !59)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!60 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!67 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!68 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!70 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 45, baseType: !7, size: 32, elements: !73)
!72 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!77 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !82, file: !81, line: 186, baseType: !7, size: 32, elements: !91)
!81 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!82 = distinct !DISubprogram(name: "x2nrealloc", scope: !81, file: !81, line: 174, type: !83, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !86)
!83 = !DISubroutineType(types: !84)
!84 = !{!24, !24, !85, !33}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!86 = !{!87, !88, !89, !90}
!87 = !DILocalVariable(name: "p", arg: 1, scope: !82, file: !81, line: 174, type: !24)
!88 = !DILocalVariable(name: "pn", arg: 2, scope: !82, file: !81, line: 174, type: !85)
!89 = !DILocalVariable(name: "s", arg: 3, scope: !82, file: !81, line: 174, type: !33)
!90 = !DILocalVariable(name: "n", scope: !82, file: !81, line: 176, type: !33)
!91 = !{!92}
!92 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!93 = !{!31, !32, !7, !25, !24, !26, !33}
!94 = !{!52, !95, !97, !159, !161, !163, !165, !167, !169, !171, !173, !176, !181}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "exit_status", scope: !54, file: !55, line: 72, type: !31, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "prev_file", scope: !99, file: !55, line: 336, type: !22, isLocal: true, isDefinition: true)
!99 = distinct !DISubprogram(name: "next_file", scope: !55, file: !55, line: 334, type: !100, scopeLine: 335, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !156)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !105)
!104 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !107)
!106 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !125, !126, !127, !130, !131, !133, !137, !140, !142, !145, !148, !149, !150, !151, !152}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !105, file: !106, line: 51, baseType: !31, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !105, file: !106, line: 54, baseType: !22, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !105, file: !106, line: 55, baseType: !22, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !105, file: !106, line: 56, baseType: !22, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !105, file: !106, line: 57, baseType: !22, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !105, file: !106, line: 58, baseType: !22, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !105, file: !106, line: 59, baseType: !22, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !105, file: !106, line: 60, baseType: !22, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !105, file: !106, line: 61, baseType: !22, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !105, file: !106, line: 64, baseType: !22, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !105, file: !106, line: 65, baseType: !22, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !105, file: !106, line: 66, baseType: !22, size: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !105, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !106, line: 36, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !105, file: !106, line: 70, baseType: !124, size: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !105, file: !106, line: 72, baseType: !31, size: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !105, file: !106, line: 73, baseType: !31, size: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !105, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !29, line: 152, baseType: !129)
!129 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !105, file: !106, line: 77, baseType: !32, size: 16, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !105, file: !106, line: 78, baseType: !132, size: 8, offset: 1040)
!132 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !105, file: !106, line: 79, baseType: !134, size: 8, offset: 1048)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !105, file: !106, line: 81, baseType: !138, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !106, line: 43, baseType: null)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !105, file: !106, line: 89, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !29, line: 153, baseType: !129)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !105, file: !106, line: 91, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !106, line: 37, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !105, file: !106, line: 92, baseType: !146, size: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !106, line: 38, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !105, file: !106, line: 93, baseType: !124, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !105, file: !106, line: 94, baseType: !24, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !105, file: !106, line: 95, baseType: !33, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !105, file: !106, line: 96, baseType: !31, size: 32, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !105, file: !106, line: 98, baseType: !153, size: 160, offset: 1568)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 20)
!156 = !{!157, !158}
!157 = !DILocalVariable(name: "fp", arg: 1, scope: !99, file: !55, line: 334, type: !102)
!158 = !DILocalVariable(name: "file", scope: !99, file: !55, line: 337, type: !22)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "max_column_width", scope: !54, file: !55, line: 45, type: !33, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !54, file: !55, line: 57, type: !33, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "tab_list", scope: !54, file: !55, line: 50, type: !25, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !54, file: !55, line: 53, type: !33, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "extend_size", scope: !54, file: !55, line: 39, type: !26, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "increment_size", scope: !54, file: !55, line: 42, type: !26, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "tab_size", scope: !54, file: !55, line: 36, type: !26, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !54, file: !55, line: 69, type: !175, isLocal: true, isDefinition: true)
!175 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !54, file: !55, line: 63, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 2)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "file_list", scope: !54, file: !55, line: 60, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!184 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "Version", scope: !187, file: !188, line: 2, type: !35, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, globals: !190, splitDebugInlining: false, nameTableKind: None)
!188 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!189 = !{}
!190 = !{!185}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "file_name", scope: !193, file: !194, line: 46, type: !35, isLocal: true, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, globals: !195, splitDebugInlining: false, nameTableKind: None)
!194 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!195 = !{!191, !196}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !193, file: !194, line: 56, type: !175, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "exit_failure", scope: !200, file: !201, line: 24, type: !203, isLocal: false, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, globals: !202, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !{!198}
!203 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "program_name", scope: !206, file: !207, line: 33, type: !35, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !208, globals: !209, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !{!24, !22}
!209 = !{!204}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !212, file: !213, line: 85, type: !258, isLocal: false, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !214, retainedTypes: !220, globals: !221, splitDebugInlining: false, nameTableKind: None)
!213 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !{!57, !215, !5}
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !58, line: 242, baseType: !7, size: 32, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!220 = !{!31, !32, !33, !22}
!221 = !{!210, !222, !228, !240, !242, !247, !254, !256}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !212, file: !213, line: 101, type: !224, isLocal: false, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 320, elements: !226)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!226 = !{!227}
!227 = !DISubrange(count: 10)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !212, file: !213, line: 1052, type: !230, isLocal: false, isDefinition: true)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !213, line: 65, size: 448, elements: !231)
!231 = !{!232, !233, !234, !238, !239}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !230, file: !213, line: 68, baseType: !57, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !230, file: !213, line: 71, baseType: !31, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !230, file: !213, line: 75, baseType: !235, size: 256, offset: 64)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !230, file: !213, line: 78, baseType: !35, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !230, file: !213, line: 81, baseType: !35, size: 64, offset: 384)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !212, file: !213, line: 116, type: !230, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "slot0", scope: !212, file: !213, line: 842, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 256)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "slotvec", scope: !212, file: !213, line: 845, type: !249, isLocal: true, isDefinition: true)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !213, line: 834, size: 128, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !250, file: !213, line: 836, baseType: !33, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !250, file: !213, line: 837, baseType: !22, size: 64, offset: 64)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "nslots", scope: !212, file: !213, line: 843, type: !31, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "slotvec0", scope: !212, file: !213, line: 844, type: !250, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 704, elements: !260)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!260 = !{!261}
!261 = !DISubrange(count: 11)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !264, file: !265, line: 26, type: !267, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, globals: !266, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = !{!262}
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 376, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 47)
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !272, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !{!71}
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !275, retainedTypes: !279, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!275 = !{!276}
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !274, line: 40, baseType: !7, size: 32, elements: !277)
!277 = !{!278}
!278 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!279 = !{!24}
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !282, retainedTypes: !290, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!282 = !{!283}
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !284, file: !81, line: 186, baseType: !7, size: 32, elements: !91)
!284 = distinct !DISubprogram(name: "x2nrealloc", scope: !81, file: !81, line: 174, type: !83, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !280, retainedNodes: !285)
!285 = !{!286, !287, !288, !289}
!286 = !DILocalVariable(name: "p", arg: 1, scope: !284, file: !81, line: 174, type: !24)
!287 = !DILocalVariable(name: "pn", arg: 2, scope: !284, file: !81, line: 174, type: !85)
!288 = !DILocalVariable(name: "s", arg: 3, scope: !284, file: !81, line: 174, type: !33)
!289 = !DILocalVariable(name: "n", scope: !284, file: !81, line: 176, type: !33)
!290 = !{!33, !22, !24}
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!293 = distinct !DICompileUnit(language: DW_LANG_C99, file: !294, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, splitDebugInlining: false, nameTableKind: None)
!294 = !DIFile(filename: "lib/xstrndup.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!295 = distinct !DICompileUnit(language: DW_LANG_C99, file: !296, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !279, splitDebugInlining: false, nameTableKind: None)
!296 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !279, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !279, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !305, splitDebugInlining: false, nameTableKind: None)
!304 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!305 = !{!33}
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, splitDebugInlining: false, nameTableKind: None)
!307 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, splitDebugInlining: false, nameTableKind: None)
!309 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !312, retainedTypes: !279, splitDebugInlining: false, nameTableKind: None)
!311 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!312 = !{!313}
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 41, baseType: !7, size: 32, elements: !315)
!314 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!316 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!317 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!318 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!319 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!320 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!321 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!322 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!323 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!324 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!325 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!326 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!327 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!328 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!329 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!330 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!331 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!332 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!333 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!334 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!335 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!336 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!337 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!338 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!339 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!340 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!341 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!342 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!343 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!344 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!345 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!346 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!347 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!348 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!349 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!350 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!351 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!352 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!353 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!354 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!355 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!356 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!357 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!358 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!359 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!360 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!361 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!362 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!363 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!364 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!365 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!424 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!427 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!428 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!429 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!430 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!431 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!432 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!433 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!434 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!435 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!436 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!437 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!438 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!511 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!584 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!585 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!586 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!587 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!588 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!589 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!590 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!591 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!592 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!593 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!594 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!595 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!596 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!597 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!598 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!600 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!601 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!602 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!603 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!604 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!605 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!631 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!632 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!633 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!634 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!635 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!640 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!641 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!642 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!643 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !279, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = !{!"clang version 12.0.1"}
!702 = !{i32 7, !"Dwarf Version", i32 4}
!703 = !{i32 2, !"Debug Info Version", i32 3}
!704 = !{i32 1, !"wchar_size", i32 4}
!705 = !{i32 7, !"PIC Level", i32 2}
!706 = !{i32 7, !"PIE Level", i32 2}
!707 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 72, type: !708, scopeLine: 73, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !31}
!710 = !{!711}
!711 = !DILocalVariable(name: "status", arg: 1, scope: !707, file: !3, line: 72, type: !31)
!712 = !DILocation(line: 0, scope: !707)
!713 = !DILocation(line: 74, column: 14, scope: !714)
!714 = distinct !DILexicalBlock(scope: !707, file: !3, line: 74, column: 7)
!715 = !DILocation(line: 74, column: 7, scope: !707)
!716 = !DILocation(line: 75, column: 5, scope: !717)
!717 = distinct !DILexicalBlock(scope: !714, file: !3, line: 75, column: 5)
!718 = !{!719, !719, i64 0}
!719 = !{!"any pointer", !720, i64 0}
!720 = !{!"omnipotent char", !721, i64 0}
!721 = !{!"Simple C/C++ TBAA"}
!722 = !DILocation(line: 78, column: 7, scope: !723)
!723 = distinct !DILexicalBlock(scope: !714, file: !3, line: 77, column: 5)
!724 = !DILocation(line: 82, column: 7, scope: !723)
!725 = !DILocation(line: 583, column: 3, scope: !726, inlinedAt: !730)
!726 = distinct !DISubprogram(name: "emit_stdin_note", scope: !727, file: !727, line: 581, type: !728, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !189)
!727 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!728 = !DISubroutineType(types: !729)
!729 = !{null}
!730 = distinct !DILocation(line: 86, column: 7, scope: !723)
!731 = !DILocation(line: 590, column: 3, scope: !732, inlinedAt: !733)
!732 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !727, file: !727, line: 588, type: !728, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !189)
!733 = distinct !DILocation(line: 87, column: 7, scope: !723)
!734 = !DILocation(line: 89, column: 7, scope: !723)
!735 = !DILocation(line: 94, column: 7, scope: !723)
!736 = !DILocation(line: 95, column: 7, scope: !723)
!737 = !DILocation(line: 96, column: 7, scope: !723)
!738 = !DILocalVariable(name: "program", arg: 1, scope: !739, file: !727, line: 634, type: !35)
!739 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !727, file: !727, line: 634, type: !740, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !35}
!742 = !{!738, !743, !752, !753, !755}
!743 = !DILocalVariable(name: "infomap", scope: !739, file: !727, line: 636, type: !744)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 896, elements: !750)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !739, file: !727, line: 636, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !746, file: !727, line: 636, baseType: !35, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !746, file: !727, line: 636, baseType: !35, size: 64, offset: 64)
!750 = !{!751}
!751 = !DISubrange(count: 7)
!752 = !DILocalVariable(name: "node", scope: !739, file: !727, line: 646, type: !35)
!753 = !DILocalVariable(name: "map_prog", scope: !739, file: !727, line: 647, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!755 = !DILocalVariable(name: "lc_messages", scope: !739, file: !727, line: 659, type: !35)
!756 = !DILocation(line: 0, scope: !739, inlinedAt: !757)
!757 = distinct !DILocation(line: 97, column: 7, scope: !723)
!758 = !DILocation(line: 636, column: 3, scope: !739, inlinedAt: !757)
!759 = !DILocation(line: 636, column: 67, scope: !739, inlinedAt: !757)
!760 = !DILocation(line: 647, column: 36, scope: !739, inlinedAt: !757)
!761 = !DILocation(line: 649, column: 3, scope: !739, inlinedAt: !757)
!762 = !DILocation(line: 649, column: 33, scope: !739, inlinedAt: !757)
!763 = !DILocation(line: 650, column: 13, scope: !739, inlinedAt: !757)
!764 = !DILocation(line: 649, column: 20, scope: !739, inlinedAt: !757)
!765 = !{!766, !719, i64 0}
!766 = !{!"infomap", !719, i64 0, !719, i64 8}
!767 = !DILocation(line: 649, column: 10, scope: !739, inlinedAt: !757)
!768 = !DILocation(line: 649, column: 28, scope: !739, inlinedAt: !757)
!769 = distinct !{!769, !761, !763, !770}
!770 = !{!"llvm.loop.mustprogress"}
!771 = !DILocation(line: 652, column: 17, scope: !772, inlinedAt: !757)
!772 = distinct !DILexicalBlock(scope: !739, file: !727, line: 652, column: 7)
!773 = !{!766, !719, i64 8}
!774 = !DILocation(line: 652, column: 7, scope: !772, inlinedAt: !757)
!775 = !DILocation(line: 652, column: 7, scope: !739, inlinedAt: !757)
!776 = !DILocation(line: 655, column: 3, scope: !739, inlinedAt: !757)
!777 = !DILocation(line: 659, column: 29, scope: !739, inlinedAt: !757)
!778 = !DILocation(line: 660, column: 7, scope: !779, inlinedAt: !757)
!779 = distinct !DILexicalBlock(scope: !739, file: !727, line: 660, column: 7)
!780 = !DILocation(line: 660, column: 19, scope: !779, inlinedAt: !757)
!781 = !DILocation(line: 660, column: 22, scope: !779, inlinedAt: !757)
!782 = !DILocation(line: 660, column: 7, scope: !739, inlinedAt: !757)
!783 = !DILocation(line: 666, column: 7, scope: !784, inlinedAt: !757)
!784 = distinct !DILexicalBlock(scope: !779, file: !727, line: 661, column: 5)
!785 = !DILocation(line: 668, column: 5, scope: !784, inlinedAt: !757)
!786 = !DILocation(line: 669, column: 3, scope: !739, inlinedAt: !757)
!787 = !DILocation(line: 671, column: 3, scope: !739, inlinedAt: !757)
!788 = !DILocation(line: 673, column: 1, scope: !739, inlinedAt: !757)
!789 = !DILocation(line: 99, column: 3, scope: !707)
!790 = !DISubprogram(name: "dcgettext", scope: !791, file: !791, line: 51, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!791 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!792 = !DISubroutineType(types: !793)
!793 = !{!22, !35, !35, !31}
!794 = !DISubprogram(name: "fputs_unlocked", scope: !795, file: !795, line: 667, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!795 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!796 = !DISubroutineType(types: !797)
!797 = !{!31, !35, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !799, file: !106, line: 51, baseType: !31, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !799, file: !106, line: 54, baseType: !22, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !799, file: !106, line: 55, baseType: !22, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !799, file: !106, line: 56, baseType: !22, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !799, file: !106, line: 57, baseType: !22, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !799, file: !106, line: 58, baseType: !22, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !799, file: !106, line: 59, baseType: !22, size: 64, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !799, file: !106, line: 60, baseType: !22, size: 64, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !799, file: !106, line: 61, baseType: !22, size: 64, offset: 512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !799, file: !106, line: 64, baseType: !22, size: 64, offset: 576)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !799, file: !106, line: 65, baseType: !22, size: 64, offset: 640)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !799, file: !106, line: 66, baseType: !22, size: 64, offset: 704)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !799, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !799, file: !106, line: 70, baseType: !798, size: 64, offset: 832)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !799, file: !106, line: 72, baseType: !31, size: 32, offset: 896)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !799, file: !106, line: 73, baseType: !31, size: 32, offset: 928)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !799, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !799, file: !106, line: 77, baseType: !32, size: 16, offset: 1024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !799, file: !106, line: 78, baseType: !132, size: 8, offset: 1040)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !799, file: !106, line: 79, baseType: !134, size: 8, offset: 1048)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !799, file: !106, line: 81, baseType: !138, size: 64, offset: 1088)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !799, file: !106, line: 89, baseType: !141, size: 64, offset: 1152)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !799, file: !106, line: 91, baseType: !143, size: 64, offset: 1216)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !799, file: !106, line: 92, baseType: !146, size: 64, offset: 1280)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !799, file: !106, line: 93, baseType: !798, size: 64, offset: 1344)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !799, file: !106, line: 94, baseType: !24, size: 64, offset: 1408)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !799, file: !106, line: 95, baseType: !33, size: 64, offset: 1472)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !799, file: !106, line: 96, baseType: !31, size: 32, offset: 1536)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !799, file: !106, line: 98, baseType: !153, size: 160, offset: 1568)
!830 = !DISubprogram(name: "setlocale", scope: !831, file: !831, line: 122, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!831 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!832 = !DISubroutineType(types: !833)
!833 = !{!22, !31, !35}
!834 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 257, type: !835, scopeLine: 258, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!31, !31, !183}
!837 = !{!838, !839, !840, !841, !842, !843}
!838 = !DILocalVariable(name: "argc", arg: 1, scope: !834, file: !3, line: 257, type: !31)
!839 = !DILocalVariable(name: "argv", arg: 2, scope: !834, file: !3, line: 257, type: !183)
!840 = !DILocalVariable(name: "have_tabval", scope: !834, file: !3, line: 259, type: !175)
!841 = !DILocalVariable(name: "tabval", scope: !834, file: !3, line: 260, type: !26)
!842 = !DILocalVariable(name: "c", scope: !834, file: !3, line: 261, type: !31)
!843 = !DILocalVariable(name: "convert_first_only", scope: !834, file: !3, line: 265, type: !175)
!844 = !DILocation(line: 0, scope: !834)
!845 = !DILocation(line: 268, column: 21, scope: !834)
!846 = !DILocation(line: 268, column: 3, scope: !834)
!847 = !DILocation(line: 269, column: 3, scope: !834)
!848 = !DILocation(line: 270, column: 3, scope: !834)
!849 = !DILocation(line: 271, column: 3, scope: !834)
!850 = !DILocation(line: 273, column: 3, scope: !834)
!851 = !DILocation(line: 275, column: 3, scope: !834)
!852 = !DILocation(line: 275, column: 15, scope: !834)
!853 = distinct !{!853, !851, !854, !770}
!854 = !DILocation(line: 309, column: 5, scope: !834)
!855 = !DILocation(line: 281, column: 11, scope: !856)
!856 = distinct !DILexicalBlock(scope: !857, file: !3, line: 279, column: 9)
!857 = distinct !DILexicalBlock(scope: !834, file: !3, line: 277, column: 5)
!858 = !DILocation(line: 283, column: 31, scope: !856)
!859 = !{!860, !860, i64 0}
!860 = !{!"_Bool", !720, i64 0}
!861 = !DILocation(line: 284, column: 11, scope: !856)
!862 = !DILocation(line: 286, column: 31, scope: !856)
!863 = !DILocation(line: 287, column: 28, scope: !856)
!864 = !DILocation(line: 287, column: 11, scope: !856)
!865 = !DILocation(line: 288, column: 11, scope: !856)
!866 = !DILocation(line: 293, column: 15, scope: !867)
!867 = distinct !DILexicalBlock(scope: !856, file: !3, line: 293, column: 15)
!868 = !DILocation(line: 293, column: 15, scope: !856)
!869 = !DILocation(line: 294, column: 13, scope: !867)
!870 = !DILocation(line: 297, column: 9, scope: !856)
!871 = !DILocation(line: 298, column: 9, scope: !856)
!872 = !DILocation(line: 300, column: 16, scope: !873)
!873 = distinct !DILexicalBlock(scope: !856, file: !3, line: 300, column: 15)
!874 = !DILocation(line: 300, column: 15, scope: !856)
!875 = !DILocation(line: 305, column: 16, scope: !876)
!876 = distinct !DILexicalBlock(scope: !856, file: !3, line: 305, column: 15)
!877 = !DILocation(line: 305, column: 15, scope: !856)
!878 = !DILocation(line: 306, column: 13, scope: !876)
!879 = !DILocation(line: 311, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !834, file: !3, line: 311, column: 7)
!881 = !DILocation(line: 311, column: 7, scope: !834)
!882 = !DILocation(line: 312, column: 25, scope: !880)
!883 = !DILocation(line: 312, column: 5, scope: !880)
!884 = !DILocation(line: 314, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !834, file: !3, line: 314, column: 7)
!886 = !DILocation(line: 314, column: 7, scope: !834)
!887 = !DILocation(line: 315, column: 5, scope: !885)
!888 = !DILocation(line: 317, column: 3, scope: !834)
!889 = !DILocation(line: 319, column: 20, scope: !834)
!890 = !{!891, !891, i64 0}
!891 = !{!"int", !720, i64 0}
!892 = !DILocation(line: 319, column: 27, scope: !834)
!893 = !DILocation(line: 319, column: 19, scope: !834)
!894 = !DILocation(line: 319, column: 3, scope: !834)
!895 = !DILocation(line: 109, column: 14, scope: !896, inlinedAt: !925)
!896 = distinct !DISubprogram(name: "unexpand", scope: !3, file: !3, line: 106, type: !728, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !897)
!897 = !{!898, !901, !902, !904, !905, !906, !907, !908, !909, !910, !911, !915, !918, !923, !924}
!898 = !DILocalVariable(name: "fp", scope: !896, file: !3, line: 109, type: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !799)
!901 = !DILocalVariable(name: "pending_blank", scope: !896, file: !3, line: 114, type: !22)
!902 = !DILocalVariable(name: "c", scope: !903, file: !3, line: 127, type: !31)
!903 = distinct !DILexicalBlock(scope: !896, file: !3, line: 125, column: 5)
!904 = !DILocalVariable(name: "convert", scope: !903, file: !3, line: 130, type: !175)
!905 = !DILocalVariable(name: "column", scope: !903, file: !3, line: 137, type: !26)
!906 = !DILocalVariable(name: "next_tab_column", scope: !903, file: !3, line: 140, type: !26)
!907 = !DILocalVariable(name: "tab_index", scope: !903, file: !3, line: 143, type: !33)
!908 = !DILocalVariable(name: "one_blank_before_tab_stop", scope: !903, file: !3, line: 146, type: !175)
!909 = !DILocalVariable(name: "prev_blank", scope: !903, file: !3, line: 151, type: !175)
!910 = !DILocalVariable(name: "pending", scope: !903, file: !3, line: 154, type: !33)
!911 = !DILocalVariable(name: "blank", scope: !912, file: !3, line: 166, type: !175)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 165, column: 13)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 164, column: 15)
!914 = distinct !DILexicalBlock(scope: !903, file: !3, line: 160, column: 9)
!915 = !DILocalVariable(name: "last_tab", scope: !916, file: !3, line: 170, type: !175)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 169, column: 17)
!917 = distinct !DILexicalBlock(scope: !912, file: !3, line: 168, column: 19)
!918 = !DILocalVariable(name: "__ptr", scope: !919, file: !3, line: 233, type: !35)
!919 = distinct !DILexicalBlock(scope: !920, file: !3, line: 233, column: 23)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 233, column: 23)
!921 = distinct !DILexicalBlock(scope: !922, file: !3, line: 230, column: 17)
!922 = distinct !DILexicalBlock(scope: !912, file: !3, line: 229, column: 19)
!923 = !DILocalVariable(name: "__stream", scope: !919, file: !3, line: 233, type: !899)
!924 = !DILocalVariable(name: "__cnt", scope: !919, file: !3, line: 233, type: !33)
!925 = distinct !DILocation(line: 321, column: 3, scope: !834)
!926 = !DILocation(line: 0, scope: !896, inlinedAt: !925)
!927 = !DILocation(line: 116, column: 8, scope: !928, inlinedAt: !925)
!928 = distinct !DILexicalBlock(scope: !896, file: !3, line: 116, column: 7)
!929 = !DILocation(line: 116, column: 7, scope: !896, inlinedAt: !925)
!930 = !DILocation(line: 122, column: 28, scope: !896, inlinedAt: !925)
!931 = !{!932, !932, i64 0}
!932 = !{!"long", !720, i64 0}
!933 = !DILocation(line: 122, column: 19, scope: !896, inlinedAt: !925)
!934 = !DILocation(line: 124, column: 3, scope: !896, inlinedAt: !925)
!935 = !DILocation(line: 0, scope: !903, inlinedAt: !925)
!936 = !DILocation(line: 143, column: 7, scope: !903, inlinedAt: !925)
!937 = !DILocation(line: 143, column: 14, scope: !903, inlinedAt: !925)
!938 = !DILocation(line: 159, column: 7, scope: !903, inlinedAt: !925)
!939 = !DILocation(line: 161, column: 11, scope: !914, inlinedAt: !925)
!940 = !DILocalVariable(name: "__fp", arg: 1, scope: !941, file: !942, line: 66, type: !899)
!941 = distinct !DISubprogram(name: "getc_unlocked", scope: !942, file: !942, line: 66, type: !943, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !945)
!942 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!943 = !DISubroutineType(types: !944)
!944 = !{!31, !899}
!945 = !{!940}
!946 = !DILocation(line: 0, scope: !941, inlinedAt: !947)
!947 = distinct !DILocation(line: 161, column: 23, scope: !914, inlinedAt: !925)
!948 = !DILocation(line: 68, column: 10, scope: !941, inlinedAt: !947)
!949 = !{!950, !719, i64 8}
!950 = !{!"_IO_FILE", !891, i64 0, !719, i64 8, !719, i64 16, !719, i64 24, !719, i64 32, !719, i64 40, !719, i64 48, !719, i64 56, !719, i64 64, !719, i64 72, !719, i64 80, !719, i64 88, !719, i64 96, !719, i64 104, !891, i64 112, !891, i64 116, !932, i64 120, !951, i64 128, !720, i64 130, !720, i64 131, !719, i64 136, !932, i64 144, !719, i64 152, !719, i64 160, !719, i64 168, !719, i64 176, !932, i64 184, !891, i64 192, !720, i64 196}
!951 = !{!"short", !720, i64 0}
!952 = !{!950, !719, i64 16}
!953 = !{!"branch_weights", i32 2000, i32 1}
!954 = !{!720, !720, i64 0}
!955 = !DILocation(line: 161, column: 38, scope: !914, inlinedAt: !925)
!956 = !DILocation(line: 161, column: 34, scope: !914, inlinedAt: !925)
!957 = !DILocation(line: 161, column: 47, scope: !914, inlinedAt: !925)
!958 = distinct !{!958, !939, !959, !770}
!959 = !DILocation(line: 162, column: 13, scope: !914, inlinedAt: !925)
!960 = !DILocation(line: 164, column: 15, scope: !913, inlinedAt: !925)
!961 = !DILocation(line: 164, column: 15, scope: !914, inlinedAt: !925)
!962 = !DILocation(line: 166, column: 31, scope: !912, inlinedAt: !925)
!963 = !{!951, !951, i64 0}
!964 = !DILocation(line: 166, column: 29, scope: !912, inlinedAt: !925)
!965 = !DILocation(line: 166, column: 20, scope: !912, inlinedAt: !925)
!966 = !DILocation(line: 0, scope: !912, inlinedAt: !925)
!967 = !DILocation(line: 168, column: 19, scope: !912, inlinedAt: !925)
!968 = !DILocation(line: 170, column: 19, scope: !916, inlinedAt: !925)
!969 = !DILocation(line: 0, scope: !916, inlinedAt: !925)
!970 = !DILocation(line: 172, column: 37, scope: !916, inlinedAt: !925)
!971 = !DILocation(line: 175, column: 23, scope: !972, inlinedAt: !925)
!972 = distinct !DILexicalBlock(scope: !916, file: !3, line: 175, column: 23)
!973 = !{i8 0, i8 2}
!974 = !DILocation(line: 175, column: 23, scope: !916, inlinedAt: !925)
!975 = !DILocation(line: 178, column: 23, scope: !976, inlinedAt: !925)
!976 = distinct !DILexicalBlock(scope: !916, file: !3, line: 178, column: 23)
!977 = !DILocation(line: 178, column: 23, scope: !916, inlinedAt: !925)
!978 = !DILocation(line: 180, column: 43, scope: !979, inlinedAt: !925)
!979 = distinct !DILexicalBlock(scope: !980, file: !3, line: 180, column: 27)
!980 = distinct !DILexicalBlock(scope: !976, file: !3, line: 179, column: 21)
!981 = !DILocation(line: 180, column: 27, scope: !980, inlinedAt: !925)
!982 = !DILocation(line: 181, column: 25, scope: !979, inlinedAt: !925)
!983 = !DILocation(line: 183, column: 29, scope: !984, inlinedAt: !925)
!984 = distinct !DILexicalBlock(scope: !980, file: !3, line: 183, column: 27)
!985 = !DILocation(line: 183, column: 27, scope: !980, inlinedAt: !925)
!986 = !DILocation(line: 187, column: 31, scope: !987, inlinedAt: !925)
!987 = distinct !DILexicalBlock(scope: !988, file: !3, line: 187, column: 31)
!988 = distinct !DILexicalBlock(scope: !984, file: !3, line: 184, column: 25)
!989 = !DILocation(line: 187, column: 31, scope: !988, inlinedAt: !925)
!990 = !DILocation(line: 192, column: 33, scope: !991, inlinedAt: !925)
!991 = distinct !DILexicalBlock(scope: !984, file: !3, line: 191, column: 25)
!992 = !DILocation(line: 194, column: 34, scope: !993, inlinedAt: !925)
!993 = distinct !DILexicalBlock(scope: !991, file: !3, line: 194, column: 31)
!994 = !DILocation(line: 194, column: 45, scope: !993, inlinedAt: !925)
!995 = !DILocation(line: 0, scope: !984, inlinedAt: !925)
!996 = !DILocation(line: 211, column: 33, scope: !980, inlinedAt: !925)
!997 = !DILocation(line: 212, column: 21, scope: !980, inlinedAt: !925)
!998 = !DILocation(line: 213, column: 17, scope: !917, inlinedAt: !925)
!999 = !DILocation(line: 214, column: 26, scope: !1000, inlinedAt: !925)
!1000 = distinct !DILexicalBlock(scope: !917, file: !3, line: 214, column: 24)
!1001 = !DILocation(line: 214, column: 24, scope: !917, inlinedAt: !925)
!1002 = !DILocation(line: 218, column: 30, scope: !1003, inlinedAt: !925)
!1003 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 215, column: 17)
!1004 = !DILocation(line: 218, column: 29, scope: !1003, inlinedAt: !925)
!1005 = !DILocation(line: 218, column: 26, scope: !1003, inlinedAt: !925)
!1006 = !DILocation(line: 220, column: 34, scope: !1003, inlinedAt: !925)
!1007 = !DILocation(line: 220, column: 33, scope: !1003, inlinedAt: !925)
!1008 = !DILocation(line: 220, column: 32, scope: !1003, inlinedAt: !925)
!1009 = !DILocation(line: 220, column: 29, scope: !1003, inlinedAt: !925)
!1010 = !DILocation(line: 221, column: 17, scope: !1003, inlinedAt: !925)
!1011 = !DILocation(line: 224, column: 25, scope: !1012, inlinedAt: !925)
!1012 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 223, column: 17)
!1013 = !DILocation(line: 225, column: 24, scope: !1014, inlinedAt: !925)
!1014 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 225, column: 23)
!1015 = !DILocation(line: 225, column: 23, scope: !1012, inlinedAt: !925)
!1016 = !DILocation(line: 226, column: 21, scope: !1014, inlinedAt: !925)
!1017 = !DILocation(line: 0, scope: !917, inlinedAt: !925)
!1018 = !DILocation(line: 161, column: 21, scope: !914, inlinedAt: !925)
!1019 = !DILocation(line: 229, column: 19, scope: !912, inlinedAt: !925)
!1020 = !DILocation(line: 231, column: 38, scope: !1021, inlinedAt: !925)
!1021 = distinct !DILexicalBlock(scope: !921, file: !3, line: 231, column: 23)
!1022 = !DILocation(line: 231, column: 23, scope: !921, inlinedAt: !925)
!1023 = !DILocation(line: 232, column: 38, scope: !1021, inlinedAt: !925)
!1024 = !DILocation(line: 232, column: 21, scope: !1021, inlinedAt: !925)
!1025 = !DILocation(line: 233, column: 23, scope: !920, inlinedAt: !925)
!1026 = !DILocation(line: 233, column: 66, scope: !920, inlinedAt: !925)
!1027 = !DILocation(line: 233, column: 23, scope: !921, inlinedAt: !925)
!1028 = !DILocation(line: 234, column: 21, scope: !920, inlinedAt: !925)
!1029 = !DILocation(line: 240, column: 26, scope: !912, inlinedAt: !925)
!1030 = !DILocation(line: 240, column: 46, scope: !912, inlinedAt: !925)
!1031 = !DILocation(line: 240, column: 23, scope: !912, inlinedAt: !925)
!1032 = !DILocation(line: 198, column: 35, scope: !1033, inlinedAt: !925)
!1033 = distinct !DILexicalBlock(scope: !993, file: !3, line: 195, column: 29)
!1034 = !DILocation(line: 200, column: 58, scope: !1033, inlinedAt: !925)
!1035 = !DILocation(line: 200, column: 52, scope: !1033, inlinedAt: !925)
!1036 = !DILocation(line: 200, column: 31, scope: !1033, inlinedAt: !925)
!1037 = !DILocation(line: 200, column: 56, scope: !1033, inlinedAt: !925)
!1038 = !DILocation(line: 243, column: 17, scope: !1039, inlinedAt: !925)
!1039 = distinct !DILexicalBlock(scope: !914, file: !3, line: 243, column: 15)
!1040 = !DILocation(line: 243, column: 15, scope: !914, inlinedAt: !925)
!1041 = !DILocation(line: 245, column: 15, scope: !1042, inlinedAt: !925)
!1042 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 244, column: 13)
!1043 = !DILocation(line: 253, column: 5, scope: !896, inlinedAt: !925)
!1044 = !DILocalVariable(name: "__c", arg: 1, scope: !1045, file: !942, line: 108, type: !31)
!1045 = distinct !DISubprogram(name: "putchar_unlocked", scope: !942, file: !942, line: 108, type: !1046, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!31, !31}
!1048 = !{!1044}
!1049 = !DILocation(line: 0, scope: !1045, inlinedAt: !1050)
!1050 = distinct !DILocation(line: 249, column: 15, scope: !1051, inlinedAt: !925)
!1051 = distinct !DILexicalBlock(scope: !914, file: !3, line: 249, column: 15)
!1052 = !DILocation(line: 110, column: 10, scope: !1045, inlinedAt: !1050)
!1053 = !{!950, !719, i64 40}
!1054 = !{!950, !719, i64 48}
!1055 = !DILocation(line: 249, column: 15, scope: !914, inlinedAt: !925)
!1056 = !DILocation(line: 249, column: 27, scope: !1051, inlinedAt: !925)
!1057 = !DILocation(line: 250, column: 13, scope: !1051, inlinedAt: !925)
!1058 = !DILocation(line: 185, column: 34, scope: !988, inlinedAt: !925)
!1059 = !DILocation(line: 236, column: 45, scope: !921, inlinedAt: !925)
!1060 = !DILocation(line: 239, column: 26, scope: !912, inlinedAt: !925)
!1061 = !DILocation(line: 235, column: 27, scope: !921, inlinedAt: !925)
!1062 = !DILocation(line: 252, column: 16, scope: !903, inlinedAt: !925)
!1063 = !DILocation(line: 251, column: 9, scope: !914, inlinedAt: !925)
!1064 = distinct !{!1064, !938, !1065, !770}
!1065 = !DILocation(line: 252, column: 23, scope: !903, inlinedAt: !925)
!1066 = !DILocation(line: 323, column: 3, scope: !834)
!1067 = !DILocation(line: 325, column: 10, scope: !834)
!1068 = !DILocation(line: 326, column: 1, scope: !834)
!1069 = !DISubprogram(name: "bindtextdomain", scope: !791, file: !791, line: 86, type: !1070, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!22, !35, !35}
!1072 = !DISubprogram(name: "textdomain", scope: !791, file: !791, line: 82, type: !1073, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!22, !35}
!1075 = !DISubprogram(name: "atexit", scope: !1076, file: !1076, line: 595, type: !1077, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!1076 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!31, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!1080 = !DISubprogram(name: "getopt_long", scope: !43, file: !43, line: 66, type: !1081, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!31, !31, !1083, !35, !1085, !48}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!1086 = !DISubprogram(name: "error", scope: !1087, file: !1087, line: 52, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!1087 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !31, !31, !35, null}
!1090 = !DISubprogram(name: "fwrite_unlocked", scope: !795, file: !795, line: 680, type: !1091, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!30, !1093, !30, !30, !798}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1095 = distinct !DISubprogram(name: "add_tab_stop", scope: !55, file: !55, line: 78, type: !1096, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !1098)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !26}
!1098 = !{!1099, !1100, !1101}
!1099 = !DILocalVariable(name: "tabval", arg: 1, scope: !1095, file: !55, line: 78, type: !26)
!1100 = !DILocalVariable(name: "prev_column", scope: !1095, file: !55, line: 80, type: !26)
!1101 = !DILocalVariable(name: "column_width", scope: !1095, file: !55, line: 81, type: !26)
!1102 = !DILocation(line: 0, scope: !1095)
!1103 = !DILocation(line: 80, column: 27, scope: !1095)
!1104 = !DILocation(line: 80, column: 44, scope: !1095)
!1105 = !DILocation(line: 80, column: 68, scope: !1095)
!1106 = !DILocation(line: 81, column: 28, scope: !1095)
!1107 = !DILocation(line: 83, column: 25, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1095, file: !55, line: 83, column: 7)
!1109 = !DILocation(line: 83, column: 22, scope: !1108)
!1110 = !DILocation(line: 83, column: 7, scope: !1095)
!1111 = !DILocation(line: 85, column: 3, scope: !1095)
!1112 = !DILocation(line: 84, column: 16, scope: !1108)
!1113 = !DILocation(line: 0, scope: !82, inlinedAt: !1114)
!1114 = distinct !DILocation(line: 84, column: 16, scope: !1108)
!1115 = !DILocation(line: 178, column: 9, scope: !1116, inlinedAt: !1114)
!1116 = distinct !DILexicalBlock(scope: !82, file: !81, line: 178, column: 7)
!1117 = !DILocation(line: 178, column: 7, scope: !82, inlinedAt: !1114)
!1118 = !DILocation(line: 180, column: 11, scope: !1119, inlinedAt: !1114)
!1119 = distinct !DILexicalBlock(scope: !1116, file: !81, line: 179, column: 5)
!1120 = !DILocation(line: 191, column: 11, scope: !1121, inlinedAt: !1114)
!1121 = distinct !DILexicalBlock(scope: !1119, file: !81, line: 191, column: 11)
!1122 = !DILocation(line: 191, column: 11, scope: !1119, inlinedAt: !1114)
!1123 = !DILocation(line: 192, column: 9, scope: !1121, inlinedAt: !1114)
!1124 = !DILocation(line: 201, column: 11, scope: !1125, inlinedAt: !1114)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !81, line: 200, column: 11)
!1126 = distinct !DILexicalBlock(scope: !1116, file: !81, line: 195, column: 5)
!1127 = !DILocation(line: 200, column: 11, scope: !1126, inlinedAt: !1114)
!1128 = !DILocation(line: 202, column: 9, scope: !1125, inlinedAt: !1114)
!1129 = !DILocation(line: 203, column: 14, scope: !1126, inlinedAt: !1114)
!1130 = !DILocation(line: 203, column: 18, scope: !1126, inlinedAt: !1114)
!1131 = !DILocation(line: 203, column: 9, scope: !1126, inlinedAt: !1114)
!1132 = !DILocation(line: 206, column: 7, scope: !82, inlinedAt: !1114)
!1133 = !DILocation(line: 207, column: 25, scope: !82, inlinedAt: !1114)
!1134 = !DILocation(line: 207, column: 10, scope: !82, inlinedAt: !1114)
!1135 = !DILocation(line: 84, column: 14, scope: !1108)
!1136 = !DILocation(line: 84, column: 5, scope: !1108)
!1137 = !DILocation(line: 85, column: 26, scope: !1095)
!1138 = !DILocation(line: 85, column: 30, scope: !1095)
!1139 = !DILocation(line: 87, column: 7, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1095, file: !55, line: 87, column: 7)
!1141 = !DILocation(line: 87, column: 24, scope: !1140)
!1142 = !DILocation(line: 87, column: 7, scope: !1095)
!1143 = !DILocation(line: 91, column: 24, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !55, line: 88, column: 5)
!1145 = !DILocation(line: 92, column: 5, scope: !1144)
