source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert blanks in each FILE to tabs, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.14 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 61, type: !36, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !35)
!3 = !DIFile(filename: "src/unexpand.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !24, !25, !26, !31, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !27, line: 102, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !29, line: 72, baseType: !30)
!29 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!0}
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1536, elements: !48)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !39, line: 50, size: 256, elements: !40)
!39 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!40 = !{!41, !44, !45, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !39, line: 52, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !38, file: !39, line: 55, baseType: !31, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !38, file: !39, line: 56, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !38, file: !39, line: 57, baseType: !31, size: 32, offset: 192)
!48 = !{!49}
!49 = !DISubrange(count: 6)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !52, file: !53, line: 33, type: !175, isDefinition: true)
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !93, globals: !94)
!53 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!54 = !{!5, !55, !69, !78}
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !56, line: 32, baseType: !7, size: 32, elements: !57)
!56 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!58 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!63 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!64 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!65 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!66 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!68 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 45, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!75 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !80, file: !79, line: 186, baseType: !7, size: 32, elements: !91)
!79 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!80 = distinct !DISubprogram(name: "x2nrealloc", scope: !79, file: !79, line: 174, type: !81, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !52, retainedNodes: !86)
!81 = !DISubroutineType(types: !82)
!82 = !{!24, !24, !83, !84}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 62, baseType: !30)
!85 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!86 = !{!87, !88, !89, !90}
!87 = !DILocalVariable(name: "p", arg: 1, scope: !80, file: !79, line: 174, type: !24)
!88 = !DILocalVariable(name: "pn", arg: 2, scope: !80, file: !79, line: 174, type: !83)
!89 = !DILocalVariable(name: "s", arg: 3, scope: !80, file: !79, line: 174, type: !84)
!90 = !DILocalVariable(name: "n", scope: !80, file: !79, line: 176, type: !84)
!91 = !{!92}
!92 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!93 = !{!31, !32, !7, !25, !24, !26, !84}
!94 = !{!50, !95, !97, !159, !161, !163, !165, !167, !169, !171, !173, !176, !181}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "exit_status", scope: !52, file: !53, line: 72, type: !31, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "prev_file", scope: !99, file: !53, line: 336, type: !22, isLocal: true, isDefinition: true)
!99 = distinct !DISubprogram(name: "next_file", scope: !53, file: !53, line: 334, type: !100, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, unit: !52, retainedNodes: !156)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !105)
!104 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !107)
!106 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !125, !126, !127, !130, !131, !133, !137, !140, !142, !145, !148, !149, !150, !151, !152}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !105, file: !106, line: 51, baseType: !31, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !105, file: !106, line: 54, baseType: !22, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !105, file: !106, line: 55, baseType: !22, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !105, file: !106, line: 56, baseType: !22, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !105, file: !106, line: 57, baseType: !22, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !105, file: !106, line: 58, baseType: !22, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !105, file: !106, line: 59, baseType: !22, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !105, file: !106, line: 60, baseType: !22, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !105, file: !106, line: 61, baseType: !22, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !105, file: !106, line: 64, baseType: !22, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !105, file: !106, line: 65, baseType: !22, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !105, file: !106, line: 66, baseType: !22, size: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !105, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !106, line: 36, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !105, file: !106, line: 70, baseType: !124, size: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !105, file: !106, line: 72, baseType: !31, size: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !105, file: !106, line: 73, baseType: !31, size: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !105, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !29, line: 150, baseType: !129)
!129 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !105, file: !106, line: 77, baseType: !32, size: 16, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !105, file: !106, line: 78, baseType: !132, size: 8, offset: 1040)
!132 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !105, file: !106, line: 79, baseType: !134, size: 8, offset: 1048)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !105, file: !106, line: 81, baseType: !138, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !106, line: 43, baseType: null)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !105, file: !106, line: 89, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !29, line: 151, baseType: !129)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !105, file: !106, line: 91, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !106, line: 37, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !105, file: !106, line: 92, baseType: !146, size: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !106, line: 38, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !105, file: !106, line: 93, baseType: !124, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !105, file: !106, line: 94, baseType: !24, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !105, file: !106, line: 95, baseType: !84, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !105, file: !106, line: 96, baseType: !31, size: 32, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !105, file: !106, line: 98, baseType: !153, size: 160, offset: 1568)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 20)
!156 = !{!157, !158}
!157 = !DILocalVariable(name: "fp", arg: 1, scope: !99, file: !53, line: 334, type: !102)
!158 = !DILocalVariable(name: "file", scope: !99, file: !53, line: 337, type: !22)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "max_column_width", scope: !52, file: !53, line: 45, type: !84, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !52, file: !53, line: 57, type: !84, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "tab_list", scope: !52, file: !53, line: 50, type: !25, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !52, file: !53, line: 53, type: !84, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "extend_size", scope: !52, file: !53, line: 39, type: !26, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "increment_size", scope: !52, file: !53, line: 42, type: !26, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "tab_size", scope: !52, file: !53, line: 36, type: !26, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !52, file: !53, line: 69, type: !175, isLocal: true, isDefinition: true)
!175 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !52, file: !53, line: 63, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 2)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "file_list", scope: !52, file: !53, line: 60, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!184 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "Version", scope: !187, file: !188, line: 2, type: !42, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !190)
!188 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!189 = !{}
!190 = !{!185}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "file_name", scope: !193, file: !198, line: 46, type: !42, isLocal: true, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !195)
!194 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!195 = !{!191, !196}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !193, file: !198, line: 56, type: !175, isLocal: true, isDefinition: true)
!198 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "exit_failure", scope: !201, file: !204, line: 24, type: !205, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !203)
!202 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!203 = !{!199}
!204 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!205 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "program_name", scope: !208, file: !212, line: 33, type: !42, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !210, globals: !211)
!209 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!210 = !{!24, !22}
!211 = !{!206}
!212 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !215, file: !227, line: 85, type: !262, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !217, retainedTypes: !223, globals: !224)
!216 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!217 = !{!55, !218, !5}
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !56, line: 242, baseType: !7, size: 32, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!221 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!222 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!223 = !{!31, !32, !84, !22}
!224 = !{!213, !225, !232, !244, !246, !251, !258, !260}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !215, file: !227, line: 101, type: !228, isDefinition: true)
!227 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 320, elements: !230)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!230 = !{!231}
!231 = !DISubrange(count: 10)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !215, file: !227, line: 1052, type: !234, isDefinition: true)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !227, line: 65, size: 448, elements: !235)
!235 = !{!236, !237, !238, !242, !243}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !234, file: !227, line: 68, baseType: !55, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !234, file: !227, line: 71, baseType: !31, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !234, file: !227, line: 75, baseType: !239, size: 256, offset: 64)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 8)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !234, file: !227, line: 78, baseType: !42, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !234, file: !227, line: 81, baseType: !42, size: 64, offset: 384)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !215, file: !227, line: 116, type: !234, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "slot0", scope: !215, file: !227, line: 842, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 256)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "slotvec", scope: !215, file: !227, line: 845, type: !253, isLocal: true, isDefinition: true)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !227, line: 834, size: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !254, file: !227, line: 836, baseType: !84, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !254, file: !227, line: 837, baseType: !22, size: 64, offset: 64)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "nslots", scope: !215, file: !227, line: 843, type: !31, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "slotvec0", scope: !215, file: !227, line: 844, type: !254, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 704, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!264 = !{!265}
!265 = !DISubrange(count: 11)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !268, file: !271, line: 26, type: !272, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !270)
!269 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!270 = !{!266}
!271 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 376, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 47)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !277)
!276 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!277 = !{!69}
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !280, retainedTypes: !285)
!279 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!280 = !{!281}
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 41, baseType: !7, size: 32, elements: !283)
!282 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!283 = !{!284}
!284 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!285 = !{!24}
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !288, retainedTypes: !296)
!287 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !290, file: !79, line: 186, baseType: !7, size: 32, elements: !91)
!290 = distinct !DISubprogram(name: "x2nrealloc", scope: !79, file: !79, line: 174, type: !81, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !286, retainedNodes: !291)
!291 = !{!292, !293, !294, !295}
!292 = !DILocalVariable(name: "p", arg: 1, scope: !290, file: !79, line: 174, type: !24)
!293 = !DILocalVariable(name: "pn", arg: 2, scope: !290, file: !79, line: 174, type: !83)
!294 = !DILocalVariable(name: "s", arg: 3, scope: !290, file: !79, line: 174, type: !84)
!295 = !DILocalVariable(name: "n", scope: !290, file: !79, line: 176, type: !84)
!296 = !{!84, !22, !24}
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189)
!298 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189)
!300 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !285)
!302 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189)
!304 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !285)
!306 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !285)
!308 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !311)
!310 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!311 = !{!84}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189)
!313 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !189)
!315 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !318, retainedTypes: !285)
!317 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!318 = !{!319}
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 41, baseType: !7, size: 32, elements: !321)
!320 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!322 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!323 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!324 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!325 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!326 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!327 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!328 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!329 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!330 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!331 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!332 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!333 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!334 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!335 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!336 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!337 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!338 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!339 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!340 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!341 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!342 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!343 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!344 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!345 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!346 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!347 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!348 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!349 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!350 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!351 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!352 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!353 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!354 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!355 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!356 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!357 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!358 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!359 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!360 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!361 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!362 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!363 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!364 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!365 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!366 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!367 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!368 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!369 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!370 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!371 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!430 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!433 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!434 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!435 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!436 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!437 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!438 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!439 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!440 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!441 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!442 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!443 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!444 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!517 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!590 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!591 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!592 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!593 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!594 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!595 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!596 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!597 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!598 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!599 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!600 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!601 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!602 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!603 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!604 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!606 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!607 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!608 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!609 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!610 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!611 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!637 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!638 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!639 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!640 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!641 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!646 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!647 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!648 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!649 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!705 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!706 = !{i32 2, !"Dwarf Version", i32 4}
!707 = !{i32 2, !"Debug Info Version", i32 3}
!708 = !{i32 1, !"wchar_size", i32 4}
!709 = !{i32 7, !"PIC Level", i32 2}
!710 = !{i32 7, !"PIE Level", i32 2}
!711 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 72, type: !712, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !31}
!714 = !{!715}
!715 = !DILocalVariable(name: "status", arg: 1, scope: !711, file: !3, line: 72, type: !31)
!716 = !DILocalVariable(name: "infomap", scope: !717, file: !718, line: 632, type: !732)
!717 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !718, file: !718, line: 630, type: !719, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !721)
!718 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!719 = !DISubroutineType(types: !720)
!720 = !{null, !42}
!721 = !{!722, !716, !723, !724, !731}
!722 = !DILocalVariable(name: "program", arg: 1, scope: !717, file: !718, line: 630, type: !42)
!723 = !DILocalVariable(name: "node", scope: !717, file: !718, line: 642, type: !42)
!724 = !DILocalVariable(name: "map_prog", scope: !717, file: !718, line: 643, type: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !717, file: !718, line: 632, size: 128, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !727, file: !718, line: 632, baseType: !42, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !727, file: !718, line: 632, baseType: !42, size: 64, offset: 64)
!731 = !DILocalVariable(name: "lc_messages", scope: !717, file: !718, line: 655, type: !42)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 896, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 7)
!735 = !DILocation(line: 632, column: 67, scope: !717, inlinedAt: !736)
!736 = distinct !DILocation(line: 97, column: 7, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !3, line: 77, column: 5)
!738 = distinct !DILexicalBlock(scope: !711, file: !3, line: 74, column: 7)
!739 = !DILocation(line: 72, column: 12, scope: !711)
!740 = !DILocation(line: 74, column: 14, scope: !738)
!741 = !DILocation(line: 74, column: 7, scope: !711)
!742 = !DILocation(line: 75, column: 5, scope: !743)
!743 = distinct !DILexicalBlock(scope: !738, file: !3, line: 75, column: 5)
!744 = !{!745, !745, i64 0}
!745 = !{!"any pointer", !746, i64 0}
!746 = !{!"omnipotent char", !747, i64 0}
!747 = !{!"Simple C/C++ TBAA"}
!748 = !DILocation(line: 78, column: 7, scope: !737)
!749 = !DILocation(line: 82, column: 7, scope: !737)
!750 = !DILocation(line: 580, column: 3, scope: !751, inlinedAt: !754)
!751 = distinct !DISubprogram(name: "emit_stdin_note", scope: !718, file: !718, line: 578, type: !752, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !189)
!752 = !DISubroutineType(types: !753)
!753 = !{null}
!754 = distinct !DILocation(line: 86, column: 7, scope: !737)
!755 = !DILocation(line: 587, column: 3, scope: !756, inlinedAt: !757)
!756 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !718, file: !718, line: 585, type: !752, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !189)
!757 = distinct !DILocation(line: 87, column: 7, scope: !737)
!758 = !DILocation(line: 89, column: 7, scope: !737)
!759 = !DILocation(line: 94, column: 7, scope: !737)
!760 = !DILocation(line: 95, column: 7, scope: !737)
!761 = !DILocation(line: 96, column: 7, scope: !737)
!762 = !DILocation(line: 632, column: 3, scope: !717, inlinedAt: !736)
!763 = !DILocation(line: 643, column: 36, scope: !717, inlinedAt: !736)
!764 = !DILocation(line: 643, column: 25, scope: !717, inlinedAt: !736)
!765 = !DILocation(line: 645, column: 33, scope: !717, inlinedAt: !736)
!766 = !DILocation(line: 645, column: 3, scope: !717, inlinedAt: !736)
!767 = !DILocation(line: 646, column: 13, scope: !717, inlinedAt: !736)
!768 = !DILocation(line: 645, column: 20, scope: !717, inlinedAt: !736)
!769 = !{!770, !745, i64 0}
!770 = !{!"infomap", !745, i64 0, !745, i64 8}
!771 = !DILocation(line: 645, column: 10, scope: !717, inlinedAt: !736)
!772 = !DILocation(line: 645, column: 28, scope: !717, inlinedAt: !736)
!773 = distinct !{!773, !774, !775}
!774 = !DILocation(line: 645, column: 3, scope: !717)
!775 = !DILocation(line: 646, column: 13, scope: !717)
!776 = !DILocation(line: 648, column: 17, scope: !777, inlinedAt: !736)
!777 = distinct !DILexicalBlock(scope: !717, file: !718, line: 648, column: 7)
!778 = !{!770, !745, i64 8}
!779 = !DILocation(line: 648, column: 7, scope: !777, inlinedAt: !736)
!780 = !DILocation(line: 648, column: 7, scope: !717, inlinedAt: !736)
!781 = !DILocation(line: 642, column: 15, scope: !717, inlinedAt: !736)
!782 = !DILocation(line: 651, column: 3, scope: !717, inlinedAt: !736)
!783 = !DILocation(line: 655, column: 29, scope: !717, inlinedAt: !736)
!784 = !DILocation(line: 655, column: 15, scope: !717, inlinedAt: !736)
!785 = !DILocation(line: 656, column: 7, scope: !786, inlinedAt: !736)
!786 = distinct !DILexicalBlock(scope: !717, file: !718, line: 656, column: 7)
!787 = !DILocation(line: 656, column: 19, scope: !786, inlinedAt: !736)
!788 = !DILocation(line: 656, column: 22, scope: !786, inlinedAt: !736)
!789 = !DILocation(line: 656, column: 7, scope: !717, inlinedAt: !736)
!790 = !DILocation(line: 662, column: 7, scope: !791, inlinedAt: !736)
!791 = distinct !DILexicalBlock(scope: !786, file: !718, line: 657, column: 5)
!792 = !DILocation(line: 664, column: 5, scope: !791, inlinedAt: !736)
!793 = !DILocation(line: 665, column: 3, scope: !717, inlinedAt: !736)
!794 = !DILocation(line: 667, column: 3, scope: !717, inlinedAt: !736)
!795 = !DILocation(line: 669, column: 1, scope: !717, inlinedAt: !736)
!796 = !DILocation(line: 99, column: 3, scope: !711)
!797 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 257, type: !798, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!31, !31, !183}
!800 = !{!801, !802, !803, !804, !805, !806}
!801 = !DILocalVariable(name: "argc", arg: 1, scope: !797, file: !3, line: 257, type: !31)
!802 = !DILocalVariable(name: "argv", arg: 2, scope: !797, file: !3, line: 257, type: !183)
!803 = !DILocalVariable(name: "have_tabval", scope: !797, file: !3, line: 259, type: !175)
!804 = !DILocalVariable(name: "tabval", scope: !797, file: !3, line: 260, type: !26)
!805 = !DILocalVariable(name: "c", scope: !797, file: !3, line: 261, type: !31)
!806 = !DILocalVariable(name: "convert_first_only", scope: !797, file: !3, line: 265, type: !175)
!807 = !DILocation(line: 257, column: 11, scope: !797)
!808 = !DILocation(line: 257, column: 24, scope: !797)
!809 = !DILocation(line: 259, column: 8, scope: !797)
!810 = !DILocation(line: 265, column: 8, scope: !797)
!811 = !DILocation(line: 268, column: 21, scope: !797)
!812 = !DILocation(line: 268, column: 3, scope: !797)
!813 = !DILocation(line: 269, column: 3, scope: !797)
!814 = !DILocation(line: 270, column: 3, scope: !797)
!815 = !DILocation(line: 271, column: 3, scope: !797)
!816 = !DILocation(line: 273, column: 3, scope: !797)
!817 = !DILocation(line: 275, column: 3, scope: !797)
!818 = !DILocation(line: 275, column: 15, scope: !797)
!819 = !DILocation(line: 260, column: 13, scope: !797)
!820 = !DILocation(line: 261, column: 7, scope: !797)
!821 = distinct !{!821, !817, !822}
!822 = !DILocation(line: 309, column: 5, scope: !797)
!823 = !DILocation(line: 281, column: 11, scope: !824)
!824 = distinct !DILexicalBlock(scope: !825, file: !3, line: 279, column: 9)
!825 = distinct !DILexicalBlock(scope: !797, file: !3, line: 277, column: 5)
!826 = !DILocation(line: 283, column: 31, scope: !824)
!827 = !{!828, !828, i64 0}
!828 = !{!"_Bool", !746, i64 0}
!829 = !DILocation(line: 284, column: 11, scope: !824)
!830 = !DILocation(line: 286, column: 31, scope: !824)
!831 = !DILocation(line: 287, column: 28, scope: !824)
!832 = !DILocation(line: 287, column: 11, scope: !824)
!833 = !DILocation(line: 288, column: 11, scope: !824)
!834 = !DILocation(line: 293, column: 15, scope: !835)
!835 = distinct !DILexicalBlock(scope: !824, file: !3, line: 293, column: 15)
!836 = !DILocation(line: 293, column: 15, scope: !824)
!837 = !DILocation(line: 294, column: 13, scope: !835)
!838 = !DILocation(line: 297, column: 9, scope: !824)
!839 = !DILocation(line: 298, column: 9, scope: !824)
!840 = !DILocation(line: 300, column: 16, scope: !841)
!841 = distinct !DILexicalBlock(scope: !824, file: !3, line: 300, column: 15)
!842 = !DILocation(line: 300, column: 15, scope: !824)
!843 = !DILocation(line: 305, column: 16, scope: !844)
!844 = distinct !DILexicalBlock(scope: !824, file: !3, line: 305, column: 15)
!845 = !DILocation(line: 305, column: 15, scope: !824)
!846 = !DILocation(line: 306, column: 13, scope: !844)
!847 = !DILocation(line: 311, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !797, file: !3, line: 311, column: 7)
!849 = !DILocation(line: 311, column: 7, scope: !797)
!850 = !DILocation(line: 312, column: 25, scope: !848)
!851 = !DILocation(line: 312, column: 5, scope: !848)
!852 = !DILocation(line: 314, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !797, file: !3, line: 314, column: 7)
!854 = !DILocation(line: 314, column: 7, scope: !797)
!855 = !DILocation(line: 315, column: 5, scope: !853)
!856 = !DILocation(line: 317, column: 3, scope: !797)
!857 = !DILocation(line: 319, column: 20, scope: !797)
!858 = !{!859, !859, i64 0}
!859 = !{!"int", !746, i64 0}
!860 = !DILocation(line: 319, column: 27, scope: !797)
!861 = !DILocation(line: 319, column: 38, scope: !797)
!862 = !DILocation(line: 319, column: 19, scope: !797)
!863 = !DILocation(line: 319, column: 3, scope: !797)
!864 = !DILocation(line: 109, column: 14, scope: !865, inlinedAt: !919)
!865 = distinct !DISubprogram(name: "unexpand", scope: !3, file: !3, line: 106, type: !752, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !866)
!866 = !{!867, !902, !903, !905, !906, !907, !908, !909, !910, !911, !912, !916}
!867 = !DILocalVariable(name: "fp", scope: !865, file: !3, line: 109, type: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !870, file: !106, line: 51, baseType: !31, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !870, file: !106, line: 54, baseType: !22, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !870, file: !106, line: 55, baseType: !22, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !870, file: !106, line: 56, baseType: !22, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !870, file: !106, line: 57, baseType: !22, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !870, file: !106, line: 58, baseType: !22, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !870, file: !106, line: 59, baseType: !22, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !870, file: !106, line: 60, baseType: !22, size: 64, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !870, file: !106, line: 61, baseType: !22, size: 64, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !870, file: !106, line: 64, baseType: !22, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !870, file: !106, line: 65, baseType: !22, size: 64, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !870, file: !106, line: 66, baseType: !22, size: 64, offset: 704)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !870, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !870, file: !106, line: 70, baseType: !886, size: 64, offset: 832)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !870, file: !106, line: 72, baseType: !31, size: 32, offset: 896)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !870, file: !106, line: 73, baseType: !31, size: 32, offset: 928)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !870, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !870, file: !106, line: 77, baseType: !32, size: 16, offset: 1024)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !870, file: !106, line: 78, baseType: !132, size: 8, offset: 1040)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !870, file: !106, line: 79, baseType: !134, size: 8, offset: 1048)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !870, file: !106, line: 81, baseType: !138, size: 64, offset: 1088)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !870, file: !106, line: 89, baseType: !141, size: 64, offset: 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !870, file: !106, line: 91, baseType: !143, size: 64, offset: 1216)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !870, file: !106, line: 92, baseType: !146, size: 64, offset: 1280)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !870, file: !106, line: 93, baseType: !886, size: 64, offset: 1344)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !870, file: !106, line: 94, baseType: !24, size: 64, offset: 1408)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !870, file: !106, line: 95, baseType: !84, size: 64, offset: 1472)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !870, file: !106, line: 96, baseType: !31, size: 32, offset: 1536)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !870, file: !106, line: 98, baseType: !153, size: 160, offset: 1568)
!902 = !DILocalVariable(name: "pending_blank", scope: !865, file: !3, line: 114, type: !22)
!903 = !DILocalVariable(name: "c", scope: !904, file: !3, line: 127, type: !31)
!904 = distinct !DILexicalBlock(scope: !865, file: !3, line: 125, column: 5)
!905 = !DILocalVariable(name: "convert", scope: !904, file: !3, line: 130, type: !175)
!906 = !DILocalVariable(name: "column", scope: !904, file: !3, line: 137, type: !26)
!907 = !DILocalVariable(name: "next_tab_column", scope: !904, file: !3, line: 140, type: !26)
!908 = !DILocalVariable(name: "tab_index", scope: !904, file: !3, line: 143, type: !84)
!909 = !DILocalVariable(name: "one_blank_before_tab_stop", scope: !904, file: !3, line: 146, type: !175)
!910 = !DILocalVariable(name: "prev_blank", scope: !904, file: !3, line: 151, type: !175)
!911 = !DILocalVariable(name: "pending", scope: !904, file: !3, line: 154, type: !84)
!912 = !DILocalVariable(name: "blank", scope: !913, file: !3, line: 166, type: !175)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 165, column: 13)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 164, column: 15)
!915 = distinct !DILexicalBlock(scope: !904, file: !3, line: 160, column: 9)
!916 = !DILocalVariable(name: "last_tab", scope: !917, file: !3, line: 170, type: !175)
!917 = distinct !DILexicalBlock(scope: !918, file: !3, line: 169, column: 17)
!918 = distinct !DILexicalBlock(scope: !913, file: !3, line: 168, column: 19)
!919 = distinct !DILocation(line: 321, column: 3, scope: !797)
!920 = !DILocation(line: 109, column: 9, scope: !865, inlinedAt: !919)
!921 = !DILocation(line: 116, column: 8, scope: !922, inlinedAt: !919)
!922 = distinct !DILexicalBlock(scope: !865, file: !3, line: 116, column: 7)
!923 = !DILocation(line: 116, column: 7, scope: !865, inlinedAt: !919)
!924 = !DILocation(line: 122, column: 28, scope: !865, inlinedAt: !919)
!925 = !{!926, !926, i64 0}
!926 = !{!"long", !746, i64 0}
!927 = !DILocation(line: 122, column: 19, scope: !865, inlinedAt: !919)
!928 = !DILocation(line: 114, column: 9, scope: !865, inlinedAt: !919)
!929 = !DILocation(line: 124, column: 3, scope: !865, inlinedAt: !919)
!930 = !DILocation(scope: !915, inlinedAt: !919)
!931 = !DILocation(line: 130, column: 12, scope: !904, inlinedAt: !919)
!932 = !DILocation(line: 137, column: 17, scope: !904, inlinedAt: !919)
!933 = !DILocation(line: 140, column: 17, scope: !904, inlinedAt: !919)
!934 = !DILocation(line: 143, column: 7, scope: !904, inlinedAt: !919)
!935 = !DILocation(line: 143, column: 14, scope: !904, inlinedAt: !919)
!936 = !DILocation(line: 146, column: 12, scope: !904, inlinedAt: !919)
!937 = !DILocation(line: 151, column: 12, scope: !904, inlinedAt: !919)
!938 = !DILocation(line: 154, column: 14, scope: !904, inlinedAt: !919)
!939 = !DILocation(line: 159, column: 7, scope: !904, inlinedAt: !919)
!940 = !DILocation(scope: !913, inlinedAt: !919)
!941 = !DILocation(scope: !942, inlinedAt: !919)
!942 = distinct !DILexicalBlock(scope: !943, file: !3, line: 184, column: 25)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 183, column: 27)
!944 = distinct !DILexicalBlock(scope: !945, file: !3, line: 179, column: 21)
!945 = distinct !DILexicalBlock(scope: !917, file: !3, line: 178, column: 23)
!946 = !DILocation(scope: !947, inlinedAt: !919)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 230, column: 17)
!948 = distinct !DILexicalBlock(scope: !913, file: !3, line: 229, column: 19)
!949 = !DILocation(line: 161, column: 11, scope: !915, inlinedAt: !919)
!950 = !DILocalVariable(name: "__fp", arg: 1, scope: !951, file: !952, line: 66, type: !868)
!951 = distinct !DISubprogram(name: "getc_unlocked", scope: !952, file: !952, line: 66, type: !953, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !955)
!952 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!953 = !DISubroutineType(types: !954)
!954 = !{!31, !868}
!955 = !{!950}
!956 = !DILocation(line: 66, column: 22, scope: !951, inlinedAt: !957)
!957 = distinct !DILocation(line: 161, column: 23, scope: !915, inlinedAt: !919)
!958 = !DILocation(line: 68, column: 10, scope: !951, inlinedAt: !957)
!959 = !{!960, !745, i64 8}
!960 = !{!"_IO_FILE", !859, i64 0, !745, i64 8, !745, i64 16, !745, i64 24, !745, i64 32, !745, i64 40, !745, i64 48, !745, i64 56, !745, i64 64, !745, i64 72, !745, i64 80, !745, i64 88, !745, i64 96, !745, i64 104, !859, i64 112, !859, i64 116, !926, i64 120, !961, i64 128, !746, i64 130, !746, i64 131, !745, i64 136, !926, i64 144, !745, i64 152, !745, i64 160, !745, i64 168, !745, i64 176, !926, i64 184, !859, i64 192, !746, i64 196}
!961 = !{!"short", !746, i64 0}
!962 = !{!960, !745, i64 16}
!963 = !{!"branch_weights", i32 2000, i32 1}
!964 = !{!746, !746, i64 0}
!965 = !DILocation(line: 127, column: 11, scope: !904, inlinedAt: !919)
!966 = !DILocation(line: 161, column: 38, scope: !915, inlinedAt: !919)
!967 = !DILocation(line: 161, column: 34, scope: !915, inlinedAt: !919)
!968 = !DILocation(line: 161, column: 47, scope: !915, inlinedAt: !919)
!969 = distinct !{!969, !970, !971}
!970 = !DILocation(line: 161, column: 11, scope: !915)
!971 = !DILocation(line: 162, column: 13, scope: !915)
!972 = !DILocation(scope: !865, inlinedAt: !919)
!973 = !DILocation(line: 164, column: 15, scope: !914, inlinedAt: !919)
!974 = !DILocation(line: 164, column: 15, scope: !915, inlinedAt: !919)
!975 = !DILocation(line: 166, column: 31, scope: !913, inlinedAt: !919)
!976 = !{!961, !961, i64 0}
!977 = !DILocation(line: 166, column: 29, scope: !913, inlinedAt: !919)
!978 = !DILocation(line: 166, column: 20, scope: !913, inlinedAt: !919)
!979 = !DILocation(line: 168, column: 19, scope: !913, inlinedAt: !919)
!980 = !DILocation(line: 170, column: 24, scope: !917, inlinedAt: !919)
!981 = !DILocation(line: 170, column: 19, scope: !917, inlinedAt: !919)
!982 = !DILocation(line: 172, column: 37, scope: !917, inlinedAt: !919)
!983 = !DILocation(line: 175, column: 23, scope: !984, inlinedAt: !919)
!984 = distinct !DILexicalBlock(scope: !917, file: !3, line: 175, column: 23)
!985 = !{i8 0, i8 2}
!986 = !DILocation(line: 175, column: 23, scope: !917, inlinedAt: !919)
!987 = !DILocation(line: 178, column: 23, scope: !945, inlinedAt: !919)
!988 = !DILocation(line: 178, column: 23, scope: !917, inlinedAt: !919)
!989 = !DILocation(line: 180, column: 43, scope: !990, inlinedAt: !919)
!990 = distinct !DILexicalBlock(scope: !944, file: !3, line: 180, column: 27)
!991 = !DILocation(line: 180, column: 27, scope: !944, inlinedAt: !919)
!992 = !DILocation(line: 181, column: 25, scope: !990, inlinedAt: !919)
!993 = !DILocation(line: 183, column: 29, scope: !943, inlinedAt: !919)
!994 = !DILocation(line: 183, column: 27, scope: !944, inlinedAt: !919)
!995 = !DILocation(line: 187, column: 31, scope: !996, inlinedAt: !919)
!996 = distinct !DILexicalBlock(scope: !942, file: !3, line: 187, column: 31)
!997 = !DILocation(line: 187, column: 31, scope: !942, inlinedAt: !919)
!998 = !DILocation(line: 192, column: 33, scope: !999, inlinedAt: !919)
!999 = distinct !DILexicalBlock(scope: !943, file: !3, line: 191, column: 25)
!1000 = !DILocation(line: 194, column: 34, scope: !1001, inlinedAt: !919)
!1001 = distinct !DILexicalBlock(scope: !999, file: !3, line: 194, column: 31)
!1002 = !DILocation(line: 194, column: 55, scope: !1001, inlinedAt: !919)
!1003 = !DILocation(line: 194, column: 45, scope: !1001, inlinedAt: !919)
!1004 = !DILocation(scope: !797)
!1005 = !DILocation(line: 211, column: 33, scope: !944, inlinedAt: !919)
!1006 = !DILocation(scope: !999, inlinedAt: !919)
!1007 = !DILocation(line: 212, column: 21, scope: !944, inlinedAt: !919)
!1008 = !DILocation(line: 213, column: 17, scope: !918, inlinedAt: !919)
!1009 = !DILocation(line: 214, column: 26, scope: !1010, inlinedAt: !919)
!1010 = distinct !DILexicalBlock(scope: !918, file: !3, line: 214, column: 24)
!1011 = !DILocation(line: 214, column: 24, scope: !918, inlinedAt: !919)
!1012 = !DILocation(line: 218, column: 30, scope: !1013, inlinedAt: !919)
!1013 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 215, column: 17)
!1014 = !DILocation(line: 218, column: 29, scope: !1013, inlinedAt: !919)
!1015 = !DILocation(line: 218, column: 26, scope: !1013, inlinedAt: !919)
!1016 = !DILocation(line: 220, column: 34, scope: !1013, inlinedAt: !919)
!1017 = !DILocation(line: 220, column: 33, scope: !1013, inlinedAt: !919)
!1018 = !DILocation(line: 220, column: 32, scope: !1013, inlinedAt: !919)
!1019 = !DILocation(line: 220, column: 29, scope: !1013, inlinedAt: !919)
!1020 = !DILocation(line: 221, column: 17, scope: !1013, inlinedAt: !919)
!1021 = !DILocation(line: 224, column: 25, scope: !1022, inlinedAt: !919)
!1022 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 223, column: 17)
!1023 = !DILocation(line: 225, column: 24, scope: !1024, inlinedAt: !919)
!1024 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 225, column: 23)
!1025 = !DILocation(line: 225, column: 23, scope: !1022, inlinedAt: !919)
!1026 = !DILocation(line: 226, column: 21, scope: !1024, inlinedAt: !919)
!1027 = !DILocation(line: 161, column: 21, scope: !915, inlinedAt: !919)
!1028 = !DILocation(scope: !904, inlinedAt: !919)
!1029 = !DILocation(scope: !1022, inlinedAt: !919)
!1030 = !DILocation(line: 229, column: 19, scope: !913, inlinedAt: !919)
!1031 = !DILocation(line: 231, column: 38, scope: !1032, inlinedAt: !919)
!1032 = distinct !DILexicalBlock(scope: !947, file: !3, line: 231, column: 23)
!1033 = !DILocation(line: 231, column: 23, scope: !947, inlinedAt: !919)
!1034 = !DILocation(line: 232, column: 38, scope: !1032, inlinedAt: !919)
!1035 = !DILocation(line: 232, column: 21, scope: !1032, inlinedAt: !919)
!1036 = !DILocation(line: 233, column: 23, scope: !1037, inlinedAt: !919)
!1037 = distinct !DILexicalBlock(scope: !947, file: !3, line: 233, column: 23)
!1038 = !DILocation(line: 233, column: 66, scope: !1037, inlinedAt: !919)
!1039 = !DILocation(line: 233, column: 23, scope: !947, inlinedAt: !919)
!1040 = !DILocation(line: 234, column: 21, scope: !1037, inlinedAt: !919)
!1041 = !DILocation(line: 240, column: 26, scope: !913, inlinedAt: !919)
!1042 = !DILocation(line: 240, column: 46, scope: !913, inlinedAt: !919)
!1043 = !DILocation(line: 240, column: 23, scope: !913, inlinedAt: !919)
!1044 = !DILocation(line: 198, column: 35, scope: !1045, inlinedAt: !919)
!1045 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 195, column: 29)
!1046 = !DILocation(line: 200, column: 58, scope: !1045, inlinedAt: !919)
!1047 = !DILocation(line: 200, column: 52, scope: !1045, inlinedAt: !919)
!1048 = !DILocation(line: 200, column: 31, scope: !1045, inlinedAt: !919)
!1049 = !DILocation(line: 200, column: 56, scope: !1045, inlinedAt: !919)
!1050 = !DILocation(line: 243, column: 17, scope: !1051, inlinedAt: !919)
!1051 = distinct !DILexicalBlock(scope: !915, file: !3, line: 243, column: 15)
!1052 = !DILocation(line: 243, column: 15, scope: !915, inlinedAt: !919)
!1053 = !DILocation(line: 245, column: 15, scope: !1054, inlinedAt: !919)
!1054 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 244, column: 13)
!1055 = !DILocation(line: 253, column: 5, scope: !865, inlinedAt: !919)
!1056 = !DILocalVariable(name: "__c", arg: 1, scope: !1057, file: !952, line: 108, type: !31)
!1057 = distinct !DISubprogram(name: "putchar_unlocked", scope: !952, file: !952, line: 108, type: !1058, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1060)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!31, !31}
!1060 = !{!1056}
!1061 = !DILocation(line: 108, column: 23, scope: !1057, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 249, column: 15, scope: !1063, inlinedAt: !919)
!1063 = distinct !DILexicalBlock(scope: !915, file: !3, line: 249, column: 15)
!1064 = !DILocation(line: 110, column: 10, scope: !1057, inlinedAt: !1062)
!1065 = !{!960, !745, i64 40}
!1066 = !{!960, !745, i64 48}
!1067 = !DILocation(line: 249, column: 15, scope: !915, inlinedAt: !919)
!1068 = !DILocation(line: 249, column: 27, scope: !1063, inlinedAt: !919)
!1069 = !DILocation(line: 250, column: 13, scope: !1063, inlinedAt: !919)
!1070 = !DILocation(line: 185, column: 34, scope: !942, inlinedAt: !919)
!1071 = !DILocation(line: 236, column: 45, scope: !947, inlinedAt: !919)
!1072 = !DILocation(line: 239, column: 26, scope: !913, inlinedAt: !919)
!1073 = !DILocation(line: 235, column: 27, scope: !947, inlinedAt: !919)
!1074 = !DILocation(line: 252, column: 16, scope: !904, inlinedAt: !919)
!1075 = !DILocation(line: 251, column: 9, scope: !915, inlinedAt: !919)
!1076 = distinct !{!1076, !1077, !1078}
!1077 = !DILocation(line: 159, column: 7, scope: !904)
!1078 = !DILocation(line: 252, column: 23, scope: !904)
!1079 = !DILocation(line: 323, column: 3, scope: !797)
!1080 = !DILocation(line: 325, column: 10, scope: !797)
!1081 = !DILocation(line: 326, column: 1, scope: !797)
!1082 = distinct !DISubprogram(name: "add_tab_stop", scope: !53, file: !53, line: 78, type: !1083, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !52, retainedNodes: !1085)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !26}
!1085 = !{!1086, !1087, !1088}
!1086 = !DILocalVariable(name: "tabval", arg: 1, scope: !1082, file: !53, line: 78, type: !26)
!1087 = !DILocalVariable(name: "prev_column", scope: !1082, file: !53, line: 80, type: !26)
!1088 = !DILocalVariable(name: "column_width", scope: !1082, file: !53, line: 81, type: !26)
!1089 = !DILocation(line: 78, column: 25, scope: !1082)
!1090 = !DILocation(line: 80, column: 27, scope: !1082)
!1091 = !DILocation(line: 80, column: 44, scope: !1082)
!1092 = !DILocation(line: 80, column: 68, scope: !1082)
!1093 = !DILocation(line: 80, column: 13, scope: !1082)
!1094 = !DILocation(line: 81, column: 28, scope: !1082)
!1095 = !DILocation(line: 81, column: 13, scope: !1082)
!1096 = !DILocation(line: 83, column: 25, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1082, file: !53, line: 83, column: 7)
!1098 = !DILocation(line: 83, column: 22, scope: !1097)
!1099 = !DILocation(line: 83, column: 7, scope: !1082)
!1100 = !DILocation(line: 85, column: 3, scope: !1082)
!1101 = !DILocation(line: 84, column: 16, scope: !1097)
!1102 = !DILocation(line: 174, column: 19, scope: !80, inlinedAt: !1103)
!1103 = distinct !DILocation(line: 84, column: 16, scope: !1097)
!1104 = !DILocation(line: 174, column: 30, scope: !80, inlinedAt: !1103)
!1105 = !DILocation(line: 174, column: 41, scope: !80, inlinedAt: !1103)
!1106 = !DILocation(line: 176, column: 10, scope: !80, inlinedAt: !1103)
!1107 = !DILocation(line: 178, column: 9, scope: !1108, inlinedAt: !1103)
!1108 = distinct !DILexicalBlock(scope: !80, file: !79, line: 178, column: 7)
!1109 = !DILocation(line: 178, column: 7, scope: !80, inlinedAt: !1103)
!1110 = !DILocation(line: 180, column: 11, scope: !1111, inlinedAt: !1103)
!1111 = distinct !DILexicalBlock(scope: !1108, file: !79, line: 179, column: 5)
!1112 = !DILocation(line: 191, column: 11, scope: !1113, inlinedAt: !1103)
!1113 = distinct !DILexicalBlock(scope: !1111, file: !79, line: 191, column: 11)
!1114 = !DILocation(line: 191, column: 11, scope: !1111, inlinedAt: !1103)
!1115 = !DILocation(line: 192, column: 9, scope: !1113, inlinedAt: !1103)
!1116 = !DILocation(line: 201, column: 11, scope: !1117, inlinedAt: !1103)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !79, line: 200, column: 11)
!1118 = distinct !DILexicalBlock(scope: !1108, file: !79, line: 195, column: 5)
!1119 = !DILocation(line: 200, column: 11, scope: !1118, inlinedAt: !1103)
!1120 = !DILocation(line: 202, column: 9, scope: !1117, inlinedAt: !1103)
!1121 = !DILocation(line: 203, column: 14, scope: !1118, inlinedAt: !1103)
!1122 = !DILocation(line: 203, column: 18, scope: !1118, inlinedAt: !1103)
!1123 = !DILocation(line: 203, column: 9, scope: !1118, inlinedAt: !1103)
!1124 = !DILocation(scope: !80, inlinedAt: !1103)
!1125 = !DILocation(line: 206, column: 7, scope: !80, inlinedAt: !1103)
!1126 = !DILocation(line: 207, column: 25, scope: !80, inlinedAt: !1103)
!1127 = !DILocation(line: 207, column: 10, scope: !80, inlinedAt: !1103)
!1128 = !DILocation(line: 84, column: 14, scope: !1097)
!1129 = !DILocation(line: 84, column: 5, scope: !1097)
!1130 = !DILocation(line: 85, column: 26, scope: !1082)
!1131 = !DILocation(line: 85, column: 30, scope: !1082)
!1132 = !DILocation(line: 87, column: 7, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1082, file: !53, line: 87, column: 7)
!1134 = !DILocation(line: 87, column: 24, scope: !1133)
!1135 = !DILocation(line: 87, column: 7, scope: !1082)
!1136 = !DILocation(line: 91, column: 24, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1133, file: !53, line: 88, column: 5)
!1138 = !DILocation(line: 92, column: 5, scope: !1137)
!1139 = !DILocation(line: 93, column: 1, scope: !1082)
!1140 = distinct !DISubprogram(name: "parse_tab_stops", scope: !53, file: !53, line: 132, type: !719, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !52, retainedNodes: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1160}
!1142 = !DILocalVariable(name: "stops", arg: 1, scope: !1140, file: !53, line: 132, type: !42)
!1143 = !DILocalVariable(name: "have_tabval", scope: !1140, file: !53, line: 134, type: !175)
!1144 = !DILocalVariable(name: "tabval", scope: !1140, file: !53, line: 135, type: !26)
!1145 = !DILocalVariable(name: "extend_tabval", scope: !1140, file: !53, line: 136, type: !175)
!1146 = !DILocalVariable(name: "increment_tabval", scope: !1140, file: !53, line: 137, type: !175)
!1147 = !DILocalVariable(name: "num_start", scope: !1140, file: !53, line: 138, type: !42)
!1148 = !DILocalVariable(name: "ok", scope: !1140, file: !53, line: 139, type: !175)
!1149 = !DILocalVariable(name: "len", scope: !1150, file: !53, line: 202, type: !84)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !53, line: 201, column: 13)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !53, line: 200, column: 15)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !53, line: 191, column: 9)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !53, line: 190, column: 16)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !53, line: 179, column: 16)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !53, line: 168, column: 16)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !53, line: 143, column: 11)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !53, line: 142, column: 5)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !53, line: 141, column: 3)
!1159 = distinct !DILexicalBlock(scope: !1140, file: !53, line: 141, column: 3)
