source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.linebuffer = type { i64, i64, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s [OPTION]... [INPUT [OUTPUT]]\0A\00", align 1
@.str.2 = private unnamed_addr constant [173 x i8] c"Filter adjacent matching lines from INPUT (or standard input),\0Awriting to OUTPUT (or standard output).\0A\0AWith no options, matching lines are merged to the first occurrence.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!19 = !DIEnumerator(name: "DM_SEPARATE", value: 2, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !21, line: 25, baseType: !6, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27}
!23 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "grouping_method", file: !3, line: 107, baseType: !6, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34}
!30 = !DIEnumerator(name: "GM_NONE", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "GM_PREPEND", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "GM_APPEND", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "GM_SEPARATE", value: 3, isUnsigned: true)
!34 = !DIEnumerator(name: "GM_BOTH", value: 4, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !36, line: 32, baseType: !6, size: 32, elements: !37)
!36 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!38 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!44 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!45 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!46 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!48 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 45, baseType: !6, size: 32, elements: !51)
!50 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 46, baseType: !6, size: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!61 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!62 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!63 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!64 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!65 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!66 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!67 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!68 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!69 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!73 = !{!74, !84, !145, !135, !149, !153, !157, !160, !161, !167, !182, !186, !190, !195, !137, !196, !78, !198, !202, !206, !210, !213, !216, !226, !80, !229, !232, !236, !239, !82, !115, !242, !246}
!74 = !DISubprogram(name: "dcgettext", scope: !75, file: !75, line: 51, type: !76, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!75 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !80, !80, !82}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !{}
!84 = !DISubprogram(name: "fputs_unlocked", scope: !85, file: !85, line: 662, type: !86, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!85 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!86 = !DISubroutineType(types: !87)
!87 = !{!82, !80, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !91)
!90 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !107, !108, !109, !110, !114, !116, !118, !122, !125, !127, !130, !133, !134, !136, !140, !141}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !89, file: !90, line: 51, baseType: !82, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !89, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !89, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !89, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !89, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !89, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !89, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !89, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !89, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !89, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !89, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !89, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !89, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !90, line: 36, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !89, file: !90, line: 70, baseType: !88, size: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !89, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !89, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !89, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !112, line: 152, baseType: !113)
!112 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!113 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !89, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!115 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !89, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!117 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !89, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !89, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !90, line: 43, baseType: null)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !89, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !112, line: 153, baseType: !113)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !89, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !90, line: 37, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !89, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !90, line: 38, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !89, file: !90, line: 93, baseType: !88, size: 64, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !89, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !89, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 46, baseType: !139)
!138 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!139 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !89, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !89, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 160, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 20)
!145 = !DISubprogram(name: "getenv", scope: !146, file: !146, line: 634, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!146 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!147 = !DISubroutineType(types: !148)
!148 = !{!78, !80}
!149 = !DISubprogram(name: "set_program_name", scope: !150, file: !150, line: 37, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!150 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !80}
!153 = !DISubprogram(name: "setlocale", scope: !154, file: !154, line: 122, type: !155, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!154 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!155 = !DISubroutineType(types: !156)
!156 = !{!78, !82, !80}
!157 = !DISubprogram(name: "bindtextdomain", scope: !75, file: !75, line: 86, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!158 = !DISubroutineType(types: !159)
!159 = !{!78, !80, !80}
!160 = !DISubprogram(name: "textdomain", scope: !75, file: !75, line: 82, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!161 = !DISubprogram(name: "atexit", scope: !146, file: !146, line: 595, type: !162, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!162 = !DISubroutineType(types: !163)
!163 = !{!82, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null}
!167 = !DISubprogram(name: "getopt_long", scope: !168, file: !168, line: 66, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!168 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!169 = !DISubroutineType(types: !170)
!170 = !{!82, !82, !171, !80, !173, !180}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !168, line: 50, size: 256, elements: !176)
!176 = !{!177, !178, !179, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !168, line: 52, baseType: !80, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !175, file: !168, line: 55, baseType: !82, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !168, line: 56, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !175, file: !168, line: 57, baseType: !82, size: 32, offset: 192)
!182 = !DISubprogram(name: "quote", scope: !183, file: !183, line: 44, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!183 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!80, !80}
!186 = !DISubprogram(name: "error", scope: !187, file: !187, line: 52, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!187 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubroutineType(types: !189)
!189 = !{null, !82, !82, !80, null}
!190 = !DISubprogram(name: "xstrtoumax", scope: !21, file: !21, line: 48, type: !191, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!191 = !DISubroutineType(types: !192)
!192 = !{!20, !80, !193, !82, !194, !80}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!198 = !DISubprogram(name: "version_etc", scope: !199, file: !199, line: 69, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!199 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !DISubroutineType(types: !201)
!201 = !{null, !88, !80, !80, !80, null}
!202 = !DISubprogram(name: "posix2_version", scope: !203, file: !203, line: 1, type: !204, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!203 = !DIFile(filename: "./lib/posixver.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !DISubroutineType(types: !205)
!205 = !{!82}
!206 = !DISubprogram(name: "freopen_safer", scope: !207, file: !207, line: 27, type: !208, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!207 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !DISubroutineType(types: !209)
!209 = !{!88, !80, !80, !88}
!210 = !DISubprogram(name: "quotearg_n_style_colon", scope: !36, file: !36, line: 397, type: !211, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!211 = !DISubroutineType(types: !212)
!212 = !{!78, !82, !35, !80}
!213 = !DISubprogram(name: "fadvise", scope: !50, file: !50, line: 72, type: !214, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !88, !49}
!216 = !DISubprogram(name: "initbuffer", scope: !217, file: !217, line: 34, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!217 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !217, line: 26, size: 192, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !217, line: 28, baseType: !137, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !221, file: !217, line: 29, baseType: !137, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !221, file: !217, line: 30, baseType: !78, size: 64, offset: 128)
!226 = !DISubprogram(name: "readlinebuffer_delim", scope: !217, file: !217, line: 41, type: !227, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!227 = !DISubroutineType(types: !228)
!228 = !{!220, !220, !88, !79}
!229 = !DISubprogram(name: "fwrite_unlocked", scope: !85, file: !85, line: 675, type: !230, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!230 = !DISubroutineType(types: !231)
!231 = !{!139, !196, !139, !139, !88}
!232 = !DISubprogram(name: "rpl_fclose", scope: !233, file: !233, line: 672, type: !234, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!233 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = !DISubroutineType(types: !235)
!235 = !{!82, !88}
!236 = !DISubprogram(name: "quotearg_style", scope: !36, file: !36, line: 377, type: !237, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!237 = !DISubroutineType(types: !238)
!238 = !{!78, !35, !80}
!239 = !DISubprogram(name: "free", scope: !146, file: !146, line: 565, type: !240, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !135}
!242 = !DISubprogram(name: "memcasecmp", scope: !243, file: !243, line: 22, type: !244, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!243 = !DIFile(filename: "./lib/memcasecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!244 = !DISubroutineType(types: !245)
!245 = !{!82, !196, !196, !139}
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !{!248, !0, !250, !252, !254, !257, !259, !261, !263, !265, !270, !276, !282, !284, !288}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "skip_fields", scope: !2, file: !3, line: 54, type: !137, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "check_chars", scope: !2, file: !3, line: 60, type: !137, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "countmode", scope: !2, file: !3, line: 70, type: !11, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "output_unique", scope: !2, file: !3, line: 75, type: !256, isLocal: true, isDefinition: true)
!256 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "output_first_repeated", scope: !2, file: !3, line: 76, type: !256, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "output_later_repeated", scope: !2, file: !3, line: 77, type: !256, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "ignore_case", scope: !2, file: !3, line: 80, type: !256, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "delimit_groups", scope: !2, file: !3, line: 105, type: !15, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 142, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 3328, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 13)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "delimit_method_map", scope: !2, file: !3, line: 99, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 96, elements: !274)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!274 = !{!275}
!275 = !DISubrange(count: 3)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "delimit_method_string", scope: !2, file: !3, line: 94, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 256, elements: !280)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!280 = !{!281}
!281 = !DISubrange(count: 4)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "grouping", scope: !2, file: !3, line: 135, type: !28, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "grouping_method_map", scope: !2, file: !3, line: 130, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 128, elements: !280)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "grouping_method_string", scope: !2, file: !3, line: 125, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 320, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 5)
!293 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!294 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!295 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!296 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!297 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "Version", scope: !300, file: !301, line: 2, type: !80, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, globals: !302, nameTableKind: None)
!301 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !{!298}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !305, file: !306, line: 67, type: !352, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !307, retainedTypes: !308, globals: !351, nameTableKind: None)
!306 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!307 = !{!35}
!308 = !{!135, !80, !74, !309, !310, !186, !313, !182, !348, !246}
!309 = !DISubprogram(name: "quotearg_n_style", scope: !36, file: !36, line: 368, type: !211, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!310 = !DISubprogram(name: "quote_n", scope: !183, file: !183, line: 40, type: !311, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!311 = !DISubroutineType(types: !312)
!312 = !{!80, !82, !80}
!313 = !DISubprogram(name: "fputs_unlocked", scope: !85, file: !85, line: 662, type: !314, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!314 = !DISubroutineType(types: !315)
!315 = !{!82, !80, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !317, file: !90, line: 51, baseType: !82, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !317, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !317, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !317, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !317, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !317, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !317, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !317, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !317, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !317, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !317, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !317, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !317, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !317, file: !90, line: 70, baseType: !316, size: 64, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !317, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !317, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !317, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !317, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !317, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !317, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !317, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !317, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !317, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !317, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !317, file: !90, line: 93, baseType: !316, size: 64, offset: 1344)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !317, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !317, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !317, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !317, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!348 = !DISubprogram(name: "usage", scope: !306, file: !306, line: 56, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !82}
!351 = !{!303}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !353, line: 61, baseType: !164)
!353 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "file_name", scope: !356, file: !357, line: 46, type: !80, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !358, globals: !396, nameTableKind: None)
!357 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!358 = !{!359, !74, !395, !186}
!359 = !DISubprogram(name: "close_stream", scope: !360, file: !360, line: 2, type: !361, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!360 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!361 = !DISubroutineType(types: !362)
!362 = !{!82, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !364, file: !90, line: 51, baseType: !82, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !364, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !364, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !364, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !364, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !364, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !364, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !364, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !364, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !364, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !364, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !364, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !364, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !364, file: !90, line: 70, baseType: !363, size: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !364, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !364, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !364, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !364, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !364, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !364, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !364, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !364, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !364, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !364, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !364, file: !90, line: 93, baseType: !363, size: 64, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !364, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !364, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !364, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !364, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!395 = !DISubprogram(name: "quotearg_colon", scope: !36, file: !36, line: 391, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!396 = !{!354, !397}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !356, file: !357, line: 56, type: !256, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "exit_failure", scope: !401, file: !402, line: 24, type: !404, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, globals: !403, nameTableKind: None)
!402 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!403 = !{!399}
!404 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !82)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "program_name", scope: !407, file: !408, line: 33, type: !80, isDefinition: true)
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !409, globals: !445, nameTableKind: None)
!408 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!409 = !{!135, !410, !78}
!410 = !DISubprogram(name: "fputs", scope: !85, file: !85, line: 626, type: !411, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!411 = !DISubroutineType(types: !412)
!412 = !{!82, !80, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !414, file: !90, line: 51, baseType: !82, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !414, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !414, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !414, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !414, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !414, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !414, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !414, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !414, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !414, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !414, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !414, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !414, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !414, file: !90, line: 70, baseType: !413, size: 64, offset: 832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !414, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !414, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !414, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !414, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !414, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !414, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !414, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !414, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !414, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !414, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !414, file: !90, line: 93, baseType: !413, size: 64, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !414, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !414, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !414, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !414, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!445 = !{!405}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !448, file: !449, line: 85, type: !546, isDefinition: true)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !450, retainedTypes: !456, globals: !519, nameTableKind: None)
!449 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!450 = !{!35, !451, !58}
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !36, line: 242, baseType: !6, size: 32, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!454 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!455 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!456 = !{!457, !461, !239, !476, !82, !115, !479, !137, !494, !498, !74, !504, !508, !78, !512, !515, !516}
!457 = !DISubprogram(name: "xmemdup", scope: !458, file: !458, line: 62, type: !459, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!458 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!459 = !DISubroutineType(types: !460)
!460 = !{!135, !196, !139}
!461 = !DISubprogram(name: "quotearg_alloc_mem", scope: !36, file: !36, line: 342, type: !462, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!462 = !DISubroutineType(types: !463)
!463 = !{!78, !80, !139, !194, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !449, line: 65, size: 448, elements: !467)
!467 = !{!468, !469, !470, !474, !475}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !466, file: !449, line: 68, baseType: !35, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !449, line: 71, baseType: !82, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !466, file: !449, line: 75, baseType: !471, size: 256, offset: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !466, file: !449, line: 78, baseType: !80, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !466, file: !449, line: 81, baseType: !80, size: 64, offset: 384)
!476 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !36, file: !36, line: 408, type: !477, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!477 = !DISubroutineType(types: !478)
!478 = !{!78, !82, !80, !80, !80, !139}
!479 = !DISubprogram(name: "rpl_mbrtowc", scope: !480, file: !480, line: 717, type: !481, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!480 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !DISubroutineType(types: !482)
!482 = !{!139, !180, !80, !139, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 64, elements: !486)
!485 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !484, file: !485, line: 15, baseType: !82, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !484, file: !485, line: 20, baseType: !489, size: 32, offset: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !484, file: !485, line: 16, size: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !489, file: !485, line: 18, baseType: !6, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !489, file: !485, line: 19, baseType: !493, size: 32)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32, elements: !280)
!494 = !DISubprogram(name: "iswprint", scope: !495, file: !495, line: 120, type: !496, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!495 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!496 = !DISubroutineType(types: !497)
!497 = !{!82, !6}
!498 = !DISubprogram(name: "mbsinit", scope: !499, file: !499, line: 292, type: !500, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!499 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!500 = !DISubroutineType(types: !501)
!501 = !{!82, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!504 = !DISubprogram(name: "locale_charset", scope: !505, file: !505, line: 35, type: !506, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!505 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!506 = !DISubroutineType(types: !507)
!507 = !{!80}
!508 = !DISubprogram(name: "c_strcasecmp", scope: !509, file: !509, line: 42, type: !510, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!509 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!510 = !DISubroutineType(types: !511)
!511 = !{!82, !80, !80}
!512 = !DISubprogram(name: "xmalloc", scope: !458, file: !458, line: 53, type: !513, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!513 = !DISubroutineType(types: !514)
!514 = !{!135, !139}
!515 = !DISubprogram(name: "xalloc_die", scope: !458, file: !458, line: 51, type: !165, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !83)
!516 = !DISubprogram(name: "xrealloc", scope: !458, file: !458, line: 59, type: !517, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!517 = !DISubroutineType(types: !518)
!518 = !{!135, !135, !139}
!519 = !{!446, !520, !526, !528, !530, !535, !542, !544}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !448, file: !449, line: 101, type: !522, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !524)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!524 = !{!525}
!525 = !DISubrange(count: 10)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !448, file: !449, line: 1052, type: !466, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !448, file: !449, line: 116, type: !466, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "slot0", scope: !448, file: !449, line: 842, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 2048, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 256)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "slotvec", scope: !448, file: !449, line: 845, type: !537, isLocal: true, isDefinition: true)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !449, line: 834, size: 128, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !538, file: !449, line: 836, baseType: !137, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !538, file: !449, line: 837, baseType: !78, size: 64, offset: 64)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "nslots", scope: !448, file: !449, line: 843, type: !82, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "slotvec0", scope: !448, file: !449, line: 844, type: !538, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 704, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 11)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !551, file: !552, line: 26, type: !554, isDefinition: true)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, globals: !553, nameTableKind: None)
!552 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = !{!549}
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 376, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 47)
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !559, retainedTypes: !560, nameTableKind: None)
!558 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!559 = !{!49}
!560 = !{!561, !565}
!561 = !DISubprogram(name: "posix_fadvise", scope: !562, file: !562, line: 288, type: !563, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!562 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!563 = !DISubroutineType(types: !564)
!564 = !{!82, !82, !113, !113, !82}
!565 = !DISubprogram(name: "fileno", scope: !85, file: !85, line: 786, type: !566, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!566 = !DISubroutineType(types: !567)
!567 = !{!82, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !569, file: !90, line: 51, baseType: !82, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !569, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !569, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !569, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !569, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !569, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !569, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !569, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !569, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !569, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !569, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !569, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !569, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !569, file: !90, line: 70, baseType: !568, size: 64, offset: 832)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !569, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !569, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !569, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !569, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !569, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !569, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !569, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !569, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !569, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !569, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !569, file: !90, line: 93, baseType: !568, size: 64, offset: 1344)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !569, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !569, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !569, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !569, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !602, nameTableKind: None)
!601 = !DIFile(filename: "lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!602 = !{!603, !638, !642, !645, !648}
!603 = !DISubprogram(name: "fileno", scope: !85, file: !85, line: 786, type: !604, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!604 = !DISubroutineType(types: !605)
!605 = !{!82, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !607, file: !90, line: 51, baseType: !82, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !607, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !607, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !607, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !607, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !607, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !607, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !607, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !607, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !607, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !607, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !607, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !607, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !607, file: !90, line: 70, baseType: !606, size: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !607, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !607, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !607, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !607, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !607, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !607, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !607, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !607, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !607, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !607, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !607, file: !90, line: 93, baseType: !606, size: 64, offset: 1344)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !607, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !607, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !607, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !607, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!638 = !DISubprogram(name: "dup2", scope: !639, file: !639, line: 534, type: !640, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!639 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!640 = !DISubroutineType(types: !641)
!641 = !{!82, !82, !82}
!642 = !DISubprogram(name: "freopen", scope: !85, file: !85, line: 252, type: !643, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!643 = !DISubroutineType(types: !644)
!644 = !{!606, !80, !80, !606}
!645 = !DISubprogram(name: "close", scope: !639, file: !639, line: 353, type: !646, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!646 = !DISubroutineType(types: !647)
!647 = !{!82, !82}
!648 = !DISubprogram(name: "open", scope: !562, file: !562, line: 196, type: !649, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!649 = !DISubroutineType(types: !650)
!650 = !{!82, !80, !82, null}
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !653, nameTableKind: None)
!652 = !DIFile(filename: "lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!653 = !{!654, !695, !239, !698}
!654 = !DISubprogram(name: "readlinebuffer_delim", scope: !217, file: !217, line: 41, type: !655, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !657, !663, !79}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !217, line: 26, size: 192, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !658, file: !217, line: 28, baseType: !137, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !658, file: !217, line: 29, baseType: !137, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !658, file: !217, line: 30, baseType: !78, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !664, file: !90, line: 51, baseType: !82, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !664, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !664, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !664, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !664, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !664, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !664, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !664, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !664, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !664, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !664, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !664, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !664, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !664, file: !90, line: 70, baseType: !663, size: 64, offset: 832)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !664, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !664, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !664, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !664, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !664, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !664, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !664, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !664, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !664, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !664, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !664, file: !90, line: 93, baseType: !663, size: 64, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !664, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !664, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !664, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !664, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!695 = !DISubprogram(name: "x2realloc", scope: !458, file: !458, line: 61, type: !696, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!696 = !DISubroutineType(types: !697)
!697 = !{!135, !135, !194}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !205, nameTableKind: None)
!700 = !DIFile(filename: "lib/memcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !703, nameTableKind: None)
!702 = !DIFile(filename: "lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!703 = !{!145}
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !706, retainedTypes: !710, nameTableKind: None)
!705 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !705, line: 40, baseType: !6, size: 32, elements: !708)
!708 = !{!709}
!709 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!710 = !{!74, !711, !135}
!711 = !DISubprogram(name: "fputs_unlocked", scope: !85, file: !85, line: 662, type: !712, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!712 = !DISubroutineType(types: !713)
!713 = !{!82, !80, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !715, file: !90, line: 51, baseType: !82, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !715, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !715, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !715, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !715, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !715, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !715, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !715, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !715, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !715, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !715, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !715, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !715, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !715, file: !90, line: 70, baseType: !714, size: 64, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !715, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !715, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !715, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !715, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !715, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !715, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !715, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !715, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !715, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !715, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !715, file: !90, line: 93, baseType: !714, size: 64, offset: 1344)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !715, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !715, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !715, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !715, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!746 = distinct !DICompileUnit(language: DW_LANG_C99, file: !747, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !748, retainedTypes: !760, nameTableKind: None)
!747 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!748 = !{!749}
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !750, file: !458, line: 186, baseType: !6, size: 32, elements: !758)
!750 = distinct !DISubprogram(name: "x2nrealloc", scope: !458, file: !458, line: 174, type: !751, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !746, retainedNodes: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!135, !135, !195, !137}
!753 = !{!754, !755, !756, !757}
!754 = !DILocalVariable(name: "p", arg: 1, scope: !750, file: !458, line: 174, type: !135)
!755 = !DILocalVariable(name: "pn", arg: 2, scope: !750, file: !458, line: 174, type: !195)
!756 = !DILocalVariable(name: "s", arg: 3, scope: !750, file: !458, line: 174, type: !137)
!757 = !DILocalVariable(name: "n", scope: !750, file: !458, line: 176, type: !137)
!758 = !{!759}
!759 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!760 = !{!137, !515, !512, !516, !78, !239, !135, !761, !764}
!761 = !DISubprogram(name: "xcalloc", scope: !458, file: !458, line: 57, type: !762, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!762 = !DISubroutineType(types: !763)
!763 = !{!135, !139, !139}
!764 = !DISubprogram(name: "rpl_calloc", scope: !765, file: !765, line: 688, type: !762, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!765 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !768, nameTableKind: None)
!767 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!768 = !{!74, !186}
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !771, retainedTypes: !772, nameTableKind: None)
!770 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!771 = !{!20, !58}
!772 = !{!82, !115}
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !775, nameTableKind: None)
!774 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!775 = !{!135}
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !778, nameTableKind: None)
!777 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!778 = !{!779, !814, !815, !818}
!779 = !DISubprogram(name: "fileno", scope: !85, file: !85, line: 786, type: !780, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!780 = !DISubroutineType(types: !781)
!781 = !{!82, !782}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !783, file: !90, line: 51, baseType: !82, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !783, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !783, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !783, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !783, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !783, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !783, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !783, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !783, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !783, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !783, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !783, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !783, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !783, file: !90, line: 70, baseType: !782, size: 64, offset: 832)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !783, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !783, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !783, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !783, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !783, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !783, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !783, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !783, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !783, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !783, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !783, file: !90, line: 93, baseType: !782, size: 64, offset: 1344)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !783, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !783, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !783, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !783, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!814 = !DISubprogram(name: "fclose", scope: !85, file: !85, line: 213, type: !780, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!815 = !DISubprogram(name: "lseek", scope: !639, file: !639, line: 334, type: !816, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!816 = !DISubroutineType(types: !817)
!817 = !{!113, !82, !113, !82}
!818 = !DISubprogram(name: "rpl_fflush", scope: !233, file: !233, line: 718, type: !780, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !821, nameTableKind: None)
!820 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!821 = !{!135, !822, !857}
!822 = !DISubprogram(name: "fflush", scope: !85, file: !85, line: 218, type: !823, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!823 = !DISubroutineType(types: !824)
!824 = !{!82, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !826, file: !90, line: 51, baseType: !82, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !826, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !826, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !826, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !826, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !826, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !826, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !826, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !826, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !826, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !826, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !826, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !826, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !826, file: !90, line: 70, baseType: !825, size: 64, offset: 832)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !826, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !826, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !826, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !826, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !826, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !826, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !826, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !826, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !826, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !826, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !826, file: !90, line: 93, baseType: !825, size: 64, offset: 1344)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !826, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !826, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !826, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !826, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!857 = !DISubprogram(name: "rpl_fseeko", scope: !233, file: !233, line: 1034, type: !858, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!858 = !DISubroutineType(types: !859)
!859 = !{!82, !825, !113, !82}
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !862, nameTableKind: None)
!861 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!862 = !{!135, !863, !815, !898}
!863 = !DISubprogram(name: "fileno", scope: !85, file: !85, line: 786, type: !864, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!864 = !DISubroutineType(types: !865)
!865 = !{!82, !866}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !867, file: !90, line: 51, baseType: !82, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !867, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !867, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !867, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !867, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !867, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !867, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !867, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !867, file: !90, line: 61, baseType: !78, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !867, file: !90, line: 64, baseType: !78, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !867, file: !90, line: 65, baseType: !78, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !867, file: !90, line: 66, baseType: !78, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !867, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !867, file: !90, line: 70, baseType: !866, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !867, file: !90, line: 72, baseType: !82, size: 32, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !867, file: !90, line: 73, baseType: !82, size: 32, offset: 928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !867, file: !90, line: 74, baseType: !111, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !867, file: !90, line: 77, baseType: !115, size: 16, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !867, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !867, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !867, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !867, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !867, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !867, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !867, file: !90, line: 93, baseType: !866, size: 64, offset: 1344)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !867, file: !90, line: 94, baseType: !135, size: 64, offset: 1408)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !867, file: !90, line: 95, baseType: !137, size: 64, offset: 1472)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !867, file: !90, line: 96, baseType: !82, size: 32, offset: 1536)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !867, file: !90, line: 98, baseType: !142, size: 160, offset: 1568)
!898 = !DISubprogram(name: "fseeko", scope: !85, file: !85, line: 707, type: !899, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!899 = !DISubroutineType(types: !900)
!900 = !{!82, !866, !113, !82}
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !903, nameTableKind: None)
!902 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!903 = !{!904, !137, !916}
!904 = !DISubprogram(name: "mbrtowc", scope: !499, file: !499, line: 296, type: !905, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!905 = !DISubroutineType(types: !906)
!906 = !{!139, !180, !80, !139, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 64, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !908, file: !485, line: 15, baseType: !82, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !908, file: !485, line: 20, baseType: !912, size: 32, offset: 32)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !908, file: !485, line: 16, size: 32, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !912, file: !485, line: 18, baseType: !6, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !912, file: !485, line: 19, baseType: !493, size: 32)
!916 = !DISubprogram(name: "hard_locale", scope: !917, file: !917, line: 26, type: !918, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!917 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!918 = !DISubroutineType(types: !919)
!919 = !{!256, !82}
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !83, retainedTypes: !922, nameTableKind: None)
!921 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!922 = !{!923}
!923 = !DISubprogram(name: "rpl_fclose", scope: !233, file: !233, line: 672, type: !924, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !83)
!924 = !DISubroutineType(types: !925)
!925 = !{!82, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !927, file: !90, line: 51, baseType: !82, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !927, file: !90, line: 54, baseType: !78, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !927, file: !90, line: 55, baseType: !78, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !927, file: !90, line: 56, baseType: !78, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !927, file: !90, line: 57, baseType: !78, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !927, file: !90, line: 58, baseType: !78, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !927, file: !90, line: 59, baseType: !78, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !927, file: !90, line: 60, baseType: !78, size: 64, offset: 448)
