source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__exit_status = type { i16, i16 }
%struct.__locale_data = type opaque
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon = type { i32, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 50, type: !50, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !39, globals: !49)
!3 = !DIFile(filename: "src/uptime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 208, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !27, file: !26, line: 187, baseType: !7, size: 32, elements: !37)
!26 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!27 = distinct !DISubprogram(name: "select_plural", scope: !26, file: !26, line: 183, type: !28, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !35)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !31}
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !32, line: 102, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !34, line: 72, baseType: !30)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!35 = !{!36}
!36 = !DILocalVariable(name: "n", arg: 1, scope: !27, file: !26, line: 183, type: !31)
!37 = !{!38}
!38 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!39 = !{!40, !43, !44, !30, !48}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !45, line: 7, baseType: !46)
!45 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !34, line: 158, baseType: !47)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !{!0}
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 256, elements: !61)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !53, line: 50, size: 256, elements: !54)
!53 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!54 = !{!55, !56, !58, !60}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !53, line: 52, baseType: !40, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !52, file: !53, line: 55, baseType: !57, size: 32, offset: 64)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !52, file: !53, line: 56, baseType: !59, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !52, file: !53, line: 57, baseType: !57, size: 32, offset: 192)
!61 = !{!62}
!62 = !DISubrange(count: 1)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "Version", scope: !65, file: !66, line: 2, type: !40, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, globals: !68)
!66 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!67 = !{}
!68 = !{!63}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !71, file: !99, line: 51, type: !100, isLocal: true, isDefinition: true)
!71 = distinct !DICompileUnit(language: DW_LANG_C99, file: !72, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, retainedTypes: !73, globals: !98)
!72 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !76, line: 24, baseType: !77)
!76 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !78, line: 42, baseType: !79)
!78 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !78, line: 28, size: 1856, elements: !81)
!81 = !{!82, !88, !92, !95, !96}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !80, file: !78, line: 31, baseType: !83, size: 832)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 832, elements: !86)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !78, line: 31, flags: DIFlagFwdDecl)
!86 = !{!87}
!87 = !DISubrange(count: 13)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !80, file: !78, line: 34, baseType: !89, size: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !80, file: !78, line: 35, baseType: !93, size: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !80, file: !78, line: 36, baseType: !93, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !80, file: !78, line: 39, baseType: !97, size: 832, offset: 1024)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 832, elements: !86)
!98 = !{!69}
!99 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!100 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !75)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "file_name", scope: !103, file: !108, line: 46, type: !40, isLocal: true, isDefinition: true)
!103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !104, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, globals: !105)
!104 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!105 = !{!101, !106}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !103, file: !108, line: 56, type: !109, isLocal: true, isDefinition: true)
!108 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!109 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "exit_failure", scope: !112, file: !115, line: 24, type: !116, isDefinition: true)
!112 = distinct !DICompileUnit(language: DW_LANG_C99, file: !113, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, globals: !114)
!113 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!114 = !{!110}
!115 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !57)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "long_options", scope: !119, file: !122, line: 33, type: !123, isLocal: true, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, globals: !121)
!120 = !DIFile(filename: "./lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!121 = !{!117}
!122 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 768, elements: !131)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !53, line: 50, size: 256, elements: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !53, line: 52, baseType: !40, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !125, file: !53, line: 55, baseType: !57, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !53, line: 56, baseType: !59, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !125, file: !53, line: 57, baseType: !57, size: 32, offset: 192)
!131 = !{!132}
!132 = !DISubrange(count: 3)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "program_name", scope: !135, file: !139, line: 33, type: !40, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, retainedTypes: !137, globals: !138)
!136 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!137 = !{!43, !74}
!138 = !{!133}
!139 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !142, file: !171, line: 85, type: !206, isDefinition: true)
!142 = distinct !DICompileUnit(language: DW_LANG_C99, file: !143, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !144, retainedTypes: !165, globals: !168)
!143 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!144 = !{!11, !145, !150}
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !7, size: 32, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!148 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!149 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 46, baseType: !7, size: 32, elements: !152)
!151 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!153 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!154 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!155 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!156 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!157 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!158 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!159 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!164 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!165 = !{!57, !91, !166, !74}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !167, line: 62, baseType: !30)
!167 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!168 = !{!140, !169, !176, !188, !190, !195, !202, !204}
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !142, file: !171, line: 101, type: !172, isDefinition: true)
!171 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 320, elements: !174)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!174 = !{!175}
!175 = !DISubrange(count: 10)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !142, file: !171, line: 1052, type: !178, isDefinition: true)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !171, line: 65, size: 448, elements: !179)
!179 = !{!180, !181, !182, !186, !187}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !178, file: !171, line: 68, baseType: !11, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !178, file: !171, line: 71, baseType: !57, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !178, file: !171, line: 75, baseType: !183, size: 256, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !178, file: !171, line: 78, baseType: !40, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !178, file: !171, line: 81, baseType: !40, size: 64, offset: 384)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !142, file: !171, line: 116, type: !178, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "slot0", scope: !142, file: !171, line: 842, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 2048, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 256)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "slotvec", scope: !142, file: !171, line: 845, type: !197, isLocal: true, isDefinition: true)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !171, line: 834, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !198, file: !171, line: 836, baseType: !166, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !198, file: !171, line: 837, baseType: !74, size: 64, offset: 64)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "nslots", scope: !142, file: !171, line: 843, type: !57, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "slotvec0", scope: !142, file: !171, line: 844, type: !198, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 704, elements: !208)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!208 = !{!209}
!209 = !DISubrange(count: 11)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !212, file: !215, line: 26, type: !216, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, globals: !214)
!213 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!214 = !{!210}
!215 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 376, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 47)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, retainedTypes: !221)
!220 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!221 = !{!166, !40, !7, !57, !48}
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !224, retainedTypes: !229)
!223 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!224 = !{!225}
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 41, baseType: !7, size: 32, elements: !227)
!226 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!227 = !{!228}
!228 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!229 = !{!43}
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !232, retainedTypes: !246)
!231 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !235, file: !234, line: 186, baseType: !7, size: 32, elements: !244)
!234 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!235 = distinct !DISubprogram(name: "x2nrealloc", scope: !234, file: !234, line: 174, type: !236, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !230, retainedNodes: !239)
!236 = !DISubroutineType(types: !237)
!237 = !{!43, !43, !238, !166}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!239 = !{!240, !241, !242, !243}
!240 = !DILocalVariable(name: "p", arg: 1, scope: !235, file: !234, line: 174, type: !43)
!241 = !DILocalVariable(name: "pn", arg: 2, scope: !235, file: !234, line: 174, type: !238)
!242 = !DILocalVariable(name: "s", arg: 3, scope: !235, file: !234, line: 174, type: !166)
!243 = !DILocalVariable(name: "n", scope: !235, file: !234, line: 176, type: !166)
!244 = !{!245}
!245 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!246 = !{!166, !74, !43}
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67)
!248 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, retainedTypes: !229)
!250 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67)
!252 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, retainedTypes: !229)
!254 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, retainedTypes: !229)
!256 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67, retainedTypes: !259)
!258 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!259 = !{!166}
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !262, retainedTypes: !270)
!261 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!262 = !{!5, !263}
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !264, file: !234, line: 186, baseType: !7, size: 32, elements: !244)
!264 = distinct !DISubprogram(name: "x2nrealloc", scope: !234, file: !234, line: 174, type: !236, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !260, retainedNodes: !265)
!265 = !{!266, !267, !268, !269}
!266 = !DILocalVariable(name: "p", arg: 1, scope: !264, file: !234, line: 174, type: !43)
!267 = !DILocalVariable(name: "pn", arg: 2, scope: !264, file: !234, line: 174, type: !238)
!268 = !DILocalVariable(name: "s", arg: 3, scope: !264, file: !234, line: 174, type: !166)
!269 = !DILocalVariable(name: "n", scope: !264, file: !234, line: 176, type: !166)
!270 = !{!74, !43, !166}
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !273, retainedTypes: !278, globals: !279)
!272 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!273 = !{!274}
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 50, baseType: !7, size: 32, elements: !276)
!275 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!276 = !{!277}
!277 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!278 = !{!74, !166}
!279 = !{!280}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "local_tz", scope: !271, file: !275, line: 55, type: !282, isLocal: true, isDefinition: true)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !284, line: 742, baseType: !285)
!284 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !287, line: 21, size: 128, elements: !288)
!287 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !287, line: 25, baseType: !285, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !286, file: !287, line: 36, baseType: !42, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !286, file: !287, line: 48, baseType: !292, offset: 72)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: -1)
!295 = distinct !DICompileUnit(language: DW_LANG_C99, file: !296, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67)
!296 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !67)
!298 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !301, retainedTypes: !229)
!300 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!301 = !{!302}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 41, baseType: !7, size: 32, elements: !304)
!303 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!305 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!306 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!307 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!308 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!309 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!310 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!311 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!312 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!313 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!314 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!315 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!316 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!317 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!318 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!319 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!320 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!321 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!322 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!323 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!324 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!325 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!326 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!327 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!328 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!329 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!330 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!331 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!332 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!333 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!334 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!335 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!336 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!337 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!338 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!339 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!340 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!341 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!342 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!343 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!344 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!345 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!346 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!347 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!348 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!349 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!350 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!351 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!352 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!353 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!354 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!413 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!416 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!417 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!418 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!419 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!420 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!421 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!422 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!423 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!424 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!425 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!426 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!427 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!500 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!573 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!574 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!575 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!576 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!577 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!578 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!579 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!580 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!581 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!582 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!583 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!584 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!585 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!586 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!587 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!589 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!590 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!591 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!592 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!593 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!594 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!620 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!621 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!622 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!623 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!624 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!629 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!630 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!631 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!632 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!688 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!689 = !{i32 2, !"Dwarf Version", i32 4}
!690 = !{i32 2, !"Debug Info Version", i32 3}
!691 = !{i32 1, !"wchar_size", i32 4}
!692 = !{i32 7, !"PIC Level", i32 2}
!693 = !{i32 7, !"PIE Level", i32 2}
!694 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 198, type: !695, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !57}
!697 = !{!698}
!698 = !DILocalVariable(name: "status", arg: 1, scope: !694, file: !3, line: 198, type: !57)
!699 = !DILocalVariable(name: "infomap", scope: !700, file: !26, line: 632, type: !714)
!700 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !26, file: !26, line: 630, type: !701, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !703)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !40}
!703 = !{!704, !699, !705, !706, !713}
!704 = !DILocalVariable(name: "program", arg: 1, scope: !700, file: !26, line: 630, type: !40)
!705 = !DILocalVariable(name: "node", scope: !700, file: !26, line: 642, type: !40)
!706 = !DILocalVariable(name: "map_prog", scope: !700, file: !26, line: 643, type: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !700, file: !26, line: 632, size: 128, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !709, file: !26, line: 632, baseType: !40, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !709, file: !26, line: 632, baseType: !40, size: 64, offset: 64)
!713 = !DILocalVariable(name: "lc_messages", scope: !700, file: !26, line: 655, type: !40)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 896, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 7)
!717 = !DILocation(line: 632, column: 67, scope: !700, inlinedAt: !718)
!718 = distinct !DILocation(line: 226, column: 7, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 203, column: 5)
!720 = distinct !DILexicalBlock(scope: !694, file: !3, line: 200, column: 7)
!721 = !DILocation(line: 198, column: 12, scope: !694)
!722 = !DILocation(line: 200, column: 14, scope: !720)
!723 = !DILocation(line: 200, column: 7, scope: !694)
!724 = !DILocation(line: 201, column: 5, scope: !725)
!725 = distinct !DILexicalBlock(scope: !720, file: !3, line: 201, column: 5)
!726 = !{!727, !727, i64 0}
!727 = !{!"any pointer", !728, i64 0}
!728 = !{!"omnipotent char", !729, i64 0}
!729 = !{!"Simple C/C++ TBAA"}
!730 = !DILocation(line: 204, column: 7, scope: !719)
!731 = !DILocation(line: 205, column: 7, scope: !719)
!732 = !DILocation(line: 214, column: 7, scope: !719)
!733 = !DILocation(line: 220, column: 7, scope: !719)
!734 = !DILocation(line: 224, column: 7, scope: !719)
!735 = !DILocation(line: 225, column: 7, scope: !719)
!736 = !DILocation(line: 632, column: 3, scope: !700, inlinedAt: !718)
!737 = !DILocation(line: 643, column: 36, scope: !700, inlinedAt: !718)
!738 = !DILocation(line: 643, column: 25, scope: !700, inlinedAt: !718)
!739 = !DILocation(line: 645, column: 33, scope: !700, inlinedAt: !718)
!740 = !DILocation(line: 645, column: 3, scope: !700, inlinedAt: !718)
!741 = !DILocation(line: 646, column: 13, scope: !700, inlinedAt: !718)
!742 = !DILocation(line: 645, column: 20, scope: !700, inlinedAt: !718)
!743 = !{!744, !727, i64 0}
!744 = !{!"infomap", !727, i64 0, !727, i64 8}
!745 = !DILocation(line: 645, column: 10, scope: !700, inlinedAt: !718)
!746 = !DILocation(line: 645, column: 28, scope: !700, inlinedAt: !718)
!747 = distinct !{!747, !748, !749}
!748 = !DILocation(line: 645, column: 3, scope: !700)
!749 = !DILocation(line: 646, column: 13, scope: !700)
!750 = !DILocation(line: 648, column: 17, scope: !751, inlinedAt: !718)
!751 = distinct !DILexicalBlock(scope: !700, file: !26, line: 648, column: 7)
!752 = !{!744, !727, i64 8}
!753 = !DILocation(line: 648, column: 7, scope: !751, inlinedAt: !718)
!754 = !DILocation(line: 648, column: 7, scope: !700, inlinedAt: !718)
!755 = !DILocation(line: 642, column: 15, scope: !700, inlinedAt: !718)
!756 = !DILocation(line: 651, column: 3, scope: !700, inlinedAt: !718)
!757 = !DILocation(line: 655, column: 29, scope: !700, inlinedAt: !718)
!758 = !DILocation(line: 655, column: 15, scope: !700, inlinedAt: !718)
!759 = !DILocation(line: 656, column: 7, scope: !760, inlinedAt: !718)
!760 = distinct !DILexicalBlock(scope: !700, file: !26, line: 656, column: 7)
!761 = !DILocation(line: 656, column: 19, scope: !760, inlinedAt: !718)
!762 = !DILocation(line: 656, column: 22, scope: !760, inlinedAt: !718)
!763 = !DILocation(line: 656, column: 7, scope: !700, inlinedAt: !718)
!764 = !DILocation(line: 662, column: 7, scope: !765, inlinedAt: !718)
!765 = distinct !DILexicalBlock(scope: !760, file: !26, line: 657, column: 5)
!766 = !DILocation(line: 664, column: 5, scope: !765, inlinedAt: !718)
!767 = !DILocation(line: 665, column: 3, scope: !700, inlinedAt: !718)
!768 = !DILocation(line: 667, column: 3, scope: !700, inlinedAt: !718)
!769 = !DILocation(line: 669, column: 1, scope: !700, inlinedAt: !718)
!770 = !DILocation(line: 228, column: 3, scope: !694)
!771 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 232, type: !772, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !775)
!772 = !DISubroutineType(types: !773)
!773 = !{!57, !57, !774}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!775 = !{!776, !777}
!776 = !DILocalVariable(name: "argc", arg: 1, scope: !771, file: !3, line: 232, type: !57)
!777 = !DILocalVariable(name: "argv", arg: 2, scope: !771, file: !3, line: 232, type: !774)
!778 = !DILocation(line: 232, column: 11, scope: !771)
!779 = !DILocation(line: 232, column: 24, scope: !771)
!780 = !DILocation(line: 235, column: 21, scope: !771)
!781 = !DILocation(line: 235, column: 3, scope: !771)
!782 = !DILocation(line: 236, column: 3, scope: !771)
!783 = !DILocation(line: 237, column: 3, scope: !771)
!784 = !DILocation(line: 238, column: 3, scope: !771)
!785 = !DILocation(line: 240, column: 3, scope: !771)
!786 = !DILocation(line: 242, column: 63, scope: !771)
!787 = !DILocation(line: 242, column: 3, scope: !771)
!788 = !DILocation(line: 244, column: 7, scope: !789)
!789 = distinct !DILexicalBlock(scope: !771, file: !3, line: 244, column: 7)
!790 = !DILocation(line: 244, column: 56, scope: !789)
!791 = !DILocation(line: 244, column: 7, scope: !771)
!792 = !DILocation(line: 245, column: 5, scope: !789)
!793 = !DILocation(line: 247, column: 18, scope: !771)
!794 = !{!795, !795, i64 0}
!795 = !{!"int", !728, i64 0}
!796 = !DILocation(line: 247, column: 16, scope: !771)
!797 = !DILocation(line: 247, column: 3, scope: !771)
!798 = !DILocation(line: 250, column: 7, scope: !799)
!799 = distinct !DILexicalBlock(scope: !771, file: !3, line: 248, column: 5)
!800 = !DILocation(line: 251, column: 7, scope: !799)
!801 = !DILocation(line: 254, column: 15, scope: !799)
!802 = !DILocation(line: 254, column: 7, scope: !799)
!803 = !DILocation(line: 255, column: 7, scope: !799)
!804 = !DILocation(line: 258, column: 20, scope: !799)
!805 = !DILocation(line: 258, column: 55, scope: !799)
!806 = !DILocation(line: 258, column: 62, scope: !799)
!807 = !DILocation(line: 258, column: 50, scope: !799)
!808 = !DILocation(line: 258, column: 43, scope: !799)
!809 = !DILocation(line: 258, column: 7, scope: !799)
!810 = !DILocation(line: 259, column: 7, scope: !799)
!811 = !DILocation(line: 262, column: 3, scope: !771)
!812 = distinct !DISubprogram(name: "uptime", scope: !3, file: !3, line: 182, type: !813, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !40, !57}
!815 = !{!816, !817, !818, !819}
!816 = !DILocalVariable(name: "filename", arg: 1, scope: !812, file: !3, line: 182, type: !40)
!817 = !DILocalVariable(name: "options", arg: 2, scope: !812, file: !3, line: 182, type: !57)
!818 = !DILocalVariable(name: "n_users", scope: !812, file: !3, line: 184, type: !166)
!819 = !DILocalVariable(name: "utmp_buf", scope: !812, file: !3, line: 185, type: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !6, line: 146, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !823, line: 55, size: 3072, elements: !824)
!823 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!824 = !{!825, !827, !829, !833, !837, !838, !839, !844, !846, !851, !853}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !822, file: !823, line: 57, baseType: !826, size: 16)
!826 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !822, file: !823, line: 58, baseType: !828, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !34, line: 152, baseType: !57)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !822, file: !823, line: 59, baseType: !830, size: 256, offset: 64)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !822, file: !823, line: 60, baseType: !834, size: 32, offset: 320)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 4)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !822, file: !823, line: 61, baseType: !830, size: 256, offset: 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !822, file: !823, line: 62, baseType: !192, size: 2048, offset: 608)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !822, file: !823, line: 63, baseType: !840, size: 32, offset: 2656)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !823, line: 42, size: 32, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !840, file: !823, line: 45, baseType: !826, size: 16)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !840, file: !823, line: 46, baseType: !826, size: 16, offset: 16)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !822, file: !823, line: 70, baseType: !845, size: 32, offset: 2688)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !34, line: 40, baseType: !57)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !822, file: !823, line: 75, baseType: !847, size: 64, offset: 2720)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !822, file: !823, line: 71, size: 64, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !847, file: !823, line: 73, baseType: !845, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !847, file: !823, line: 74, baseType: !845, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !822, file: !823, line: 80, baseType: !852, size: 128, offset: 2784)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 128, elements: !835)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !822, file: !823, line: 81, baseType: !854, size: 160, offset: 2912)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 20)
!857 = !DILocalVariable(name: "avg", scope: !858, file: !3, line: 66, type: !951)
!858 = distinct !DISubprogram(name: "print_uptime", scope: !3, file: !3, line: 56, type: !859, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !863)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !166, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !857, !889, !890, !939, !945, !946, !949}
!864 = !DILocalVariable(name: "n", arg: 1, scope: !858, file: !3, line: 56, type: !166)
!865 = !DILocalVariable(name: "this", arg: 2, scope: !858, file: !3, line: 56, type: !861)
!866 = !DILocalVariable(name: "entries", scope: !858, file: !3, line: 58, type: !166)
!867 = !DILocalVariable(name: "boot_time", scope: !858, file: !3, line: 59, type: !44)
!868 = !DILocalVariable(name: "time_now", scope: !858, file: !3, line: 60, type: !44)
!869 = !DILocalVariable(name: "uptime", scope: !858, file: !3, line: 61, type: !44)
!870 = !DILocalVariable(name: "updays", scope: !858, file: !3, line: 62, type: !47)
!871 = !DILocalVariable(name: "uphours", scope: !858, file: !3, line: 63, type: !57)
!872 = !DILocalVariable(name: "upmins", scope: !858, file: !3, line: 64, type: !57)
!873 = !DILocalVariable(name: "tmn", scope: !858, file: !3, line: 65, type: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !876, line: 7, size: 448, elements: !877)
!876 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !875, file: !876, line: 9, baseType: !57, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !875, file: !876, line: 10, baseType: !57, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !875, file: !876, line: 11, baseType: !57, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !875, file: !876, line: 12, baseType: !57, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !875, file: !876, line: 13, baseType: !57, size: 32, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !875, file: !876, line: 14, baseType: !57, size: 32, offset: 160)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !875, file: !876, line: 15, baseType: !57, size: 32, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !875, file: !876, line: 16, baseType: !57, size: 32, offset: 224)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !875, file: !876, line: 17, baseType: !57, size: 32, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !875, file: !876, line: 20, baseType: !47, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !875, file: !876, line: 21, baseType: !40, size: 64, offset: 384)
!889 = !DILocalVariable(name: "loads", scope: !858, file: !3, line: 67, type: !57)
!890 = !DILocalVariable(name: "fp", scope: !858, file: !3, line: 69, type: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !893, line: 7, baseType: !894)
!893 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !895, line: 49, size: 1728, elements: !896)
!895 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !912, !914, !915, !916, !918, !919, !921, !923, !926, !928, !931, !934, !935, !936, !937, !938}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !894, file: !895, line: 51, baseType: !57, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !894, file: !895, line: 54, baseType: !74, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !894, file: !895, line: 55, baseType: !74, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !894, file: !895, line: 56, baseType: !74, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !894, file: !895, line: 57, baseType: !74, size: 64, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !894, file: !895, line: 58, baseType: !74, size: 64, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !894, file: !895, line: 59, baseType: !74, size: 64, offset: 384)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !894, file: !895, line: 60, baseType: !74, size: 64, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !894, file: !895, line: 61, baseType: !74, size: 64, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !894, file: !895, line: 64, baseType: !74, size: 64, offset: 576)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !894, file: !895, line: 65, baseType: !74, size: 64, offset: 640)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !894, file: !895, line: 66, baseType: !74, size: 64, offset: 704)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !894, file: !895, line: 68, baseType: !910, size: 64, offset: 768)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !895, line: 36, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !894, file: !895, line: 70, baseType: !913, size: 64, offset: 832)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !894, file: !895, line: 72, baseType: !57, size: 32, offset: 896)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !894, file: !895, line: 73, baseType: !57, size: 32, offset: 928)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !894, file: !895, line: 74, baseType: !917, size: 64, offset: 960)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 150, baseType: !47)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !894, file: !895, line: 77, baseType: !91, size: 16, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !894, file: !895, line: 78, baseType: !920, size: 8, offset: 1040)
!920 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !894, file: !895, line: 79, baseType: !922, size: 8, offset: 1048)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, elements: !61)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !894, file: !895, line: 81, baseType: !924, size: 64, offset: 1088)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !895, line: 43, baseType: null)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !894, file: !895, line: 89, baseType: !927, size: 64, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !34, line: 151, baseType: !47)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !894, file: !895, line: 91, baseType: !929, size: 64, offset: 1216)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !895, line: 37, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !894, file: !895, line: 92, baseType: !932, size: 64, offset: 1280)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !895, line: 38, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !894, file: !895, line: 93, baseType: !913, size: 64, offset: 1344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !894, file: !895, line: 94, baseType: !43, size: 64, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !894, file: !895, line: 95, baseType: !166, size: 64, offset: 1472)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !894, file: !895, line: 96, baseType: !57, size: 32, offset: 1536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !894, file: !895, line: 98, baseType: !854, size: 160, offset: 1568)
!939 = !DILocalVariable(name: "buf", scope: !940, file: !3, line: 74, type: !942)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 73, column: 5)
!941 = distinct !DILexicalBlock(scope: !858, file: !3, line: 72, column: 7)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 65536, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 8192)
!945 = !DILocalVariable(name: "b", scope: !940, file: !3, line: 75, type: !74)
!946 = !DILocalVariable(name: "end_ptr", scope: !947, file: !3, line: 78, type: !74)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 77, column: 9)
!948 = distinct !DILexicalBlock(scope: !940, file: !3, line: 76, column: 11)
!949 = !DILocalVariable(name: "upsecs", scope: !947, file: !3, line: 79, type: !950)
!950 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 192, elements: !131)
!952 = !DILocation(line: 66, column: 10, scope: !858, inlinedAt: !953)
!953 = distinct !DILocation(line: 192, column: 3, scope: !812)
!954 = !DILocation(line: 74, column: 12, scope: !940, inlinedAt: !953)
!955 = !DILocation(line: 182, column: 21, scope: !812)
!956 = !DILocation(line: 182, column: 35, scope: !812)
!957 = !DILocation(line: 184, column: 3, scope: !812)
!958 = !DILocation(line: 185, column: 3, scope: !812)
!959 = !DILocation(line: 185, column: 16, scope: !812)
!960 = !DILocation(line: 184, column: 10, scope: !812)
!961 = !DILocation(line: 188, column: 7, scope: !962)
!962 = distinct !DILexicalBlock(scope: !812, file: !3, line: 188, column: 7)
!963 = !DILocation(line: 188, column: 58, scope: !962)
!964 = !DILocation(line: 188, column: 7, scope: !812)
!965 = !DILocation(line: 189, column: 5, scope: !962)
!966 = !DILocation(line: 192, column: 17, scope: !812)
!967 = !{!968, !968, i64 0}
!968 = !{!"long", !728, i64 0}
!969 = !DILocation(line: 192, column: 26, scope: !812)
!970 = !DILocation(line: 56, column: 22, scope: !858, inlinedAt: !953)
!971 = !DILocation(line: 56, column: 44, scope: !858, inlinedAt: !953)
!972 = !DILocation(line: 58, column: 10, scope: !858, inlinedAt: !953)
!973 = !DILocation(line: 59, column: 10, scope: !858, inlinedAt: !953)
!974 = !DILocation(line: 60, column: 3, scope: !858, inlinedAt: !953)
!975 = !DILocation(line: 61, column: 10, scope: !858, inlinedAt: !953)
!976 = !DILocation(line: 66, column: 3, scope: !858, inlinedAt: !953)
!977 = !DILocation(line: 71, column: 8, scope: !858, inlinedAt: !953)
!978 = !DILocation(line: 69, column: 9, scope: !858, inlinedAt: !953)
!979 = !DILocation(line: 72, column: 10, scope: !941, inlinedAt: !953)
!980 = !DILocation(line: 72, column: 7, scope: !858, inlinedAt: !953)
!981 = !DILocation(line: 74, column: 7, scope: !940, inlinedAt: !953)
!982 = !DILocation(line: 75, column: 17, scope: !940, inlinedAt: !953)
!983 = !DILocation(line: 75, column: 13, scope: !940, inlinedAt: !953)
!984 = !DILocation(line: 76, column: 13, scope: !948, inlinedAt: !953)
!985 = !DILocation(line: 76, column: 11, scope: !940, inlinedAt: !953)
!986 = !DILocation(line: 78, column: 11, scope: !947, inlinedAt: !953)
!987 = !DILocation(line: 78, column: 17, scope: !947, inlinedAt: !953)
!988 = !DILocation(line: 79, column: 27, scope: !947, inlinedAt: !953)
!989 = !DILocation(line: 79, column: 18, scope: !947, inlinedAt: !953)
!990 = !DILocation(line: 80, column: 22, scope: !991, inlinedAt: !953)
!991 = distinct !DILexicalBlock(scope: !947, file: !3, line: 80, column: 15)
!992 = !DILocation(line: 80, column: 19, scope: !991, inlinedAt: !953)
!993 = !DILocation(line: 80, column: 15, scope: !947, inlinedAt: !953)
!994 = !DILocation(line: 81, column: 25, scope: !991, inlinedAt: !953)
!995 = !DILocation(line: 81, column: 45, scope: !991, inlinedAt: !953)
!996 = !DILocation(line: 81, column: 35, scope: !991, inlinedAt: !953)
!997 = !DILocation(line: 81, column: 22, scope: !991, inlinedAt: !953)
!998 = !DILocation(line: 81, column: 13, scope: !991, inlinedAt: !953)
!999 = !DILocation(scope: !858, inlinedAt: !953)
!1000 = !DILocation(line: 83, column: 9, scope: !948, inlinedAt: !953)
!1001 = !DILocation(line: 83, column: 9, scope: !947, inlinedAt: !953)
!1002 = !DILocation(line: 85, column: 7, scope: !940, inlinedAt: !953)
!1003 = !DILocation(line: 86, column: 5, scope: !941, inlinedAt: !953)
!1004 = !DILocation(line: 86, column: 5, scope: !940, inlinedAt: !953)
!1005 = !DILocation(line: 113, column: 3, scope: !858, inlinedAt: !953)
!1006 = !DILocation(line: 113, column: 11, scope: !858, inlinedAt: !953)
!1007 = !DILocation(line: 115, column: 18, scope: !1008, inlinedAt: !953)
!1008 = distinct !DILexicalBlock(scope: !858, file: !3, line: 114, column: 5)
!1009 = !{!728, !728, i64 0}
!1010 = !DILocation(scope: !1008, inlinedAt: !953)
!1011 = !{!1012, !1013, i64 0}
!1012 = !{!"utmpx", !1013, i64 0, !795, i64 4, !728, i64 8, !728, i64 40, !728, i64 44, !728, i64 76, !1014, i64 332, !795, i64 336, !1015, i64 340, !728, i64 348, !728, i64 364}
!1013 = !{!"short", !728, i64 0}
!1014 = !{!"__exit_status", !1013, i64 0, !1013, i64 2}
!1015 = !{!"", !795, i64 0, !795, i64 4}
!1016 = !DILocation(line: 115, column: 15, scope: !1008, inlinedAt: !953)
!1017 = !DILocation(line: 116, column: 11, scope: !1018, inlinedAt: !953)
!1018 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 116, column: 11)
!1019 = !DILocation(line: 116, column: 11, scope: !1008, inlinedAt: !953)
!1020 = !DILocation(line: 117, column: 21, scope: !1018, inlinedAt: !953)
!1021 = !{!1012, !795, i64 340}
!1022 = !DILocation(line: 117, column: 9, scope: !1018, inlinedAt: !953)
!1023 = !DILocation(scope: !1018, inlinedAt: !953)
!1024 = !DILocation(line: 125, column: 14, scope: !858, inlinedAt: !953)
!1025 = !DILocation(line: 60, column: 10, scope: !858, inlinedAt: !953)
!1026 = !DILocation(line: 125, column: 12, scope: !858, inlinedAt: !953)
!1027 = !DILocation(line: 127, column: 14, scope: !1028, inlinedAt: !953)
!1028 = distinct !DILexicalBlock(scope: !858, file: !3, line: 127, column: 7)
!1029 = !DILocation(line: 127, column: 7, scope: !858, inlinedAt: !953)
!1030 = !DILocation(line: 130, column: 21, scope: !1031, inlinedAt: !953)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 130, column: 11)
!1032 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 129, column: 5)
!1033 = !DILocation(line: 130, column: 11, scope: !1032, inlinedAt: !953)
!1034 = !DILocation(line: 131, column: 9, scope: !1031, inlinedAt: !953)
!1035 = !DILocation(line: 132, column: 25, scope: !1032, inlinedAt: !953)
!1036 = !DILocation(line: 133, column: 5, scope: !1032, inlinedAt: !953)
!1037 = !DILocation(scope: !991, inlinedAt: !953)
!1038 = !DILocation(line: 134, column: 19, scope: !858, inlinedAt: !953)
!1039 = !DILocation(line: 62, column: 12, scope: !858, inlinedAt: !953)
!1040 = !DILocation(line: 135, column: 21, scope: !858, inlinedAt: !953)
!1041 = !DILocation(line: 135, column: 41, scope: !858, inlinedAt: !953)
!1042 = !DILocation(line: 135, column: 13, scope: !858, inlinedAt: !953)
!1043 = !DILocation(line: 63, column: 7, scope: !858, inlinedAt: !953)
!1044 = !DILocation(line: 136, column: 41, scope: !858, inlinedAt: !953)
!1045 = !DILocation(line: 136, column: 39, scope: !858, inlinedAt: !953)
!1046 = !DILocation(line: 136, column: 59, scope: !858, inlinedAt: !953)
!1047 = !DILocation(line: 136, column: 12, scope: !858, inlinedAt: !953)
!1048 = !DILocation(line: 64, column: 7, scope: !858, inlinedAt: !953)
!1049 = !DILocation(line: 137, column: 9, scope: !858, inlinedAt: !953)
!1050 = !DILocation(line: 65, column: 14, scope: !858, inlinedAt: !953)
!1051 = !DILocation(line: 140, column: 7, scope: !1052, inlinedAt: !953)
!1052 = distinct !DILexicalBlock(scope: !858, file: !3, line: 140, column: 7)
!1053 = !DILocation(line: 140, column: 7, scope: !858, inlinedAt: !953)
!1054 = !DILocation(line: 142, column: 18, scope: !1052, inlinedAt: !953)
!1055 = !DILocation(line: 142, column: 26, scope: !1052, inlinedAt: !953)
!1056 = !DILocation(line: 142, column: 5, scope: !1052, inlinedAt: !953)
!1057 = !DILocation(line: 144, column: 5, scope: !1052, inlinedAt: !953)
!1058 = !DILocation(line: 145, column: 14, scope: !1059, inlinedAt: !953)
!1059 = distinct !DILexicalBlock(scope: !858, file: !3, line: 145, column: 7)
!1060 = !DILocation(line: 145, column: 7, scope: !858, inlinedAt: !953)
!1061 = !DILocation(line: 146, column: 5, scope: !1059, inlinedAt: !953)
!1062 = !DILocation(line: 149, column: 13, scope: !1063, inlinedAt: !953)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 149, column: 11)
!1064 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 148, column: 5)
!1065 = !DILocation(line: 149, column: 11, scope: !1064, inlinedAt: !953)
!1066 = !DILocation(line: 150, column: 9, scope: !1063, inlinedAt: !953)
!1067 = !DILocation(line: 155, column: 9, scope: !1063, inlinedAt: !953)
!1068 = !DILocation(line: 157, column: 3, scope: !858, inlinedAt: !953)
!1069 = !DILocation(line: 160, column: 23, scope: !858, inlinedAt: !953)
!1070 = !DILocation(line: 160, column: 11, scope: !858, inlinedAt: !953)
!1071 = !DILocation(line: 67, column: 7, scope: !858, inlinedAt: !953)
!1072 = !DILocation(line: 162, column: 13, scope: !1073, inlinedAt: !953)
!1073 = distinct !DILexicalBlock(scope: !858, file: !3, line: 162, column: 7)
!1074 = !DILocation(line: 162, column: 7, scope: !858, inlinedAt: !953)
!1075 = !DILocalVariable(name: "__c", arg: 1, scope: !1076, file: !1077, line: 108, type: !57)
!1076 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1077, file: !1077, line: 108, type: !1078, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1080)
!1077 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!57, !57}
!1080 = !{!1075}
!1081 = !DILocation(line: 108, column: 23, scope: !1076, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 163, column: 5, scope: !1073, inlinedAt: !953)
!1083 = !DILocation(line: 110, column: 10, scope: !1076, inlinedAt: !1082)
!1084 = !{!1085, !727, i64 40}
!1085 = !{!"_IO_FILE", !795, i64 0, !727, i64 8, !727, i64 16, !727, i64 24, !727, i64 32, !727, i64 40, !727, i64 48, !727, i64 56, !727, i64 64, !727, i64 72, !727, i64 80, !727, i64 88, !727, i64 96, !727, i64 104, !795, i64 112, !795, i64 116, !968, i64 120, !1013, i64 128, !728, i64 130, !728, i64 131, !727, i64 136, !968, i64 144, !727, i64 152, !727, i64 160, !727, i64 168, !727, i64 176, !968, i64 184, !795, i64 192, !728, i64 196}
!1086 = !{!1085, !727, i64 48}
!1087 = !{!"branch_weights", i32 2000, i32 1}
!1088 = !DILocation(line: 166, column: 17, scope: !1089, inlinedAt: !953)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 166, column: 11)
!1090 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 165, column: 5)
!1091 = !DILocation(line: 166, column: 11, scope: !1090, inlinedAt: !953)
!1092 = !DILocation(line: 167, column: 9, scope: !1089, inlinedAt: !953)
!1093 = !{!1094, !1094, i64 0}
!1094 = !{!"double", !728, i64 0}
!1095 = !DILocation(line: 168, column: 17, scope: !1096, inlinedAt: !953)
!1096 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 168, column: 11)
!1097 = !DILocation(line: 168, column: 11, scope: !1090, inlinedAt: !953)
!1098 = !DILocation(line: 169, column: 9, scope: !1096, inlinedAt: !953)
!1099 = !DILocation(line: 170, column: 17, scope: !1100, inlinedAt: !953)
!1100 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 170, column: 11)
!1101 = !DILocation(line: 170, column: 11, scope: !1090, inlinedAt: !953)
!1102 = !DILocation(line: 171, column: 9, scope: !1100, inlinedAt: !953)
!1103 = !DILocation(line: 108, column: 23, scope: !1076, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 173, column: 9, scope: !1105, inlinedAt: !953)
!1105 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 172, column: 11)
!1106 = !DILocation(line: 110, column: 10, scope: !1076, inlinedAt: !1104)
!1107 = !DILocation(line: 175, column: 1, scope: !858, inlinedAt: !953)
!1108 = !DILocation(line: 195, column: 1, scope: !812)
!1109 = !DILocation(line: 118, column: 7, scope: !1008, inlinedAt: !953)
!1110 = distinct !{!1110, !1111, !1112}
!1111 = !DILocation(line: 113, column: 3, scope: !858)
!1112 = !DILocation(line: 119, column: 5, scope: !858)
!1113 = distinct !DISubprogram(name: "c_strtod", scope: !99, file: !99, line: 66, type: !1114, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !71, retainedNodes: !1116)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!950, !40, !774}
!1116 = !{!1117, !1118, !1119, !1120}
!1117 = !DILocalVariable(name: "nptr", arg: 1, scope: !1113, file: !99, line: 66, type: !40)
!1118 = !DILocalVariable(name: "endptr", arg: 2, scope: !1113, file: !99, line: 66, type: !774)
!1119 = !DILocalVariable(name: "r", scope: !1113, file: !99, line: 68, type: !950)
!1120 = !DILocalVariable(name: "locale", scope: !1113, file: !99, line: 72, type: !75)
!1121 = !DILocation(line: 66, column: 23, scope: !1113)
!1122 = !DILocation(line: 66, column: 36, scope: !1113)
!1123 = !DILocation(line: 58, column: 8, scope: !1124, inlinedAt: !1128)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !99, line: 58, column: 7)
!1125 = distinct !DISubprogram(name: "c_locale", scope: !99, file: !99, line: 56, type: !1126, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !71, retainedNodes: !67)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!75}
!1128 = distinct !DILocation(line: 72, column: 21, scope: !1113)
!1129 = !DILocation(line: 58, column: 7, scope: !1125, inlinedAt: !1128)
!1130 = !DILocation(line: 59, column: 22, scope: !1124, inlinedAt: !1128)
!1131 = !DILocation(line: 59, column: 20, scope: !1124, inlinedAt: !1128)
!1132 = !DILocation(line: 59, column: 5, scope: !1124, inlinedAt: !1128)
!1133 = !DILocation(line: 60, column: 10, scope: !1125, inlinedAt: !1128)
!1134 = !DILocation(line: 72, column: 12, scope: !1113)
!1135 = !DILocation(line: 73, column: 8, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1113, file: !99, line: 73, column: 7)
!1137 = !DILocation(line: 73, column: 7, scope: !1113)
!1138 = !DILocation(line: 75, column: 11, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !99, line: 75, column: 11)
!1140 = distinct !DILexicalBlock(scope: !1136, file: !99, line: 74, column: 5)
!1141 = !DILocation(line: 75, column: 11, scope: !1140)
!1142 = !DILocation(line: 76, column: 17, scope: !1139)
!1143 = !DILocation(line: 76, column: 9, scope: !1139)
!1144 = !DILocation(line: 80, column: 7, scope: !1113)
!1145 = !DILocation(line: 68, column: 10, scope: !1113)
!1146 = !DILocation(line: 111, column: 3, scope: !1113)
!1147 = !DILocation(scope: !1140)
!1148 = !DILocation(line: 112, column: 1, scope: !1113)
!1149 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !108, file: !108, line: 51, type: !701, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !103, retainedNodes: !1150)
!1150 = !{!1151}
!1151 = !DILocalVariable(name: "file", arg: 1, scope: !1149, file: !108, line: 51, type: !40)
!1152 = !DILocation(line: 51, column: 41, scope: !1149)
!1153 = !DILocation(line: 53, column: 13, scope: !1149)
!1154 = !DILocation(line: 54, column: 1, scope: !1149)
