; ModuleID = 'coreutils-8.32/src/uptime.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Version", scope: !2, file: !3, line: 2, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !11, file: !12, line: 50, type: !40, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !39, splitDebugInlining: false, nameTableKind: None)
!12 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !16, line: 24, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !18, line: 42, baseType: !19)
!18 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !18, line: 28, size: 1856, elements: !21)
!21 = !{!22, !28, !32, !36, !37}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !20, file: !18, line: 31, baseType: !23, size: 832)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 832, elements: !26)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !18, line: 31, flags: DIFlagFwdDecl)
!26 = !{!27}
!27 = !DISubrange(count: 13)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !20, file: !18, line: 34, baseType: !29, size: 64, offset: 832)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !20, file: !18, line: 35, baseType: !33, size: 64, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !20, file: !18, line: 36, baseType: !33, size: 64, offset: 960)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !20, file: !18, line: 39, baseType: !38, size: 832, offset: 1024)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !26)
!39 = !{!9}
!40 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !15)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "file_name", scope: !43, file: !44, line: 46, type: !6, isLocal: true, isDefinition: true)
!43 = distinct !DICompileUnit(language: DW_LANG_C99, file: !44, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !45, splitDebugInlining: false, nameTableKind: None)
!44 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!45 = !{!41, !46}
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !43, file: !44, line: 56, type: !48, isLocal: true, isDefinition: true)
!48 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "exit_failure", scope: !51, file: !52, line: 24, type: !54, isLocal: false, isDefinition: true)
!51 = distinct !DICompileUnit(language: DW_LANG_C99, file: !52, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !53, splitDebugInlining: false, nameTableKind: None)
!52 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!53 = !{!49}
!54 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "long_options", scope: !57, file: !58, line: 34, type: !60, isLocal: true, isDefinition: true)
!57 = distinct !DICompileUnit(language: DW_LANG_C99, file: !58, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !59, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!59 = !{!55}
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !70)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !63, line: 50, size: 256, elements: !64)
!63 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!64 = !{!65, !66, !67, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !63, line: 52, baseType: !6, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !62, file: !63, line: 55, baseType: !35, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !62, file: !63, line: 56, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !62, file: !63, line: 57, baseType: !35, size: 32, offset: 192)
!70 = !{!71}
!71 = !DISubrange(count: 3)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "program_name", scope: !74, file: !75, line: 33, type: !6, isLocal: false, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !76, globals: !78, splitDebugInlining: false, nameTableKind: None)
!75 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{!77, !14}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!78 = !{!72}
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !81, file: !82, line: 85, type: !160, isLocal: false, isDefinition: true)
!81 = distinct !DICompileUnit(language: DW_LANG_C99, file: !82, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !83, retainedTypes: !119, globals: !123, splitDebugInlining: false, nameTableKind: None)
!82 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!83 = !{!84, !99, !104}
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !85, line: 32, baseType: !86, size: 32, elements: !87)
!85 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!86 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!88 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!92 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!94 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!95 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!96 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!97 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!98 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !85, line: 242, baseType: !86, size: 32, elements: !100)
!100 = !{!101, !102, !103}
!101 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 46, baseType: !86, size: 32, elements: !106)
!105 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!107 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!108 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!109 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!110 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!111 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!112 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!119 = !{!35, !31, !120, !14}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 46, baseType: !122)
!121 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!122 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!123 = !{!79, !124, !130, !142, !144, !149, !156, !158}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !81, file: !82, line: 101, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 320, elements: !128)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!128 = !{!129}
!129 = !DISubrange(count: 10)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !81, file: !82, line: 1052, type: !132, isLocal: false, isDefinition: true)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !82, line: 65, size: 448, elements: !133)
!133 = !{!134, !135, !136, !140, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !132, file: !82, line: 68, baseType: !84, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !82, line: 71, baseType: !35, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !132, file: !82, line: 75, baseType: !137, size: 256, offset: 64)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 256, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !132, file: !82, line: 78, baseType: !6, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !132, file: !82, line: 81, baseType: !6, size: 64, offset: 384)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !81, file: !82, line: 116, type: !132, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "slot0", scope: !81, file: !82, line: 842, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 256)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "slotvec", scope: !81, file: !82, line: 845, type: !151, isLocal: true, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !82, line: 834, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !82, line: 836, baseType: !120, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !152, file: !82, line: 837, baseType: !14, size: 64, offset: 64)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "nslots", scope: !81, file: !82, line: 843, type: !35, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "slotvec0", scope: !81, file: !82, line: 844, type: !152, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 704, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!162 = !{!163}
!163 = !DISubrange(count: 11)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !166, file: !167, line: 26, type: !169, isLocal: false, isDefinition: true)
!166 = distinct !DICompileUnit(language: DW_LANG_C99, file: !167, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !168, splitDebugInlining: false, nameTableKind: None)
!167 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!168 = !{!164}
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 47)
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !193, splitDebugInlining: false, nameTableKind: None)
!173 = !DIFile(filename: "src/uptime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!174 = !{!175, !84, !180}
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !176, line: 208, baseType: !86, size: 32, elements: !177)
!176 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!178, !179}
!178 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1, isUnsigned: true)
!179 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2, isUnsigned: true)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !182, file: !181, line: 187, baseType: !86, size: 32, elements: !191)
!181 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!182 = distinct !DISubprogram(name: "select_plural", scope: !181, file: !181, line: 183, type: !183, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !189)
!183 = !DISubroutineType(types: !184)
!184 = !{!122, !185}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !186, line: 102, baseType: !187)
!186 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !188, line: 73, baseType: !122)
!188 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!189 = !{!190}
!190 = !DILocalVariable(name: "n", arg: 1, scope: !182, file: !181, line: 183, type: !185)
!191 = !{!192}
!192 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!193 = !{!6, !77, !194, !122, !198}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !195, line: 7, baseType: !196)
!195 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !188, line: 160, baseType: !197)
!197 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!198 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !200, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !201, splitDebugInlining: false, nameTableKind: None)
!200 = !DIFile(filename: "lib/fprintftime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !{!120, !6, !86, !35, !202, !198, !203, !31, !197, !122, !204, !205}
!202 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!204 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!205 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !{!209}
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !207, line: 40, baseType: !86, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!212 = !{!77}
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !215, retainedTypes: !229, splitDebugInlining: false, nameTableKind: None)
!214 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!216}
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !218, file: !217, line: 186, baseType: !86, size: 32, elements: !227)
!217 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!218 = distinct !DISubprogram(name: "x2nrealloc", scope: !217, file: !217, line: 174, type: !219, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !213, retainedNodes: !222)
!219 = !DISubroutineType(types: !220)
!220 = !{!77, !77, !221, !120}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!222 = !{!223, !224, !225, !226}
!223 = !DILocalVariable(name: "p", arg: 1, scope: !218, file: !217, line: 174, type: !77)
!224 = !DILocalVariable(name: "pn", arg: 2, scope: !218, file: !217, line: 174, type: !221)
!225 = !DILocalVariable(name: "s", arg: 3, scope: !218, file: !217, line: 174, type: !120)
!226 = !DILocalVariable(name: "n", scope: !218, file: !217, line: 176, type: !120)
!227 = !{!228}
!228 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!229 = !{!120, !14, !77}
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !242, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!242 = !{!120}
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !245, retainedTypes: !253, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "lib/readutmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !{!175, !246}
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !247, file: !217, line: 186, baseType: !86, size: 32, elements: !227)
!247 = distinct !DISubprogram(name: "x2nrealloc", scope: !217, file: !217, line: 174, type: !219, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !243, retainedNodes: !248)
!248 = !{!249, !250, !251, !252}
!249 = !DILocalVariable(name: "p", arg: 1, scope: !247, file: !217, line: 174, type: !77)
!250 = !DILocalVariable(name: "pn", arg: 2, scope: !247, file: !217, line: 174, type: !221)
!251 = !DILocalVariable(name: "s", arg: 3, scope: !247, file: !217, line: 174, type: !120)
!252 = !DILocalVariable(name: "n", scope: !247, file: !217, line: 176, type: !120)
!253 = !{!14, !77, !120}
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !260, globals: !261, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !{!257}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 50, baseType: !86, size: 32, elements: !258)
!258 = !{!259}
!259 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!260 = !{!14, !120}
!261 = !{!262}
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "local_tz", scope: !254, file: !255, line: 55, type: !264, isLocal: true, isDefinition: true)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !266, line: 778, baseType: !267)
!266 = !DIFile(filename: "./lib/time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !269, line: 21, size: 128, elements: !270)
!269 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = !{!271, !272, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !269, line: 25, baseType: !267, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !268, file: !269, line: 36, baseType: !8, size: 8, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !268, file: !269, line: 48, baseType: !274, offset: 72)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: -1)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!280 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !283, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!283 = !{!284}
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 41, baseType: !86, size: 32, elements: !286)
!285 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!287 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!288 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!289 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!290 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!291 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!292 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!293 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!294 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!295 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!296 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!297 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!298 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!299 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!300 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!304 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!305 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!306 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!307 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!308 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!309 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!310 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!311 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!312 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!316 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!317 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!318 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!319 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!320 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!321 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!322 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!323 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!324 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!325 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!326 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!327 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!328 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!329 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!330 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!331 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!332 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!333 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!334 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!335 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!336 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!395 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!401 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!402 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!403 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!404 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!405 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!406 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!407 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!408 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!409 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!482 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!555 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!556 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!557 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!558 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!559 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!560 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!561 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!562 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!563 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!564 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!565 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!566 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!567 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!568 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!569 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!571 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!572 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!573 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!574 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!575 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!576 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!602 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!603 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!604 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!605 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!606 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!611 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!612 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!613 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!614 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!672 = !{!"clang version 12.0.1"}
!673 = !{i32 7, !"Dwarf Version", i32 4}
!674 = !{i32 2, !"Debug Info Version", i32 3}
!675 = !{i32 1, !"wchar_size", i32 4}
!676 = !{i32 7, !"PIC Level", i32 2}
!677 = !{i32 7, !"PIE Level", i32 2}
!678 = distinct !DISubprogram(name: "usage", scope: !173, file: !173, line: 193, type: !679, scopeLine: 194, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !35}
!681 = !{!682}
!682 = !DILocalVariable(name: "status", arg: 1, scope: !678, file: !173, line: 193, type: !35)
!683 = !DILocation(line: 0, scope: !678)
!684 = !DILocation(line: 195, column: 14, scope: !685)
!685 = distinct !DILexicalBlock(scope: !678, file: !173, line: 195, column: 7)
!686 = !DILocation(line: 195, column: 7, scope: !678)
!687 = !DILocation(line: 196, column: 5, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !173, line: 196, column: 5)
!689 = !{!690, !690, i64 0}
!690 = !{!"any pointer", !691, i64 0}
!691 = !{!"omnipotent char", !692, i64 0}
!692 = !{!"Simple C/C++ TBAA"}
!693 = !DILocation(line: 199, column: 7, scope: !694)
!694 = distinct !DILexicalBlock(scope: !685, file: !173, line: 198, column: 5)
!695 = !DILocation(line: 200, column: 7, scope: !694)
!696 = !DILocation(line: 209, column: 7, scope: !694)
!697 = !DILocation(line: 215, column: 7, scope: !694)
!698 = !DILocation(line: 219, column: 7, scope: !694)
!699 = !DILocation(line: 220, column: 7, scope: !694)
!700 = !DILocalVariable(name: "program", arg: 1, scope: !701, file: !181, line: 634, type: !6)
!701 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !181, file: !181, line: 634, type: !702, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !704)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !6}
!704 = !{!700, !705, !714, !715, !717}
!705 = !DILocalVariable(name: "infomap", scope: !701, file: !181, line: 636, type: !706)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 896, elements: !712)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !701, file: !181, line: 636, size: 128, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !708, file: !181, line: 636, baseType: !6, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !708, file: !181, line: 636, baseType: !6, size: 64, offset: 64)
!712 = !{!713}
!713 = !DISubrange(count: 7)
!714 = !DILocalVariable(name: "node", scope: !701, file: !181, line: 646, type: !6)
!715 = !DILocalVariable(name: "map_prog", scope: !701, file: !181, line: 647, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!717 = !DILocalVariable(name: "lc_messages", scope: !701, file: !181, line: 659, type: !6)
!718 = !DILocation(line: 0, scope: !701, inlinedAt: !719)
!719 = distinct !DILocation(line: 221, column: 7, scope: !694)
!720 = !DILocation(line: 636, column: 3, scope: !701, inlinedAt: !719)
!721 = !DILocation(line: 636, column: 67, scope: !701, inlinedAt: !719)
!722 = !DILocation(line: 647, column: 36, scope: !701, inlinedAt: !719)
!723 = !DILocation(line: 649, column: 3, scope: !701, inlinedAt: !719)
!724 = !DILocation(line: 649, column: 33, scope: !701, inlinedAt: !719)
!725 = !DILocation(line: 650, column: 13, scope: !701, inlinedAt: !719)
!726 = !DILocation(line: 649, column: 20, scope: !701, inlinedAt: !719)
!727 = !{!728, !690, i64 0}
!728 = !{!"infomap", !690, i64 0, !690, i64 8}
!729 = !DILocation(line: 649, column: 10, scope: !701, inlinedAt: !719)
!730 = !DILocation(line: 649, column: 28, scope: !701, inlinedAt: !719)
!731 = distinct !{!731, !723, !725, !732}
!732 = !{!"llvm.loop.mustprogress"}
!733 = !DILocation(line: 652, column: 17, scope: !734, inlinedAt: !719)
!734 = distinct !DILexicalBlock(scope: !701, file: !181, line: 652, column: 7)
!735 = !{!728, !690, i64 8}
!736 = !DILocation(line: 652, column: 7, scope: !734, inlinedAt: !719)
!737 = !DILocation(line: 652, column: 7, scope: !701, inlinedAt: !719)
!738 = !DILocation(line: 655, column: 3, scope: !701, inlinedAt: !719)
!739 = !DILocation(line: 659, column: 29, scope: !701, inlinedAt: !719)
!740 = !DILocation(line: 660, column: 7, scope: !741, inlinedAt: !719)
!741 = distinct !DILexicalBlock(scope: !701, file: !181, line: 660, column: 7)
!742 = !DILocation(line: 660, column: 19, scope: !741, inlinedAt: !719)
!743 = !DILocation(line: 660, column: 22, scope: !741, inlinedAt: !719)
!744 = !DILocation(line: 660, column: 7, scope: !701, inlinedAt: !719)
!745 = !DILocation(line: 666, column: 7, scope: !746, inlinedAt: !719)
!746 = distinct !DILexicalBlock(scope: !741, file: !181, line: 661, column: 5)
!747 = !DILocation(line: 668, column: 5, scope: !746, inlinedAt: !719)
!748 = !DILocation(line: 669, column: 3, scope: !701, inlinedAt: !719)
!749 = !DILocation(line: 671, column: 3, scope: !701, inlinedAt: !719)
!750 = !DILocation(line: 673, column: 1, scope: !701, inlinedAt: !719)
!751 = !DILocation(line: 223, column: 3, scope: !678)
!752 = !DISubprogram(name: "dcgettext", scope: !753, file: !753, line: 51, type: !754, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!753 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!754 = !DISubroutineType(types: !755)
!755 = !{!14, !6, !6, !35}
!756 = !DISubprogram(name: "fputs_unlocked", scope: !757, file: !757, line: 667, type: !758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!757 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!758 = !DISubroutineType(types: !759)
!759 = !{!35, !6, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !762, line: 49, size: 1728, elements: !763)
!762 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !779, !780, !781, !782, !784, !785, !786, !790, !793, !795, !798, !801, !802, !803, !804, !805}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !761, file: !762, line: 51, baseType: !35, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !761, file: !762, line: 54, baseType: !14, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !761, file: !762, line: 55, baseType: !14, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !761, file: !762, line: 56, baseType: !14, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !761, file: !762, line: 57, baseType: !14, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !761, file: !762, line: 58, baseType: !14, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !761, file: !762, line: 59, baseType: !14, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !761, file: !762, line: 60, baseType: !14, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !761, file: !762, line: 61, baseType: !14, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !761, file: !762, line: 64, baseType: !14, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !761, file: !762, line: 65, baseType: !14, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !761, file: !762, line: 66, baseType: !14, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !761, file: !762, line: 68, baseType: !777, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !762, line: 36, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !761, file: !762, line: 70, baseType: !760, size: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !761, file: !762, line: 72, baseType: !35, size: 32, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !761, file: !762, line: 73, baseType: !35, size: 32, offset: 928)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !761, file: !762, line: 74, baseType: !783, size: 64, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !188, line: 152, baseType: !197)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !761, file: !762, line: 77, baseType: !31, size: 16, offset: 1024)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !761, file: !762, line: 78, baseType: !202, size: 8, offset: 1040)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !761, file: !762, line: 79, baseType: !787, size: 8, offset: 1048)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 1)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !761, file: !762, line: 81, baseType: !791, size: 64, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !762, line: 43, baseType: null)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !761, file: !762, line: 89, baseType: !794, size: 64, offset: 1152)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !188, line: 153, baseType: !197)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !761, file: !762, line: 91, baseType: !796, size: 64, offset: 1216)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !762, line: 37, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !761, file: !762, line: 92, baseType: !799, size: 64, offset: 1280)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !762, line: 38, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !761, file: !762, line: 93, baseType: !760, size: 64, offset: 1344)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !761, file: !762, line: 94, baseType: !77, size: 64, offset: 1408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !761, file: !762, line: 95, baseType: !120, size: 64, offset: 1472)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !761, file: !762, line: 96, baseType: !35, size: 32, offset: 1536)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !761, file: !762, line: 98, baseType: !806, size: 160, offset: 1568)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 20)
!809 = !DISubprogram(name: "setlocale", scope: !810, file: !810, line: 122, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!810 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!811 = !DISubroutineType(types: !812)
!812 = !{!14, !35, !6}
!813 = distinct !DISubprogram(name: "main", scope: !173, file: !173, line: 227, type: !814, scopeLine: 228, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !817)
!814 = !DISubroutineType(types: !815)
!815 = !{!35, !35, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!817 = !{!818, !819}
!818 = !DILocalVariable(name: "argc", arg: 1, scope: !813, file: !173, line: 227, type: !35)
!819 = !DILocalVariable(name: "argv", arg: 2, scope: !813, file: !173, line: 227, type: !816)
!820 = !DILocation(line: 0, scope: !813)
!821 = !DILocation(line: 230, column: 21, scope: !813)
!822 = !DILocation(line: 230, column: 3, scope: !813)
!823 = !DILocation(line: 231, column: 3, scope: !813)
!824 = !DILocation(line: 232, column: 3, scope: !813)
!825 = !DILocation(line: 233, column: 3, scope: !813)
!826 = !DILocation(line: 235, column: 3, scope: !813)
!827 = !DILocation(line: 238, column: 36, scope: !813)
!828 = !DILocation(line: 237, column: 3, scope: !813)
!829 = !DILocation(line: 241, column: 18, scope: !813)
!830 = !{!831, !831, i64 0}
!831 = !{!"int", !691, i64 0}
!832 = !DILocation(line: 241, column: 16, scope: !813)
!833 = !DILocation(line: 241, column: 3, scope: !813)
!834 = !DILocation(line: 244, column: 7, scope: !835)
!835 = distinct !DILexicalBlock(scope: !813, file: !173, line: 242, column: 5)
!836 = !DILocation(line: 245, column: 7, scope: !835)
!837 = !DILocation(line: 248, column: 15, scope: !835)
!838 = !DILocation(line: 248, column: 7, scope: !835)
!839 = !DILocation(line: 249, column: 7, scope: !835)
!840 = !DILocation(line: 252, column: 20, scope: !835)
!841 = !DILocation(line: 252, column: 55, scope: !835)
!842 = !DILocation(line: 252, column: 62, scope: !835)
!843 = !DILocation(line: 252, column: 50, scope: !835)
!844 = !DILocation(line: 252, column: 43, scope: !835)
!845 = !DILocation(line: 252, column: 7, scope: !835)
!846 = !DILocation(line: 253, column: 7, scope: !835)
!847 = !DILocation(line: 256, column: 3, scope: !813)
!848 = !DISubprogram(name: "bindtextdomain", scope: !753, file: !753, line: 86, type: !849, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!849 = !DISubroutineType(types: !850)
!850 = !{!14, !6, !6}
!851 = !DISubprogram(name: "textdomain", scope: !753, file: !753, line: 82, type: !852, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!852 = !DISubroutineType(types: !853)
!853 = !{!14, !6}
!854 = !DISubprogram(name: "atexit", scope: !855, file: !855, line: 595, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!855 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!856 = !DISubroutineType(types: !857)
!857 = !{!35, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null}
!861 = distinct !DISubprogram(name: "uptime", scope: !173, file: !173, line: 177, type: !862, scopeLine: 178, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !864)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !6, !35}
!864 = !{!865, !866, !867, !868}
!865 = !DILocalVariable(name: "filename", arg: 1, scope: !861, file: !173, line: 177, type: !6)
!866 = !DILocalVariable(name: "options", arg: 2, scope: !861, file: !173, line: 177, type: !35)
!867 = !DILocalVariable(name: "n_users", scope: !861, file: !173, line: 179, type: !120)
!868 = !DILocalVariable(name: "utmp_buf", scope: !861, file: !173, line: 180, type: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !176, line: 146, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !872, line: 55, size: 3072, elements: !873)
!872 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "")
!873 = !{!874, !875, !877, !881, !885, !886, !887, !892, !894, !899, !901}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !871, file: !872, line: 57, baseType: !203, size: 16)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !871, file: !872, line: 58, baseType: !876, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !188, line: 154, baseType: !35)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !871, file: !872, line: 59, baseType: !878, size: 256, offset: 64)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !871, file: !872, line: 61, baseType: !882, size: 32, offset: 320)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 4)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !871, file: !872, line: 63, baseType: !878, size: 256, offset: 352)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !871, file: !872, line: 65, baseType: !146, size: 2048, offset: 608)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !871, file: !872, line: 67, baseType: !888, size: 32, offset: 2656)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !872, line: 42, size: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !888, file: !872, line: 45, baseType: !203, size: 16)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !888, file: !872, line: 46, baseType: !203, size: 16, offset: 16)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !871, file: !872, line: 74, baseType: !893, size: 32, offset: 2688)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !188, line: 41, baseType: !35)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !871, file: !872, line: 79, baseType: !895, size: 64, offset: 2720)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 75, size: 64, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !895, file: !872, line: 77, baseType: !893, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !895, file: !872, line: 78, baseType: !893, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !871, file: !872, line: 84, baseType: !900, size: 128, offset: 2784)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 128, elements: !883)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !871, file: !872, line: 85, baseType: !806, size: 160, offset: 2912)
!902 = !DILocation(line: 0, scope: !861)
!903 = !DILocation(line: 179, column: 3, scope: !861)
!904 = !DILocation(line: 180, column: 3, scope: !861)
!905 = !DILocation(line: 180, column: 16, scope: !861)
!906 = !DILocation(line: 183, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !861, file: !173, line: 183, column: 7)
!908 = !DILocation(line: 183, column: 58, scope: !907)
!909 = !DILocation(line: 183, column: 7, scope: !861)
!910 = !DILocation(line: 184, column: 5, scope: !907)
!911 = !DILocation(line: 187, column: 17, scope: !861)
!912 = !{!913, !913, i64 0}
!913 = !{!"long", !691, i64 0}
!914 = !DILocation(line: 187, column: 26, scope: !861)
!915 = !DILocalVariable(name: "n", arg: 1, scope: !916, file: !173, line: 50, type: !120)
!916 = distinct !DISubprogram(name: "print_uptime", scope: !173, file: !173, line: 50, type: !917, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !921)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !120, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!921 = !{!915, !922, !923, !924, !925, !926, !927, !928, !929, !930, !946, !949, !950, !954, !960, !961, !964}
!922 = !DILocalVariable(name: "this", arg: 2, scope: !916, file: !173, line: 50, type: !919)
!923 = !DILocalVariable(name: "entries", scope: !916, file: !173, line: 52, type: !120)
!924 = !DILocalVariable(name: "boot_time", scope: !916, file: !173, line: 53, type: !194)
!925 = !DILocalVariable(name: "time_now", scope: !916, file: !173, line: 54, type: !194)
!926 = !DILocalVariable(name: "uptime", scope: !916, file: !173, line: 55, type: !194)
!927 = !DILocalVariable(name: "updays", scope: !916, file: !173, line: 56, type: !197)
!928 = !DILocalVariable(name: "uphours", scope: !916, file: !173, line: 57, type: !35)
!929 = !DILocalVariable(name: "upmins", scope: !916, file: !173, line: 58, type: !35)
!930 = !DILocalVariable(name: "tmn", scope: !916, file: !173, line: 59, type: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !933, line: 7, size: 448, elements: !934)
!933 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !932, file: !933, line: 9, baseType: !35, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !932, file: !933, line: 10, baseType: !35, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !932, file: !933, line: 11, baseType: !35, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !932, file: !933, line: 12, baseType: !35, size: 32, offset: 96)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !932, file: !933, line: 13, baseType: !35, size: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !932, file: !933, line: 14, baseType: !35, size: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !932, file: !933, line: 15, baseType: !35, size: 32, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !932, file: !933, line: 16, baseType: !35, size: 32, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !932, file: !933, line: 17, baseType: !35, size: 32, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !932, file: !933, line: 20, baseType: !197, size: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !932, file: !933, line: 21, baseType: !6, size: 64, offset: 384)
!946 = !DILocalVariable(name: "avg", scope: !916, file: !173, line: 60, type: !947)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 192, elements: !70)
!948 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!949 = !DILocalVariable(name: "loads", scope: !916, file: !173, line: 61, type: !35)
!950 = !DILocalVariable(name: "fp", scope: !916, file: !173, line: 63, type: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !953, line: 7, baseType: !761)
!953 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!954 = !DILocalVariable(name: "buf", scope: !955, file: !173, line: 68, type: !957)
!955 = distinct !DILexicalBlock(scope: !956, file: !173, line: 67, column: 5)
!956 = distinct !DILexicalBlock(scope: !916, file: !173, line: 66, column: 7)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 65536, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 8192)
!960 = !DILocalVariable(name: "b", scope: !955, file: !173, line: 69, type: !14)
!961 = !DILocalVariable(name: "end_ptr", scope: !962, file: !173, line: 72, type: !14)
!962 = distinct !DILexicalBlock(scope: !963, file: !173, line: 71, column: 9)
!963 = distinct !DILexicalBlock(scope: !955, file: !173, line: 70, column: 11)
!964 = !DILocalVariable(name: "upsecs", scope: !962, file: !173, line: 73, type: !948)
!965 = !DILocation(line: 0, scope: !916, inlinedAt: !966)
!966 = distinct !DILocation(line: 187, column: 3, scope: !861)
!967 = !DILocation(line: 54, column: 3, scope: !916, inlinedAt: !966)
!968 = !DILocation(line: 60, column: 3, scope: !916, inlinedAt: !966)
!969 = !DILocation(line: 60, column: 10, scope: !916, inlinedAt: !966)
!970 = !DILocation(line: 65, column: 8, scope: !916, inlinedAt: !966)
!971 = !DILocation(line: 66, column: 10, scope: !956, inlinedAt: !966)
!972 = !DILocation(line: 66, column: 7, scope: !916, inlinedAt: !966)
!973 = !DILocation(line: 68, column: 7, scope: !955, inlinedAt: !966)
!974 = !DILocation(line: 68, column: 12, scope: !955, inlinedAt: !966)
!975 = !DILocation(line: 69, column: 17, scope: !955, inlinedAt: !966)
!976 = !DILocation(line: 0, scope: !955, inlinedAt: !966)
!977 = !DILocation(line: 70, column: 13, scope: !963, inlinedAt: !966)
!978 = !DILocation(line: 70, column: 11, scope: !955, inlinedAt: !966)
!979 = !DILocation(line: 72, column: 11, scope: !962, inlinedAt: !966)
!980 = !DILocation(line: 0, scope: !962, inlinedAt: !966)
!981 = !DILocation(line: 73, column: 27, scope: !962, inlinedAt: !966)
!982 = !DILocation(line: 74, column: 22, scope: !983, inlinedAt: !966)
!983 = distinct !DILexicalBlock(scope: !962, file: !173, line: 74, column: 15)
!984 = !DILocation(line: 74, column: 19, scope: !983, inlinedAt: !966)
!985 = !DILocation(line: 74, column: 15, scope: !962, inlinedAt: !966)
!986 = !DILocation(line: 75, column: 25, scope: !983, inlinedAt: !966)
!987 = !DILocation(line: 75, column: 35, scope: !983, inlinedAt: !966)
!988 = !DILocation(line: 75, column: 22, scope: !983, inlinedAt: !966)
!989 = !DILocation(line: 75, column: 13, scope: !983, inlinedAt: !966)
!990 = !DILocation(line: 77, column: 9, scope: !963, inlinedAt: !966)
!991 = !DILocation(line: 77, column: 9, scope: !962, inlinedAt: !966)
!992 = !DILocation(line: 79, column: 7, scope: !955, inlinedAt: !966)
!993 = !DILocation(line: 80, column: 5, scope: !956, inlinedAt: !966)
!994 = !DILocation(line: 80, column: 5, scope: !955, inlinedAt: !966)
!995 = !DILocation(line: 108, column: 3, scope: !916, inlinedAt: !966)
!996 = !DILocation(line: 110, column: 18, scope: !997, inlinedAt: !966)
!997 = distinct !DILexicalBlock(scope: !916, file: !173, line: 109, column: 5)
!998 = !{!691, !691, i64 0}
!999 = !DILocation(line: 0, scope: !997, inlinedAt: !966)
!1000 = !{!1001, !1002, i64 0}
!1001 = !{!"utmpx", !1002, i64 0, !831, i64 4, !691, i64 8, !691, i64 40, !691, i64 44, !691, i64 76, !1003, i64 332, !831, i64 336, !1004, i64 340, !691, i64 348, !691, i64 364}
!1002 = !{!"short", !691, i64 0}
!1003 = !{!"__exit_status", !1002, i64 0, !1002, i64 2}
!1004 = !{!"", !831, i64 0, !831, i64 4}
!1005 = !DILocation(line: 110, column: 15, scope: !997, inlinedAt: !966)
!1006 = !DILocation(line: 111, column: 11, scope: !1007, inlinedAt: !966)
!1007 = distinct !DILexicalBlock(scope: !997, file: !173, line: 111, column: 11)
!1008 = !DILocation(line: 111, column: 11, scope: !997, inlinedAt: !966)
!1009 = !DILocation(line: 112, column: 21, scope: !1007, inlinedAt: !966)
!1010 = !{!1001, !831, i64 340}
!1011 = !DILocation(line: 112, column: 9, scope: !1007, inlinedAt: !966)
!1012 = !DILocation(line: 120, column: 14, scope: !916, inlinedAt: !966)
!1013 = !DILocation(line: 120, column: 12, scope: !916, inlinedAt: !966)
!1014 = !DILocation(line: 122, column: 14, scope: !1015, inlinedAt: !966)
!1015 = distinct !DILexicalBlock(scope: !916, file: !173, line: 122, column: 7)
!1016 = !DILocation(line: 122, column: 7, scope: !916, inlinedAt: !966)
!1017 = !DILocation(line: 125, column: 21, scope: !1018, inlinedAt: !966)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !173, line: 125, column: 11)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !173, line: 124, column: 5)
!1020 = !DILocation(line: 125, column: 11, scope: !1019, inlinedAt: !966)
!1021 = !DILocation(line: 126, column: 9, scope: !1018, inlinedAt: !966)
!1022 = !DILocation(line: 127, column: 25, scope: !1019, inlinedAt: !966)
!1023 = !DILocation(line: 128, column: 5, scope: !1019, inlinedAt: !966)
!1024 = !DILocation(line: 129, column: 19, scope: !916, inlinedAt: !966)
!1025 = !DILocation(line: 130, column: 31, scope: !916, inlinedAt: !966)
!1026 = !DILocation(line: 130, column: 21, scope: !916, inlinedAt: !966)
!1027 = !DILocation(line: 130, column: 41, scope: !916, inlinedAt: !966)
!1028 = !DILocation(line: 130, column: 13, scope: !916, inlinedAt: !966)
!1029 = !DILocation(line: 131, column: 41, scope: !916, inlinedAt: !966)
!1030 = !DILocation(line: 131, column: 39, scope: !916, inlinedAt: !966)
!1031 = !DILocation(line: 131, column: 59, scope: !916, inlinedAt: !966)
!1032 = !DILocation(line: 131, column: 12, scope: !916, inlinedAt: !966)
!1033 = !DILocation(line: 132, column: 9, scope: !916, inlinedAt: !966)
!1034 = !DILocation(line: 135, column: 7, scope: !1035, inlinedAt: !966)
!1035 = distinct !DILexicalBlock(scope: !916, file: !173, line: 135, column: 7)
!1036 = !DILocation(line: 135, column: 7, scope: !916, inlinedAt: !966)
!1037 = !DILocation(line: 137, column: 18, scope: !1035, inlinedAt: !966)
!1038 = !DILocation(line: 137, column: 26, scope: !1035, inlinedAt: !966)
!1039 = !DILocation(line: 137, column: 5, scope: !1035, inlinedAt: !966)
!1040 = !DILocation(line: 139, column: 5, scope: !1035, inlinedAt: !966)
!1041 = !DILocation(line: 140, column: 14, scope: !1042, inlinedAt: !966)
!1042 = distinct !DILexicalBlock(scope: !916, file: !173, line: 140, column: 7)
!1043 = !DILocation(line: 140, column: 7, scope: !916, inlinedAt: !966)
!1044 = !DILocation(line: 141, column: 5, scope: !1042, inlinedAt: !966)
!1045 = !DILocation(line: 144, column: 13, scope: !1046, inlinedAt: !966)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !173, line: 144, column: 11)
!1047 = distinct !DILexicalBlock(scope: !1042, file: !173, line: 143, column: 5)
!1048 = !DILocation(line: 144, column: 11, scope: !1047, inlinedAt: !966)
!1049 = !DILocation(line: 145, column: 9, scope: !1046, inlinedAt: !966)
!1050 = !DILocation(line: 150, column: 9, scope: !1046, inlinedAt: !966)
!1051 = !DILocation(line: 152, column: 3, scope: !916, inlinedAt: !966)
!1052 = !DILocation(line: 155, column: 23, scope: !916, inlinedAt: !966)
!1053 = !DILocation(line: 155, column: 11, scope: !916, inlinedAt: !966)
!1054 = !DILocation(line: 157, column: 13, scope: !1055, inlinedAt: !966)
!1055 = distinct !DILexicalBlock(scope: !916, file: !173, line: 157, column: 7)
!1056 = !DILocation(line: 157, column: 7, scope: !916, inlinedAt: !966)
!1057 = !DILocalVariable(name: "__c", arg: 1, scope: !1058, file: !1059, line: 108, type: !35)
!1058 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1059, file: !1059, line: 108, type: !1060, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !1062)
!1059 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!35, !35}
!1062 = !{!1057}
!1063 = !DILocation(line: 0, scope: !1058, inlinedAt: !1064)
!1064 = distinct !DILocation(line: 158, column: 5, scope: !1055, inlinedAt: !966)
!1065 = !DILocation(line: 110, column: 10, scope: !1058, inlinedAt: !1064)
!1066 = !{!1067, !690, i64 40}
!1067 = !{!"_IO_FILE", !831, i64 0, !690, i64 8, !690, i64 16, !690, i64 24, !690, i64 32, !690, i64 40, !690, i64 48, !690, i64 56, !690, i64 64, !690, i64 72, !690, i64 80, !690, i64 88, !690, i64 96, !690, i64 104, !831, i64 112, !831, i64 116, !913, i64 120, !1002, i64 128, !691, i64 130, !691, i64 131, !690, i64 136, !913, i64 144, !690, i64 152, !690, i64 160, !690, i64 168, !690, i64 176, !913, i64 184, !831, i64 192, !691, i64 196}
!1068 = !{!1067, !690, i64 48}
!1069 = !{!"branch_weights", i32 2000, i32 1}
!1070 = !DILocation(line: 161, column: 17, scope: !1071, inlinedAt: !966)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !173, line: 161, column: 11)
!1072 = distinct !DILexicalBlock(scope: !1055, file: !173, line: 160, column: 5)
!1073 = !DILocation(line: 161, column: 11, scope: !1072, inlinedAt: !966)
!1074 = !DILocation(line: 162, column: 9, scope: !1071, inlinedAt: !966)
!1075 = !{!1076, !1076, i64 0}
!1076 = !{!"double", !691, i64 0}
!1077 = !DILocation(line: 163, column: 17, scope: !1078, inlinedAt: !966)
!1078 = distinct !DILexicalBlock(scope: !1072, file: !173, line: 163, column: 11)
!1079 = !DILocation(line: 163, column: 11, scope: !1072, inlinedAt: !966)
!1080 = !DILocation(line: 164, column: 9, scope: !1078, inlinedAt: !966)
!1081 = !DILocation(line: 165, column: 17, scope: !1082, inlinedAt: !966)
!1082 = distinct !DILexicalBlock(scope: !1072, file: !173, line: 165, column: 11)
!1083 = !DILocation(line: 165, column: 11, scope: !1072, inlinedAt: !966)
!1084 = !DILocation(line: 166, column: 9, scope: !1082, inlinedAt: !966)
!1085 = !DILocation(line: 0, scope: !1058, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 168, column: 9, scope: !1087, inlinedAt: !966)
!1087 = distinct !DILexicalBlock(scope: !1072, file: !173, line: 167, column: 11)
!1088 = !DILocation(line: 110, column: 10, scope: !1058, inlinedAt: !1086)
!1089 = !DILocation(line: 170, column: 1, scope: !916, inlinedAt: !966)
!1090 = !DILocation(line: 190, column: 1, scope: !861)
!1091 = !DILocation(line: 113, column: 7, scope: !997, inlinedAt: !966)
!1092 = distinct !{!1092, !995, !1093, !732}
!1093 = !DILocation(line: 114, column: 5, scope: !916, inlinedAt: !966)
!1094 = !DISubprogram(name: "error", scope: !1095, file: !1095, line: 52, type: !1096, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1095 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !35, !35, !6, null}
!1098 = !DISubprogram(name: "time", scope: !1099, file: !1099, line: 75, type: !1100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1099 = !DIFile(filename: "/usr/include/time.h", directory: "")
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!197, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!1103 = !DISubprogram(name: "localtime", scope: !1099, file: !1099, line: 123, type: !1104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!931, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!1108 = !DISubprogram(name: "dcngettext", scope: !753, file: !753, line: 73, type: !1109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!14, !6, !6, !6, !122, !35}
!1111 = !DISubprogram(name: "getloadavg", scope: !855, file: !855, line: 1004, type: !1112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!35, !1114, !35}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!1115 = distinct !DISubprogram(name: "c_strtod", scope: !12, file: !12, line: 65, type: !1116, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1118)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!948, !6, !816}
!1118 = !{!1119, !1120, !1121, !1122}
!1119 = !DILocalVariable(name: "nptr", arg: 1, scope: !1115, file: !12, line: 65, type: !6)
!1120 = !DILocalVariable(name: "endptr", arg: 2, scope: !1115, file: !12, line: 65, type: !816)
!1121 = !DILocalVariable(name: "r", scope: !1115, file: !12, line: 67, type: !948)
!1122 = !DILocalVariable(name: "locale", scope: !1115, file: !12, line: 73, type: !15)
!1123 = !DILocation(line: 0, scope: !1115)
!1124 = !DILocation(line: 57, column: 8, scope: !1125, inlinedAt: !1129)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !12, line: 57, column: 7)
!1126 = distinct !DISubprogram(name: "c_locale", scope: !12, file: !12, line: 55, type: !1127, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !4)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!15}
!1129 = distinct !DILocation(line: 73, column: 21, scope: !1115)
!1130 = !DILocation(line: 57, column: 7, scope: !1126, inlinedAt: !1129)
!1131 = !DILocation(line: 58, column: 22, scope: !1125, inlinedAt: !1129)
!1132 = !DILocation(line: 58, column: 20, scope: !1125, inlinedAt: !1129)
!1133 = !DILocation(line: 58, column: 5, scope: !1125, inlinedAt: !1129)
!1134 = !DILocation(line: 59, column: 10, scope: !1126, inlinedAt: !1129)
!1135 = !DILocation(line: 74, column: 8, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1115, file: !12, line: 74, column: 7)
!1137 = !DILocation(line: 74, column: 7, scope: !1115)
!1138 = !DILocation(line: 76, column: 11, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !12, line: 76, column: 11)
!1140 = distinct !DILexicalBlock(scope: !1136, file: !12, line: 75, column: 5)
!1141 = !DILocation(line: 76, column: 11, scope: !1140)
!1142 = !DILocation(line: 77, column: 17, scope: !1139)
!1143 = !DILocation(line: 77, column: 9, scope: !1139)
!1144 = !DILocation(line: 83, column: 7, scope: !1115)
!1145 = !DILocation(line: 134, column: 3, scope: !1115)
!1146 = !DILocation(line: 135, column: 1, scope: !1115)
!1147 = !DISubprogram(name: "newlocale", scope: !810, file: !810, line: 141, type: !1148, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!19, !35, !6, !19}
