; ModuleID = 'coreutils-8.32/src/uptime.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Version", scope: !2, file: !3, line: 2, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !11, file: !12, line: 50, type: !50, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !49, splitDebugInlining: false, nameTableKind: None)
!12 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !42, !45}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!15 = !DISubprogram(name: "strtod_l", scope: !16, file: !16, line: 295, type: !17, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !6, !20, !21}
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !23, line: 28, size: 1856, elements: !24)
!23 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!24 = !{!25, !31, !35, !39, !40}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !22, file: !23, line: 31, baseType: !26, size: 832)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 832, elements: !29)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !23, line: 31, flags: DIFlagFwdDecl)
!29 = !{!30}
!30 = !DISubrange(count: 13)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !22, file: !23, line: 34, baseType: !32, size: 64, offset: 832)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !22, file: !23, line: 35, baseType: !36, size: 64, offset: 896)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !22, file: !23, line: 36, baseType: !36, size: 64, offset: 960)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !22, file: !23, line: 39, baseType: !41, size: 832, offset: 1024)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !29)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !43, line: 24, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !23, line: 42, baseType: !21)
!45 = !DISubprogram(name: "newlocale", scope: !46, file: !46, line: 141, type: !47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!46 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!21, !38, !6, !21}
!49 = !{!9}
!50 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "file_name", scope: !53, file: !54, line: 46, type: !6, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !55, globals: !128, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!55 = !{!56, !116, !120, !124}
!56 = !DISubprogram(name: "close_stream", scope: !57, file: !57, line: 2, type: !58, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!57 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!58 = !DISubroutineType(types: !59)
!59 = !{!38, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !63)
!62 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !80, !81, !82, !86, !87, !89, !93, !96, !98, !101, !104, !105, !107, !111, !112}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 51, baseType: !38, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 70, baseType: !60, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 152, baseType: !85)
!84 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!85 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 43, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 153, baseType: !85)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !61, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !62, line: 37, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !61, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !62, line: 38, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !61, file: !62, line: 93, baseType: !60, size: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !61, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DISubprogram(name: "dcgettext", scope: !117, file: !117, line: 51, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!14, !6, !6, !38}
!120 = !DISubprogram(name: "quotearg_colon", scope: !121, file: !121, line: 391, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!121 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !DISubroutineType(types: !123)
!123 = !{!14, !6}
!124 = !DISubprogram(name: "error", scope: !125, file: !125, line: 52, type: !126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!125 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!126 = !DISubroutineType(types: !127)
!127 = !{null, !38, !38, !6, null}
!128 = !{!51, !129}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !53, file: !54, line: 56, type: !131, isLocal: true, isDefinition: true)
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "exit_failure", scope: !134, file: !135, line: 24, type: !137, isLocal: false, isDefinition: true)
!134 = distinct !DICompileUnit(language: DW_LANG_C99, file: !135, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !136, splitDebugInlining: false, nameTableKind: None)
!135 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !{!132}
!137 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "long_options", scope: !140, file: !141, line: 34, type: !203, isLocal: true, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, globals: !202, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!142 = !{!143, !158}
!143 = !DISubprogram(name: "getopt_long", scope: !144, file: !144, line: 66, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!144 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!145 = !DISubroutineType(types: !146)
!146 = !{!38, !38, !147, !6, !149, !156}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !152)
!152 = !{!153, !154, !155, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !144, line: 52, baseType: !6, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !151, file: !144, line: 55, baseType: !38, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !151, file: !144, line: 56, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !151, file: !144, line: 57, baseType: !38, size: 32, offset: 192)
!158 = !DISubprogram(name: "version_etc_va", scope: !159, file: !159, line: 63, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!159 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!160 = !DISubroutineType(types: !161)
!161 = !{null, !162, !6, !6, !6, !194}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !163, file: !62, line: 51, baseType: !38, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !163, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !163, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !163, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !163, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !163, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !163, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !163, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !163, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !163, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !163, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !163, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !163, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !163, file: !62, line: 70, baseType: !162, size: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !163, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !163, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !163, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !163, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !163, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !163, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !163, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !163, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !163, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !163, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !163, file: !62, line: 93, baseType: !162, size: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !163, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !163, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !163, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !163, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !141, line: 72, size: 192, elements: !196)
!196 = !{!197, !199, !200, !201}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !195, file: !141, line: 72, baseType: !198, size: 32)
!198 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !195, file: !141, line: 72, baseType: !198, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !195, file: !141, line: 72, baseType: !106, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !195, file: !141, line: 72, baseType: !106, size: 64, offset: 128)
!202 = !{!138}
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 768, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 3)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "program_name", scope: !208, file: !209, line: 33, type: !6, isLocal: false, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !210, globals: !247, splitDebugInlining: false, nameTableKind: None)
!209 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !{!106, !211, !14}
!211 = !DISubprogram(name: "fputs", scope: !212, file: !212, line: 626, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!212 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!213 = !DISubroutineType(types: !214)
!214 = !{!38, !6, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !216, file: !62, line: 51, baseType: !38, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !216, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !216, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !216, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !216, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !216, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !216, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !216, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !216, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !216, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !216, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !216, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !216, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !216, file: !62, line: 70, baseType: !215, size: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !216, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !216, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !216, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !216, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !216, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !216, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !216, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !216, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !216, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !216, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !216, file: !62, line: 93, baseType: !215, size: 64, offset: 1344)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !216, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !216, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !216, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !216, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!247 = !{!206}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !250, file: !251, line: 85, type: !386, isLocal: false, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !252, retainedTypes: !286, globals: !359, splitDebugInlining: false, nameTableKind: None)
!251 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = !{!253, !266, !271}
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !121, line: 32, baseType: !198, size: 32, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!255 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!256 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!257 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!258 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!259 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!260 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!261 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!262 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!263 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!264 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!265 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !121, line: 242, baseType: !198, size: 32, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!269 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!270 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 46, baseType: !198, size: 32, elements: !273)
!272 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!274 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!275 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!276 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!277 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!278 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!279 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!280 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!281 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!282 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!284 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!285 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!286 = !{!287, !293, !309, !312, !38, !34, !315, !108, !332, !336, !116, !342, !346, !14, !350, !353, !356}
!287 = !DISubprogram(name: "xmemdup", scope: !288, file: !288, line: 62, type: !289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!288 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!289 = !DISubroutineType(types: !290)
!290 = !{!106, !291, !110}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!293 = !DISubprogram(name: "quotearg_alloc_mem", scope: !121, file: !121, line: 342, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!294 = !DISubroutineType(types: !295)
!295 = !{!14, !6, !110, !296, !297}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !251, line: 65, size: 448, elements: !300)
!300 = !{!301, !302, !303, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !299, file: !251, line: 68, baseType: !253, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !251, line: 71, baseType: !38, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !299, file: !251, line: 75, baseType: !304, size: 256, offset: 64)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 256, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !299, file: !251, line: 78, baseType: !6, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !299, file: !251, line: 81, baseType: !6, size: 64, offset: 384)
!309 = !DISubprogram(name: "free", scope: !16, file: !16, line: 565, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !106}
!312 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !121, file: !121, line: 408, type: !313, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!313 = !DISubroutineType(types: !314)
!314 = !{!14, !38, !6, !6, !6, !110}
!315 = !DISubprogram(name: "rpl_mbrtowc", scope: !316, file: !316, line: 717, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!316 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!317 = !DISubroutineType(types: !318)
!318 = !{!110, !156, !6, !110, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 13, size: 64, elements: !322)
!321 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !320, file: !321, line: 15, baseType: !38, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !320, file: !321, line: 20, baseType: !325, size: 32, offset: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !320, file: !321, line: 16, size: 32, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !325, file: !321, line: 18, baseType: !198, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !325, file: !321, line: 19, baseType: !329, size: 32)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 4)
!332 = !DISubprogram(name: "iswprint", scope: !333, file: !333, line: 120, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!333 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!334 = !DISubroutineType(types: !335)
!335 = !{!38, !198}
!336 = !DISubprogram(name: "mbsinit", scope: !337, file: !337, line: 292, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!337 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!338 = !DISubroutineType(types: !339)
!339 = !{!38, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!342 = !DISubprogram(name: "locale_charset", scope: !343, file: !343, line: 35, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!343 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !DISubroutineType(types: !345)
!345 = !{!6}
!346 = !DISubprogram(name: "c_strcasecmp", scope: !347, file: !347, line: 42, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!347 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!348 = !DISubroutineType(types: !349)
!349 = !{!38, !6, !6}
!350 = !DISubprogram(name: "xmalloc", scope: !288, file: !288, line: 53, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!351 = !DISubroutineType(types: !352)
!352 = !{!106, !110}
!353 = !DISubprogram(name: "xalloc_die", scope: !288, file: !288, line: 51, type: !354, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!354 = !DISubroutineType(types: !355)
!355 = !{null}
!356 = !DISubprogram(name: "xrealloc", scope: !288, file: !288, line: 59, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!357 = !DISubroutineType(types: !358)
!358 = !{!106, !106, !110}
!359 = !{!248, !360, !366, !368, !370, !375, !382, !384}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !250, file: !251, line: 101, type: !362, isLocal: false, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 320, elements: !364)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!364 = !{!365}
!365 = !DISubrange(count: 10)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !250, file: !251, line: 1052, type: !299, isLocal: false, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !250, file: !251, line: 116, type: !299, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "slot0", scope: !250, file: !251, line: 842, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 256)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "slotvec", scope: !250, file: !251, line: 845, type: !377, isLocal: true, isDefinition: true)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !251, line: 834, size: 128, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !378, file: !251, line: 836, baseType: !108, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !378, file: !251, line: 837, baseType: !14, size: 64, offset: 64)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "nslots", scope: !250, file: !251, line: 843, type: !38, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "slotvec0", scope: !250, file: !251, line: 844, type: !378, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 704, elements: !388)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!388 = !{!389}
!389 = !DISubrange(count: 11)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !392, file: !393, line: 26, type: !395, isLocal: false, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !394, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!394 = !{!390}
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 47)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !400, retainedTypes: !418, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "src/uptime.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!400 = !{!401, !253, !406}
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !402, line: 208, baseType: !198, size: 32, elements: !403)
!402 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!403 = !{!404, !405}
!404 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1, isUnsigned: true)
!405 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2, isUnsigned: true)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !408, file: !407, line: 187, baseType: !198, size: 32, elements: !416)
!407 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!408 = distinct !DISubprogram(name: "select_plural", scope: !407, file: !407, line: 183, type: !409, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !398, retainedNodes: !414)
!409 = !DISubroutineType(types: !410)
!410 = !{!110, !411}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !412, line: 102, baseType: !413)
!412 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !84, line: 73, baseType: !110)
!414 = !{!415}
!415 = !DILocalVariable(name: "n", arg: 1, scope: !408, file: !407, line: 183, type: !411)
!416 = !{!417}
!417 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!418 = !{!116, !419, !454, !458, !461, !464, !465, !6, !106, !469, !476, !124, !480, !514, !517, !521, !524, !528, !533, !553, !562, !110, !565, !569}
!419 = !DISubprogram(name: "fputs_unlocked", scope: !212, file: !212, line: 662, type: !420, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!420 = !DISubroutineType(types: !421)
!421 = !{!38, !6, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !423, file: !62, line: 51, baseType: !38, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !423, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !423, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !423, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !423, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !423, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !423, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !423, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !423, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !423, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !423, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !423, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !423, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !423, file: !62, line: 70, baseType: !422, size: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !423, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !423, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !423, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !423, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !423, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !423, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !423, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !423, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !423, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !423, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !423, file: !62, line: 93, baseType: !422, size: 64, offset: 1344)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !423, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !423, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !423, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !423, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!454 = !DISubprogram(name: "set_program_name", scope: !455, file: !455, line: 37, type: !456, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!455 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!456 = !DISubroutineType(types: !457)
!457 = !{null, !6}
!458 = !DISubprogram(name: "setlocale", scope: !46, file: !46, line: 122, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!459 = !DISubroutineType(types: !460)
!460 = !{!14, !38, !6}
!461 = !DISubprogram(name: "bindtextdomain", scope: !117, file: !117, line: 86, type: !462, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!462 = !DISubroutineType(types: !463)
!463 = !{!14, !6, !6}
!464 = !DISubprogram(name: "textdomain", scope: !117, file: !117, line: 82, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!465 = !DISubprogram(name: "atexit", scope: !16, file: !16, line: 595, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!466 = !DISubroutineType(types: !467)
!467 = !{!38, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!469 = !DISubprogram(name: "parse_gnu_standard_options_only", scope: !470, file: !470, line: 33, type: !471, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!470 = !DIFile(filename: "./lib/long-options.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!471 = !DISubroutineType(types: !472)
!472 = !{null, !38, !20, !6, !6, !6, !131, !473, null}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !38}
!476 = !DISubprogram(name: "quote", scope: !477, file: !477, line: 44, type: !478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!477 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!478 = !DISubroutineType(types: !479)
!479 = !{!6, !6}
!480 = !DISubprogram(name: "read_utmp", scope: !402, file: !402, line: 215, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!481 = !DISubroutineType(types: !482)
!482 = !{!38, !6, !296, !483, !38}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !486, line: 55, size: 3072, elements: !487)
!486 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "")
!487 = !{!488, !490, !492, !496, !497, !498, !499, !504, !506, !511, !513}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !485, file: !486, line: 57, baseType: !489, size: 16)
!489 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !485, file: !486, line: 58, baseType: !491, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !84, line: 154, baseType: !38)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !485, file: !486, line: 59, baseType: !493, size: 256, offset: 64)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !485, file: !486, line: 61, baseType: !329, size: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !485, file: !486, line: 63, baseType: !493, size: 256, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !485, file: !486, line: 65, baseType: !372, size: 2048, offset: 608)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !485, file: !486, line: 67, baseType: !500, size: 32, offset: 2656)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !486, line: 42, size: 32, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !500, file: !486, line: 45, baseType: !489, size: 16)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !500, file: !486, line: 46, baseType: !489, size: 16, offset: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !485, file: !486, line: 74, baseType: !505, size: 32, offset: 2688)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !84, line: 41, baseType: !38)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !485, file: !486, line: 79, baseType: !507, size: 64, offset: 2720)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !486, line: 75, size: 64, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !507, file: !486, line: 77, baseType: !505, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !507, file: !486, line: 78, baseType: !505, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !485, file: !486, line: 84, baseType: !512, size: 128, offset: 2784)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 128, elements: !330)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !485, file: !486, line: 85, baseType: !113, size: 160, offset: 2912)
!514 = !DISubprogram(name: "quotearg_n_style_colon", scope: !121, file: !121, line: 397, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!515 = !DISubroutineType(types: !516)
!516 = !{!14, !38, !253, !6}
!517 = !DISubprogram(name: "c_strtod", scope: !518, file: !518, line: 40, type: !519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!518 = !DIFile(filename: "./lib/c-strtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !DISubroutineType(types: !520)
!520 = !{!19, !6, !20}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !522, line: 7, baseType: !523)
!522 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !84, line: 160, baseType: !85)
!524 = !DISubprogram(name: "rpl_fclose", scope: !525, file: !525, line: 672, type: !526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!525 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!526 = !DISubroutineType(types: !527)
!527 = !{!38, !422}
!528 = !DISubprogram(name: "time", scope: !529, file: !529, line: 75, type: !530, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!529 = !DIFile(filename: "/usr/include/time.h", directory: "")
!530 = !DISubroutineType(types: !531)
!531 = !{!85, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!533 = !DISubprogram(name: "localtime", scope: !529, file: !529, line: 123, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!534 = !DISubroutineType(types: !535)
!535 = !{!536, !551}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !538, line: 7, size: 448, elements: !539)
!538 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !537, file: !538, line: 9, baseType: !38, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !537, file: !538, line: 10, baseType: !38, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !537, file: !538, line: 11, baseType: !38, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !537, file: !538, line: 12, baseType: !38, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !537, file: !538, line: 13, baseType: !38, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !537, file: !538, line: 14, baseType: !38, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !537, file: !538, line: 15, baseType: !38, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !537, file: !538, line: 16, baseType: !38, size: 32, offset: 224)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !537, file: !538, line: 17, baseType: !38, size: 32, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !537, file: !538, line: 20, baseType: !85, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !537, file: !538, line: 21, baseType: !6, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!553 = !DISubprogram(name: "fprintftime", scope: !554, file: !554, line: 28, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!554 = !DIFile(filename: "./lib/fprintftime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = !DISubroutineType(types: !556)
!556 = !{!110, !422, !6, !557, !559, !38}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !561, line: 778, flags: DIFlagFwdDecl)
!561 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!562 = !DISubprogram(name: "dcngettext", scope: !117, file: !117, line: 73, type: !563, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!563 = !DISubroutineType(types: !564)
!564 = !{!14, !6, !6, !6, !110, !38}
!565 = !DISubprogram(name: "getloadavg", scope: !16, file: !16, line: 1003, type: !566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!566 = !DISubroutineType(types: !567)
!567 = !{!38, !568, !38}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!569 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !572, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !{!108, !6, !573, !198, !38, !88, !569, !489, !34, !85, !110, !608, !609, !610, !628}
!573 = !DISubprogram(name: "fputc", scope: !212, file: !212, line: 521, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!574 = !DISubroutineType(types: !575)
!575 = !{!38, !38, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !577, file: !62, line: 51, baseType: !38, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !577, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !577, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !577, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !577, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !577, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !577, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !577, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !577, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !577, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !577, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !577, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !577, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !577, file: !62, line: 70, baseType: !576, size: 64, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !577, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !577, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !577, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !577, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !577, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !577, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !577, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !577, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !577, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !577, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !577, file: !62, line: 93, baseType: !576, size: 64, offset: 1344)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !577, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !577, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !577, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !577, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!608 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!609 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!610 = !DISubprogram(name: "strftime", scope: !529, file: !529, line: 88, type: !611, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!611 = !DISubroutineType(types: !612)
!612 = !{!110, !14, !110, !6, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !538, line: 7, size: 448, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !615, file: !538, line: 9, baseType: !38, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !615, file: !538, line: 10, baseType: !38, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !615, file: !538, line: 11, baseType: !38, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !615, file: !538, line: 12, baseType: !38, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !615, file: !538, line: 13, baseType: !38, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !615, file: !538, line: 14, baseType: !38, size: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !615, file: !538, line: 15, baseType: !38, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !615, file: !538, line: 16, baseType: !38, size: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !615, file: !538, line: 17, baseType: !38, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !615, file: !538, line: 20, baseType: !85, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !615, file: !538, line: 21, baseType: !6, size: 64, offset: 384)
!628 = !DISubprogram(name: "mktime_z", scope: !561, file: !561, line: 789, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!629 = !DISubroutineType(types: !630)
!630 = !{!85, !631, !641}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !633, line: 21, size: 128, elements: !634)
!633 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!634 = !{!635, !636, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !632, file: !633, line: 25, baseType: !631, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !632, file: !633, line: 36, baseType: !8, size: 8, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !632, file: !633, line: 48, baseType: !638, offset: 72)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: -1)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!642 = distinct !DICompileUnit(language: DW_LANG_C99, file: !643, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !644, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!643 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!644 = !{!645}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !643, line: 40, baseType: !198, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!648 = !{!116, !649, !106}
!649 = !DISubprogram(name: "fputs_unlocked", scope: !212, file: !212, line: 662, type: !650, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!650 = !DISubroutineType(types: !651)
!651 = !{!38, !6, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !653, file: !62, line: 51, baseType: !38, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !653, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !653, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !653, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !653, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !653, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !653, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !653, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !653, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !653, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !653, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !653, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !653, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !653, file: !62, line: 70, baseType: !652, size: 64, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !653, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !653, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !653, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !653, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !653, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !653, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !653, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !653, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !653, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !653, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !653, file: !62, line: 93, baseType: !652, size: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !653, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !653, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !653, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !653, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !686, retainedTypes: !699, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!686 = !{!687}
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !688, file: !288, line: 186, baseType: !198, size: 32, elements: !697)
!688 = distinct !DISubprogram(name: "x2nrealloc", scope: !288, file: !288, line: 174, type: !689, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !684, retainedNodes: !692)
!689 = !DISubroutineType(types: !690)
!690 = !{!106, !106, !691, !108}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!692 = !{!693, !694, !695, !696}
!693 = !DILocalVariable(name: "p", arg: 1, scope: !688, file: !288, line: 174, type: !106)
!694 = !DILocalVariable(name: "pn", arg: 2, scope: !688, file: !288, line: 174, type: !691)
!695 = !DILocalVariable(name: "s", arg: 3, scope: !688, file: !288, line: 174, type: !108)
!696 = !DILocalVariable(name: "n", scope: !688, file: !288, line: 176, type: !108)
!697 = !{!698}
!698 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!699 = !{!108, !353, !350, !356, !14, !309, !106, !700, !703}
!700 = !DISubprogram(name: "xcalloc", scope: !288, file: !288, line: 57, type: !701, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!701 = !DISubroutineType(types: !702)
!702 = !{!106, !110, !110}
!703 = !DISubprogram(name: "rpl_calloc", scope: !704, file: !704, line: 688, type: !701, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!704 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!707 = !{!116, !124}
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !710, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!710 = !{!106}
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!712 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!713 = !{!714, !749, !750, !754}
!714 = !DISubprogram(name: "fileno", scope: !212, file: !212, line: 786, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!715 = !DISubroutineType(types: !716)
!716 = !{!38, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !718, file: !62, line: 51, baseType: !38, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !718, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !718, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !718, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !718, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !718, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !718, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !718, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !718, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !718, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !718, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !718, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !718, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !718, file: !62, line: 70, baseType: !717, size: 64, offset: 832)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !718, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !718, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !718, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !718, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !718, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !718, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !718, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !718, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !718, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !718, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !718, file: !62, line: 93, baseType: !717, size: 64, offset: 1344)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !718, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !718, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !718, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !718, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!749 = !DISubprogram(name: "fclose", scope: !212, file: !212, line: 213, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!750 = !DISubprogram(name: "lseek", scope: !751, file: !751, line: 334, type: !752, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!751 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!752 = !DISubroutineType(types: !753)
!753 = !{!85, !38, !85, !38}
!754 = !DISubprogram(name: "rpl_fflush", scope: !525, file: !525, line: 718, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !757, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!757 = !{!106, !758, !793}
!758 = !DISubprogram(name: "fflush", scope: !212, file: !212, line: 218, type: !759, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!759 = !DISubroutineType(types: !760)
!760 = !{!38, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !762, file: !62, line: 51, baseType: !38, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !762, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !762, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !762, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !762, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !762, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !762, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !762, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !762, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !762, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !762, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !762, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !762, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !762, file: !62, line: 70, baseType: !761, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !762, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !762, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !762, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !762, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !762, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !762, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !762, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !762, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !762, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !762, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !762, file: !62, line: 93, baseType: !761, size: 64, offset: 1344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !762, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !762, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !762, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !762, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!793 = !DISubprogram(name: "rpl_fseeko", scope: !525, file: !525, line: 1034, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!794 = !DISubroutineType(types: !795)
!795 = !{!38, !761, !85, !38}
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !798, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!798 = !{!106, !799, !750, !834}
!799 = !DISubprogram(name: "fileno", scope: !212, file: !212, line: 786, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!800 = !DISubroutineType(types: !801)
!801 = !{!38, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !803, file: !62, line: 51, baseType: !38, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !803, file: !62, line: 54, baseType: !14, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !803, file: !62, line: 55, baseType: !14, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !803, file: !62, line: 56, baseType: !14, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !803, file: !62, line: 57, baseType: !14, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !803, file: !62, line: 58, baseType: !14, size: 64, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !803, file: !62, line: 59, baseType: !14, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !803, file: !62, line: 60, baseType: !14, size: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !803, file: !62, line: 61, baseType: !14, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !803, file: !62, line: 64, baseType: !14, size: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !803, file: !62, line: 65, baseType: !14, size: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !803, file: !62, line: 66, baseType: !14, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !803, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !803, file: !62, line: 70, baseType: !802, size: 64, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !803, file: !62, line: 72, baseType: !38, size: 32, offset: 896)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !803, file: !62, line: 73, baseType: !38, size: 32, offset: 928)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !803, file: !62, line: 74, baseType: !83, size: 64, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !803, file: !62, line: 77, baseType: !34, size: 16, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !803, file: !62, line: 78, baseType: !88, size: 8, offset: 1040)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !803, file: !62, line: 79, baseType: !90, size: 8, offset: 1048)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !803, file: !62, line: 81, baseType: !94, size: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !803, file: !62, line: 89, baseType: !97, size: 64, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !803, file: !62, line: 91, baseType: !99, size: 64, offset: 1216)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !803, file: !62, line: 92, baseType: !102, size: 64, offset: 1280)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !803, file: !62, line: 93, baseType: !802, size: 64, offset: 1344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !803, file: !62, line: 94, baseType: !106, size: 64, offset: 1408)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !803, file: !62, line: 95, baseType: !108, size: 64, offset: 1472)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !803, file: !62, line: 96, baseType: !38, size: 32, offset: 1536)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !803, file: !62, line: 98, baseType: !113, size: 160, offset: 1568)
!834 = !DISubprogram(name: "fseeko", scope: !212, file: !212, line: 707, type: !835, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!835 = !DISubroutineType(types: !836)
!836 = !{!38, !802, !85, !38}
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!838 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!839 = !{!840, !108, !852}
!840 = !DISubprogram(name: "mbrtowc", scope: !337, file: !337, line: 296, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!841 = !DISubroutineType(types: !842)
!842 = !{!110, !156, !6, !110, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 13, size: 64, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !844, file: !321, line: 15, baseType: !38, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !844, file: !321, line: 20, baseType: !848, size: 32, offset: 32)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !844, file: !321, line: 16, size: 32, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !848, file: !321, line: 18, baseType: !198, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !848, file: !321, line: 19, baseType: !329, size: 32)
!852 = !DISubprogram(name: "hard_locale", scope: !853, file: !853, line: 26, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!853 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!854 = !DISubroutineType(types: !855)
!855 = !{!131, !38}
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !858, retainedTypes: !866, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!858 = !{!401, !859}
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !860, file: !288, line: 186, baseType: !198, size: 32, elements: !697)
!860 = distinct !DISubprogram(name: "x2nrealloc", scope: !288, file: !288, line: 174, type: !689, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !856, retainedNodes: !861)
!861 = !{!862, !863, !864, !865}
!862 = !DILocalVariable(name: "p", arg: 1, scope: !860, file: !288, line: 174, type: !106)
!863 = !DILocalVariable(name: "pn", arg: 2, scope: !860, file: !288, line: 174, type: !691)
!864 = !DILocalVariable(name: "s", arg: 3, scope: !860, file: !288, line: 174, type: !108)
!865 = !DILocalVariable(name: "n", scope: !860, file: !288, line: 176, type: !108)
!866 = !{!350, !14, !867, !871, !872, !106, !897, !898, !108, !353, !356}
!867 = !DISubprogram(name: "utmpxname", scope: !868, file: !868, line: 93, type: !869, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!868 = !DIFile(filename: "/usr/include/utmpx.h", directory: "")
!869 = !DISubroutineType(types: !870)
!870 = !{!38, !6}
!871 = !DISubprogram(name: "setutxent", scope: !868, file: !868, line: 53, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!872 = !DISubprogram(name: "getutxent", scope: !868, file: !868, line: 65, type: !873, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!873 = !DISubroutineType(types: !874)
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !486, line: 55, size: 3072, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !889, !890, !895, !896}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !876, file: !486, line: 57, baseType: !489, size: 16)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !876, file: !486, line: 58, baseType: !491, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !876, file: !486, line: 59, baseType: !493, size: 256, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !876, file: !486, line: 61, baseType: !329, size: 32, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !876, file: !486, line: 63, baseType: !493, size: 256, offset: 352)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !876, file: !486, line: 65, baseType: !372, size: 2048, offset: 608)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !876, file: !486, line: 67, baseType: !885, size: 32, offset: 2656)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !486, line: 42, size: 32, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !885, file: !486, line: 45, baseType: !489, size: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !885, file: !486, line: 46, baseType: !489, size: 16, offset: 16)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !876, file: !486, line: 74, baseType: !505, size: 32, offset: 2688)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !876, file: !486, line: 79, baseType: !891, size: 64, offset: 2720)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !876, file: !486, line: 75, size: 64, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !891, file: !486, line: 77, baseType: !505, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !891, file: !486, line: 78, baseType: !505, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !876, file: !486, line: 84, baseType: !512, size: 128, offset: 2784)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !876, file: !486, line: 85, baseType: !113, size: 160, offset: 2912)
!897 = !DISubprogram(name: "endutxent", scope: !868, file: !868, line: 59, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!898 = !DISubprogram(name: "kill", scope: !899, file: !899, line: 112, type: !900, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!899 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!900 = !DISubroutineType(types: !901)
!901 = !{!38, !38, !38}
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !904, retainedTypes: !908, globals: !937, splitDebugInlining: false, nameTableKind: None)
!903 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!904 = !{!905}
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !903, line: 50, baseType: !198, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!908 = !{!309, !909, !926, !927, !930, !931, !932, !933, !936, !14, !108}
!909 = !DISubprogram(name: "gmtime_r", scope: !529, file: !529, line: 128, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!910 = !DISubroutineType(types: !911)
!911 = !{!912, !551, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !538, line: 7, size: 448, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !913, file: !538, line: 9, baseType: !38, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !913, file: !538, line: 10, baseType: !38, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !913, file: !538, line: 11, baseType: !38, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !913, file: !538, line: 12, baseType: !38, size: 32, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !913, file: !538, line: 13, baseType: !38, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !913, file: !538, line: 14, baseType: !38, size: 32, offset: 160)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !913, file: !538, line: 15, baseType: !38, size: 32, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !913, file: !538, line: 16, baseType: !38, size: 32, offset: 224)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !913, file: !538, line: 17, baseType: !38, size: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !913, file: !538, line: 20, baseType: !85, size: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !913, file: !538, line: 21, baseType: !6, size: 64, offset: 384)
!926 = !DISubprogram(name: "localtime_r", scope: !529, file: !529, line: 133, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!927 = !DISubprogram(name: "timegm", scope: !529, file: !529, line: 190, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!928 = !DISubroutineType(types: !929)
!929 = !{!85, !912}
!930 = !DISubprogram(name: "mktime", scope: !529, file: !529, line: 82, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!931 = !DISubprogram(name: "getenv", scope: !16, file: !16, line: 634, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!932 = !DISubprogram(name: "tzset", scope: !529, file: !529, line: 170, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!933 = !DISubprogram(name: "setenv", scope: !16, file: !16, line: 653, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!934 = !DISubroutineType(types: !935)
!935 = !{!38, !6, !6, !38}
!936 = !DISubprogram(name: "unsetenv", scope: !16, file: !16, line: 657, type: !869, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!937 = !{!938}
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
