source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__exit_status = type { i16, i16 }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon = type { i32, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Version", scope: !2, file: !3, line: 2, type: !6, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !5, nameTableKind: None)
!3 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "file_name", scope: !11, file: !12, line: 46, type: !6, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !13, nameTableKind: None)
!12 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!9, !14}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !11, file: !12, line: 56, type: !16, isLocal: true, isDefinition: true)
!16 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "exit_failure", scope: !19, file: !20, line: 24, type: !22, isDefinition: true)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !20, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !21, nameTableKind: None)
!20 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!21 = !{!17}
!22 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "long_options", scope: !26, file: !27, line: 34, type: !29, isLocal: true, isDefinition: true)
!26 = distinct !DICompileUnit(language: DW_LANG_C99, file: !27, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !28, nameTableKind: None)
!27 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!28 = !{!24}
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 768, elements: !39)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !32, line: 50, size: 256, elements: !33)
!32 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!33 = !{!34, !35, !36, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !32, line: 52, baseType: !6, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !31, file: !32, line: 55, baseType: !23, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !31, file: !32, line: 56, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !31, file: !32, line: 57, baseType: !23, size: 32, offset: 192)
!39 = !{!40}
!40 = !DISubrange(count: 3)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "program_name", scope: !43, file: !44, line: 33, type: !6, isDefinition: true)
!43 = distinct !DICompileUnit(language: DW_LANG_C99, file: !44, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !48, nameTableKind: None)
!44 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!48 = !{!41}
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !51, file: !52, line: 85, type: !131, isDefinition: true)
!51 = distinct !DICompileUnit(language: DW_LANG_C99, file: !52, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !89, globals: !94, nameTableKind: None)
!52 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!53 = !{!54, !69, !74}
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !55, line: 32, baseType: !56, size: 32, elements: !57)
!55 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!58 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!63 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!64 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!65 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!66 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!68 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !55, line: 242, baseType: !56, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 46, baseType: !56, size: 32, elements: !76)
!75 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!77 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!78 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!79 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!80 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!81 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!82 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!83 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!84 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!85 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!89 = !{!23, !90, !91, !47}
!90 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !92, line: 46, baseType: !93)
!92 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!93 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!94 = !{!49, !95, !101, !113, !115, !120, !127, !129}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !51, file: !52, line: 101, type: !97, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 320, elements: !99)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!99 = !{!100}
!100 = !DISubrange(count: 10)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !51, file: !52, line: 1052, type: !103, isDefinition: true)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !52, line: 65, size: 448, elements: !104)
!104 = !{!105, !106, !107, !111, !112}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !103, file: !52, line: 68, baseType: !54, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !103, file: !52, line: 71, baseType: !23, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !103, file: !52, line: 75, baseType: !108, size: 256, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 256, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !103, file: !52, line: 78, baseType: !6, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !103, file: !52, line: 81, baseType: !6, size: 64, offset: 384)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !51, file: !52, line: 116, type: !103, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "slot0", scope: !51, file: !52, line: 842, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 256)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "slotvec", scope: !51, file: !52, line: 845, type: !122, isLocal: true, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !52, line: 834, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !123, file: !52, line: 836, baseType: !91, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !123, file: !52, line: 837, baseType: !47, size: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "nslots", scope: !51, file: !52, line: 843, type: !23, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "slotvec0", scope: !51, file: !52, line: 844, type: !123, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 704, elements: !133)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!133 = !{!134}
!134 = !DISubrange(count: 11)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !137, file: !138, line: 26, type: !140, isDefinition: true)
!137 = distinct !DICompileUnit(language: DW_LANG_C99, file: !138, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !139, nameTableKind: None)
!138 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !{!135}
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 47)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !145, retainedTypes: !151, nameTableKind: None)
!144 = !DIFile(filename: "src/users.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!145 = !{!146, !54}
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 208, baseType: !56, size: 32, elements: !148)
!147 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!148 = !{!149, !150}
!149 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1, isUnsigned: true)
!150 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2, isUnsigned: true)
!151 = !{!6, !46, !91, !152, !153}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!153 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !156, retainedTypes: !160, nameTableKind: None)
!155 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!156 = !{!157}
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !155, line: 40, baseType: !56, size: 32, elements: !158)
!158 = !{!159}
!159 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!160 = !{!46}
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !163, retainedTypes: !177, nameTableKind: None)
!162 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!163 = !{!164}
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !166, file: !165, line: 186, baseType: !56, size: 32, elements: !175)
!165 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = distinct !DISubprogram(name: "x2nrealloc", scope: !165, file: !165, line: 174, type: !167, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !170)
!167 = !DISubroutineType(types: !168)
!168 = !{!46, !46, !169, !91}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!170 = !{!171, !172, !173, !174}
!171 = !DILocalVariable(name: "p", arg: 1, scope: !166, file: !165, line: 174, type: !46)
!172 = !DILocalVariable(name: "pn", arg: 2, scope: !166, file: !165, line: 174, type: !169)
!173 = !DILocalVariable(name: "s", arg: 3, scope: !166, file: !165, line: 174, type: !91)
!174 = !DILocalVariable(name: "n", scope: !166, file: !165, line: 176, type: !91)
!175 = !{!176}
!176 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!177 = !{!91, !47, !46}
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!179 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !160, nameTableKind: None)
!181 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !184, nameTableKind: None)
!183 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !{!91}
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !187, retainedTypes: !195, nameTableKind: None)
!186 = !DIFile(filename: "lib/readutmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !{!146, !188}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !189, file: !165, line: 186, baseType: !56, size: 32, elements: !175)
!189 = distinct !DISubprogram(name: "x2nrealloc", scope: !165, file: !165, line: 174, type: !167, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !185, retainedNodes: !190)
!190 = !{!191, !192, !193, !194}
!191 = !DILocalVariable(name: "p", arg: 1, scope: !189, file: !165, line: 174, type: !46)
!192 = !DILocalVariable(name: "pn", arg: 2, scope: !189, file: !165, line: 174, type: !169)
!193 = !DILocalVariable(name: "s", arg: 3, scope: !189, file: !165, line: 174, type: !91)
!194 = !DILocalVariable(name: "n", scope: !189, file: !165, line: 176, type: !91)
!195 = !{!47, !46, !91}
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!197 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!199 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !202, retainedTypes: !160, nameTableKind: None)
!201 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !{!203}
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 41, baseType: !56, size: 32, elements: !205)
!204 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!206 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!207 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!208 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!209 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!210 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!211 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!212 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!213 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!214 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!215 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!216 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!217 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!218 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!219 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!220 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!221 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!222 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!223 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!224 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!225 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!226 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!227 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!228 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!229 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!230 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!231 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!232 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!233 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!234 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!235 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!236 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!237 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!238 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!239 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!240 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!241 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!242 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!243 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!244 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!245 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!246 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!247 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!248 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!249 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!250 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!251 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!252 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!253 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!254 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!255 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!256 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!257 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!258 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!259 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!260 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!261 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!262 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!263 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!264 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!265 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!266 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!267 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!268 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!269 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!270 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!271 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!312 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!314 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!317 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!318 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!319 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!320 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!321 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!322 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!323 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!324 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!325 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!326 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!327 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!328 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!401 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!474 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!475 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!476 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!477 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!478 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!479 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!480 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!481 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!482 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!483 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!484 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!485 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!486 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!487 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!488 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!490 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!491 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!492 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!493 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!494 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!495 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!521 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!522 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!523 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!524 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!525 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!530 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!531 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!532 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!533 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !160, nameTableKind: None)
!590 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!592 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !160, nameTableKind: None)
!594 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !160, nameTableKind: None)
!596 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!597 = !{!"clang version 12.0.1"}
!598 = !{i32 7, !"Dwarf Version", i32 4}
!599 = !{i32 2, !"Debug Info Version", i32 3}
!600 = !{i32 1, !"wchar_size", i32 4}
!601 = !{i32 7, !"PIC Level", i32 2}
!602 = !{i32 7, !"PIE Level", i32 2}
!603 = distinct !DISubprogram(name: "usage", scope: !144, file: !144, line: 99, type: !604, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !606)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !23}
!606 = !{!607}
!607 = !DILocalVariable(name: "status", arg: 1, scope: !603, file: !144, line: 99, type: !23)
!608 = !DILocation(scope: !603)
!609 = !DILocation(line: 101, column: 14, scope: !610)
!610 = distinct !DILexicalBlock(scope: !603, file: !144, line: 101, column: 7)
!611 = !DILocation(line: 101, column: 7, scope: !603)
!612 = !DILocation(line: 102, column: 5, scope: !613)
!613 = distinct !DILexicalBlock(scope: !610, file: !144, line: 102, column: 5)
!614 = !{!615, !615, i64 0}
!615 = !{!"any pointer", !616, i64 0}
!616 = !{!"omnipotent char", !617, i64 0}
!617 = !{!"Simple C/C++ TBAA"}
!618 = !DILocation(line: 105, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !610, file: !144, line: 104, column: 5)
!620 = !DILocation(line: 106, column: 7, scope: !619)
!621 = !DILocation(line: 112, column: 7, scope: !619)
!622 = !DILocation(line: 113, column: 7, scope: !619)
!623 = !DILocalVariable(name: "program", arg: 1, scope: !624, file: !625, line: 634, type: !6)
!624 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !625, file: !625, line: 634, type: !626, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !628)
!625 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!626 = !DISubroutineType(types: !627)
!627 = !{null, !6}
!628 = !{!623, !629, !638, !639, !641}
!629 = !DILocalVariable(name: "infomap", scope: !624, file: !625, line: 636, type: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 896, elements: !636)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !624, file: !625, line: 636, size: 128, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !632, file: !625, line: 636, baseType: !6, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !632, file: !625, line: 636, baseType: !6, size: 64, offset: 64)
!636 = !{!637}
!637 = !DISubrange(count: 7)
!638 = !DILocalVariable(name: "node", scope: !624, file: !625, line: 646, type: !6)
!639 = !DILocalVariable(name: "map_prog", scope: !624, file: !625, line: 647, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!641 = !DILocalVariable(name: "lc_messages", scope: !624, file: !625, line: 659, type: !6)
!642 = !DILocation(scope: !624, inlinedAt: !643)
!643 = distinct !DILocation(line: 114, column: 7, scope: !619)
!644 = !DILocation(line: 636, column: 3, scope: !624, inlinedAt: !643)
!645 = !DILocation(line: 636, column: 67, scope: !624, inlinedAt: !643)
!646 = !DILocation(line: 647, column: 36, scope: !624, inlinedAt: !643)
!647 = !DILocation(line: 649, column: 3, scope: !624, inlinedAt: !643)
!648 = !DILocation(line: 649, column: 33, scope: !624, inlinedAt: !643)
!649 = !DILocation(line: 650, column: 13, scope: !624, inlinedAt: !643)
!650 = !DILocation(line: 649, column: 20, scope: !624, inlinedAt: !643)
!651 = !{!652, !615, i64 0}
!652 = !{!"infomap", !615, i64 0, !615, i64 8}
!653 = !DILocation(line: 649, column: 10, scope: !624, inlinedAt: !643)
!654 = !DILocation(line: 649, column: 28, scope: !624, inlinedAt: !643)
!655 = distinct !{!655, !647, !649, !656}
!656 = !{!"llvm.loop.mustprogress"}
!657 = !DILocation(line: 652, column: 17, scope: !658, inlinedAt: !643)
!658 = distinct !DILexicalBlock(scope: !624, file: !625, line: 652, column: 7)
!659 = !{!652, !615, i64 8}
!660 = !DILocation(line: 652, column: 7, scope: !658, inlinedAt: !643)
!661 = !DILocation(line: 652, column: 7, scope: !624, inlinedAt: !643)
!662 = !DILocation(line: 655, column: 3, scope: !624, inlinedAt: !643)
!663 = !DILocation(line: 659, column: 29, scope: !624, inlinedAt: !643)
!664 = !DILocation(line: 660, column: 7, scope: !665, inlinedAt: !643)
!665 = distinct !DILexicalBlock(scope: !624, file: !625, line: 660, column: 7)
!666 = !DILocation(line: 660, column: 19, scope: !665, inlinedAt: !643)
!667 = !DILocation(line: 660, column: 22, scope: !665, inlinedAt: !643)
!668 = !DILocation(line: 660, column: 7, scope: !624, inlinedAt: !643)
!669 = !DILocation(line: 666, column: 7, scope: !670, inlinedAt: !643)
!670 = distinct !DILexicalBlock(scope: !665, file: !625, line: 661, column: 5)
!671 = !DILocation(line: 668, column: 5, scope: !670, inlinedAt: !643)
!672 = !DILocation(line: 669, column: 3, scope: !624, inlinedAt: !643)
!673 = !DILocation(line: 671, column: 3, scope: !624, inlinedAt: !643)
!674 = !DILocation(line: 673, column: 1, scope: !624, inlinedAt: !643)
!675 = !DILocation(line: 116, column: 3, scope: !603)
!676 = !DISubprogram(name: "dcgettext", scope: !677, file: !677, line: 51, type: !678, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!677 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!678 = !DISubroutineType(types: !679)
!679 = !{!47, !6, !6, !23}
!680 = !DISubprogram(name: "fputs_unlocked", scope: !681, file: !681, line: 667, type: !682, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!681 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!682 = !DISubroutineType(types: !683)
!683 = !{!23, !6, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !686, line: 49, size: 1728, elements: !687)
!686 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !703, !704, !705, !706, !710, !711, !713, !717, !720, !722, !725, !728, !729, !730, !731, !732}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !685, file: !686, line: 51, baseType: !23, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !685, file: !686, line: 54, baseType: !47, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !685, file: !686, line: 55, baseType: !47, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !685, file: !686, line: 56, baseType: !47, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !685, file: !686, line: 57, baseType: !47, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !685, file: !686, line: 58, baseType: !47, size: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !685, file: !686, line: 59, baseType: !47, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !685, file: !686, line: 60, baseType: !47, size: 64, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !685, file: !686, line: 61, baseType: !47, size: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !685, file: !686, line: 64, baseType: !47, size: 64, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !685, file: !686, line: 65, baseType: !47, size: 64, offset: 640)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !685, file: !686, line: 66, baseType: !47, size: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !685, file: !686, line: 68, baseType: !701, size: 64, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !686, line: 36, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !685, file: !686, line: 70, baseType: !684, size: 64, offset: 832)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !685, file: !686, line: 72, baseType: !23, size: 32, offset: 896)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !685, file: !686, line: 73, baseType: !23, size: 32, offset: 928)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !685, file: !686, line: 74, baseType: !707, size: 64, offset: 960)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !708, line: 152, baseType: !709)
!708 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!709 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !685, file: !686, line: 77, baseType: !90, size: 16, offset: 1024)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !685, file: !686, line: 78, baseType: !712, size: 8, offset: 1040)
!712 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !685, file: !686, line: 79, baseType: !714, size: 8, offset: 1048)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 1)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !685, file: !686, line: 81, baseType: !718, size: 64, offset: 1088)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !686, line: 43, baseType: null)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !685, file: !686, line: 89, baseType: !721, size: 64, offset: 1152)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !708, line: 153, baseType: !709)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !685, file: !686, line: 91, baseType: !723, size: 64, offset: 1216)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !686, line: 37, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !685, file: !686, line: 92, baseType: !726, size: 64, offset: 1280)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !686, line: 38, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !685, file: !686, line: 93, baseType: !684, size: 64, offset: 1344)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !685, file: !686, line: 94, baseType: !46, size: 64, offset: 1408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !685, file: !686, line: 95, baseType: !91, size: 64, offset: 1472)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !685, file: !686, line: 96, baseType: !23, size: 32, offset: 1536)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !685, file: !686, line: 98, baseType: !733, size: 160, offset: 1568)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 20)
!736 = !DISubprogram(name: "setlocale", scope: !737, file: !737, line: 122, type: !738, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!737 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!738 = !DISubroutineType(types: !739)
!739 = !{!47, !23, !6}
!740 = distinct !DISubprogram(name: "main", scope: !144, file: !144, line: 120, type: !741, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!23, !23, !152}
!743 = !{!744, !745}
!744 = !DILocalVariable(name: "argc", arg: 1, scope: !740, file: !144, line: 120, type: !23)
!745 = !DILocalVariable(name: "argv", arg: 2, scope: !740, file: !144, line: 120, type: !152)
!746 = !DILocation(scope: !740)
!747 = !DILocation(line: 123, column: 21, scope: !740)
!748 = !DILocation(line: 123, column: 3, scope: !740)
!749 = !DILocation(line: 124, column: 3, scope: !740)
!750 = !DILocation(line: 125, column: 3, scope: !740)
!751 = !DILocation(line: 126, column: 3, scope: !740)
!752 = !DILocation(line: 128, column: 3, scope: !740)
!753 = !DILocation(line: 131, column: 36, scope: !740)
!754 = !DILocation(line: 130, column: 3, scope: !740)
!755 = !DILocation(line: 134, column: 18, scope: !740)
!756 = !{!757, !757, i64 0}
!757 = !{!"int", !616, i64 0}
!758 = !DILocation(line: 134, column: 16, scope: !740)
!759 = !DILocation(line: 134, column: 3, scope: !740)
!760 = !DILocation(line: 137, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !740, file: !144, line: 135, column: 5)
!762 = !DILocation(line: 138, column: 7, scope: !761)
!763 = !DILocation(line: 141, column: 14, scope: !761)
!764 = !DILocation(line: 141, column: 7, scope: !761)
!765 = !DILocation(line: 142, column: 7, scope: !761)
!766 = !DILocation(line: 145, column: 20, scope: !761)
!767 = !DILocation(line: 145, column: 55, scope: !761)
!768 = !DILocation(line: 145, column: 62, scope: !761)
!769 = !DILocation(line: 145, column: 50, scope: !761)
!770 = !DILocation(line: 145, column: 43, scope: !761)
!771 = !DILocation(line: 145, column: 7, scope: !761)
!772 = !DILocation(line: 146, column: 7, scope: !761)
!773 = !DILocation(line: 149, column: 3, scope: !740)
!774 = !DISubprogram(name: "bindtextdomain", scope: !677, file: !677, line: 86, type: !775, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!775 = !DISubroutineType(types: !776)
!776 = !{!47, !6, !6}
!777 = !DISubprogram(name: "textdomain", scope: !677, file: !677, line: 82, type: !778, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!778 = !DISubroutineType(types: !779)
!779 = !{!47, !6}
!780 = !DISubprogram(name: "atexit", scope: !781, file: !781, line: 595, type: !782, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!781 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!782 = !DISubroutineType(types: !783)
!783 = !{!23, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null}
!787 = distinct !DISubprogram(name: "users", scope: !144, file: !144, line: 85, type: !788, scopeLine: 86, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !6, !23}
!790 = !{!791, !792, !793, !794}
!791 = !DILocalVariable(name: "filename", arg: 1, scope: !787, file: !144, line: 85, type: !6)
!792 = !DILocalVariable(name: "options", arg: 2, scope: !787, file: !144, line: 85, type: !23)
!793 = !DILocalVariable(name: "n_users", scope: !787, file: !144, line: 87, type: !91)
!794 = !DILocalVariable(name: "utmp_buf", scope: !787, file: !144, line: 88, type: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !147, line: 146, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !798, line: 55, size: 3072, elements: !799)
!798 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "")
!799 = !{!800, !802, !804, !808, !812, !813, !814, !819, !821, !826, !828}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !797, file: !798, line: 57, baseType: !801, size: 16)
!801 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !797, file: !798, line: 58, baseType: !803, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !708, line: 154, baseType: !23)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !797, file: !798, line: 59, baseType: !805, size: 256, offset: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !797, file: !798, line: 61, baseType: !809, size: 32, offset: 320)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 4)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !797, file: !798, line: 63, baseType: !805, size: 256, offset: 352)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !797, file: !798, line: 65, baseType: !117, size: 2048, offset: 608)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !797, file: !798, line: 67, baseType: !815, size: 32, offset: 2656)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !798, line: 42, size: 32, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !815, file: !798, line: 45, baseType: !801, size: 16)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !815, file: !798, line: 46, baseType: !801, size: 16, offset: 16)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !797, file: !798, line: 74, baseType: !820, size: 32, offset: 2688)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !708, line: 41, baseType: !23)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !797, file: !798, line: 79, baseType: !822, size: 64, offset: 2720)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !798, line: 75, size: 64, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !822, file: !798, line: 77, baseType: !820, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !822, file: !798, line: 78, baseType: !820, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !797, file: !798, line: 84, baseType: !827, size: 128, offset: 2784)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 128, elements: !810)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !797, file: !798, line: 85, baseType: !733, size: 160, offset: 2912)
!829 = !DILocation(scope: !787)
!830 = !DILocation(line: 87, column: 3, scope: !787)
!831 = !DILocation(line: 88, column: 3, scope: !787)
!832 = !DILocation(line: 90, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !787, file: !144, line: 90, column: 7)
!834 = !DILocation(line: 90, column: 58, scope: !833)
!835 = !DILocation(line: 90, column: 7, scope: !787)
!836 = !DILocation(line: 91, column: 5, scope: !833)
!837 = !DILocation(line: 93, column: 23, scope: !787)
!838 = !{!839, !839, i64 0}
!839 = !{!"long", !616, i64 0}
!840 = !DILocalVariable(name: "n", arg: 1, scope: !841, file: !144, line: 47, type: !91)
!841 = distinct !DISubprogram(name: "list_entries_users", scope: !144, file: !144, line: 47, type: !842, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !846)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !91, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!846 = !{!840, !847, !848, !849, !850, !851, !855}
!847 = !DILocalVariable(name: "this", arg: 2, scope: !841, file: !144, line: 47, type: !844)
!848 = !DILocalVariable(name: "u", scope: !841, file: !144, line: 49, type: !152)
!849 = !DILocalVariable(name: "i", scope: !841, file: !144, line: 50, type: !91)
!850 = !DILocalVariable(name: "n_entries", scope: !841, file: !144, line: 51, type: !91)
!851 = !DILocalVariable(name: "trimmed_name", scope: !852, file: !144, line: 57, type: !47)
!852 = distinct !DILexicalBlock(scope: !853, file: !144, line: 56, column: 9)
!853 = distinct !DILexicalBlock(scope: !854, file: !144, line: 55, column: 11)
!854 = distinct !DILexicalBlock(scope: !841, file: !144, line: 54, column: 5)
!855 = !DILocalVariable(name: "c", scope: !856, file: !144, line: 71, type: !8)
!856 = distinct !DILexicalBlock(scope: !857, file: !144, line: 70, column: 5)
!857 = distinct !DILexicalBlock(scope: !858, file: !144, line: 69, column: 3)
!858 = distinct !DILexicalBlock(scope: !841, file: !144, line: 69, column: 3)
!859 = !DILocation(scope: !841, inlinedAt: !860)
!860 = distinct !DILocation(line: 93, column: 3, scope: !787)
!861 = !DILocalVariable(name: "n", arg: 1, scope: !862, file: !165, line: 99, type: !91)
!862 = distinct !DISubprogram(name: "xnmalloc", scope: !165, file: !165, line: 99, type: !863, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !865)
!863 = !DISubroutineType(types: !864)
!864 = !{!46, !91, !91}
!865 = !{!861, !866}
!866 = !DILocalVariable(name: "s", arg: 2, scope: !862, file: !165, line: 99, type: !91)
!867 = !DILocation(scope: !862, inlinedAt: !868)
!868 = distinct !DILocation(line: 49, column: 14, scope: !841, inlinedAt: !860)
!869 = !DILocation(line: 101, column: 7, scope: !870, inlinedAt: !868)
!870 = distinct !DILexicalBlock(scope: !862, file: !165, line: 101, column: 7)
!871 = !DILocation(line: 101, column: 7, scope: !862, inlinedAt: !868)
!872 = !DILocation(line: 102, column: 5, scope: !870, inlinedAt: !868)
!873 = !DILocation(line: 93, column: 32, scope: !787)
!874 = !DILocation(line: 103, column: 21, scope: !862, inlinedAt: !868)
!875 = !DILocation(line: 103, column: 10, scope: !862, inlinedAt: !868)
!876 = !DILocation(line: 49, column: 14, scope: !841, inlinedAt: !860)
!877 = !DILocation(line: 53, column: 3, scope: !841, inlinedAt: !860)
!878 = !DILocation(line: 67, column: 3, scope: !841, inlinedAt: !860)
!879 = !DILocation(line: 69, column: 3, scope: !858, inlinedAt: !860)
!880 = !DILocation(line: 53, column: 11, scope: !841, inlinedAt: !860)
!881 = !DILocation(line: 55, column: 11, scope: !853, inlinedAt: !860)
!882 = !{!616, !616, i64 0}
!883 = !{!884, !885, i64 0}
!884 = !{!"utmpx", !885, i64 0, !757, i64 4, !616, i64 8, !616, i64 40, !616, i64 44, !616, i64 76, !886, i64 332, !757, i64 336, !887, i64 340, !616, i64 348, !616, i64 364}
!885 = !{!"short", !616, i64 0}
!886 = !{!"__exit_status", !885, i64 0, !885, i64 2}
!887 = !{!"", !757, i64 0, !757, i64 4}
!888 = !DILocation(line: 55, column: 11, scope: !854, inlinedAt: !860)
!889 = !DILocation(line: 59, column: 26, scope: !852, inlinedAt: !860)
!890 = !DILocation(scope: !852, inlinedAt: !860)
!891 = !DILocation(line: 61, column: 11, scope: !852, inlinedAt: !860)
!892 = !DILocation(line: 61, column: 24, scope: !852, inlinedAt: !860)
!893 = !DILocation(line: 62, column: 11, scope: !852, inlinedAt: !860)
!894 = !DILocation(line: 63, column: 9, scope: !852, inlinedAt: !860)
!895 = !DILocation(line: 64, column: 11, scope: !854, inlinedAt: !860)
!896 = distinct !{!896, !877, !897, !656}
!897 = !DILocation(line: 65, column: 5, scope: !841, inlinedAt: !860)
!898 = !DILocation(line: 69, column: 17, scope: !857, inlinedAt: !860)
!899 = !DILocation(line: 71, column: 19, scope: !856, inlinedAt: !860)
!900 = !DILocation(scope: !856, inlinedAt: !860)
!901 = !DILocation(line: 72, column: 7, scope: !856, inlinedAt: !860)
!902 = !DILocation(line: 71, column: 16, scope: !856, inlinedAt: !860)
!903 = !DILocalVariable(name: "__c", arg: 1, scope: !904, file: !905, line: 108, type: !23)
!904 = distinct !DISubprogram(name: "putchar_unlocked", scope: !905, file: !905, line: 108, type: !906, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !908)
!905 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!906 = !DISubroutineType(types: !907)
!907 = !{!23, !23}
!908 = !{!903}
!909 = !DILocation(scope: !904, inlinedAt: !910)
!910 = distinct !DILocation(line: 73, column: 7, scope: !856, inlinedAt: !860)
!911 = !DILocation(line: 110, column: 10, scope: !904, inlinedAt: !910)
!912 = !{!913, !615, i64 40}
!913 = !{!"_IO_FILE", !757, i64 0, !615, i64 8, !615, i64 16, !615, i64 24, !615, i64 32, !615, i64 40, !615, i64 48, !615, i64 56, !615, i64 64, !615, i64 72, !615, i64 80, !615, i64 88, !615, i64 96, !615, i64 104, !757, i64 112, !757, i64 116, !839, i64 120, !885, i64 128, !616, i64 130, !616, i64 131, !615, i64 136, !839, i64 144, !615, i64 152, !615, i64 160, !615, i64 168, !615, i64 176, !839, i64 184, !757, i64 192, !616, i64 196}
!914 = !{!913, !615, i64 48}
!915 = !{!"branch_weights", i32 2000, i32 1}
!916 = !DILocation(line: 69, column: 31, scope: !857, inlinedAt: !860)
!917 = distinct !{!917, !879, !918, !656}
!918 = !DILocation(line: 74, column: 5, scope: !858, inlinedAt: !860)
!919 = !DILocation(line: 77, column: 11, scope: !920, inlinedAt: !860)
!920 = distinct !DILexicalBlock(scope: !921, file: !144, line: 76, column: 3)
!921 = distinct !DILexicalBlock(scope: !841, file: !144, line: 76, column: 3)
!922 = !DILocation(line: 77, column: 5, scope: !920, inlinedAt: !860)
!923 = !DILocation(line: 76, column: 31, scope: !920, inlinedAt: !860)
!924 = !DILocation(line: 76, column: 17, scope: !920, inlinedAt: !860)
!925 = !DILocation(line: 76, column: 3, scope: !921, inlinedAt: !860)
!926 = distinct !{!926, !925, !927, !656}
!927 = !DILocation(line: 77, column: 15, scope: !921, inlinedAt: !860)
!928 = !DILocation(line: 78, column: 3, scope: !841, inlinedAt: !860)
!929 = !DILocation(line: 95, column: 9, scope: !787)
!930 = !DILocation(line: 95, column: 3, scope: !787)
!931 = !DILocation(line: 96, column: 1, scope: !787)
!932 = !DISubprogram(name: "error", scope: !933, file: !933, line: 52, type: !934, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!933 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!934 = !DISubroutineType(types: !935)
!935 = !{null, !23, !23, !6, null}
!936 = distinct !DISubprogram(name: "userid_compare", scope: !144, file: !144, line: 39, type: !937, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !941)
!937 = !DISubroutineType(types: !938)
!938 = !{!23, !939, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!941 = !{!942, !943, !944, !945}
!942 = !DILocalVariable(name: "v_a", arg: 1, scope: !936, file: !144, line: 39, type: !939)
!943 = !DILocalVariable(name: "v_b", arg: 2, scope: !936, file: !144, line: 39, type: !939)
!944 = !DILocalVariable(name: "a", scope: !936, file: !144, line: 41, type: !152)
!945 = !DILocalVariable(name: "b", scope: !936, file: !144, line: 42, type: !152)
!946 = !DILocation(scope: !936)
!947 = !DILocation(line: 41, column: 14, scope: !936)
!948 = !DILocation(line: 42, column: 14, scope: !936)
!949 = !DILocation(line: 43, column: 18, scope: !936)
!950 = !DILocation(line: 43, column: 22, scope: !936)
!951 = !DILocation(line: 43, column: 10, scope: !936)
!952 = !DILocation(line: 43, column: 3, scope: !936)
!953 = !DISubprogram(name: "qsort", scope: !781, file: !781, line: 830, type: !954, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !46, !93, !93, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!957 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !12, file: !12, line: 51, type: !626, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !958)
!958 = !{!959}
!959 = !DILocalVariable(name: "file", arg: 1, scope: !957, file: !12, line: 51, type: !6)
!960 = !DILocation(scope: !957)
!961 = !DILocation(line: 53, column: 13, scope: !957)
!962 = !DILocation(line: 54, column: 1, scope: !957)
!963 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !12, file: !12, line: 88, type: !964, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !966)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !16}
!966 = !{!967}
!967 = !DILocalVariable(name: "ignore", arg: 1, scope: !963, file: !12, line: 88, type: !16)
!968 = !DILocation(scope: !963)
!969 = !DILocation(line: 90, column: 16, scope: !963)
!970 = !{!971, !971, i64 0}
!971 = !{!"_Bool", !616, i64 0}
!972 = !DILocation(line: 91, column: 1, scope: !963)
!973 = distinct !DISubprogram(name: "close_stdout", scope: !12, file: !12, line: 117, type: !785, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !974)
!974 = !{!975}
!975 = !DILocalVariable(name: "write_error", scope: !976, file: !12, line: 122, type: !6)
!976 = distinct !DILexicalBlock(scope: !977, file: !12, line: 121, column: 5)
!977 = distinct !DILexicalBlock(scope: !973, file: !12, line: 119, column: 7)
!978 = !DILocation(line: 119, column: 21, scope: !977)
!979 = !DILocation(line: 119, column: 7, scope: !977)
!980 = !DILocation(line: 119, column: 29, scope: !977)
!981 = !DILocation(line: 120, column: 7, scope: !977)
!982 = !DILocation(line: 120, column: 12, scope: !977)
!983 = !{i8 0, i8 2}
!984 = !DILocation(line: 120, column: 25, scope: !977)
!985 = !DILocation(line: 120, column: 28, scope: !977)
!986 = !DILocation(line: 120, column: 34, scope: !977)
!987 = !DILocation(line: 119, column: 7, scope: !973)
!988 = !DILocation(line: 122, column: 33, scope: !976)
!989 = !DILocation(scope: !976)
!990 = !DILocation(line: 123, column: 11, scope: !991)
!991 = distinct !DILexicalBlock(scope: !976, file: !12, line: 123, column: 11)
!992 = !DILocation(scope: !991)
!993 = !DILocation(line: 123, column: 11, scope: !976)
!994 = !DILocation(line: 124, column: 36, scope: !991)
!995 = !DILocation(line: 124, column: 9, scope: !991)
!996 = !DILocation(line: 127, column: 9, scope: !991)
!997 = !DILocation(line: 129, column: 14, scope: !976)
!998 = !DILocation(line: 129, column: 7, scope: !976)
!999 = !DILocation(line: 134, column: 42, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !973, file: !12, line: 134, column: 7)
!1001 = !DILocation(line: 134, column: 28, scope: !1000)
!1002 = !DILocation(line: 134, column: 50, scope: !1000)
!1003 = !DILocation(line: 134, column: 7, scope: !973)
!1004 = !DILocation(line: 135, column: 12, scope: !1000)
!1005 = !DILocation(line: 135, column: 5, scope: !1000)
!1006 = !DILocation(line: 136, column: 1, scope: !973)
!1007 = distinct !DISubprogram(name: "parse_long_options", scope: !27, file: !27, line: 45, type: !1008, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !1011)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !23, !152, !6, !6, !6, !1010, null}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020}
!1012 = !DILocalVariable(name: "argc", arg: 1, scope: !1007, file: !27, line: 45, type: !23)
!1013 = !DILocalVariable(name: "argv", arg: 2, scope: !1007, file: !27, line: 46, type: !152)
!1014 = !DILocalVariable(name: "command_name", arg: 3, scope: !1007, file: !27, line: 47, type: !6)
!1015 = !DILocalVariable(name: "package", arg: 4, scope: !1007, file: !27, line: 48, type: !6)
!1016 = !DILocalVariable(name: "version", arg: 5, scope: !1007, file: !27, line: 49, type: !6)
!1017 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1007, file: !27, line: 50, type: !1010)
!1018 = !DILocalVariable(name: "c", scope: !1007, file: !27, line: 53, type: !23)
!1019 = !DILocalVariable(name: "saved_opterr", scope: !1007, file: !27, line: 54, type: !23)
!1020 = !DILocalVariable(name: "authors", scope: !1021, file: !27, line: 72, type: !1025)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !27, line: 71, column: 11)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !27, line: 65, column: 9)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !27, line: 63, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1007, file: !27, line: 61, column: 7)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !681, line: 52, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1027, line: 32, baseType: !1028)
!1027 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stdarg.h", directory: "")
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !27, baseType: !1029)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 192, elements: !715)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1030, file: !27, line: 72, baseType: !56, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1030, file: !27, line: 72, baseType: !56, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1030, file: !27, line: 72, baseType: !46, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1030, file: !27, line: 72, baseType: !46, size: 64, offset: 128)
!1036 = !DILocation(scope: !1007)
!1037 = !DILocation(line: 56, column: 18, scope: !1007)
!1038 = !DILocation(line: 59, column: 10, scope: !1007)
!1039 = !DILocation(line: 61, column: 12, scope: !1024)
!1040 = !DILocation(line: 62, column: 7, scope: !1024)
!1041 = !DILocation(line: 62, column: 15, scope: !1024)
!1042 = !DILocation(line: 61, column: 7, scope: !1007)
!1043 = !DILocation(line: 67, column: 11, scope: !1022)
!1044 = !DILocation(line: 68, column: 11, scope: !1022)
!1045 = !DILocation(line: 72, column: 13, scope: !1021)
!1046 = !DILocation(line: 72, column: 21, scope: !1021)
!1047 = !DILocation(line: 73, column: 13, scope: !1021)
!1048 = !DILocation(line: 74, column: 29, scope: !1021)
!1049 = !DILocation(line: 74, column: 13, scope: !1021)
!1050 = !DILocation(line: 75, column: 13, scope: !1021)
!1051 = !DILocation(line: 85, column: 10, scope: !1007)
!1052 = !DILocation(line: 89, column: 10, scope: !1007)
!1053 = !DILocation(line: 90, column: 1, scope: !1007)
!1054 = !DISubprogram(name: "getopt_long", scope: !32, file: !32, line: 66, type: !1055, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!23, !23, !1057, !6, !1059, !37}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!1060 = distinct !DISubprogram(name: "parse_gnu_standard_options_only", scope: !27, file: !27, line: 98, type: !1061, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !1063)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !23, !152, !6, !6, !6, !16, !1010, null}
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1064 = !DILocalVariable(name: "argc", arg: 1, scope: !1060, file: !27, line: 98, type: !23)
!1065 = !DILocalVariable(name: "argv", arg: 2, scope: !1060, file: !27, line: 99, type: !152)
!1066 = !DILocalVariable(name: "command_name", arg: 3, scope: !1060, file: !27, line: 100, type: !6)
!1067 = !DILocalVariable(name: "package", arg: 4, scope: !1060, file: !27, line: 101, type: !6)
!1068 = !DILocalVariable(name: "version", arg: 5, scope: !1060, file: !27, line: 102, type: !6)
!1069 = !DILocalVariable(name: "scan_all", arg: 6, scope: !1060, file: !27, line: 103, type: !16)
!1070 = !DILocalVariable(name: "usage_func", arg: 7, scope: !1060, file: !27, line: 104, type: !1010)
!1071 = !DILocalVariable(name: "c", scope: !1060, file: !27, line: 107, type: !23)
!1072 = !DILocalVariable(name: "saved_opterr", scope: !1060, file: !27, line: 108, type: !23)
!1073 = !DILocalVariable(name: "optstring", scope: !1060, file: !27, line: 113, type: !6)
!1074 = !DILocalVariable(name: "authors", scope: !1075, file: !27, line: 125, type: !1025)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !27, line: 124, column: 11)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !27, line: 118, column: 9)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !27, line: 116, column: 5)
!1078 = distinct !DILexicalBlock(scope: !1060, file: !27, line: 115, column: 7)
!1079 = !DILocation(scope: !1060)
!1080 = !DILocation(line: 108, column: 22, scope: !1060)
!1081 = !DILocation(line: 111, column: 10, scope: !1060)
!1082 = !DILocation(line: 113, column: 27, scope: !1060)
!1083 = !DILocation(line: 115, column: 12, scope: !1078)
!1084 = !DILocation(line: 115, column: 7, scope: !1060)
!1085 = !DILocation(line: 125, column: 13, scope: !1075)
!1086 = !DILocation(line: 125, column: 21, scope: !1075)
!1087 = !DILocation(line: 126, column: 13, scope: !1075)
!1088 = !DILocation(line: 127, column: 29, scope: !1075)
!1089 = !DILocation(line: 127, column: 13, scope: !1075)
!1090 = !DILocation(line: 128, column: 13, scope: !1075)
!1091 = !DILocation(line: 132, column: 26, scope: !1076)
!1092 = !DILocation(line: 133, column: 11, scope: !1076)
!1093 = !DILocation(scope: !1076)
!1094 = !DILocation(line: 138, column: 10, scope: !1060)
!1095 = !DILocation(line: 139, column: 1, scope: !1060)
!1096 = distinct !DISubprogram(name: "set_program_name", scope: !44, file: !44, line: 39, type: !626, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !43, retainedNodes: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DILocalVariable(name: "argv0", arg: 1, scope: !1096, file: !44, line: 39, type: !6)
!1099 = !DILocalVariable(name: "slash", scope: !1096, file: !44, line: 46, type: !6)
!1100 = !DILocalVariable(name: "base", scope: !1096, file: !44, line: 47, type: !6)
!1101 = !DILocation(scope: !1096)
!1102 = !DILocation(line: 51, column: 13, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1096, file: !44, line: 51, column: 7)
!1104 = !DILocation(line: 51, column: 7, scope: !1096)
!1105 = !DILocation(line: 55, column: 14, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1103, file: !44, line: 52, column: 5)
!1107 = !DILocation(line: 54, column: 7, scope: !1106)
!1108 = !DILocation(line: 56, column: 7, scope: !1106)
!1109 = !DILocation(line: 59, column: 11, scope: !1096)
!1110 = !DILocation(line: 60, column: 17, scope: !1096)
!1111 = !DILocation(line: 60, column: 11, scope: !1096)
!1112 = !DILocation(line: 61, column: 12, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1096, file: !44, line: 61, column: 7)
!1114 = !DILocation(line: 61, column: 20, scope: !1113)
!1115 = !DILocation(line: 61, column: 25, scope: !1113)
!1116 = !DILocation(line: 61, column: 42, scope: !1113)
!1117 = !DILocation(line: 61, column: 28, scope: !1113)
!1118 = !DILocation(line: 61, column: 61, scope: !1113)
!1119 = !DILocation(line: 61, column: 7, scope: !1096)
!1120 = !DILocation(line: 64, column: 11, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !44, line: 64, column: 11)
!1122 = distinct !DILexicalBlock(scope: !1113, file: !44, line: 62, column: 5)
!1123 = !DILocation(line: 64, column: 36, scope: !1121)
!1124 = !DILocation(line: 64, column: 11, scope: !1122)
!1125 = !DILocation(line: 66, column: 24, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1121, file: !44, line: 65, column: 9)
!1127 = !DILocation(line: 70, column: 41, scope: !1126)
!1128 = !DILocation(line: 72, column: 9, scope: !1126)
!1129 = !DILocation(line: 84, column: 16, scope: !1096)
!1130 = !DILocation(line: 90, column: 27, scope: !1096)
!1131 = !DILocation(line: 92, column: 1, scope: !1096)
!1132 = distinct !DISubprogram(name: "clone_quoting_options", scope: !52, file: !52, line: 122, type: !1133, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !1136)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!1135, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!1136 = !{!1137, !1138, !1139}
!1137 = !DILocalVariable(name: "o", arg: 1, scope: !1132, file: !52, line: 122, type: !1135)
!1138 = !DILocalVariable(name: "e", scope: !1132, file: !52, line: 124, type: !23)
!1139 = !DILocalVariable(name: "p", scope: !1132, file: !52, line: 125, type: !1135)
!1140 = !DILocation(scope: !1132)
!1141 = !DILocation(line: 124, column: 11, scope: !1132)
!1142 = !DILocation(line: 125, column: 40, scope: !1132)
!1143 = !DILocation(line: 125, column: 31, scope: !1132)
!1144 = !DILocation(line: 127, column: 9, scope: !1132)
!1145 = !DILocation(line: 128, column: 3, scope: !1132)
!1146 = distinct !DISubprogram(name: "get_quoting_style", scope: !52, file: !52, line: 133, type: !1147, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !1151)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!54, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!1151 = !{!1152}
!1152 = !DILocalVariable(name: "o", arg: 1, scope: !1146, file: !52, line: 133, type: !1149)
!1153 = !DILocation(scope: !1146)
!1154 = !DILocation(line: 135, column: 11, scope: !1146)
!1155 = !DILocation(line: 135, column: 46, scope: !1146)
!1156 = !{!1157, !616, i64 0}
!1157 = !{!"quoting_options", !616, i64 0, !757, i64 4, !616, i64 8, !615, i64 40, !615, i64 48}
!1158 = !DILocation(line: 135, column: 3, scope: !1146)
!1159 = distinct !DISubprogram(name: "set_quoting_style", scope: !52, file: !52, line: 141, type: !1160, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !1162)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1135, !54}
!1162 = !{!1163, !1164}
!1163 = !DILocalVariable(name: "o", arg: 1, scope: !1159, file: !52, line: 141, type: !1135)
!1164 = !DILocalVariable(name: "s", arg: 2, scope: !1159, file: !52, line: 141, type: !54)
!1165 = !DILocation(scope: !1159)
!1166 = !DILocation(line: 143, column: 4, scope: !1159)
!1167 = !DILocation(line: 143, column: 39, scope: !1159)
!1168 = !DILocation(line: 143, column: 45, scope: !1159)
!1169 = !DILocation(line: 144, column: 1, scope: !1159)
!1170 = distinct !DISubprogram(name: "set_char_quoting", scope: !52, file: !52, line: 152, type: !1171, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !1173)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!23, !1135, !8, !23}
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1180, !1181}
!1174 = !DILocalVariable(name: "o", arg: 1, scope: !1170, file: !52, line: 152, type: !1135)
!1175 = !DILocalVariable(name: "c", arg: 2, scope: !1170, file: !52, line: 152, type: !8)
!1176 = !DILocalVariable(name: "i", arg: 3, scope: !1170, file: !52, line: 152, type: !23)
!1177 = !DILocalVariable(name: "uc", scope: !1170, file: !52, line: 154, type: !153)
!1178 = !DILocalVariable(name: "p", scope: !1170, file: !52, line: 155, type: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!1180 = !DILocalVariable(name: "shift", scope: !1170, file: !52, line: 157, type: !23)
!1181 = !DILocalVariable(name: "r", scope: !1170, file: !52, line: 158, type: !23)
!1182 = !DILocation(scope: !1170)
!1183 = !DILocation(line: 156, column: 6, scope: !1170)
!1184 = !DILocation(line: 156, column: 62, scope: !1170)
!1185 = !DILocation(line: 156, column: 57, scope: !1170)
!1186 = !DILocation(line: 157, column: 15, scope: !1170)
!1187 = !DILocation(line: 158, column: 12, scope: !1170)
!1188 = !DILocation(line: 158, column: 15, scope: !1170)
!1189 = !DILocation(line: 158, column: 25, scope: !1170)
!1190 = !DILocation(line: 159, column: 13, scope: !1170)
!1191 = !DILocation(line: 159, column: 18, scope: !1170)
!1192 = !DILocation(line: 159, column: 23, scope: !1170)
!1193 = !DILocation(line: 159, column: 6, scope: !1170)
!1194 = !DILocation(line: 160, column: 3, scope: !1170)
!1195 = distinct !DISubprogram(name: "set_quoting_flags", scope: !52, file: !52, line: 168, type: !1196, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !1198)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!23, !1135, !23}
!1198 = !{!1199, !1200, !1201}
!1199 = !DILocalVariable(name: "o", arg: 1, scope: !1195, file: !52, line: 168, type: !1135)
