; ModuleID = 'coreutils-8.32/src/wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.Tokens = type { i64, i8**, i64*, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.argv_iterator = type { %struct._IO_FILE*, i64, i8*, i64, i8**, i8** }
%struct.fstatus = type { i32, %struct.stat }
%struct.__mbstate_t = type { i32, %union.anon.2 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "page_size", scope: !2, file: !3, line: 75, type: !115, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !337, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/wc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !27, !36}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "argv_iter_err", file: !21, line: 25, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/argv-iter.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "AI_ERR_OK", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "AI_ERR_EOF", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "AI_ERR_MEM", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "AI_ERR_READ", value: 4, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 45, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 46, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!39 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!41 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!44 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!45 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!46 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!47 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!50 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!51 = !{!52, !62, !123, !127, !131, !134, !137, !144, !148, !151, !113, !152, !56, !167, !171, !174, !178, !181, !186, !250, !254, !256, !261, !264, !266, !270, !273, !278, !279, !282, !283, !115, !286, !289, !293, !296, !299, !303, !320, !326, !330, !331, !60, !93, !332, !333}
!52 = !DISubprogram(name: "dcgettext", scope: !53, file: !53, line: 51, type: !54, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!53 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !58, !58, !60}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !{}
!62 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 662, type: !64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!63 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!64 = !DISubroutineType(types: !65)
!65 = !{!60, !58, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !69)
!68 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !85, !86, !87, !88, !92, !94, !96, !100, !103, !105, !108, !111, !112, !114, !118, !119}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 51, baseType: !60, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 36, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 70, baseType: !66, size: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !91)
!90 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!91 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!93 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 43, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !91)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !67, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !68, line: 37, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !67, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !68, line: 38, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !67, file: !68, line: 93, baseType: !66, size: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !67, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DISubprogram(name: "set_program_name", scope: !124, file: !124, line: 37, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!124 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!125 = !DISubroutineType(types: !126)
!126 = !{null, !58}
!127 = !DISubprogram(name: "setlocale", scope: !128, file: !128, line: 122, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!128 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!56, !60, !58}
!131 = !DISubprogram(name: "bindtextdomain", scope: !53, file: !53, line: 86, type: !132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!132 = !DISubroutineType(types: !133)
!133 = !{!56, !58, !58}
!134 = !DISubprogram(name: "textdomain", scope: !53, file: !53, line: 82, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!135 = !DISubroutineType(types: !136)
!136 = !{!56, !58}
!137 = !DISubprogram(name: "atexit", scope: !138, file: !138, line: 595, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!138 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!139 = !DISubroutineType(types: !140)
!140 = !{!60, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{null}
!144 = !DISubprogram(name: "getpagesize", scope: !145, file: !145, line: 976, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!145 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!146 = !DISubroutineType(types: !147)
!147 = !{!60}
!148 = !DISubprogram(name: "setvbuf", scope: !63, file: !63, line: 308, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!149 = !DISubroutineType(types: !150)
!150 = !{!60, !66, !56, !60, !117}
!151 = !DISubprogram(name: "getenv", scope: !138, file: !138, line: 634, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 66, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!153 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!60, !60, !156, !58, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 50, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 52, baseType: !58, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 55, baseType: !60, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 57, baseType: !60, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 69, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !66, !58, !58, !58, null}
!171 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!172 = !DISubroutineType(types: !173)
!173 = !{!56, !5, !58}
!174 = !DISubprogram(name: "error", scope: !175, file: !175, line: 52, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!175 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !DISubroutineType(types: !177)
!177 = !{null, !60, !60, !58, null}
!178 = !DISubprogram(name: "fileno", scope: !63, file: !63, line: 786, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!179 = !DISubroutineType(types: !180)
!180 = !{!60, !66}
!181 = !DISubprogram(name: "physmem_available", scope: !182, file: !182, line: 24, type: !183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!182 = !DIFile(filename: "./lib/physmem.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !DISubroutineType(types: !184)
!184 = !{!185}
!185 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!186 = !DISubprogram(name: "readtokens0_init", scope: !187, file: !187, line: 38, type: !188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!187 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubroutineType(types: !189)
!189 = !{null, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !187, line: 28, size: 2304, elements: !192)
!192 = !{!193, !194, !196, !198, !248, !249}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !191, file: !187, line: 30, baseType: !115, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !191, file: !187, line: 31, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !191, file: !187, line: 32, baseType: !197, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !191, file: !187, line: 33, baseType: !199, size: 704, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !200, line: 174, size: 704, elements: !201)
!200 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !{!202, !203, !213, !214, !215, !216, !221, !222, !233, !244, !245, !246, !247}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !199, file: !200, line: 176, baseType: !115, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !199, file: !200, line: 177, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !200, line: 167, size: 128, elements: !206)
!206 = !{!207, !208, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !205, file: !200, line: 169, baseType: !56, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !200, line: 170, baseType: !204, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !205, file: !200, line: 171, baseType: !210, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: -1)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !199, file: !200, line: 178, baseType: !56, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !199, file: !200, line: 179, baseType: !56, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !199, file: !200, line: 180, baseType: !56, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !199, file: !200, line: 185, baseType: !217, size: 64, offset: 320)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !199, file: !200, line: 181, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !217, file: !200, line: 183, baseType: !115, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !217, file: !200, line: 184, baseType: !113, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !199, file: !200, line: 186, baseType: !115, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !199, file: !200, line: 193, baseType: !223, size: 64, offset: 448)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !199, file: !200, line: 189, size: 64, elements: !224)
!224 = !{!225, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !223, file: !200, line: 191, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!113, !115}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !223, file: !200, line: 192, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!113, !113, !115}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !199, file: !200, line: 198, baseType: !234, size: 64, offset: 512)
!234 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !199, file: !200, line: 194, size: 64, elements: !235)
!235 = !{!236, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !234, file: !200, line: 196, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !113}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !234, file: !200, line: 197, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !113, !113}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !199, file: !200, line: 200, baseType: !113, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !199, file: !200, line: 201, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !199, file: !200, line: 202, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !199, file: !200, line: 206, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !191, file: !187, line: 34, baseType: !199, size: 704, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !191, file: !187, line: 35, baseType: !199, size: 704, offset: 1600)
!250 = !DISubprogram(name: "readtokens0", scope: !187, file: !187, line: 40, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!251 = !DISubroutineType(types: !252)
!252 = !{!253, !66, !190}
!253 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!254 = !DISubprogram(name: "rpl_fclose", scope: !255, file: !255, line: 672, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!255 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !DISubprogram(name: "argv_iter_init_argv", scope: !21, file: !21, line: 33, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !195}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !21, line: 23, flags: DIFlagFwdDecl)
!261 = !DISubprogram(name: "argv_iter_init_stream", scope: !21, file: !21, line: 35, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!262 = !DISubroutineType(types: !263)
!263 = !{!259, !66}
!264 = !DISubprogram(name: "xalloc_die", scope: !265, file: !265, line: 51, type: !142, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !61)
!265 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = !DISubprogram(name: "argv_iter", scope: !21, file: !21, line: 37, type: !267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!267 = !DISubroutineType(types: !268)
!268 = !{!56, !259, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!270 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!271 = !DISubroutineType(types: !272)
!272 = !{!56, !60, !5, !58}
!273 = !DISubprogram(name: "argv_iter_n_args", scope: !21, file: !21, line: 39, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!274 = !DISubroutineType(types: !275)
!275 = !{!117, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!278 = !DISubprogram(name: "readtokens0_free", scope: !187, file: !187, line: 39, type: !188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!279 = !DISubprogram(name: "argv_iter_free", scope: !21, file: !21, line: 41, type: !280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !259}
!282 = !DISubprogram(name: "free", scope: !138, file: !138, line: 565, type: !238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!283 = !DISubprogram(name: "close", scope: !145, file: !145, line: 353, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!284 = !DISubroutineType(types: !285)
!285 = !{!60, !60}
!286 = !DISubprogram(name: "xmalloc", scope: !265, file: !265, line: 53, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!287 = !DISubroutineType(types: !288)
!288 = !{!113, !117}
!289 = !DISubprogram(name: "open", scope: !290, file: !290, line: 196, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!290 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!291 = !DISubroutineType(types: !292)
!292 = !{!60, !58, !60, null}
!293 = !DISubprogram(name: "fdadvise", scope: !28, file: !28, line: 71, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !60, !91, !91, !27}
!296 = !DISubprogram(name: "lseek", scope: !145, file: !145, line: 334, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!297 = !DISubroutineType(types: !298)
!298 = !{!91, !60, !91, !60}
!299 = !DISubprogram(name: "safe_read", scope: !300, file: !300, line: 42, type: !301, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!300 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !DISubroutineType(types: !302)
!302 = !{!117, !60, !113, !117}
!303 = !DISubprogram(name: "rpl_mbrtowc", scope: !304, file: !304, line: 717, type: !305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!304 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!305 = !DISubroutineType(types: !306)
!306 = !{!117, !165, !58, !117, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 13, size: 64, elements: !310)
!309 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !308, file: !309, line: 15, baseType: !60, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !308, file: !309, line: 20, baseType: !313, size: 32, offset: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !308, file: !309, line: 16, size: 32, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !313, file: !309, line: 18, baseType: !7, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !313, file: !309, line: 19, baseType: !317, size: 32)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 4)
!320 = !DISubprogram(name: "mbsinit", scope: !321, file: !321, line: 292, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!321 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!322 = !DISubroutineType(types: !323)
!323 = !{!60, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!326 = !DISubprogram(name: "iswprint", scope: !327, file: !327, line: 120, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!327 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!328 = !DISubroutineType(types: !329)
!329 = !{!60, !7}
!330 = !DISubprogram(name: "wcwidth", scope: !321, file: !321, line: 367, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!331 = !DISubprogram(name: "iswspace", scope: !327, file: !327, line: 130, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!332 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!333 = !DISubprogram(name: "umaxtostr", scope: !334, file: !334, line: 46, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!334 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!335 = !DISubroutineType(types: !336)
!336 = !{!56, !117, !56}
!337 = !{!338, !417, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !442, !0, !444, !446, !451}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "stdin_only", scope: !340, file: !3, line: 799, type: !416, isLocal: true, isDefinition: true)
!340 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 680, type: !341, scopeLine: 681, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !343)
!341 = !DISubroutineType(types: !342)
!342 = !{!60, !60, !195}
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !393, !394, !395, !396, !402, !403, !405, !408, !409, !410, !415}
!344 = !DILocalVariable(name: "argc", arg: 1, scope: !340, file: !3, line: 680, type: !60)
!345 = !DILocalVariable(name: "argv", arg: 2, scope: !340, file: !3, line: 680, type: !195)
!346 = !DILocalVariable(name: "ok", scope: !340, file: !3, line: 682, type: !253)
!347 = !DILocalVariable(name: "optc", scope: !340, file: !3, line: 683, type: !60)
!348 = !DILocalVariable(name: "nfiles", scope: !340, file: !3, line: 684, type: !115)
!349 = !DILocalVariable(name: "files", scope: !340, file: !3, line: 685, type: !195)
!350 = !DILocalVariable(name: "files_from", scope: !340, file: !3, line: 686, type: !56)
!351 = !DILocalVariable(name: "fstatus", scope: !340, file: !3, line: 687, type: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !3, line: 81, size: 1216, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !353, file: !3, line: 85, baseType: !60, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !353, file: !3, line: 88, baseType: !357, size: 1152, offset: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !358, line: 46, size: 1152, elements: !359)
!358 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!359 = !{!360, !362, !364, !366, !368, !370, !372, !373, !374, !375, !377, !379, !387, !388, !389}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !357, file: !358, line: 48, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !90, line: 145, baseType: !117)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !357, file: !358, line: 53, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !90, line: 148, baseType: !117)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !357, file: !358, line: 61, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !90, line: 151, baseType: !117)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !357, file: !358, line: 62, baseType: !367, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !90, line: 150, baseType: !7)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !357, file: !358, line: 64, baseType: !369, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !90, line: 146, baseType: !7)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !357, file: !358, line: 65, baseType: !371, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !90, line: 147, baseType: !7)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !357, file: !358, line: 67, baseType: !60, size: 32, offset: 288)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !357, file: !358, line: 69, baseType: !361, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !357, file: !358, line: 74, baseType: !89, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !357, file: !358, line: 78, baseType: !376, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !90, line: 174, baseType: !91)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !357, file: !358, line: 80, baseType: !378, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !90, line: 179, baseType: !91)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !357, file: !358, line: 91, baseType: !380, size: 128, offset: 576)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !381, line: 10, size: 128, elements: !382)
!381 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!382 = !{!383, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !380, file: !381, line: 12, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 160, baseType: !91)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !380, file: !381, line: 16, baseType: !386, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !90, line: 196, baseType: !91)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !357, file: !358, line: 92, baseType: !380, size: 128, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !357, file: !358, line: 93, baseType: !380, size: 128, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !357, file: !358, line: 106, baseType: !390, size: 192, offset: 960)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 192, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 3)
!393 = !DILocalVariable(name: "tok", scope: !340, file: !3, line: 688, type: !191)
!394 = !DILocalVariable(name: "read_tokens", scope: !340, file: !3, line: 748, type: !253)
!395 = !DILocalVariable(name: "ai", scope: !340, file: !3, line: 749, type: !259)
!396 = !DILocalVariable(name: "stream", scope: !397, file: !3, line: 752, type: !399)
!397 = distinct !DILexicalBlock(scope: !398, file: !3, line: 751, column: 5)
!398 = distinct !DILexicalBlock(scope: !340, file: !3, line: 750, column: 7)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !401, line: 7, baseType: !67)
!401 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!402 = !DILocalVariable(name: "st", scope: !397, file: !3, line: 776, type: !357)
!403 = !DILocalVariable(name: "i", scope: !404, file: !3, line: 812, type: !60)
!404 = distinct !DILexicalBlock(scope: !340, file: !3, line: 812, column: 3)
!405 = !DILocalVariable(name: "skip_file", scope: !406, file: !3, line: 814, type: !253)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 813, column: 5)
!407 = distinct !DILexicalBlock(scope: !404, file: !3, line: 812, column: 3)
!408 = !DILocalVariable(name: "ai_err", scope: !406, file: !3, line: 815, type: !20)
!409 = !DILocalVariable(name: "file_name", scope: !406, file: !3, line: 816, type: !56)
!410 = !DILocalVariable(name: "file_number", scope: !411, file: !3, line: 857, type: !117)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 853, column: 13)
!412 = distinct !DILexicalBlock(scope: !413, file: !3, line: 850, column: 15)
!413 = distinct !DILexicalBlock(scope: !414, file: !3, line: 845, column: 9)
!414 = distinct !DILexicalBlock(scope: !406, file: !3, line: 844, column: 11)
!415 = !DILabel(scope: !340, name: "argv_iter_done", file: !3, line: 872)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, elements: !98)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "total_lines", scope: !2, file: !3, line: 58, type: !419, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !420, line: 102, baseType: !421)
!420 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !90, line: 73, baseType: !117)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "total_words", scope: !2, file: !3, line: 59, type: !419, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "total_chars", scope: !2, file: !3, line: 60, type: !419, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "total_bytes", scope: !2, file: !3, line: 61, type: !419, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "max_line_length", scope: !2, file: !3, line: 62, type: !419, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "print_lines", scope: !2, file: !3, line: 65, type: !253, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "print_words", scope: !2, file: !3, line: 65, type: !253, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "print_chars", scope: !2, file: !3, line: 65, type: !253, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "print_bytes", scope: !2, file: !3, line: 65, type: !253, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "print_linelength", scope: !2, file: !3, line: 66, type: !253, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 69, type: !60, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 72, type: !253, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !2, file: !3, line: 78, type: !253, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 98, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 2304, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 9)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !453, file: !3, line: 178, type: !468, isLocal: true, isDefinition: true)
!453 = distinct !DISubprogram(name: "write_counts", scope: !3, file: !3, line: 171, type: !454, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !419, !419, !419, !419, !419, !58}
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464}
!457 = !DILocalVariable(name: "lines", arg: 1, scope: !453, file: !3, line: 171, type: !419)
!458 = !DILocalVariable(name: "words", arg: 2, scope: !453, file: !3, line: 172, type: !419)
!459 = !DILocalVariable(name: "chars", arg: 3, scope: !453, file: !3, line: 173, type: !419)
!460 = !DILocalVariable(name: "bytes", arg: 4, scope: !453, file: !3, line: 174, type: !419)
!461 = !DILocalVariable(name: "linelength", arg: 5, scope: !453, file: !3, line: 175, type: !419)
!462 = !DILocalVariable(name: "file", arg: 6, scope: !453, file: !3, line: 176, type: !58)
!463 = !DILocalVariable(name: "format_int", scope: !453, file: !3, line: 179, type: !58)
!464 = !DILocalVariable(name: "buf", scope: !453, file: !3, line: 180, type: !465)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 168, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 21)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 40, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 5)
!471 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!472 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!473 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!474 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!475 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!476 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "Version", scope: !479, file: !480, line: 2, type: !58, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, globals: !481, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !{!477}
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "file_name", scope: !484, file: !485, line: 46, type: !58, isLocal: true, isDefinition: true)
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !486, globals: !524, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!486 = !{!487, !52, !523, !174}
!487 = !DISubprogram(name: "close_stream", scope: !488, file: !488, line: 2, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!488 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!489 = !DISubroutineType(types: !490)
!490 = !{!60, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !492, file: !68, line: 51, baseType: !60, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !492, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !492, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !492, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !492, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !492, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !492, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !492, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !492, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !492, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !492, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !492, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !492, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !492, file: !68, line: 70, baseType: !491, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !492, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !492, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !492, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !492, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !492, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !492, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !492, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !492, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !492, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !492, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !492, file: !68, line: 93, baseType: !491, size: 64, offset: 1344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !492, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !492, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !492, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !492, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!523 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!524 = !{!482, !525}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !484, file: !485, line: 56, type: !253, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "exit_failure", scope: !529, file: !530, line: 24, type: !532, isLocal: false, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, globals: !531, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!531 = !{!527}
!532 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !535, file: !536, line: 28, type: !540, isLocal: false, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !537, globals: !539, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!537 = !{!330, !538, !332}
!538 = !DISubprogram(name: "iswcntrl", scope: !327, file: !327, line: 104, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!539 = !{!533}
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 256, elements: !542)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!542 = !{!543}
!543 = !DISubrange(count: 8)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "program_name", scope: !546, file: !547, line: 33, type: !58, isLocal: false, isDefinition: true)
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !548, globals: !584, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!548 = !{!113, !549, !56}
!549 = !DISubprogram(name: "fputs", scope: !63, file: !63, line: 626, type: !550, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!550 = !DISubroutineType(types: !551)
!551 = !{!60, !58, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !553, file: !68, line: 51, baseType: !60, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !553, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !553, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !553, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !553, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !553, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !553, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !553, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !553, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !553, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !553, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !553, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !553, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !553, file: !68, line: 70, baseType: !552, size: 64, offset: 832)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !553, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !553, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !553, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !553, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !553, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !553, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !553, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !553, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !553, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !553, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !553, file: !68, line: 93, baseType: !552, size: 64, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !553, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !553, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !553, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !553, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!584 = !{!544}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !587, file: !588, line: 85, type: !673, isLocal: false, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !589, retainedTypes: !595, globals: !646, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = !{!5, !590, !36}
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!593 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!594 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!595 = !{!596, !601, !282, !615, !60, !93, !618, !115, !326, !630, !52, !635, !639, !56, !286, !264, !643}
!596 = !DISubprogram(name: "xmemdup", scope: !265, file: !265, line: 62, type: !597, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!597 = !DISubroutineType(types: !598)
!598 = !{!113, !599, !117}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!601 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !602, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!602 = !DISubroutineType(types: !603)
!603 = !{!56, !58, !117, !604, !605}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !588, line: 65, size: 448, elements: !608)
!608 = !{!609, !610, !611, !613, !614}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !607, file: !588, line: 68, baseType: !5, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !607, file: !588, line: 71, baseType: !60, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !607, file: !588, line: 75, baseType: !612, size: 256, offset: 64)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !542)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !607, file: !588, line: 78, baseType: !58, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !607, file: !588, line: 81, baseType: !58, size: 64, offset: 384)
!615 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !616, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!616 = !DISubroutineType(types: !617)
!617 = !{!56, !60, !58, !58, !58, !117}
!618 = !DISubprogram(name: "rpl_mbrtowc", scope: !304, file: !304, line: 717, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!619 = !DISubroutineType(types: !620)
!620 = !{!117, !165, !58, !117, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 13, size: 64, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !622, file: !309, line: 15, baseType: !60, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !622, file: !309, line: 20, baseType: !626, size: 32, offset: 32)
!626 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !622, file: !309, line: 16, size: 32, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !626, file: !309, line: 18, baseType: !7, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !626, file: !309, line: 19, baseType: !317, size: 32)
!630 = !DISubprogram(name: "mbsinit", scope: !321, file: !321, line: 292, type: !631, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!631 = !DISubroutineType(types: !632)
!632 = !{!60, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!635 = !DISubprogram(name: "locale_charset", scope: !636, file: !636, line: 35, type: !637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!636 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!637 = !DISubroutineType(types: !638)
!638 = !{!58}
!639 = !DISubprogram(name: "c_strcasecmp", scope: !640, file: !640, line: 42, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!640 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!641 = !DISubroutineType(types: !642)
!642 = !{!60, !58, !58}
!643 = !DISubprogram(name: "xrealloc", scope: !265, file: !265, line: 59, type: !644, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!644 = !DISubroutineType(types: !645)
!645 = !{!113, !113, !117}
!646 = !{!585, !647, !653, !655, !657, !662, !669, !671}
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !587, file: !588, line: 101, type: !649, isLocal: false, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 320, elements: !651)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!651 = !{!652}
!652 = !DISubrange(count: 10)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !587, file: !588, line: 1052, type: !607, isLocal: false, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !587, file: !588, line: 116, type: !607, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "slot0", scope: !587, file: !588, line: 842, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 256)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "slotvec", scope: !587, file: !588, line: 845, type: !664, isLocal: true, isDefinition: true)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !588, line: 834, size: 128, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !588, line: 836, baseType: !115, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !665, file: !588, line: 837, baseType: !56, size: 64, offset: 64)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "nslots", scope: !587, file: !588, line: 843, type: !60, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "slotvec0", scope: !587, file: !588, line: 844, type: !665, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 704, elements: !675)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!675 = !{!676}
!676 = !DISubrange(count: 11)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !679, file: !680, line: 26, type: !682, isLocal: false, isDefinition: true)
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, globals: !681, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!681 = !{!677}
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 47)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !687, file: !688, line: 351, type: !141, isLocal: false, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !689, globals: !690, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!689 = !{!56, !113, !52}
!690 = !{!685}
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !693, retainedTypes: !694, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/argv-iter.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!693 = !{!20}
!694 = !{!695, !730, !113, !282}
!695 = !DISubprogram(name: "getdelim", scope: !63, file: !63, line: 606, type: !696, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!696 = !DISubroutineType(types: !697)
!697 = !{!91, !195, !604, !60, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !699, file: !68, line: 51, baseType: !60, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !699, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !699, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !699, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !699, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !699, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !699, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !699, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !699, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !699, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !699, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !699, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !699, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !699, file: !68, line: 70, baseType: !698, size: 64, offset: 832)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !699, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !699, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !699, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !699, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !699, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !699, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !699, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !699, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !699, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !699, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !699, file: !68, line: 93, baseType: !698, size: 64, offset: 1344)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !699, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !699, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !699, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !699, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!730 = !DISubprogram(name: "feof", scope: !63, file: !63, line: 759, type: !731, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!731 = !DISubroutineType(types: !732)
!732 = !{!60, !698}
!733 = distinct !DICompileUnit(language: DW_LANG_C99, file: !734, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !735, retainedTypes: !736, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!735 = !{!27}
!736 = !{!737, !740}
!737 = !DISubprogram(name: "posix_fadvise", scope: !290, file: !290, line: 288, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!738 = !DISubroutineType(types: !739)
!739 = !{!60, !60, !91, !91, !60}
!740 = !DISubprogram(name: "fileno", scope: !63, file: !63, line: 786, type: !741, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!741 = !DISubroutineType(types: !742)
!742 = !{!60, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !744, file: !68, line: 51, baseType: !60, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !744, file: !68, line: 54, baseType: !56, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !744, file: !68, line: 55, baseType: !56, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !744, file: !68, line: 56, baseType: !56, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !744, file: !68, line: 57, baseType: !56, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !744, file: !68, line: 58, baseType: !56, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !744, file: !68, line: 59, baseType: !56, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !744, file: !68, line: 60, baseType: !56, size: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !744, file: !68, line: 61, baseType: !56, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !744, file: !68, line: 64, baseType: !56, size: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !744, file: !68, line: 65, baseType: !56, size: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !744, file: !68, line: 66, baseType: !56, size: 64, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !744, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !744, file: !68, line: 70, baseType: !743, size: 64, offset: 832)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !744, file: !68, line: 72, baseType: !60, size: 32, offset: 896)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !744, file: !68, line: 73, baseType: !60, size: 32, offset: 928)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !744, file: !68, line: 74, baseType: !89, size: 64, offset: 960)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !744, file: !68, line: 77, baseType: !93, size: 16, offset: 1024)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !744, file: !68, line: 78, baseType: !95, size: 8, offset: 1040)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !744, file: !68, line: 79, baseType: !97, size: 8, offset: 1048)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !744, file: !68, line: 81, baseType: !101, size: 64, offset: 1088)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !744, file: !68, line: 89, baseType: !104, size: 64, offset: 1152)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !744, file: !68, line: 91, baseType: !106, size: 64, offset: 1216)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !744, file: !68, line: 92, baseType: !109, size: 64, offset: 1280)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !744, file: !68, line: 93, baseType: !743, size: 64, offset: 1344)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !744, file: !68, line: 94, baseType: !113, size: 64, offset: 1408)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !744, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !744, file: !68, line: 96, baseType: !60, size: 32, offset: 1536)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !744, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!775 = distinct !DICompileUnit(language: DW_LANG_C99, file: !776, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !777, splitDebugInlining: false, nameTableKind: None)
!776 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!777 = !{!419}
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !999, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "lib/physmem.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!780 = !{!781}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !782, line: 71, baseType: !7, size: 32, elements: !783)
!782 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!784 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0, isUnsigned: true)
!785 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1, isUnsigned: true)
!786 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2, isUnsigned: true)
!787 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3, isUnsigned: true)
!788 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4, isUnsigned: true)
!789 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5, isUnsigned: true)
!790 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6, isUnsigned: true)
!791 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7, isUnsigned: true)
!792 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8, isUnsigned: true)
!793 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9, isUnsigned: true)
!794 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10, isUnsigned: true)
!795 = !DIEnumerator(name: "_SC_TIMERS", value: 11, isUnsigned: true)
!796 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12, isUnsigned: true)
!797 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13, isUnsigned: true)
!798 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14, isUnsigned: true)
!799 = !DIEnumerator(name: "_SC_FSYNC", value: 15, isUnsigned: true)
!800 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16, isUnsigned: true)
!801 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17, isUnsigned: true)
!802 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18, isUnsigned: true)
!803 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19, isUnsigned: true)
!804 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20, isUnsigned: true)
!805 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21, isUnsigned: true)
!806 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22, isUnsigned: true)
!807 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23, isUnsigned: true)
!808 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24, isUnsigned: true)
!809 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25, isUnsigned: true)
!810 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26, isUnsigned: true)
!811 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27, isUnsigned: true)
!812 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28, isUnsigned: true)
!813 = !DIEnumerator(name: "_SC_VERSION", value: 29, isUnsigned: true)
!814 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30, isUnsigned: true)
!815 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31, isUnsigned: true)
!816 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32, isUnsigned: true)
!817 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33, isUnsigned: true)
!818 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34, isUnsigned: true)
!819 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35, isUnsigned: true)
!820 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36, isUnsigned: true)
!821 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37, isUnsigned: true)
!822 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38, isUnsigned: true)
!823 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39, isUnsigned: true)
!824 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40, isUnsigned: true)
!825 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41, isUnsigned: true)
!826 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42, isUnsigned: true)
!827 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43, isUnsigned: true)
!828 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44, isUnsigned: true)
!829 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45, isUnsigned: true)
!830 = !DIEnumerator(name: "_SC_2_VERSION", value: 46, isUnsigned: true)
!831 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47, isUnsigned: true)
!832 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48, isUnsigned: true)
!833 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49, isUnsigned: true)
!834 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50, isUnsigned: true)
!835 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51, isUnsigned: true)
!836 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52, isUnsigned: true)
!837 = !DIEnumerator(name: "_SC_PII", value: 53, isUnsigned: true)
!838 = !DIEnumerator(name: "_SC_PII_XTI", value: 54, isUnsigned: true)
!839 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55, isUnsigned: true)
!840 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56, isUnsigned: true)
!841 = !DIEnumerator(name: "_SC_PII_OSI", value: 57, isUnsigned: true)
!842 = !DIEnumerator(name: "_SC_POLL", value: 58, isUnsigned: true)
!843 = !DIEnumerator(name: "_SC_SELECT", value: 59, isUnsigned: true)
!844 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60, isUnsigned: true)
!845 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60, isUnsigned: true)
!846 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61, isUnsigned: true)
!847 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62, isUnsigned: true)
!848 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63, isUnsigned: true)
!849 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64, isUnsigned: true)
!850 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65, isUnsigned: true)
!851 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66, isUnsigned: true)
!852 = !DIEnumerator(name: "_SC_THREADS", value: 67, isUnsigned: true)
!853 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68, isUnsigned: true)
!854 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69, isUnsigned: true)
!855 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70, isUnsigned: true)
!856 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71, isUnsigned: true)
!857 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72, isUnsigned: true)
!858 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73, isUnsigned: true)
!859 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74, isUnsigned: true)
!860 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75, isUnsigned: true)
!861 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76, isUnsigned: true)
!862 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77, isUnsigned: true)
!863 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78, isUnsigned: true)
!864 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79, isUnsigned: true)
!865 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80, isUnsigned: true)
!866 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81, isUnsigned: true)
!867 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82, isUnsigned: true)
!868 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83, isUnsigned: true)
!869 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84, isUnsigned: true)
!870 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85, isUnsigned: true)
!871 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86, isUnsigned: true)
!872 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87, isUnsigned: true)
!873 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88, isUnsigned: true)
!874 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89, isUnsigned: true)
!875 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90, isUnsigned: true)
!876 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91, isUnsigned: true)
!877 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92, isUnsigned: true)
!878 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93, isUnsigned: true)
!879 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94, isUnsigned: true)
!880 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95, isUnsigned: true)
!881 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96, isUnsigned: true)
!882 = !DIEnumerator(name: "_SC_2_UPE", value: 97, isUnsigned: true)
!883 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98, isUnsigned: true)
!884 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99, isUnsigned: true)
!885 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100, isUnsigned: true)
!886 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101, isUnsigned: true)
!887 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102, isUnsigned: true)
!888 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103, isUnsigned: true)
!889 = !DIEnumerator(name: "_SC_INT_MAX", value: 104, isUnsigned: true)
!890 = !DIEnumerator(name: "_SC_INT_MIN", value: 105, isUnsigned: true)
!891 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106, isUnsigned: true)
!892 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107, isUnsigned: true)
!893 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108, isUnsigned: true)
!894 = !DIEnumerator(name: "_SC_NZERO", value: 109, isUnsigned: true)
!895 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110, isUnsigned: true)
!896 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111, isUnsigned: true)
!897 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112, isUnsigned: true)
!898 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113, isUnsigned: true)
!899 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114, isUnsigned: true)
!900 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115, isUnsigned: true)
!901 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116, isUnsigned: true)
!902 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117, isUnsigned: true)
!903 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118, isUnsigned: true)
!904 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119, isUnsigned: true)
!905 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120, isUnsigned: true)
!906 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121, isUnsigned: true)
!907 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122, isUnsigned: true)
!908 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123, isUnsigned: true)
!909 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124, isUnsigned: true)
!910 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125, isUnsigned: true)
!911 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126, isUnsigned: true)
!912 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127, isUnsigned: true)
!913 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128, isUnsigned: true)
!914 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129, isUnsigned: true)
!915 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130, isUnsigned: true)
!916 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131, isUnsigned: true)
!917 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132, isUnsigned: true)
!918 = !DIEnumerator(name: "_SC_BARRIERS", value: 133, isUnsigned: true)
!919 = !DIEnumerator(name: "_SC_BASE", value: 134, isUnsigned: true)
!920 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135, isUnsigned: true)
!921 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136, isUnsigned: true)
!922 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137, isUnsigned: true)
!923 = !DIEnumerator(name: "_SC_CPUTIME", value: 138, isUnsigned: true)
!924 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139, isUnsigned: true)
!925 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140, isUnsigned: true)
!926 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141, isUnsigned: true)
!927 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142, isUnsigned: true)
!928 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143, isUnsigned: true)
!929 = !DIEnumerator(name: "_SC_FIFO", value: 144, isUnsigned: true)
!930 = !DIEnumerator(name: "_SC_PIPE", value: 145, isUnsigned: true)
!931 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146, isUnsigned: true)
!932 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147, isUnsigned: true)
!933 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148, isUnsigned: true)
!934 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149, isUnsigned: true)
!935 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150, isUnsigned: true)
!936 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151, isUnsigned: true)
!937 = !DIEnumerator(name: "_SC_NETWORKING", value: 152, isUnsigned: true)
!938 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153, isUnsigned: true)
!939 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154, isUnsigned: true)
!940 = !DIEnumerator(name: "_SC_REGEXP", value: 155, isUnsigned: true)
!941 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156, isUnsigned: true)
!942 = !DIEnumerator(name: "_SC_SHELL", value: 157, isUnsigned: true)
!943 = !DIEnumerator(name: "_SC_SIGNALS", value: 158, isUnsigned: true)
!944 = !DIEnumerator(name: "_SC_SPAWN", value: 159, isUnsigned: true)
!945 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160, isUnsigned: true)
!946 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161, isUnsigned: true)
!947 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162, isUnsigned: true)
!948 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163, isUnsigned: true)
!949 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164, isUnsigned: true)
!950 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165, isUnsigned: true)
!951 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166, isUnsigned: true)
!952 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167, isUnsigned: true)
!953 = !DIEnumerator(name: "_SC_2_PBS", value: 168, isUnsigned: true)
!954 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169, isUnsigned: true)
!955 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170, isUnsigned: true)
!956 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171, isUnsigned: true)
!957 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172, isUnsigned: true)
!958 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173, isUnsigned: true)
!959 = !DIEnumerator(name: "_SC_STREAMS", value: 174, isUnsigned: true)
!960 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175, isUnsigned: true)
!961 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176, isUnsigned: true)
!962 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177, isUnsigned: true)
!963 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178, isUnsigned: true)
!964 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179, isUnsigned: true)
!965 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180, isUnsigned: true)
!966 = !DIEnumerator(name: "_SC_TRACE", value: 181, isUnsigned: true)
!967 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182, isUnsigned: true)
!968 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183, isUnsigned: true)
!969 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184, isUnsigned: true)
!970 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185, isUnsigned: true)
!971 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186, isUnsigned: true)
!972 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187, isUnsigned: true)
!973 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188, isUnsigned: true)
!974 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189, isUnsigned: true)
!975 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190, isUnsigned: true)
!976 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191, isUnsigned: true)
!977 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192, isUnsigned: true)
!978 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193, isUnsigned: true)
!979 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194, isUnsigned: true)
!980 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195, isUnsigned: true)
!981 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196, isUnsigned: true)
!982 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197, isUnsigned: true)
!983 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198, isUnsigned: true)
!984 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199, isUnsigned: true)
!985 = !DIEnumerator(name: "_SC_IPV6", value: 235, isUnsigned: true)
!986 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236, isUnsigned: true)
!987 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237, isUnsigned: true)
!988 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238, isUnsigned: true)
!989 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239, isUnsigned: true)
!990 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240, isUnsigned: true)
!991 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241, isUnsigned: true)
!992 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242, isUnsigned: true)
!993 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243, isUnsigned: true)
!994 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244, isUnsigned: true)
!995 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245, isUnsigned: true)
!996 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246, isUnsigned: true)
!997 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247, isUnsigned: true)
!998 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248, isUnsigned: true)
!999 = !{!1000, !1003, !185}
!1000 = !DISubprogram(name: "sysconf", scope: !145, file: !145, line: 619, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!91, !60}
!1003 = !DISubprogram(name: "sysinfo", scope: !1004, file: !1004, line: 29, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!1004 = !DIFile(filename: "/usr/include/sys/sysinfo.h", directory: "")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!60, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysinfo", file: !1009, line: 8, size: 896, elements: !1010)
!1009 = !DIFile(filename: "/usr/include/linux/sysinfo.h", directory: "")
!1010 = !{!1011, !1014, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1026, !1027, !1028, !1029, !1031}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "uptime", scope: !1008, file: !1009, line: 9, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !1013, line: 15, baseType: !91)
!1013 = !DIFile(filename: "/usr/include/asm-generic/posix_types.h", directory: "")
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "loads", scope: !1008, file: !1009, line: 10, baseType: !1015, size: 192, offset: 64)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 192, elements: !391)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1013, line: 16, baseType: !117)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "totalram", scope: !1008, file: !1009, line: 11, baseType: !1016, size: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "freeram", scope: !1008, file: !1009, line: 12, baseType: !1016, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "sharedram", scope: !1008, file: !1009, line: 13, baseType: !1016, size: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "bufferram", scope: !1008, file: !1009, line: 14, baseType: !1016, size: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "totalswap", scope: !1008, file: !1009, line: 15, baseType: !1016, size: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "freeswap", scope: !1008, file: !1009, line: 16, baseType: !1016, size: 64, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !1008, file: !1009, line: 17, baseType: !1024, size: 16, offset: 640)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !1025, line: 24, baseType: !93)
!1025 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1008, file: !1009, line: 18, baseType: !1024, size: 16, offset: 656)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "totalhigh", scope: !1008, file: !1009, line: 19, baseType: !1016, size: 64, offset: 704)
