source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Tokens = type { i64, i8**, i64*, %struct.obstack, %struct.obstack, %struct.obstack }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.2 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%struct.argv_iterator = type { %struct._IO_FILE*, i64, i8*, i64, i8**, i8** }
%struct.fstatus = type { i32, %struct.stat }
%struct.infomap = type { i8*, i8* }
%struct.mbchar = type { i8*, i64, i8, i32, [24 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "argv_iter_err", file: !21, line: 25, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/argv-iter.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "AI_ERR_OK", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "AI_ERR_EOF", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "AI_ERR_MEM", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "AI_ERR_READ", value: 4, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 45, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 46, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!39 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!41 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!44 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!45 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!46 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!47 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!50 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!51 = !{!52, !54, !55, !58, !59, !60}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 62, baseType: !57)
!56 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !{!62, !255, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !0, !282, !298}
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "stdin_only", scope: !64, file: !3, line: 778, type: !254, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 661, type: !65, isDefinition: true, scopeLine: 662, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !68)
!65 = !DISubroutineType(types: !66)
!66 = !{!58, !58, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!68 = !{!69, !70, !71, !73, !74, !75, !76, !77, !122, !182, !183, !186, !241, !242, !244, !247, !248, !249}
!69 = !DILocalVariable(name: "argc", arg: 1, scope: !64, file: !3, line: 661, type: !58)
!70 = !DILocalVariable(name: "argv", arg: 2, scope: !64, file: !3, line: 661, type: !67)
!71 = !DILocalVariable(name: "ok", scope: !64, file: !3, line: 663, type: !72)
!72 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!73 = !DILocalVariable(name: "optc", scope: !64, file: !3, line: 664, type: !58)
!74 = !DILocalVariable(name: "nfiles", scope: !64, file: !3, line: 665, type: !55)
!75 = !DILocalVariable(name: "files", scope: !64, file: !3, line: 666, type: !67)
!76 = !DILocalVariable(name: "files_from", scope: !64, file: !3, line: 667, type: !52)
!77 = !DILocalVariable(name: "fstatus", scope: !64, file: !3, line: 668, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !3, line: 78, size: 1216, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !79, file: !3, line: 82, baseType: !58, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !79, file: !3, line: 85, baseType: !83, size: 1152, offset: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !84, line: 46, size: 1152, elements: !85)
!84 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!85 = !{!86, !89, !91, !93, !95, !97, !99, !100, !101, !104, !106, !108, !116, !117, !118}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !83, file: !84, line: 48, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !88, line: 143, baseType: !57)
!88 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !83, file: !84, line: 53, baseType: !90, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !88, line: 146, baseType: !57)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !83, file: !84, line: 61, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !88, line: 149, baseType: !57)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !83, file: !84, line: 62, baseType: !94, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !88, line: 148, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !83, file: !84, line: 64, baseType: !96, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !88, line: 144, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !83, file: !84, line: 65, baseType: !98, size: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !88, line: 145, baseType: !7)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !83, file: !84, line: 67, baseType: !58, size: 32, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !83, file: !84, line: 69, baseType: !87, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !83, file: !84, line: 74, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !88, line: 150, baseType: !103)
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !83, file: !84, line: 78, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !88, line: 172, baseType: !103)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !83, file: !84, line: 80, baseType: !107, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !88, line: 177, baseType: !103)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !83, file: !84, line: 91, baseType: !109, size: 128, offset: 576)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !110, line: 9, size: 128, elements: !111)
!110 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!111 = !{!112, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !109, file: !110, line: 11, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !88, line: 158, baseType: !103)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !109, file: !110, line: 12, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !88, line: 194, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !83, file: !84, line: 92, baseType: !109, size: 128, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !83, file: !84, line: 93, baseType: !109, size: 128, offset: 832)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !83, file: !84, line: 106, baseType: !119, size: 192, offset: 960)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 192, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DILocalVariable(name: "tok", scope: !64, file: !3, line: 669, type: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !124, line: 28, size: 2304, elements: !125)
!124 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!125 = !{!126, !127, !128, !130, !180, !181}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !123, file: !124, line: 30, baseType: !55, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !123, file: !124, line: 31, baseType: !67, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !123, file: !124, line: 32, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !123, file: !124, line: 33, baseType: !131, size: 704, offset: 192)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !132, line: 174, size: 704, elements: !133)
!132 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!133 = !{!134, !135, !145, !146, !147, !148, !153, !154, !165, !176, !177, !178, !179}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !131, file: !132, line: 176, baseType: !55, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !131, file: !132, line: 177, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !132, line: 167, size: 128, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !137, file: !132, line: 169, baseType: !52, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !132, line: 170, baseType: !136, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !137, file: !132, line: 171, baseType: !142, offset: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: -1)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !131, file: !132, line: 178, baseType: !52, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !131, file: !132, line: 179, baseType: !52, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !131, file: !132, line: 180, baseType: !52, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !131, file: !132, line: 185, baseType: !149, size: 64, offset: 320)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !132, line: 181, size: 64, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !149, file: !132, line: 183, baseType: !55, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !149, file: !132, line: 184, baseType: !54, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !131, file: !132, line: 186, baseType: !55, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !131, file: !132, line: 193, baseType: !155, size: 64, offset: 448)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !132, line: 189, size: 64, elements: !156)
!156 = !{!157, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !155, file: !132, line: 191, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!54, !55}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !155, file: !132, line: 192, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!54, !54, !55}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !131, file: !132, line: 198, baseType: !166, size: 64, offset: 512)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !132, line: 194, size: 64, elements: !167)
!167 = !{!168, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !166, file: !132, line: 196, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !54}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !166, file: !132, line: 197, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !54, !54}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !131, file: !132, line: 200, baseType: !54, size: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !131, file: !132, line: 201, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !131, file: !132, line: 202, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !131, file: !132, line: 206, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !123, file: !124, line: 34, baseType: !131, size: 704, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !123, file: !124, line: 35, baseType: !131, size: 704, offset: 1600)
!182 = !DILocalVariable(name: "read_tokens", scope: !64, file: !3, line: 727, type: !72)
!183 = !DILocalVariable(name: "ai", scope: !64, file: !3, line: 728, type: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !21, line: 23, flags: DIFlagFwdDecl)
!186 = !DILocalVariable(name: "stream", scope: !187, file: !3, line: 731, type: !189)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 730, column: 5)
!188 = distinct !DILexicalBlock(scope: !64, file: !3, line: 729, column: 7)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !191, line: 7, baseType: !192)
!191 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !193, line: 49, size: 1728, elements: !194)
!193 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !210, !212, !213, !214, !215, !216, !218, !222, !225, !227, !230, !233, !234, !235, !236, !237}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !192, file: !193, line: 51, baseType: !58, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !192, file: !193, line: 54, baseType: !52, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !192, file: !193, line: 55, baseType: !52, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !192, file: !193, line: 56, baseType: !52, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !192, file: !193, line: 57, baseType: !52, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !192, file: !193, line: 58, baseType: !52, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !192, file: !193, line: 59, baseType: !52, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !192, file: !193, line: 60, baseType: !52, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !192, file: !193, line: 61, baseType: !52, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !192, file: !193, line: 64, baseType: !52, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !192, file: !193, line: 65, baseType: !52, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !192, file: !193, line: 66, baseType: !52, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !192, file: !193, line: 68, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !193, line: 36, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !192, file: !193, line: 70, baseType: !211, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !192, file: !193, line: 72, baseType: !58, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !192, file: !193, line: 73, baseType: !58, size: 32, offset: 928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !192, file: !193, line: 74, baseType: !102, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !192, file: !193, line: 77, baseType: !59, size: 16, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !192, file: !193, line: 78, baseType: !217, size: 8, offset: 1040)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !192, file: !193, line: 79, baseType: !219, size: 8, offset: 1048)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 1)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !192, file: !193, line: 81, baseType: !223, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !193, line: 43, baseType: null)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !192, file: !193, line: 89, baseType: !226, size: 64, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !88, line: 151, baseType: !103)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !192, file: !193, line: 91, baseType: !228, size: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !193, line: 37, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !192, file: !193, line: 92, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !193, line: 38, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !192, file: !193, line: 93, baseType: !211, size: 64, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !192, file: !193, line: 94, baseType: !54, size: 64, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !192, file: !193, line: 95, baseType: !55, size: 64, offset: 1472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !192, file: !193, line: 96, baseType: !58, size: 32, offset: 1536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !192, file: !193, line: 98, baseType: !238, size: 160, offset: 1568)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 20)
!241 = !DILocalVariable(name: "st", scope: !187, file: !3, line: 755, type: !83)
!242 = !DILocalVariable(name: "i", scope: !243, file: !3, line: 791, type: !58)
!243 = distinct !DILexicalBlock(scope: !64, file: !3, line: 791, column: 3)
!244 = !DILocalVariable(name: "skip_file", scope: !245, file: !3, line: 793, type: !72)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 792, column: 5)
!246 = distinct !DILexicalBlock(scope: !243, file: !3, line: 791, column: 3)
!247 = !DILocalVariable(name: "ai_err", scope: !245, file: !3, line: 794, type: !20)
!248 = !DILocalVariable(name: "file_name", scope: !245, file: !3, line: 795, type: !52)
!249 = !DILocalVariable(name: "file_number", scope: !250, file: !3, line: 836, type: !57)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 832, column: 13)
!251 = distinct !DILexicalBlock(scope: !252, file: !3, line: 829, column: 15)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 824, column: 9)
!253 = distinct !DILexicalBlock(scope: !245, file: !3, line: 823, column: 11)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !220)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "total_lines", scope: !2, file: !3, line: 58, type: !257, isLocal: true, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !258, line: 102, baseType: !259)
!258 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !88, line: 72, baseType: !57)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "total_words", scope: !2, file: !3, line: 59, type: !257, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "total_chars", scope: !2, file: !3, line: 60, type: !257, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "total_bytes", scope: !2, file: !3, line: 61, type: !257, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "max_line_length", scope: !2, file: !3, line: 62, type: !257, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "print_lines", scope: !2, file: !3, line: 65, type: !72, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "print_words", scope: !2, file: !3, line: 65, type: !72, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "print_chars", scope: !2, file: !3, line: 65, type: !72, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "print_bytes", scope: !2, file: !3, line: 65, type: !72, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "print_linelength", scope: !2, file: !3, line: 66, type: !72, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 69, type: !58, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 72, type: !72, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 95, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 2304, elements: !296)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !287, line: 50, size: 256, elements: !288)
!287 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!288 = !{!289, !292, !293, !295}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !286, file: !287, line: 52, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !286, file: !287, line: 55, baseType: !58, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !287, line: 56, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !286, file: !287, line: 57, baseType: !58, size: 32, offset: 192)
!296 = !{!297}
!297 = !DISubrange(count: 9)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !300, file: !3, line: 160, type: !315, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "write_counts", scope: !3, file: !3, line: 153, type: !301, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !257, !257, !257, !257, !257, !290}
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311}
!304 = !DILocalVariable(name: "lines", arg: 1, scope: !300, file: !3, line: 153, type: !257)
!305 = !DILocalVariable(name: "words", arg: 2, scope: !300, file: !3, line: 154, type: !257)
!306 = !DILocalVariable(name: "chars", arg: 3, scope: !300, file: !3, line: 155, type: !257)
!307 = !DILocalVariable(name: "bytes", arg: 4, scope: !300, file: !3, line: 156, type: !257)
!308 = !DILocalVariable(name: "linelength", arg: 5, scope: !300, file: !3, line: 157, type: !257)
!309 = !DILocalVariable(name: "file", arg: 6, scope: !300, file: !3, line: 158, type: !290)
!310 = !DILocalVariable(name: "format_int", scope: !300, file: !3, line: 161, type: !290)
!311 = !DILocalVariable(name: "buf", scope: !300, file: !3, line: 162, type: !312)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 168, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 21)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 40, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 5)
!318 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!319 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!320 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!321 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!322 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!323 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "Version", scope: !326, file: !327, line: 2, type: !290, isDefinition: true)
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, globals: !329)
!327 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!328 = !{}
!329 = !{!324}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "file_name", scope: !332, file: !337, line: 46, type: !290, isLocal: true, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, globals: !334)
!333 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!334 = !{!330, !335}
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !332, file: !337, line: 56, type: !72, isLocal: true, isDefinition: true)
!337 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "exit_failure", scope: !340, file: !343, line: 24, type: !344, isDefinition: true)
!340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, globals: !342)
!341 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!342 = !{!338}
!343 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!344 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !347, file: !351, line: 28, type: !352, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !349, globals: !350)
!348 = !DIFile(filename: "./lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!349 = !{!60}
!350 = !{!345}
!351 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 256, elements: !354)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!354 = !{!355}
!355 = !DISubrange(count: 8)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "program_name", scope: !358, file: !362, line: 33, type: !290, isDefinition: true)
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !360, globals: !361)
!359 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!360 = !{!54, !52}
!361 = !{!356}
!362 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !365, file: !377, line: 85, type: !410, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !367, retainedTypes: !373, globals: !374)
!366 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!367 = !{!5, !368, !36}
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!371 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!372 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!373 = !{!58, !59, !55, !52}
!374 = !{!363, !375, !382, !392, !394, !399, !406, !408}
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !365, file: !377, line: 101, type: !378, isDefinition: true)
!377 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 320, elements: !380)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!380 = !{!381}
!381 = !DISubrange(count: 10)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !365, file: !377, line: 1052, type: !384, isDefinition: true)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !377, line: 65, size: 448, elements: !385)
!385 = !{!386, !387, !388, !390, !391}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !384, file: !377, line: 68, baseType: !5, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !384, file: !377, line: 71, baseType: !58, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !384, file: !377, line: 75, baseType: !389, size: 256, offset: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !354)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !384, file: !377, line: 78, baseType: !290, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !384, file: !377, line: 81, baseType: !290, size: 64, offset: 384)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !365, file: !377, line: 116, type: !384, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "slot0", scope: !365, file: !377, line: 842, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 256)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "slotvec", scope: !365, file: !377, line: 845, type: !401, isLocal: true, isDefinition: true)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !377, line: 834, size: 128, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !402, file: !377, line: 836, baseType: !55, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !402, file: !377, line: 837, baseType: !52, size: 64, offset: 64)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "nslots", scope: !365, file: !377, line: 843, type: !58, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "slotvec0", scope: !365, file: !377, line: 844, type: !402, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 704, elements: !412)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!412 = !{!413}
!413 = !DISubrange(count: 11)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !416, file: !419, line: 26, type: !420, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, globals: !418)
!417 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!418 = !{!414}
!419 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 376, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 47)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !425, file: !429, line: 351, type: !430, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !427, globals: !428)
!426 = !DIFile(filename: "./lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!427 = !{!52, !54}
!428 = !{!423}
!429 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{null}
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !435, retainedTypes: !436)
!434 = !DIFile(filename: "./lib/argv-iter.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!435 = !{!20}
!436 = !{!54}
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !439)
!438 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!439 = !{!27}
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !442)
!441 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!442 = !{!257}
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !445, retainedTypes: !664)
!444 = !DIFile(filename: "./lib/physmem.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!445 = !{!446}
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 71, baseType: !7, size: 32, elements: !448)
!447 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!449 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0, isUnsigned: true)
!450 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1, isUnsigned: true)
!451 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2, isUnsigned: true)
!452 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3, isUnsigned: true)
!453 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4, isUnsigned: true)
!454 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5, isUnsigned: true)
!455 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6, isUnsigned: true)
!456 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7, isUnsigned: true)
!457 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8, isUnsigned: true)
!458 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9, isUnsigned: true)
!459 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10, isUnsigned: true)
!460 = !DIEnumerator(name: "_SC_TIMERS", value: 11, isUnsigned: true)
!461 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12, isUnsigned: true)
!462 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13, isUnsigned: true)
!463 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14, isUnsigned: true)
!464 = !DIEnumerator(name: "_SC_FSYNC", value: 15, isUnsigned: true)
!465 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16, isUnsigned: true)
!466 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17, isUnsigned: true)
!467 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18, isUnsigned: true)
!468 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19, isUnsigned: true)
!469 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20, isUnsigned: true)
!470 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21, isUnsigned: true)
!471 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22, isUnsigned: true)
!472 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23, isUnsigned: true)
!473 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24, isUnsigned: true)
!474 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25, isUnsigned: true)
!475 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26, isUnsigned: true)
!476 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27, isUnsigned: true)
!477 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28, isUnsigned: true)
!478 = !DIEnumerator(name: "_SC_VERSION", value: 29, isUnsigned: true)
!479 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30, isUnsigned: true)
!480 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31, isUnsigned: true)
!481 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32, isUnsigned: true)
!482 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33, isUnsigned: true)
!483 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34, isUnsigned: true)
!484 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35, isUnsigned: true)
!485 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36, isUnsigned: true)
!486 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37, isUnsigned: true)
!487 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38, isUnsigned: true)
!488 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39, isUnsigned: true)
!489 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40, isUnsigned: true)
!490 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41, isUnsigned: true)
!491 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42, isUnsigned: true)
!492 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43, isUnsigned: true)
!493 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44, isUnsigned: true)
!494 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45, isUnsigned: true)
!495 = !DIEnumerator(name: "_SC_2_VERSION", value: 46, isUnsigned: true)
!496 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47, isUnsigned: true)
!497 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48, isUnsigned: true)
!498 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49, isUnsigned: true)
!499 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50, isUnsigned: true)
!500 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51, isUnsigned: true)
!501 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52, isUnsigned: true)
!502 = !DIEnumerator(name: "_SC_PII", value: 53, isUnsigned: true)
!503 = !DIEnumerator(name: "_SC_PII_XTI", value: 54, isUnsigned: true)
!504 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55, isUnsigned: true)
!505 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56, isUnsigned: true)
!506 = !DIEnumerator(name: "_SC_PII_OSI", value: 57, isUnsigned: true)
!507 = !DIEnumerator(name: "_SC_POLL", value: 58, isUnsigned: true)
!508 = !DIEnumerator(name: "_SC_SELECT", value: 59, isUnsigned: true)
!509 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60, isUnsigned: true)
!510 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60, isUnsigned: true)
!511 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61, isUnsigned: true)
!512 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62, isUnsigned: true)
!513 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63, isUnsigned: true)
!514 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64, isUnsigned: true)
!515 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65, isUnsigned: true)
!516 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66, isUnsigned: true)
!517 = !DIEnumerator(name: "_SC_THREADS", value: 67, isUnsigned: true)
!518 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68, isUnsigned: true)
!519 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69, isUnsigned: true)
!520 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70, isUnsigned: true)
!521 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71, isUnsigned: true)
!522 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72, isUnsigned: true)
!523 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73, isUnsigned: true)
!524 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74, isUnsigned: true)
!525 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75, isUnsigned: true)
!526 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76, isUnsigned: true)
!527 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77, isUnsigned: true)
!528 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78, isUnsigned: true)
!529 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79, isUnsigned: true)
!530 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80, isUnsigned: true)
!531 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81, isUnsigned: true)
!532 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82, isUnsigned: true)
!533 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83, isUnsigned: true)
!534 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84, isUnsigned: true)
!535 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85, isUnsigned: true)
!536 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86, isUnsigned: true)
!537 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87, isUnsigned: true)
!538 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88, isUnsigned: true)
!539 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89, isUnsigned: true)
!540 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90, isUnsigned: true)
!541 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91, isUnsigned: true)
!542 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92, isUnsigned: true)
!543 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93, isUnsigned: true)
!544 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94, isUnsigned: true)
!545 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95, isUnsigned: true)
!546 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96, isUnsigned: true)
!547 = !DIEnumerator(name: "_SC_2_UPE", value: 97, isUnsigned: true)
!548 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98, isUnsigned: true)
!549 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99, isUnsigned: true)
!550 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100, isUnsigned: true)
!551 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101, isUnsigned: true)
!552 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102, isUnsigned: true)
!553 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103, isUnsigned: true)
!554 = !DIEnumerator(name: "_SC_INT_MAX", value: 104, isUnsigned: true)
!555 = !DIEnumerator(name: "_SC_INT_MIN", value: 105, isUnsigned: true)
!556 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106, isUnsigned: true)
!557 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107, isUnsigned: true)
!558 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108, isUnsigned: true)
!559 = !DIEnumerator(name: "_SC_NZERO", value: 109, isUnsigned: true)
!560 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110, isUnsigned: true)
!561 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111, isUnsigned: true)
!562 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112, isUnsigned: true)
!563 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113, isUnsigned: true)
!564 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114, isUnsigned: true)
!565 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115, isUnsigned: true)
!566 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116, isUnsigned: true)
!567 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117, isUnsigned: true)
!568 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118, isUnsigned: true)
!569 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119, isUnsigned: true)
!570 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120, isUnsigned: true)
!571 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121, isUnsigned: true)
!572 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122, isUnsigned: true)
!573 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123, isUnsigned: true)
!574 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124, isUnsigned: true)
!575 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125, isUnsigned: true)
!576 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126, isUnsigned: true)
!577 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127, isUnsigned: true)
!578 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128, isUnsigned: true)
!579 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129, isUnsigned: true)
!580 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130, isUnsigned: true)
!581 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131, isUnsigned: true)
!582 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132, isUnsigned: true)
!583 = !DIEnumerator(name: "_SC_BARRIERS", value: 133, isUnsigned: true)
!584 = !DIEnumerator(name: "_SC_BASE", value: 134, isUnsigned: true)
!585 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135, isUnsigned: true)
!586 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136, isUnsigned: true)
!587 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137, isUnsigned: true)
!588 = !DIEnumerator(name: "_SC_CPUTIME", value: 138, isUnsigned: true)
!589 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139, isUnsigned: true)
!590 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140, isUnsigned: true)
!591 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141, isUnsigned: true)
!592 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142, isUnsigned: true)
!593 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143, isUnsigned: true)
!594 = !DIEnumerator(name: "_SC_FIFO", value: 144, isUnsigned: true)
!595 = !DIEnumerator(name: "_SC_PIPE", value: 145, isUnsigned: true)
!596 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146, isUnsigned: true)
!597 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147, isUnsigned: true)
!598 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148, isUnsigned: true)
!599 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149, isUnsigned: true)
!600 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150, isUnsigned: true)
!601 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151, isUnsigned: true)
!602 = !DIEnumerator(name: "_SC_NETWORKING", value: 152, isUnsigned: true)
!603 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153, isUnsigned: true)
!604 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154, isUnsigned: true)
!605 = !DIEnumerator(name: "_SC_REGEXP", value: 155, isUnsigned: true)
!606 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156, isUnsigned: true)
!607 = !DIEnumerator(name: "_SC_SHELL", value: 157, isUnsigned: true)
!608 = !DIEnumerator(name: "_SC_SIGNALS", value: 158, isUnsigned: true)
!609 = !DIEnumerator(name: "_SC_SPAWN", value: 159, isUnsigned: true)
!610 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160, isUnsigned: true)
!611 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161, isUnsigned: true)
!612 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162, isUnsigned: true)
!613 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163, isUnsigned: true)
!614 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164, isUnsigned: true)
!615 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165, isUnsigned: true)
!616 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166, isUnsigned: true)
!617 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167, isUnsigned: true)
!618 = !DIEnumerator(name: "_SC_2_PBS", value: 168, isUnsigned: true)
!619 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169, isUnsigned: true)
!620 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170, isUnsigned: true)
!621 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171, isUnsigned: true)
!622 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172, isUnsigned: true)
!623 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173, isUnsigned: true)
!624 = !DIEnumerator(name: "_SC_STREAMS", value: 174, isUnsigned: true)
!625 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175, isUnsigned: true)
!626 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176, isUnsigned: true)
!627 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177, isUnsigned: true)
!628 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178, isUnsigned: true)
!629 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179, isUnsigned: true)
!630 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180, isUnsigned: true)
!631 = !DIEnumerator(name: "_SC_TRACE", value: 181, isUnsigned: true)
!632 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182, isUnsigned: true)
!633 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183, isUnsigned: true)
!634 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184, isUnsigned: true)
!635 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185, isUnsigned: true)
!636 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186, isUnsigned: true)
!637 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187, isUnsigned: true)
!638 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188, isUnsigned: true)
!639 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189, isUnsigned: true)
!640 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190, isUnsigned: true)
!641 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191, isUnsigned: true)
!642 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192, isUnsigned: true)
!643 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193, isUnsigned: true)
!644 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194, isUnsigned: true)
!645 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195, isUnsigned: true)
!646 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196, isUnsigned: true)
!647 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197, isUnsigned: true)
!648 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198, isUnsigned: true)
!649 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199, isUnsigned: true)
!650 = !DIEnumerator(name: "_SC_IPV6", value: 235, isUnsigned: true)
!651 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236, isUnsigned: true)
!652 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237, isUnsigned: true)
!653 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238, isUnsigned: true)
!654 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239, isUnsigned: true)
!655 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240, isUnsigned: true)
!656 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241, isUnsigned: true)
!657 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242, isUnsigned: true)
!658 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243, isUnsigned: true)
!659 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244, isUnsigned: true)
!660 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245, isUnsigned: true)
!661 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246, isUnsigned: true)
!662 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247, isUnsigned: true)
!663 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248, isUnsigned: true)
!664 = !{!665}
!665 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !668)
!667 = !DIFile(filename: "./lib/readtokens0.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!668 = !{!54, !52, !55, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !674)
!673 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!674 = !{!675}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 40, baseType: !7, size: 32, elements: !677)
!676 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!677 = !{!678}
!678 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !681, retainedTypes: !436)
!680 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!681 = !{!682}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !683, line: 41, baseType: !7, size: 32, elements: !684)
!683 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!684 = !{!685}
!685 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !688, retainedTypes: !701)
!687 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!688 = !{!689}
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !691, file: !690, line: 186, baseType: !7, size: 32, elements: !699)
!690 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!691 = distinct !DISubprogram(name: "x2nrealloc", scope: !690, file: !690, line: 174, type: !692, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !686, retainedNodes: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{!54, !54, !129, !55}
!694 = !{!695, !696, !697, !698}
!695 = !DILocalVariable(name: "p", arg: 1, scope: !691, file: !690, line: 174, type: !54)
!696 = !DILocalVariable(name: "pn", arg: 2, scope: !691, file: !690, line: 174, type: !129)
!697 = !DILocalVariable(name: "s", arg: 3, scope: !691, file: !690, line: 174, type: !55)
!698 = !DILocalVariable(name: "n", scope: !691, file: !690, line: 176, type: !55)
!699 = !{!700}
!700 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!701 = !{!55, !52, !54}
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328)
!703 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !436)
!705 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328)
!707 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !436)
!709 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !436)
!711 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !714)
!713 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!714 = !{!55}
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328)
!716 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328)
!718 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !721, retainedTypes: !436)
!720 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!721 = !{!722}
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !723, line: 41, baseType: !7, size: 32, elements: !724)
!723 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107}
!725 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!726 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!727 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!728 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!729 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!730 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!731 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!732 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!733 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!734 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!735 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!736 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!737 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!738 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!739 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!740 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!741 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!742 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!743 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!744 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!745 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!746 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!747 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!748 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!749 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!750 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!751 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!752 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!753 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!754 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!755 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!756 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!757 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!758 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!759 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!760 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!761 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!762 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!763 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!764 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!765 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!766 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!767 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!768 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!769 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!770 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!771 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!772 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!773 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!774 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!833 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!836 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!837 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!838 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!839 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!840 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!841 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!842 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!843 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!844 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!845 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!846 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!847 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!920 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!993 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!994 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!995 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!996 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!997 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!998 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!999 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!1000 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!1001 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!1002 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!1003 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!1004 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!1005 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!1006 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!1007 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!1009 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!1010 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!1011 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!1012 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!1013 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!1014 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!1037 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!1038 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!1039 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!1040 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!1041 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!1042 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!1043 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!1044 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!1045 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!1046 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!1047 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!1048 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!1049 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!1050 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!1051 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!1052 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!1053 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!1054 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!1055 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!1056 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!1057 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!1058 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!1059 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!1060 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!1061 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!1062 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!1063 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!1064 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!1065 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!1066 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!1067 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!1068 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!1069 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!1070 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!1071 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!1072 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!1073 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!1074 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!1075 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!1076 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!1077 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!1078 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!1079 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!1080 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1081 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1082 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1083 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1084 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1085 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1086 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1087 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1088 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1089 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1090 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1091 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
