; ModuleID = 'coreutils-8.32/src/who.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!50 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !38, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !38, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !38, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !38, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !38, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !38, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !38, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !38, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !38, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !69, isLocal: true, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !73, isLocal: true, isDefinition: true)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "mesg", scope: !76, file: !3, line: 249, type: !103, isLocal: true, isDefinition: true)
!76 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !77, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !79)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !73, !69, !70, !73, !69, !69, !69, !69, !69, !69}
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !95, !99, !100, !101}
!80 = !DILocalVariable(name: "userlen", arg: 1, scope: !76, file: !3, line: 244, type: !73)
!81 = !DILocalVariable(name: "user", arg: 2, scope: !76, file: !3, line: 244, type: !69)
!82 = !DILocalVariable(name: "state", arg: 3, scope: !76, file: !3, line: 244, type: !70)
!83 = !DILocalVariable(name: "linelen", arg: 4, scope: !76, file: !3, line: 245, type: !73)
!84 = !DILocalVariable(name: "line", arg: 5, scope: !76, file: !3, line: 245, type: !69)
!85 = !DILocalVariable(name: "time_str", arg: 6, scope: !76, file: !3, line: 246, type: !69)
!86 = !DILocalVariable(name: "idle", arg: 7, scope: !76, file: !3, line: 246, type: !69)
!87 = !DILocalVariable(name: "pid", arg: 8, scope: !76, file: !3, line: 246, type: !69)
!88 = !DILocalVariable(name: "comment", arg: 9, scope: !76, file: !3, line: 247, type: !69)
!89 = !DILocalVariable(name: "exitstr", arg: 10, scope: !76, file: !3, line: 247, type: !69)
!90 = !DILocalVariable(name: "buf", scope: !76, file: !3, line: 250, type: !26)
!91 = !DILocalVariable(name: "x_idle", scope: !76, file: !3, line: 251, type: !92)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 8)
!95 = !DILocalVariable(name: "x_pid", scope: !76, file: !3, line: 252, type: !96)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 104, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 13)
!99 = !DILocalVariable(name: "x_exitstr", scope: !76, file: !3, line: 253, type: !26)
!100 = !DILocalVariable(name: "err", scope: !76, file: !3, line: 254, type: !73)
!101 = !DILocalVariable(name: "p", scope: !102, file: !3, line: 303, type: !26)
!102 = distinct !DILexicalBlock(scope: !76, file: !3, line: 301, column: 3)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 3)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "hoststr", scope: !108, file: !3, line: 339, type: !26, isLocal: true, isDefinition: true)
!108 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !109, scopeLine: 334, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !151)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !111, !29}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !6, line: 146, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !115, line: 55, size: 3072, elements: !116)
!115 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "")
!116 = !{!117, !118, !120, !124, !128, !129, !133, !138, !140, !145, !147}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !114, file: !115, line: 57, baseType: !34, size: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !114, file: !115, line: 58, baseType: !119, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !32, line: 154, baseType: !73)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !114, file: !115, line: 59, baseType: !121, size: 256, offset: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !114, file: !115, line: 61, baseType: !125, size: 32, offset: 320)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 4)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !114, file: !115, line: 63, baseType: !121, size: 256, offset: 352)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !114, file: !115, line: 65, baseType: !130, size: 2048, offset: 608)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !114, file: !115, line: 67, baseType: !134, size: 32, offset: 2656)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !115, line: 42, size: 32, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !134, file: !115, line: 45, baseType: !34, size: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !134, file: !115, line: 46, baseType: !34, size: 16, offset: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !114, file: !115, line: 74, baseType: !139, size: 32, offset: 2688)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !32, line: 41, baseType: !73)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !114, file: !115, line: 79, baseType: !141, size: 64, offset: 2720)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !115, line: 75, size: 64, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !141, file: !115, line: 77, baseType: !139, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !141, file: !115, line: 78, baseType: !139, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !114, file: !115, line: 84, baseType: !146, size: 128, offset: 2784)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 128, elements: !126)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !114, file: !115, line: 85, baseType: !148, size: 160, offset: 2912)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 20)
!151 = !{!152, !153, !154, !190, !191, !192, !196, !200, !201, !205, !211, !212}
!152 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !108, file: !3, line: 333, type: !111)
!153 = !DILocalVariable(name: "boottime", arg: 2, scope: !108, file: !3, line: 333, type: !29)
!154 = !DILocalVariable(name: "stats", scope: !108, file: !3, line: 335, type: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !156, line: 26, size: 1152, elements: !157)
!156 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!157 = !{!158, !161, !163, !165, !167, !169, !171, !172, !173, !175, !177, !179, !186, !187, !188}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !155, file: !156, line: 28, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !32, line: 145, baseType: !160)
!160 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !155, file: !156, line: 33, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !32, line: 148, baseType: !160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !155, file: !156, line: 41, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !32, line: 151, baseType: !160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !155, file: !156, line: 42, baseType: !166, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !32, line: 150, baseType: !7)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !155, file: !156, line: 44, baseType: !168, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !32, line: 146, baseType: !7)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !155, file: !156, line: 45, baseType: !170, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !32, line: 147, baseType: !7)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !155, file: !156, line: 47, baseType: !73, size: 32, offset: 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !155, file: !156, line: 49, baseType: !159, size: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !155, file: !156, line: 54, baseType: !174, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !32, line: 152, baseType: !33)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !155, file: !156, line: 58, baseType: !176, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !32, line: 175, baseType: !33)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !155, file: !156, line: 60, baseType: !178, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !32, line: 180, baseType: !33)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !155, file: !156, line: 71, baseType: !180, size: 128, offset: 576)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !181, line: 10, size: 128, elements: !182)
!181 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !180, file: !181, line: 12, baseType: !31, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !180, file: !181, line: 16, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !32, line: 197, baseType: !33)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !155, file: !156, line: 72, baseType: !180, size: 128, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !155, file: !156, line: 73, baseType: !180, size: 128, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !155, file: !156, line: 86, baseType: !189, size: 192, offset: 960)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 192, elements: !104)
!190 = !DILocalVariable(name: "last_change", scope: !108, file: !3, line: 336, type: !29)
!191 = !DILocalVariable(name: "mesg", scope: !108, file: !3, line: 337, type: !27)
!192 = !DILocalVariable(name: "idlestr", scope: !108, file: !3, line: 338, type: !193)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 56, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 7)
!196 = !DILocalVariable(name: "line", scope: !108, file: !3, line: 347, type: !197)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 304, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 38)
!200 = !DILocalVariable(name: "p", scope: !108, file: !3, line: 348, type: !26)
!201 = !DILocalVariable(name: "pidstr", scope: !108, file: !3, line: 349, type: !202)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 12)
!205 = !DILocalVariable(name: "ut_host", scope: !206, file: !3, line: 377, type: !208)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 376, column: 5)
!207 = distinct !DILexicalBlock(scope: !108, file: !3, line: 375, column: 7)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2056, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 257)
!211 = !DILocalVariable(name: "host", scope: !206, file: !3, line: 378, type: !26)
!212 = !DILocalVariable(name: "display", scope: !206, file: !3, line: 379, type: !26)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "hostlen", scope: !108, file: !3, line: 341, type: !215, isLocal: true, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !216, line: 46, baseType: !160)
!216 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "now", scope: !219, file: !3, line: 190, type: !29, isLocal: true, isDefinition: true)
!219 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !220, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !222)
!220 = !DISubroutineType(types: !221)
!221 = !{!69, !29, !29}
!222 = !{!223, !224, !225}
!223 = !DILocalVariable(name: "when", arg: 1, scope: !219, file: !3, line: 188, type: !29)
!224 = !DILocalVariable(name: "boottime", arg: 2, scope: !219, file: !3, line: 188, type: !29)
!225 = !DILocalVariable(name: "seconds_idle", scope: !226, file: !3, line: 197, type: !73)
!226 = distinct !DILexicalBlock(scope: !227, file: !3, line: 196, column: 5)
!227 = distinct !DILexicalBlock(scope: !219, file: !3, line: 195, column: 7)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !219, file: !3, line: 202, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 48, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 6)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "buf", scope: !235, file: !3, line: 220, type: !257, isLocal: true, isDefinition: true)
!235 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !236, scopeLine: 219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !238)
!236 = !DISubroutineType(types: !237)
!237 = !{!69, !111}
!238 = !{!239, !240, !241}
!239 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !235, file: !3, line: 218, type: !111)
!240 = !DILocalVariable(name: "t", scope: !235, file: !3, line: 228, type: !29)
!241 = !DILocalVariable(name: "tmp", scope: !235, file: !3, line: 229, type: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !244, line: 7, size: 448, elements: !245)
!244 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !243, file: !244, line: 9, baseType: !73, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !243, file: !244, line: 10, baseType: !73, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !243, file: !244, line: 11, baseType: !73, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !243, file: !244, line: 12, baseType: !73, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !243, file: !244, line: 13, baseType: !73, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !243, file: !244, line: 14, baseType: !73, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !243, file: !244, line: 15, baseType: !73, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !243, file: !244, line: 16, baseType: !73, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !243, file: !244, line: 17, baseType: !73, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !243, file: !244, line: 20, baseType: !33, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !243, file: !244, line: 21, baseType: !69, size: 64, offset: 384)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 264, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 33)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "runlevline", scope: !262, file: !3, line: 516, type: !26, isLocal: true, isDefinition: true)
!262 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !263, scopeLine: 515, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !265)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !111}
!265 = !{!266, !267, !269}
!266 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !262, file: !3, line: 514, type: !111)
!267 = !DILocalVariable(name: "last", scope: !262, file: !3, line: 517, type: !268)
!268 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!269 = !DILocalVariable(name: "curr", scope: !262, file: !3, line: 518, type: !268)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "comment", scope: !262, file: !3, line: 516, type: !26, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "exitstr", scope: !274, file: !3, line: 461, type: !26, isLocal: true, isDefinition: true)
!274 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !263, scopeLine: 460, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !275)
!275 = !{!276, !277, !278}
!276 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !274, file: !3, line: 459, type: !111)
!277 = !DILocalVariable(name: "comment", scope: !274, file: !3, line: 462, type: !26)
!278 = !DILocalVariable(name: "pidstr", scope: !274, file: !3, line: 463, type: !202)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 4608, elements: !289)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !282, line: 50, size: 256, elements: !283)
!282 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!283 = !{!284, !285, !286, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !282, line: 52, baseType: !69, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !281, file: !282, line: 55, baseType: !73, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !281, file: !282, line: 56, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !281, file: !282, line: 57, baseType: !73, size: 32, offset: 192)
!289 = !{!290}
!290 = !DISubrange(count: 18)
!291 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!292 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!293 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!294 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!295 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!296 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!297 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!298 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!299 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!300 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!301 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!302 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!303 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!304 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!305 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "Version", scope: !308, file: !309, line: 2, type: !69, isLocal: false, isDefinition: true)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !311, splitDebugInlining: false, nameTableKind: None)
!309 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = !{}
!311 = !{!306}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "last_cherror", scope: !314, file: !315, line: 28, type: !73, isLocal: true, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !316, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!316 = !{!317, !312}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "hints", scope: !319, file: !315, line: 64, type: !328, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "canon_host_r", scope: !315, file: !315, line: 61, type: !320, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !314, retainedNodes: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{!26, !69, !287}
!322 = !{!323, !324, !325, !326, !353}
!323 = !DILocalVariable(name: "host", arg: 1, scope: !319, file: !315, line: 61, type: !69)
!324 = !DILocalVariable(name: "cherror", arg: 2, scope: !319, file: !315, line: 61, type: !287)
!325 = !DILocalVariable(name: "retval", scope: !319, file: !315, line: 63, type: !26)
!326 = !DILocalVariable(name: "res", scope: !319, file: !315, line: 65, type: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !329, line: 565, size: 384, elements: !330)
!329 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!330 = !{!331, !332, !333, !334, !335, !339, !351, !352}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !328, file: !329, line: 567, baseType: !73, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !328, file: !329, line: 568, baseType: !73, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !328, file: !329, line: 569, baseType: !73, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !328, file: !329, line: 570, baseType: !73, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !328, file: !329, line: 571, baseType: !336, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !337, line: 33, baseType: !338)
!337 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "")
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !32, line: 210, baseType: !7)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !328, file: !329, line: 572, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !337, line: 178, size: 128, elements: !342)
!342 = !{!343, !347}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !341, file: !337, line: 180, baseType: !344, size: 16)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !345, line: 28, baseType: !346)
!345 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "")
!346 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !341, file: !337, line: 181, baseType: !348, size: 112, offset: 16)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 14)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !328, file: !329, line: 573, baseType: !26, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !328, file: !329, line: 574, baseType: !327, size: 64, offset: 320)
!353 = !DILocalVariable(name: "status", scope: !319, file: !315, line: 66, type: !73)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "file_name", scope: !356, file: !357, line: 46, type: !69, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !358, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!358 = !{!354, !359}
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !356, file: !357, line: 56, type: !38, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "exit_failure", scope: !363, file: !364, line: 24, type: !366, isLocal: false, isDefinition: true)
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !365, splitDebugInlining: false, nameTableKind: None)
!364 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!365 = !{!361}
!366 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !73)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "program_name", scope: !369, file: !370, line: 33, type: !69, isLocal: false, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !371, globals: !372, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!371 = !{!28, !26}
!372 = !{!367}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !375, file: !376, line: 85, type: !431, isLocal: false, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !398, globals: !399, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!377 = !{!11, !378, !383}
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !7, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!381 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!382 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 46, baseType: !7, size: 32, elements: !385)
!384 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!386 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!387 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!388 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!389 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!390 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!391 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!392 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!393 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!394 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!396 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!397 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!398 = !{!73, !346, !215, !26}
!399 = !{!373, !400, !406, !416, !418, !420, !427, !429}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !375, file: !376, line: 101, type: !402, isLocal: false, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 320, elements: !404)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!404 = !{!405}
!405 = !DISubrange(count: 10)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !375, file: !376, line: 1052, type: !408, isLocal: false, isDefinition: true)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !376, line: 65, size: 448, elements: !409)
!409 = !{!410, !411, !412, !414, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !408, file: !376, line: 68, baseType: !11, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !376, line: 71, baseType: !73, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !408, file: !376, line: 75, baseType: !413, size: 256, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !93)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !408, file: !376, line: 78, baseType: !69, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !408, file: !376, line: 81, baseType: !69, size: 64, offset: 384)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !375, file: !376, line: 116, type: !408, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "slot0", scope: !375, file: !376, line: 842, type: !130, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "slotvec", scope: !375, file: !376, line: 845, type: !422, isLocal: true, isDefinition: true)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !376, line: 834, size: 128, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !376, line: 836, baseType: !215, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !423, file: !376, line: 837, baseType: !26, size: 64, offset: 64)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "nslots", scope: !375, file: !376, line: 843, type: !73, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "slotvec0", scope: !375, file: !376, line: 844, type: !423, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 704, elements: !433)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!433 = !{!434}
!434 = !DISubrange(count: 11)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !437, file: !438, line: 26, type: !440, isLocal: false, isDefinition: true)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !439, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!439 = !{!435}
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 376, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 47)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !447, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !449, line: 101, baseType: !450)
!449 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !32, line: 72, baseType: !33)
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!453 = !{!28}
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !456, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!456 = !{!457}
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 40, baseType: !7, size: 32, elements: !458)
!458 = !{!459}
!459 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !462, retainedTypes: !476, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!462 = !{!463}
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !465, file: !464, line: 186, baseType: !7, size: 32, elements: !474)
!464 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!465 = distinct !DISubprogram(name: "x2nrealloc", scope: !464, file: !464, line: 174, type: !466, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !460, retainedNodes: !469)
!466 = !DISubroutineType(types: !467)
!467 = !{!28, !28, !468, !215}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!469 = !{!470, !471, !472, !473}
!470 = !DILocalVariable(name: "p", arg: 1, scope: !465, file: !464, line: 174, type: !28)
!471 = !DILocalVariable(name: "pn", arg: 2, scope: !465, file: !464, line: 174, type: !468)
!472 = !DILocalVariable(name: "s", arg: 3, scope: !465, file: !464, line: 174, type: !215)
!473 = !DILocalVariable(name: "n", scope: !465, file: !464, line: 176, type: !215)
!474 = !{!475}
!475 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!476 = !{!215, !26, !28}
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, splitDebugInlining: false, nameTableKind: None)
!478 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !483, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!483 = !{!215}
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !486, retainedTypes: !494, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "lib/readutmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!486 = !{!5, !487}
!487 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !488, file: !464, line: 186, baseType: !7, size: 32, elements: !474)
!488 = distinct !DISubprogram(name: "x2nrealloc", scope: !464, file: !464, line: 174, type: !466, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !484, retainedNodes: !489)
!489 = !{!490, !491, !492, !493}
!490 = !DILocalVariable(name: "p", arg: 1, scope: !488, file: !464, line: 174, type: !28)
!491 = !DILocalVariable(name: "pn", arg: 2, scope: !488, file: !464, line: 174, type: !468)
!492 = !DILocalVariable(name: "s", arg: 3, scope: !488, file: !464, line: 174, type: !215)
!493 = !DILocalVariable(name: "n", scope: !488, file: !464, line: 176, type: !215)
!494 = !{!26, !28, !215}
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !499, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!500}
!500 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !501, line: 41, baseType: !7, size: 32, elements: !502)
!501 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!503 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!504 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!505 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!506 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!507 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!508 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!509 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!510 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!511 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!512 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!513 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!514 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!515 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!516 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!517 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!518 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!519 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!520 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!521 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!522 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!523 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!524 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!525 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!526 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!527 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!528 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!529 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!530 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!531 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!532 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!533 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!534 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!535 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!536 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!537 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!538 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!539 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!540 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!541 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!542 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!543 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!544 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!545 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!546 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!547 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!548 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!549 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!550 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!551 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!552 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!611 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!614 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!615 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!616 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!617 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!618 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!619 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!620 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!621 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!622 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!623 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!624 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!625 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!698 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!771 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!772 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!773 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!774 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!775 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!776 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!777 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!778 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!779 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!780 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!781 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!782 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!783 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!784 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!785 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!787 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!788 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!789 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!790 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!791 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!792 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!818 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!819 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!820 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!821 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!822 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!827 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!828 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!829 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!830 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, splitDebugInlining: false, nameTableKind: None)
!887 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!889 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!892 = !{!"clang version 12.0.1"}
!893 = !{i32 7, !"Dwarf Version", i32 4}
!894 = !{i32 2, !"Debug Info Version", i32 3}
!895 = !{i32 1, !"wchar_size", i32 4}
!896 = !{i32 7, !"PIC Level", i32 2}
!897 = !{i32 7, !"PIE Level", i32 2}
!898 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !899, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !901)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !73}
!901 = !{!902}
!902 = !DILocalVariable(name: "status", arg: 1, scope: !898, file: !3, line: 638, type: !73)
!903 = !DILocation(line: 0, scope: !898)
!904 = !DILocation(line: 640, column: 14, scope: !905)
!905 = distinct !DILexicalBlock(scope: !898, file: !3, line: 640, column: 7)
!906 = !DILocation(line: 640, column: 7, scope: !898)
!907 = !DILocation(line: 641, column: 5, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !3, line: 641, column: 5)
!909 = !{!910, !910, i64 0}
!910 = !{!"any pointer", !911, i64 0}
!911 = !{!"omnipotent char", !912, i64 0}
!912 = !{!"Simple C/C++ TBAA"}
!913 = !DILocation(line: 644, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !905, file: !3, line: 643, column: 5)
!915 = !DILocation(line: 645, column: 7, scope: !914)
!916 = !DILocation(line: 648, column: 7, scope: !914)
!917 = !DILocation(line: 655, column: 7, scope: !914)
!918 = !DILocation(line: 658, column: 7, scope: !914)
!919 = !DILocation(line: 663, column: 7, scope: !914)
!920 = !DILocation(line: 669, column: 7, scope: !914)
!921 = !DILocation(line: 675, column: 7, scope: !914)
!922 = !DILocation(line: 676, column: 7, scope: !914)
!923 = !DILocation(line: 677, column: 7, scope: !914)
!924 = !DILocalVariable(name: "program", arg: 1, scope: !925, file: !926, line: 634, type: !69)
!925 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !926, file: !926, line: 634, type: !927, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !929)
!926 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!927 = !DISubroutineType(types: !928)
!928 = !{null, !69}
!929 = !{!924, !930, !937, !938, !940}
!930 = !DILocalVariable(name: "infomap", scope: !925, file: !926, line: 636, type: !931)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 896, elements: !194)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !925, file: !926, line: 636, size: 128, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !933, file: !926, line: 636, baseType: !69, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !933, file: !926, line: 636, baseType: !69, size: 64, offset: 64)
!937 = !DILocalVariable(name: "node", scope: !925, file: !926, line: 646, type: !69)
!938 = !DILocalVariable(name: "map_prog", scope: !925, file: !926, line: 647, type: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!940 = !DILocalVariable(name: "lc_messages", scope: !925, file: !926, line: 659, type: !69)
!941 = !DILocation(line: 0, scope: !925, inlinedAt: !942)
!942 = distinct !DILocation(line: 682, column: 7, scope: !914)
!943 = !DILocation(line: 636, column: 3, scope: !925, inlinedAt: !942)
!944 = !DILocation(line: 636, column: 67, scope: !925, inlinedAt: !942)
!945 = !DILocation(line: 647, column: 36, scope: !925, inlinedAt: !942)
!946 = !DILocation(line: 649, column: 3, scope: !925, inlinedAt: !942)
!947 = !DILocation(line: 649, column: 33, scope: !925, inlinedAt: !942)
!948 = !DILocation(line: 650, column: 13, scope: !925, inlinedAt: !942)
!949 = !DILocation(line: 649, column: 20, scope: !925, inlinedAt: !942)
!950 = !{!951, !910, i64 0}
!951 = !{!"infomap", !910, i64 0, !910, i64 8}
!952 = !DILocation(line: 649, column: 10, scope: !925, inlinedAt: !942)
!953 = !DILocation(line: 649, column: 28, scope: !925, inlinedAt: !942)
!954 = distinct !{!954, !946, !948, !955}
!955 = !{!"llvm.loop.mustprogress"}
!956 = !DILocation(line: 652, column: 17, scope: !957, inlinedAt: !942)
!957 = distinct !DILexicalBlock(scope: !925, file: !926, line: 652, column: 7)
!958 = !{!951, !910, i64 8}
!959 = !DILocation(line: 652, column: 7, scope: !957, inlinedAt: !942)
!960 = !DILocation(line: 652, column: 7, scope: !925, inlinedAt: !942)
!961 = !DILocation(line: 655, column: 3, scope: !925, inlinedAt: !942)
!962 = !DILocation(line: 659, column: 29, scope: !925, inlinedAt: !942)
!963 = !DILocation(line: 660, column: 7, scope: !964, inlinedAt: !942)
!964 = distinct !DILexicalBlock(scope: !925, file: !926, line: 660, column: 7)
!965 = !DILocation(line: 660, column: 19, scope: !964, inlinedAt: !942)
!966 = !DILocation(line: 660, column: 22, scope: !964, inlinedAt: !942)
!967 = !DILocation(line: 660, column: 7, scope: !925, inlinedAt: !942)
!968 = !DILocation(line: 666, column: 7, scope: !969, inlinedAt: !942)
!969 = distinct !DILexicalBlock(scope: !964, file: !926, line: 661, column: 5)
!970 = !DILocation(line: 668, column: 5, scope: !969, inlinedAt: !942)
!971 = !DILocation(line: 669, column: 3, scope: !925, inlinedAt: !942)
!972 = !DILocation(line: 671, column: 3, scope: !925, inlinedAt: !942)
!973 = !DILocation(line: 673, column: 1, scope: !925, inlinedAt: !942)
!974 = !DILocation(line: 684, column: 3, scope: !898)
!975 = !DISubprogram(name: "dcgettext", scope: !976, file: !976, line: 51, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !310)
!976 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!977 = !DISubroutineType(types: !978)
!978 = !{!26, !69, !69, !73}
!979 = !DISubprogram(name: "fputs_unlocked", scope: !980, file: !980, line: 667, type: !981, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !310)
!980 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!981 = !DISubroutineType(types: !982)
!982 = !{!73, !69, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !985, line: 49, size: 1728, elements: !986)
!985 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!986 = !{!987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1002, !1003, !1004, !1005, !1006, !1007, !1009, !1013, !1016, !1018, !1021, !1024, !1025, !1026, !1027, !1028}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !984, file: !985, line: 51, baseType: !73, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !984, file: !985, line: 54, baseType: !26, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !984, file: !985, line: 55, baseType: !26, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !984, file: !985, line: 56, baseType: !26, size: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !984, file: !985, line: 57, baseType: !26, size: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !984, file: !985, line: 58, baseType: !26, size: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !984, file: !985, line: 59, baseType: !26, size: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !984, file: !985, line: 60, baseType: !26, size: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !984, file: !985, line: 61, baseType: !26, size: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !984, file: !985, line: 64, baseType: !26, size: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !984, file: !985, line: 65, baseType: !26, size: 64, offset: 640)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !984, file: !985, line: 66, baseType: !26, size: 64, offset: 704)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !984, file: !985, line: 68, baseType: !1000, size: 64, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !985, line: 36, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !984, file: !985, line: 70, baseType: !983, size: 64, offset: 832)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !984, file: !985, line: 72, baseType: !73, size: 32, offset: 896)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !984, file: !985, line: 73, baseType: !73, size: 32, offset: 928)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !984, file: !985, line: 74, baseType: !174, size: 64, offset: 960)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !984, file: !985, line: 77, baseType: !346, size: 16, offset: 1024)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !984, file: !985, line: 78, baseType: !1008, size: 8, offset: 1040)
!1008 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !984, file: !985, line: 79, baseType: !1010, size: 8, offset: 1048)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 1)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !984, file: !985, line: 81, baseType: !1014, size: 64, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !985, line: 43, baseType: null)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !984, file: !985, line: 89, baseType: !1017, size: 64, offset: 1152)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !32, line: 153, baseType: !33)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !984, file: !985, line: 91, baseType: !1019, size: 64, offset: 1216)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !985, line: 37, flags: DIFlagFwdDecl)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !984, file: !985, line: 92, baseType: !1022, size: 64, offset: 1280)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !985, line: 38, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !984, file: !985, line: 93, baseType: !983, size: 64, offset: 1344)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !984, file: !985, line: 94, baseType: !28, size: 64, offset: 1408)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !984, file: !985, line: 95, baseType: !215, size: 64, offset: 1472)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !984, file: !985, line: 96, baseType: !73, size: 32, offset: 1536)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !984, file: !985, line: 98, baseType: !148, size: 160, offset: 1568)
!1029 = !DISubprogram(name: "setlocale", scope: !1030, file: !1030, line: 122, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !310)
!1030 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!26, !73, !69}
!1033 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !1034, scopeLine: 689, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!73, !73, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!1037 = !{!1038, !1039, !1040, !1041}
!1038 = !DILocalVariable(name: "argc", arg: 1, scope: !1033, file: !3, line: 688, type: !73)
!1039 = !DILocalVariable(name: "argv", arg: 2, scope: !1033, file: !3, line: 688, type: !1036)
!1040 = !DILocalVariable(name: "optc", scope: !1033, file: !3, line: 690, type: !73)
!1041 = !DILocalVariable(name: "assumptions", scope: !1033, file: !3, line: 691, type: !38)
!1042 = !DILocation(line: 0, scope: !1033)
!1043 = !DILocation(line: 694, column: 21, scope: !1033)
!1044 = !DILocation(line: 694, column: 3, scope: !1033)
!1045 = !DILocation(line: 695, column: 3, scope: !1033)
!1046 = !DILocation(line: 696, column: 3, scope: !1033)
!1047 = !DILocation(line: 697, column: 3, scope: !1033)
!1048 = !DILocation(line: 699, column: 3, scope: !1033)
!1049 = !DILocation(line: 701, column: 3, scope: !1033)
!1050 = !DILocation(line: 691, column: 8, scope: !1033)
!1051 = !DILocation(line: 701, column: 18, scope: !1033)
!1052 = !DILocation(line: 707, column: 25, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 705, column: 9)
!1054 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 703, column: 5)
!1055 = !DILocation(line: 708, column: 26, scope: !1053)
!1056 = !DILocation(line: 709, column: 22, scope: !1053)
!1057 = !DILocation(line: 710, column: 26, scope: !1053)
!1058 = !DILocation(line: 711, column: 25, scope: !1053)
!1059 = !DILocation(line: 712, column: 28, scope: !1053)
!1060 = !DILocation(line: 713, column: 22, scope: !1053)
!1061 = !DILocation(line: 714, column: 24, scope: !1053)
!1062 = !DILocation(line: 715, column: 24, scope: !1053)
!1063 = !DILocation(line: 718, column: 11, scope: !1053)
!1064 = !DILocation(line: 726, column: 26, scope: !1053)
!1065 = !DILocation(line: 727, column: 24, scope: !1053)
!1066 = !DILocation(line: 730, column: 11, scope: !1053)
!1067 = !DILocation(line: 734, column: 11, scope: !1053)
!1068 = !DILocation(line: 737, column: 22, scope: !1053)
!1069 = !DILocation(line: 740, column: 11, scope: !1053)
!1070 = !DILocation(line: 744, column: 11, scope: !1053)
!1071 = !DILocation(line: 749, column: 11, scope: !1053)
!1072 = !DILocation(line: 753, column: 11, scope: !1053)
!1073 = !DILocation(line: 756, column: 25, scope: !1053)
!1074 = !DILocation(line: 759, column: 11, scope: !1053)
!1075 = !DILocation(line: 763, column: 11, scope: !1053)
!1076 = !DILocation(line: 768, column: 11, scope: !1053)
!1077 = !DILocation(line: 773, column: 11, scope: !1053)
!1078 = !DILocation(line: 776, column: 22, scope: !1053)
!1079 = !DILocation(line: 779, column: 11, scope: !1053)
!1080 = !DILocation(line: 783, column: 11, scope: !1053)
!1081 = !DILocation(line: 785, column: 9, scope: !1053)
!1082 = !DILocation(line: 787, column: 9, scope: !1053)
!1083 = !DILocation(line: 790, column: 11, scope: !1053)
!1084 = !DILocation(line: 0, scope: !1053)
!1085 = distinct !{!1085, !1049, !1086, !955}
!1086 = !DILocation(line: 792, column: 5, scope: !1033)
!1087 = !DILocation(line: 794, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 794, column: 7)
!1089 = !DILocation(line: 794, column: 7, scope: !1033)
!1090 = !DILocation(line: 796, column: 18, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 795, column: 5)
!1092 = !DILocation(line: 797, column: 20, scope: !1091)
!1093 = !DILocation(line: 798, column: 5, scope: !1091)
!1094 = !DILocation(line: 800, column: 7, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 800, column: 7)
!1096 = !DILocation(line: 800, column: 7, scope: !1033)
!1097 = !DILocation(line: 802, column: 20, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 801, column: 5)
!1099 = !DILocation(line: 803, column: 5, scope: !1098)
!1100 = !DILocation(line: 805, column: 7, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 805, column: 7)
!1102 = !DILocation(line: 805, column: 7, scope: !1033)
!1103 = !DILocation(line: 0, scope: !1101)
!1104 = !{!1105, !1105, i64 0}
!1105 = !{!"int", !911, i64 0}
!1106 = !DILocation(line: 816, column: 18, scope: !1033)
!1107 = !DILocation(line: 816, column: 16, scope: !1033)
!1108 = !DILocation(line: 816, column: 3, scope: !1033)
!1109 = !DILocation(line: 819, column: 20, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 817, column: 5)
!1111 = !DILocation(line: 820, column: 7, scope: !1110)
!1112 = !DILocation(line: 823, column: 7, scope: !1110)
!1113 = !DILocation(line: 824, column: 7, scope: !1110)
!1114 = !DILocation(line: 827, column: 12, scope: !1110)
!1115 = !DILocation(line: 827, column: 7, scope: !1110)
!1116 = !DILocation(line: 828, column: 7, scope: !1110)
!1117 = !DILocation(line: 831, column: 20, scope: !1110)
!1118 = !DILocation(line: 831, column: 55, scope: !1110)
!1119 = !DILocation(line: 831, column: 62, scope: !1110)
!1120 = !DILocation(line: 831, column: 50, scope: !1110)
!1121 = !DILocation(line: 831, column: 43, scope: !1110)
!1122 = !DILocation(line: 831, column: 7, scope: !1110)
!1123 = !DILocation(line: 832, column: 7, scope: !1110)
!1124 = !DILocation(line: 835, column: 3, scope: !1033)
!1125 = !DISubprogram(name: "bindtextdomain", scope: !976, file: !976, line: 86, type: !1126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !310)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!26, !69, !69}
!1128 = !DISubprogram(name: "textdomain", scope: !976, file: !976, line: 82, type: !1129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !310)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!26, !69}
!1131 = !DISubprogram(name: "atexit", scope: !1132, file: !1132, line: 595, type: !1133, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !310)
!1132 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!73, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null}
!1138 = !DISubprogram(name: "getopt_long", scope: !282, file: !282, line: 66, type: !1139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !310)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!73, !73, !1141, !69, !1143, !287}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!1144 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !1145, scopeLine: 622, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1147)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{null, !69, !73}
!1147 = !{!1148, !1149, !1150, !1151}
!1148 = !DILocalVariable(name: "filename", arg: 1, scope: !1144, file: !3, line: 621, type: !69)
!1149 = !DILocalVariable(name: "options", arg: 2, scope: !1144, file: !3, line: 621, type: !73)
!1150 = !DILocalVariable(name: "n_users", scope: !1144, file: !3, line: 623, type: !215)
!1151 = !DILocalVariable(name: "utmp_buf", scope: !1144, file: !3, line: 624, type: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!1153 = !DILocation(line: 0, scope: !1144)
!1154 = !DILocation(line: 623, column: 3, scope: !1144)
!1155 = !DILocation(line: 624, column: 3, scope: !1144)
!1156 = !DILocation(line: 626, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 626, column: 7)
!1158 = !DILocation(line: 626, column: 58, scope: !1157)
