; ModuleID = 'coreutils-8.32/src/who.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 162, type: !437, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !25, globals: !253, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/who.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 208, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !{!26, !36, !97, !101, !105, !108, !111, !118, !30, !87, !133, !137, !142, !146, !150, !191, !194, !197, !202, !205, !209, !213, !214, !65, !217, !219, !224, !244, !249, !160}
!26 = !DISubprogram(name: "dcgettext", scope: !27, file: !27, line: 51, type: !28, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!27 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !32, !32, !34}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !{}
!36 = !DISubprogram(name: "fputs_unlocked", scope: !37, file: !37, line: 662, type: !38, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!37 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!38 = !DISubroutineType(types: !39)
!39 = !{!34, !32, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !42, line: 49, size: 1728, elements: !43)
!42 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !59, !60, !61, !62, !66, !68, !70, !74, !77, !79, !82, !85, !86, !88, !92, !93}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !41, file: !42, line: 51, baseType: !34, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !41, file: !42, line: 54, baseType: !30, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !41, file: !42, line: 55, baseType: !30, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !41, file: !42, line: 56, baseType: !30, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !41, file: !42, line: 57, baseType: !30, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !41, file: !42, line: 58, baseType: !30, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !41, file: !42, line: 59, baseType: !30, size: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !41, file: !42, line: 60, baseType: !30, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !41, file: !42, line: 61, baseType: !30, size: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !41, file: !42, line: 64, baseType: !30, size: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !41, file: !42, line: 65, baseType: !30, size: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !41, file: !42, line: 66, baseType: !30, size: 64, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !41, file: !42, line: 68, baseType: !57, size: 64, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !42, line: 36, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !41, file: !42, line: 70, baseType: !40, size: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !41, file: !42, line: 72, baseType: !34, size: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !41, file: !42, line: 73, baseType: !34, size: 32, offset: 928)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !41, file: !42, line: 74, baseType: !63, size: 64, offset: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !64, line: 152, baseType: !65)
!64 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !41, file: !42, line: 77, baseType: !67, size: 16, offset: 1024)
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !41, file: !42, line: 78, baseType: !69, size: 8, offset: 1040)
!69 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !41, file: !42, line: 79, baseType: !71, size: 8, offset: 1048)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !41, file: !42, line: 81, baseType: !75, size: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !42, line: 43, baseType: null)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !41, file: !42, line: 89, baseType: !78, size: 64, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !64, line: 153, baseType: !65)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !41, file: !42, line: 91, baseType: !80, size: 64, offset: 1216)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !42, line: 37, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !41, file: !42, line: 92, baseType: !83, size: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !42, line: 38, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !41, file: !42, line: 93, baseType: !40, size: 64, offset: 1344)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !41, file: !42, line: 94, baseType: !87, size: 64, offset: 1408)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !41, file: !42, line: 95, baseType: !89, size: 64, offset: 1472)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !90, line: 46, baseType: !91)
!90 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!91 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !41, file: !42, line: 96, baseType: !34, size: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !41, file: !42, line: 98, baseType: !94, size: 160, offset: 1568)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !DISubprogram(name: "set_program_name", scope: !98, file: !98, line: 37, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!98 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!99 = !DISubroutineType(types: !100)
!100 = !{null, !32}
!101 = !DISubprogram(name: "setlocale", scope: !102, file: !102, line: 122, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!102 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!103 = !DISubroutineType(types: !104)
!104 = !{!30, !34, !32}
!105 = !DISubprogram(name: "bindtextdomain", scope: !27, file: !27, line: 86, type: !106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!106 = !DISubroutineType(types: !107)
!107 = !{!30, !32, !32}
!108 = !DISubprogram(name: "textdomain", scope: !27, file: !27, line: 82, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!109 = !DISubroutineType(types: !110)
!110 = !{!30, !32}
!111 = !DISubprogram(name: "atexit", scope: !112, file: !112, line: 595, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!112 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!113 = !DISubroutineType(types: !114)
!114 = !{!34, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null}
!118 = !DISubprogram(name: "getopt_long", scope: !119, file: !119, line: 66, type: !120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!119 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!120 = !DISubroutineType(types: !121)
!121 = !{!34, !34, !122, !32, !124, !131}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !119, line: 50, size: 256, elements: !127)
!127 = !{!128, !129, !130, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !119, line: 52, baseType: !32, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !126, file: !119, line: 55, baseType: !34, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !119, line: 56, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !119, line: 57, baseType: !34, size: 32, offset: 192)
!133 = !DISubprogram(name: "version_etc", scope: !134, file: !134, line: 69, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!134 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!135 = !DISubroutineType(types: !136)
!136 = !{null, !40, !32, !32, !32, null}
!137 = !DISubprogram(name: "hard_locale", scope: !138, file: !138, line: 26, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!138 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !34}
!141 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!142 = !DISubprogram(name: "quote", scope: !143, file: !143, line: 44, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!143 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!144 = !DISubroutineType(types: !145)
!145 = !{!32, !32}
!146 = !DISubprogram(name: "error", scope: !147, file: !147, line: 52, type: !148, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!147 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!148 = !DISubroutineType(types: !149)
!149 = !{null, !34, !34, !32, null}
!150 = !DISubprogram(name: "read_utmp", scope: !6, file: !6, line: 215, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!151 = !DISubroutineType(types: !152)
!152 = !{!34, !32, !153, !154, !34}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !157, line: 55, size: 3072, elements: !158)
!157 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "")
!158 = !{!159, !161, !163, !167, !171, !172, !176, !181, !183, !188, !190}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !156, file: !157, line: 57, baseType: !160, size: 16)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !156, file: !157, line: 58, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !64, line: 154, baseType: !34)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !156, file: !157, line: 59, baseType: !164, size: 256, offset: 64)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !156, file: !157, line: 61, baseType: !168, size: 32, offset: 320)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 4)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !156, file: !157, line: 63, baseType: !164, size: 256, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !156, file: !157, line: 65, baseType: !173, size: 2048, offset: 608)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2048, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !156, file: !157, line: 67, baseType: !177, size: 32, offset: 2656)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !157, line: 42, size: 32, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !177, file: !157, line: 45, baseType: !160, size: 16)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !177, file: !157, line: 46, baseType: !160, size: 16, offset: 16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !156, file: !157, line: 74, baseType: !182, size: 32, offset: 2688)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !64, line: 41, baseType: !34)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !156, file: !157, line: 79, baseType: !184, size: 64, offset: 2720)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !157, line: 75, size: 64, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !184, file: !157, line: 77, baseType: !182, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !184, file: !157, line: 78, baseType: !182, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !156, file: !157, line: 84, baseType: !189, size: 128, offset: 2784)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 128, elements: !169)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !156, file: !157, line: 85, baseType: !94, size: 160, offset: 2912)
!191 = !DISubprogram(name: "quotearg_n_style_colon", scope: !12, file: !12, line: 397, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!192 = !DISubroutineType(types: !193)
!193 = !{!30, !34, !11, !32}
!194 = !DISubprogram(name: "free", scope: !112, file: !112, line: 565, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !87}
!197 = !DISubprogram(name: "extract_trimmed_name", scope: !6, file: !6, line: 214, type: !198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!198 = !DISubroutineType(types: !199)
!199 = !{!30, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !203, line: 7, baseType: !204)
!203 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !64, line: 160, baseType: !65)
!205 = !DISubprogram(name: "ttyname", scope: !206, file: !206, line: 770, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!206 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!207 = !DISubroutineType(types: !208)
!208 = !{!30, !34}
!209 = !DISubprogram(name: "xmalloc", scope: !210, file: !210, line: 53, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!210 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!211 = !DISubroutineType(types: !212)
!212 = !{!87, !91}
!213 = !DISubprogram(name: "xalloc_die", scope: !210, file: !210, line: 51, type: !116, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !35)
!214 = !DISubprogram(name: "puts", scope: !37, file: !37, line: 632, type: !215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!215 = !DISubroutineType(types: !216)
!216 = !{!34, !32}
!217 = !DISubprogram(name: "canon_host", scope: !218, file: !218, line: 23, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!218 = !DIFile(filename: "./lib/canon-host.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = !DISubprogram(name: "time", scope: !220, file: !220, line: 75, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!220 = !DIFile(filename: "/usr/include/time.h", directory: "")
!221 = !DISubroutineType(types: !222)
!222 = !{!65, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!224 = !DISubprogram(name: "localtime", scope: !220, file: !220, line: 123, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !242}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !229, line: 7, size: 448, elements: !230)
!229 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !228, file: !229, line: 9, baseType: !34, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !228, file: !229, line: 10, baseType: !34, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !228, file: !229, line: 11, baseType: !34, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !228, file: !229, line: 12, baseType: !34, size: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !228, file: !229, line: 13, baseType: !34, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !228, file: !229, line: 14, baseType: !34, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !228, file: !229, line: 15, baseType: !34, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !228, file: !229, line: 16, baseType: !34, size: 32, offset: 224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !228, file: !229, line: 17, baseType: !34, size: 32, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !228, file: !229, line: 20, baseType: !65, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !228, file: !229, line: 21, baseType: !32, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!244 = !DISubprogram(name: "strftime", scope: !220, file: !220, line: 88, type: !245, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!245 = !DISubroutineType(types: !246)
!246 = !{!91, !30, !91, !32, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!249 = !DISubprogram(name: "imaxtostr", scope: !250, file: !250, line: 42, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!250 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !DISubroutineType(types: !252)
!252 = !{!30, !65, !30}
!253 = !{!254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !0, !288, !320, !388, !390, !401, !406, !418, !428, !430}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !141, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !141, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !141, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !141, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !141, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !141, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !141, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !141, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !141, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !141, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !141, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !141, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !141, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !141, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !141, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !32, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !34, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "mesg", scope: !290, file: !3, line: 249, type: !317, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !291, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !34, !32, !33, !34, !32, !32, !32, !32, !32, !32}
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !309, !313, !314, !315}
!294 = !DILocalVariable(name: "userlen", arg: 1, scope: !290, file: !3, line: 244, type: !34)
!295 = !DILocalVariable(name: "user", arg: 2, scope: !290, file: !3, line: 244, type: !32)
!296 = !DILocalVariable(name: "state", arg: 3, scope: !290, file: !3, line: 244, type: !33)
!297 = !DILocalVariable(name: "linelen", arg: 4, scope: !290, file: !3, line: 245, type: !34)
!298 = !DILocalVariable(name: "line", arg: 5, scope: !290, file: !3, line: 245, type: !32)
!299 = !DILocalVariable(name: "time_str", arg: 6, scope: !290, file: !3, line: 246, type: !32)
!300 = !DILocalVariable(name: "idle", arg: 7, scope: !290, file: !3, line: 246, type: !32)
!301 = !DILocalVariable(name: "pid", arg: 8, scope: !290, file: !3, line: 246, type: !32)
!302 = !DILocalVariable(name: "comment", arg: 9, scope: !290, file: !3, line: 247, type: !32)
!303 = !DILocalVariable(name: "exitstr", arg: 10, scope: !290, file: !3, line: 247, type: !32)
!304 = !DILocalVariable(name: "buf", scope: !290, file: !3, line: 250, type: !30)
!305 = !DILocalVariable(name: "x_idle", scope: !290, file: !3, line: 251, type: !306)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 8)
!309 = !DILocalVariable(name: "x_pid", scope: !290, file: !3, line: 252, type: !310)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 104, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 13)
!313 = !DILocalVariable(name: "x_exitstr", scope: !290, file: !3, line: 253, type: !30)
!314 = !DILocalVariable(name: "err", scope: !290, file: !3, line: 254, type: !34)
!315 = !DILocalVariable(name: "p", scope: !316, file: !3, line: 303, type: !30)
!316 = distinct !DILexicalBlock(scope: !290, file: !3, line: 301, column: 3)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 3)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "hoststr", scope: !322, file: !3, line: 339, type: !30, isLocal: true, isDefinition: true)
!322 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !323, scopeLine: 334, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !328)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !325, !202}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !6, line: 146, baseType: !156)
!328 = !{!329, !330, !331, !365, !366, !367, !371, !375, !376, !380, !386, !387}
!329 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !322, file: !3, line: 333, type: !325)
!330 = !DILocalVariable(name: "boottime", arg: 2, scope: !322, file: !3, line: 333, type: !202)
!331 = !DILocalVariable(name: "stats", scope: !322, file: !3, line: 335, type: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !333, line: 46, size: 1152, elements: !334)
!333 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!334 = !{!335, !337, !339, !341, !343, !345, !347, !348, !349, !350, !352, !354, !361, !362, !363}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !332, file: !333, line: 48, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !64, line: 145, baseType: !91)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !332, file: !333, line: 53, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !64, line: 148, baseType: !91)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !332, file: !333, line: 61, baseType: !340, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !64, line: 151, baseType: !91)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !332, file: !333, line: 62, baseType: !342, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !64, line: 150, baseType: !7)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !332, file: !333, line: 64, baseType: !344, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !64, line: 146, baseType: !7)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !332, file: !333, line: 65, baseType: !346, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !64, line: 147, baseType: !7)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !332, file: !333, line: 67, baseType: !34, size: 32, offset: 288)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !332, file: !333, line: 69, baseType: !336, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !332, file: !333, line: 74, baseType: !63, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !332, file: !333, line: 78, baseType: !351, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !64, line: 174, baseType: !65)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !332, file: !333, line: 80, baseType: !353, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !64, line: 179, baseType: !65)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !332, file: !333, line: 91, baseType: !355, size: 128, offset: 576)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !356, line: 10, size: 128, elements: !357)
!356 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !355, file: !356, line: 12, baseType: !204, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !355, file: !356, line: 16, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !64, line: 196, baseType: !65)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !332, file: !333, line: 92, baseType: !355, size: 128, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !332, file: !333, line: 93, baseType: !355, size: 128, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !332, file: !333, line: 106, baseType: !364, size: 192, offset: 960)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 192, elements: !318)
!365 = !DILocalVariable(name: "last_change", scope: !322, file: !3, line: 336, type: !202)
!366 = !DILocalVariable(name: "mesg", scope: !322, file: !3, line: 337, type: !31)
!367 = !DILocalVariable(name: "idlestr", scope: !322, file: !3, line: 338, type: !368)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 56, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 7)
!371 = !DILocalVariable(name: "line", scope: !322, file: !3, line: 347, type: !372)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 304, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 38)
!375 = !DILocalVariable(name: "p", scope: !322, file: !3, line: 348, type: !30)
!376 = !DILocalVariable(name: "pidstr", scope: !322, file: !3, line: 349, type: !377)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 12)
!380 = !DILocalVariable(name: "ut_host", scope: !381, file: !3, line: 377, type: !383)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 376, column: 5)
!382 = distinct !DILexicalBlock(scope: !322, file: !3, line: 375, column: 7)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2056, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 257)
!386 = !DILocalVariable(name: "host", scope: !381, file: !3, line: 378, type: !30)
!387 = !DILocalVariable(name: "display", scope: !381, file: !3, line: 379, type: !30)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "hostlen", scope: !322, file: !3, line: 341, type: !89, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "now", scope: !392, file: !3, line: 190, type: !202, isLocal: true, isDefinition: true)
!392 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !393, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{!32, !202, !202}
!395 = !{!396, !397, !398}
!396 = !DILocalVariable(name: "when", arg: 1, scope: !392, file: !3, line: 188, type: !202)
!397 = !DILocalVariable(name: "boottime", arg: 2, scope: !392, file: !3, line: 188, type: !202)
!398 = !DILocalVariable(name: "seconds_idle", scope: !399, file: !3, line: 197, type: !34)
!399 = distinct !DILexicalBlock(scope: !400, file: !3, line: 196, column: 5)
!400 = distinct !DILexicalBlock(scope: !392, file: !3, line: 195, column: 7)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !392, file: !3, line: 202, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 48, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 6)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "buf", scope: !408, file: !3, line: 220, type: !415, isLocal: true, isDefinition: true)
!408 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !409, scopeLine: 219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !411)
!409 = !DISubroutineType(types: !410)
!410 = !{!32, !325}
!411 = !{!412, !413, !414}
!412 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !408, file: !3, line: 218, type: !325)
!413 = !DILocalVariable(name: "t", scope: !408, file: !3, line: 228, type: !202)
!414 = !DILocalVariable(name: "tmp", scope: !408, file: !3, line: 229, type: !227)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 264, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 33)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "runlevline", scope: !420, file: !3, line: 516, type: !30, isLocal: true, isDefinition: true)
!420 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !421, scopeLine: 515, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !325}
!423 = !{!424, !425, !427}
!424 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !420, file: !3, line: 514, type: !325)
!425 = !DILocalVariable(name: "last", scope: !420, file: !3, line: 517, type: !426)
!426 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!427 = !DILocalVariable(name: "curr", scope: !420, file: !3, line: 518, type: !426)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "comment", scope: !420, file: !3, line: 516, type: !30, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "exitstr", scope: !432, file: !3, line: 461, type: !30, isLocal: true, isDefinition: true)
!432 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !421, scopeLine: 460, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!433 = !{!434, !435, !436}
!434 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !432, file: !3, line: 459, type: !325)
!435 = !DILocalVariable(name: "comment", scope: !432, file: !3, line: 462, type: !30)
!436 = !DILocalVariable(name: "pidstr", scope: !432, file: !3, line: 463, type: !377)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 4608, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 18)
!440 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!441 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!442 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!443 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!444 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!445 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!446 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!447 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!448 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!449 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!450 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!451 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!452 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!453 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!454 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "Version", scope: !457, file: !458, line: 2, type: !32, isLocal: false, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, globals: !459, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!459 = !{!455}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "last_cherror", scope: !462, file: !463, line: 28, type: !34, isLocal: true, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !464, globals: !505, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!464 = !{!465, !468, !499, !502}
!465 = !DISubprogram(name: "canon_host_r", scope: !218, file: !218, line: 24, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!466 = !DISubroutineType(types: !467)
!467 = !{!30, !32, !131}
!468 = !DISubprogram(name: "getaddrinfo", scope: !469, file: !469, line: 660, type: !470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!469 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!470 = !DISubroutineType(types: !471)
!471 = !{!34, !32, !32, !472, !498}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !469, line: 565, size: 384, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !484, !495, !496}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !474, file: !469, line: 567, baseType: !34, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !474, file: !469, line: 568, baseType: !34, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !474, file: !469, line: 569, baseType: !34, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !474, file: !469, line: 570, baseType: !34, size: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !474, file: !469, line: 571, baseType: !481, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !482, line: 33, baseType: !483)
!482 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !64, line: 209, baseType: !7)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !474, file: !469, line: 572, baseType: !485, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !482, line: 178, size: 128, elements: !487)
!487 = !{!488, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !486, file: !482, line: 180, baseType: !489, size: 16)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !490, line: 28, baseType: !67)
!490 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !486, file: !482, line: 181, baseType: !492, size: 112, offset: 16)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 112, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 14)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !474, file: !469, line: 573, baseType: !30, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !474, file: !469, line: 574, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!499 = !DISubprogram(name: "freeaddrinfo", scope: !469, file: !469, line: 666, type: !500, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !497}
!502 = !DISubprogram(name: "gai_strerror", scope: !469, file: !469, line: 669, type: !503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!503 = !DISubroutineType(types: !504)
!504 = !{!32, !34}
!505 = !{!506, !460}
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "hints", scope: !508, file: !463, line: 64, type: !474, isLocal: true, isDefinition: true)
!508 = distinct !DISubprogram(name: "canon_host_r", scope: !463, file: !463, line: 61, type: !466, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !462, retainedNodes: !509)
!509 = !{!510, !511, !512, !513, !514}
!510 = !DILocalVariable(name: "host", arg: 1, scope: !508, file: !463, line: 61, type: !32)
!511 = !DILocalVariable(name: "cherror", arg: 2, scope: !508, file: !463, line: 61, type: !131)
!512 = !DILocalVariable(name: "retval", scope: !508, file: !463, line: 63, type: !30)
!513 = !DILocalVariable(name: "res", scope: !508, file: !463, line: 65, type: !497)
!514 = !DILocalVariable(name: "status", scope: !508, file: !463, line: 66, type: !34)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "file_name", scope: !517, file: !518, line: 46, type: !32, isLocal: true, isDefinition: true)
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !519, globals: !557, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !{!520, !26, !556, !146}
!520 = !DISubprogram(name: "close_stream", scope: !521, file: !521, line: 2, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!521 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = !DISubroutineType(types: !523)
!523 = !{!34, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !42, line: 49, size: 1728, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !525, file: !42, line: 51, baseType: !34, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !525, file: !42, line: 54, baseType: !30, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !525, file: !42, line: 55, baseType: !30, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !525, file: !42, line: 56, baseType: !30, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !525, file: !42, line: 57, baseType: !30, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !525, file: !42, line: 58, baseType: !30, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !525, file: !42, line: 59, baseType: !30, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !525, file: !42, line: 60, baseType: !30, size: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !525, file: !42, line: 61, baseType: !30, size: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !525, file: !42, line: 64, baseType: !30, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !525, file: !42, line: 65, baseType: !30, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !525, file: !42, line: 66, baseType: !30, size: 64, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !525, file: !42, line: 68, baseType: !57, size: 64, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !525, file: !42, line: 70, baseType: !524, size: 64, offset: 832)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !525, file: !42, line: 72, baseType: !34, size: 32, offset: 896)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !525, file: !42, line: 73, baseType: !34, size: 32, offset: 928)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !525, file: !42, line: 74, baseType: !63, size: 64, offset: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !525, file: !42, line: 77, baseType: !67, size: 16, offset: 1024)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !525, file: !42, line: 78, baseType: !69, size: 8, offset: 1040)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !525, file: !42, line: 79, baseType: !71, size: 8, offset: 1048)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !525, file: !42, line: 81, baseType: !75, size: 64, offset: 1088)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !525, file: !42, line: 89, baseType: !78, size: 64, offset: 1152)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !525, file: !42, line: 91, baseType: !80, size: 64, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !525, file: !42, line: 92, baseType: !83, size: 64, offset: 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !525, file: !42, line: 93, baseType: !524, size: 64, offset: 1344)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !525, file: !42, line: 94, baseType: !87, size: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !525, file: !42, line: 95, baseType: !89, size: 64, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !525, file: !42, line: 96, baseType: !34, size: 32, offset: 1536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !525, file: !42, line: 98, baseType: !94, size: 160, offset: 1568)
!556 = !DISubprogram(name: "quotearg_colon", scope: !12, file: !12, line: 391, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!557 = !{!515, !558}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !517, file: !518, line: 56, type: !141, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "exit_failure", scope: !562, file: !563, line: 24, type: !565, isLocal: false, isDefinition: true)
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, globals: !564, splitDebugInlining: false, nameTableKind: None)
!563 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!564 = !{!560}
!565 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !34)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "program_name", scope: !568, file: !569, line: 33, type: !32, isLocal: false, isDefinition: true)
!568 = distinct !DICompileUnit(language: DW_LANG_C99, file: !569, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !570, globals: !606, splitDebugInlining: false, nameTableKind: None)
!569 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!570 = !{!87, !571, !30}
!571 = !DISubprogram(name: "fputs", scope: !37, file: !37, line: 626, type: !572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!572 = !DISubroutineType(types: !573)
!573 = !{!34, !32, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !42, line: 49, size: 1728, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !575, file: !42, line: 51, baseType: !34, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !575, file: !42, line: 54, baseType: !30, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !575, file: !42, line: 55, baseType: !30, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !575, file: !42, line: 56, baseType: !30, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !575, file: !42, line: 57, baseType: !30, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !575, file: !42, line: 58, baseType: !30, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !575, file: !42, line: 59, baseType: !30, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !575, file: !42, line: 60, baseType: !30, size: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !575, file: !42, line: 61, baseType: !30, size: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !575, file: !42, line: 64, baseType: !30, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !575, file: !42, line: 65, baseType: !30, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !575, file: !42, line: 66, baseType: !30, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !575, file: !42, line: 68, baseType: !57, size: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !575, file: !42, line: 70, baseType: !574, size: 64, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !575, file: !42, line: 72, baseType: !34, size: 32, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !575, file: !42, line: 73, baseType: !34, size: 32, offset: 928)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !575, file: !42, line: 74, baseType: !63, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !575, file: !42, line: 77, baseType: !67, size: 16, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !575, file: !42, line: 78, baseType: !69, size: 8, offset: 1040)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !575, file: !42, line: 79, baseType: !71, size: 8, offset: 1048)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !575, file: !42, line: 81, baseType: !75, size: 64, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !575, file: !42, line: 89, baseType: !78, size: 64, offset: 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !575, file: !42, line: 91, baseType: !80, size: 64, offset: 1216)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !575, file: !42, line: 92, baseType: !83, size: 64, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !575, file: !42, line: 93, baseType: !574, size: 64, offset: 1344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !575, file: !42, line: 94, baseType: !87, size: 64, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !575, file: !42, line: 95, baseType: !89, size: 64, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !575, file: !42, line: 96, baseType: !34, size: 32, offset: 1536)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !575, file: !42, line: 98, baseType: !94, size: 160, offset: 1568)
!606 = !{!566}
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !609, file: !610, line: 85, type: !713, isLocal: false, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !611, retainedTypes: !632, globals: !689, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!611 = !{!11, !612, !617}
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !7, size: 32, elements: !613)
!613 = !{!614, !615, !616}
!614 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!615 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!616 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !618, line: 46, baseType: !7, size: 32, elements: !619)
!618 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!620 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!621 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!622 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!623 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!624 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!625 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!626 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!627 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!628 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!629 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!630 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!631 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!632 = !{!633, !638, !194, !651, !34, !67, !654, !89, !668, !672, !26, !678, !682, !30, !209, !213, !686}
!633 = !DISubprogram(name: "xmemdup", scope: !210, file: !210, line: 62, type: !634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!634 = !DISubroutineType(types: !635)
!635 = !{!87, !636, !91}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!638 = !DISubprogram(name: "quotearg_alloc_mem", scope: !12, file: !12, line: 342, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!639 = !DISubroutineType(types: !640)
!640 = !{!30, !32, !91, !153, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !610, line: 65, size: 448, elements: !644)
!644 = !{!645, !646, !647, !649, !650}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !643, file: !610, line: 68, baseType: !11, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !643, file: !610, line: 71, baseType: !34, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !643, file: !610, line: 75, baseType: !648, size: 256, offset: 64)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !307)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !643, file: !610, line: 78, baseType: !32, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !643, file: !610, line: 81, baseType: !32, size: 64, offset: 384)
!651 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !12, file: !12, line: 408, type: !652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!652 = !DISubroutineType(types: !653)
!653 = !{!30, !34, !32, !32, !32, !91}
!654 = !DISubprogram(name: "rpl_mbrtowc", scope: !655, file: !655, line: 717, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!655 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !DISubroutineType(types: !657)
!657 = !{!91, !131, !32, !91, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 13, size: 64, elements: !661)
!660 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !659, file: !660, line: 15, baseType: !34, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !659, file: !660, line: 20, baseType: !664, size: 32, offset: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !659, file: !660, line: 16, size: 32, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !664, file: !660, line: 18, baseType: !7, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !664, file: !660, line: 19, baseType: !168, size: 32)
!668 = !DISubprogram(name: "iswprint", scope: !669, file: !669, line: 120, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!669 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!670 = !DISubroutineType(types: !671)
!671 = !{!34, !7}
!672 = !DISubprogram(name: "mbsinit", scope: !673, file: !673, line: 292, type: !674, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!673 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!674 = !DISubroutineType(types: !675)
!675 = !{!34, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!678 = !DISubprogram(name: "locale_charset", scope: !679, file: !679, line: 35, type: !680, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!679 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!680 = !DISubroutineType(types: !681)
!681 = !{!32}
!682 = !DISubprogram(name: "c_strcasecmp", scope: !683, file: !683, line: 42, type: !684, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!683 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!684 = !DISubroutineType(types: !685)
!685 = !{!34, !32, !32}
!686 = !DISubprogram(name: "xrealloc", scope: !210, file: !210, line: 59, type: !687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!687 = !DISubroutineType(types: !688)
!688 = !{!87, !87, !91}
!689 = !{!607, !690, !696, !698, !700, !702, !709, !711}
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !609, file: !610, line: 101, type: !692, isLocal: false, isDefinition: true)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 320, elements: !694)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!694 = !{!695}
!695 = !DISubrange(count: 10)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !609, file: !610, line: 1052, type: !643, isLocal: false, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !609, file: !610, line: 116, type: !643, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "slot0", scope: !609, file: !610, line: 842, type: !173, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "slotvec", scope: !609, file: !610, line: 845, type: !704, isLocal: true, isDefinition: true)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !610, line: 834, size: 128, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !705, file: !610, line: 836, baseType: !89, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !705, file: !610, line: 837, baseType: !30, size: 64, offset: 64)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "nslots", scope: !609, file: !610, line: 843, type: !34, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "slotvec0", scope: !609, file: !610, line: 844, type: !705, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 704, elements: !715)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!715 = !{!716}
!716 = !DISubrange(count: 11)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !719, file: !720, line: 26, type: !722, isLocal: false, isDefinition: true)
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, globals: !721, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!721 = !{!717}
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 376, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 47)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !727, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!727 = !{!728}
!728 = !DISubprogram(name: "setlocale_null_r", scope: !729, file: !729, line: 64, type: !730, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!729 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !DISubroutineType(types: !731)
!731 = !{!34, !34, !30, !91}
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !734, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !736, line: 101, baseType: !737)
!736 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !64, line: 72, baseType: !65)
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !740, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!740 = !{!87, !101}
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !743, retainedTypes: !747, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!743 = !{!744}
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !742, line: 40, baseType: !7, size: 32, elements: !745)
!745 = !{!746}
!746 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!747 = !{!26, !748, !87}
!748 = !DISubprogram(name: "fputs_unlocked", scope: !37, file: !37, line: 662, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!749 = !DISubroutineType(types: !750)
!750 = !{!34, !32, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !42, line: 49, size: 1728, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !752, file: !42, line: 51, baseType: !34, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !752, file: !42, line: 54, baseType: !30, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !752, file: !42, line: 55, baseType: !30, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !752, file: !42, line: 56, baseType: !30, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !752, file: !42, line: 57, baseType: !30, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !752, file: !42, line: 58, baseType: !30, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !752, file: !42, line: 59, baseType: !30, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !752, file: !42, line: 60, baseType: !30, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !752, file: !42, line: 61, baseType: !30, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !752, file: !42, line: 64, baseType: !30, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !752, file: !42, line: 65, baseType: !30, size: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !752, file: !42, line: 66, baseType: !30, size: 64, offset: 704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !752, file: !42, line: 68, baseType: !57, size: 64, offset: 768)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !752, file: !42, line: 70, baseType: !751, size: 64, offset: 832)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !752, file: !42, line: 72, baseType: !34, size: 32, offset: 896)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !752, file: !42, line: 73, baseType: !34, size: 32, offset: 928)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !752, file: !42, line: 74, baseType: !63, size: 64, offset: 960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !752, file: !42, line: 77, baseType: !67, size: 16, offset: 1024)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !752, file: !42, line: 78, baseType: !69, size: 8, offset: 1040)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !752, file: !42, line: 79, baseType: !71, size: 8, offset: 1048)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !752, file: !42, line: 81, baseType: !75, size: 64, offset: 1088)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !752, file: !42, line: 89, baseType: !78, size: 64, offset: 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !752, file: !42, line: 91, baseType: !80, size: 64, offset: 1216)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !752, file: !42, line: 92, baseType: !83, size: 64, offset: 1280)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !752, file: !42, line: 93, baseType: !751, size: 64, offset: 1344)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !752, file: !42, line: 94, baseType: !87, size: 64, offset: 1408)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !752, file: !42, line: 95, baseType: !89, size: 64, offset: 1472)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !752, file: !42, line: 96, baseType: !34, size: 32, offset: 1536)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !752, file: !42, line: 98, baseType: !94, size: 160, offset: 1568)
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !785, retainedTypes: !798, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!785 = !{!786}
!786 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !787, file: !210, line: 186, baseType: !7, size: 32, elements: !796)
!787 = distinct !DISubprogram(name: "x2nrealloc", scope: !210, file: !210, line: 174, type: !788, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !783, retainedNodes: !791)
!788 = !DISubroutineType(types: !789)
!789 = !{!87, !87, !790, !89}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!791 = !{!792, !793, !794, !795}
!792 = !DILocalVariable(name: "p", arg: 1, scope: !787, file: !210, line: 174, type: !87)
!793 = !DILocalVariable(name: "pn", arg: 2, scope: !787, file: !210, line: 174, type: !790)
!794 = !DILocalVariable(name: "s", arg: 3, scope: !787, file: !210, line: 174, type: !89)
!795 = !DILocalVariable(name: "n", scope: !787, file: !210, line: 176, type: !89)
!796 = !{!797}
!797 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!798 = !{!89, !213, !209, !686, !30, !194, !87, !799, !802}
!799 = !DISubprogram(name: "xcalloc", scope: !210, file: !210, line: 57, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!800 = !DISubroutineType(types: !801)
!801 = !{!87, !91, !91}
!802 = !DISubprogram(name: "rpl_calloc", scope: !803, file: !803, line: 688, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!803 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !806, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!806 = !{!26, !146}
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !809, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!809 = !{!87}
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!811 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!812 = !{!813, !89, !137}
!813 = !DISubprogram(name: "mbrtowc", scope: !673, file: !673, line: 296, type: !814, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!814 = !DISubroutineType(types: !815)
!815 = !{!91, !131, !32, !91, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 13, size: 64, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !817, file: !660, line: 15, baseType: !34, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !817, file: !660, line: 20, baseType: !821, size: 32, offset: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !817, file: !660, line: 16, size: 32, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !821, file: !660, line: 18, baseType: !7, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !821, file: !660, line: 19, baseType: !168, size: 32)
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !827, retainedTypes: !835, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!827 = !{!5, !828}
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !829, file: !210, line: 186, baseType: !7, size: 32, elements: !796)
!829 = distinct !DISubprogram(name: "x2nrealloc", scope: !210, file: !210, line: 174, type: !788, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !825, retainedNodes: !830)
!830 = !{!831, !832, !833, !834}
!831 = !DILocalVariable(name: "p", arg: 1, scope: !829, file: !210, line: 174, type: !87)
!832 = !DILocalVariable(name: "pn", arg: 2, scope: !829, file: !210, line: 174, type: !790)
!833 = !DILocalVariable(name: "s", arg: 3, scope: !829, file: !210, line: 174, type: !89)
!834 = !DILocalVariable(name: "n", scope: !829, file: !210, line: 176, type: !89)
!835 = !{!209, !30, !836, !838, !839, !87, !864, !865, !89, !213, !686}
!836 = !DISubprogram(name: "utmpxname", scope: !837, file: !837, line: 93, type: !215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!837 = !DIFile(filename: "/usr/include/utmpx.h", directory: "")
!838 = !DISubprogram(name: "setutxent", scope: !837, file: !837, line: 53, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!839 = !DISubprogram(name: "getutxent", scope: !837, file: !837, line: 65, type: !840, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!840 = !DISubroutineType(types: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !157, line: 55, size: 3072, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !856, !857, !862, !863}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !843, file: !157, line: 57, baseType: !160, size: 16)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !843, file: !157, line: 58, baseType: !162, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !843, file: !157, line: 59, baseType: !164, size: 256, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !843, file: !157, line: 61, baseType: !168, size: 32, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !843, file: !157, line: 63, baseType: !164, size: 256, offset: 352)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !843, file: !157, line: 65, baseType: !173, size: 2048, offset: 608)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !843, file: !157, line: 67, baseType: !852, size: 32, offset: 2656)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !157, line: 42, size: 32, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !852, file: !157, line: 45, baseType: !160, size: 16)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !852, file: !157, line: 46, baseType: !160, size: 16, offset: 16)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !843, file: !157, line: 74, baseType: !182, size: 32, offset: 2688)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !843, file: !157, line: 79, baseType: !858, size: 64, offset: 2720)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !843, file: !157, line: 75, size: 64, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !858, file: !157, line: 77, baseType: !182, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !858, file: !157, line: 78, baseType: !182, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !843, file: !157, line: 84, baseType: !189, size: 128, offset: 2784)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !843, file: !157, line: 85, baseType: !94, size: 160, offset: 2912)
!864 = !DISubprogram(name: "endutxent", scope: !837, file: !837, line: 59, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!865 = !DISubprogram(name: "kill", scope: !866, file: !866, line: 112, type: !867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!866 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!867 = !DISubroutineType(types: !868)
!868 = !{!34, !34, !34}
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !871, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!871 = !{!872}
!872 = !DISubprogram(name: "rpl_fclose", scope: !873, file: !873, line: 672, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !35)
!873 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!874 = !DISubroutineType(types: !875)
!875 = !{!34, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !42, line: 49, size: 1728, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !877, file: !42, line: 51, baseType: !34, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !877, file: !42, line: 54, baseType: !30, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !877, file: !42, line: 55, baseType: !30, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !877, file: !42, line: 56, baseType: !30, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !877, file: !42, line: 57, baseType: !30, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !877, file: !42, line: 58, baseType: !30, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !877, file: !42, line: 59, baseType: !30, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !877, file: !42, line: 60, baseType: !30, size: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !877, file: !42, line: 61, baseType: !30, size: 64, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !877, file: !42, line: 64, baseType: !30, size: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !877, file: !42, line: 65, baseType: !30, size: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !877, file: !42, line: 66, baseType: !30, size: 64, offset: 704)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !877, file: !42, line: 68, baseType: !57, size: 64, offset: 768)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !877, file: !42, line: 70, baseType: !876, size: 64, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !877, file: !42, line: 72, baseType: !34, size: 32, offset: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !877, file: !42, line: 73, baseType: !34, size: 32, offset: 928)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !877, file: !42, line: 74, baseType: !63, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !877, file: !42, line: 77, baseType: !67, size: 16, offset: 1024)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !877, file: !42, line: 78, baseType: !69, size: 8, offset: 1040)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !877, file: !42, line: 79, baseType: !71, size: 8, offset: 1048)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !877, file: !42, line: 81, baseType: !75, size: 64, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !877, file: !42, line: 89, baseType: !78, size: 64, offset: 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !877, file: !42, line: 91, baseType: !80, size: 64, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !877, file: !42, line: 92, baseType: !83, size: 64, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !877, file: !42, line: 93, baseType: !876, size: 64, offset: 1344)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !877, file: !42, line: 94, baseType: !87, size: 64, offset: 1408)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !877, file: !42, line: 95, baseType: !89, size: 64, offset: 1472)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !877, file: !42, line: 96, baseType: !34, size: 32, offset: 1536)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !877, file: !42, line: 98, baseType: !94, size: 160, offset: 1568)
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !910, retainedTypes: !1297, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!910 = !{!911}
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !912, line: 41, baseType: !7, size: 32, elements: !913)
!912 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296}
!914 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!915 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!916 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!917 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!918 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!919 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!920 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!921 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!922 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!923 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!924 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!925 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!926 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!927 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!928 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!929 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!930 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!931 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!932 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!933 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!934 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!935 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!936 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!937 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!938 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!939 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!940 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!941 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!942 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!943 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!944 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!945 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!946 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!947 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!948 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!949 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!950 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!951 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!952 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!953 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!954 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!955 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!956 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!957 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!958 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!959 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!960 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!961 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!962 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!963 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
